ntkrnlmp_types = {
  'LIST_ENTRY64' : [ 0x10, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'Blink' : [ 0x8, ['unsigned long long']],
} ],
  'LIST_ENTRY32' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long']],
    'Blink' : [ 0x4, ['unsigned long']],
} ],
  '_LIST_ENTRY' : [ 0x10, {
    'Flink' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
    'Blink' : [ 0x8, ['pointer64', ['_LIST_ENTRY']]],
} ],
  '_SINGLE_LIST_ENTRY' : [ 0x8, {
    'Next' : [ 0x0, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_UNICODE_STRING' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x8, ['pointer64', ['wchar']]],
} ],
  '_STRING' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x8, ['pointer64', ['unsigned char']]],
} ],
  '_RTL_QUERY_REGISTRY_TABLE' : [ 0x38, {
    'QueryRoutine' : [ 0x0, ['pointer64', ['void']]],
    'Flags' : [ 0x8, ['unsigned long']],
    'Name' : [ 0x10, ['pointer64', ['wchar']]],
    'EntryContext' : [ 0x18, ['pointer64', ['void']]],
    'DefaultType' : [ 0x20, ['unsigned long']],
    'DefaultData' : [ 0x28, ['pointer64', ['void']]],
    'DefaultLength' : [ 0x30, ['unsigned long']],
} ],
  '__unnamed_108e' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_LARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
    'u' : [ 0x0, ['__unnamed_108e']],
    'QuadPart' : [ 0x0, ['long long']],
} ],
  '__unnamed_1093' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
} ],
  '_ULARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
    'u' : [ 0x0, ['__unnamed_1093']],
    'QuadPart' : [ 0x0, ['unsigned long long']],
} ],
  '_RTL_BITMAP' : [ 0x10, {
    'SizeOfBitMap' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x8, ['pointer64', ['unsigned long']]],
} ],
  '_KFLOATING_SAVE' : [ 0x4, {
    'Dummy' : [ 0x0, ['unsigned long']],
} ],
  '_EXT_SET_PARAMETERS_V0' : [ 0x10, {
    'Version' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'NoWakeTolerance' : [ 0x8, ['long long']],
} ],
  '_FAST_MUTEX' : [ 0x38, {
    'Count' : [ 0x0, ['long']],
    'Owner' : [ 0x8, ['pointer64', ['void']]],
    'Contention' : [ 0x10, ['unsigned long']],
    'Event' : [ 0x18, ['_KEVENT']],
    'OldIrql' : [ 0x30, ['unsigned long']],
} ],
  '_KEVENT' : [ 0x18, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
} ],
  '_LOOKASIDE_LIST_EX' : [ 0x60, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE_POOL']],
} ],
  '_SLIST_ENTRY' : [ 0x10, {
    'Next' : [ 0x0, ['pointer64', ['_SLIST_ENTRY']]],
} ],
  '__unnamed_10db' : [ 0x10, {
    'Depth' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'Sequence' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 64, native_type='unsigned long long')]],
    'Reserved' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long long')]],
    'NextEntry' : [ 0x8, ['BitField', dict(start_bit = 4, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_SLIST_HEADER' : [ 0x10, {
    'Alignment' : [ 0x0, ['unsigned long long']],
    'Region' : [ 0x8, ['unsigned long long']],
    'HeaderX64' : [ 0x0, ['__unnamed_10db']],
} ],
  '_NPAGED_LOOKASIDE_LIST' : [ 0x80, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
} ],
  '_PAGED_LOOKASIDE_LIST' : [ 0x80, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
} ],
  '_WORK_QUEUE_ITEM' : [ 0x20, {
    'List' : [ 0x0, ['_LIST_ENTRY']],
    'WorkerRoutine' : [ 0x10, ['pointer64', ['void']]],
    'Parameter' : [ 0x18, ['pointer64', ['void']]],
} ],
  '_EXT_DELETE_PARAMETERS' : [ 0x18, {
    'Version' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'DeleteCallback' : [ 0x8, ['pointer64', ['void']]],
    'DeleteContext' : [ 0x10, ['pointer64', ['void']]],
} ],
  '_MDL' : [ 0x30, {
    'Next' : [ 0x0, ['pointer64', ['_MDL']]],
    'Size' : [ 0x8, ['short']],
    'MdlFlags' : [ 0xa, ['short']],
    'Process' : [ 0x10, ['pointer64', ['_EPROCESS']]],
    'MappedSystemVa' : [ 0x18, ['pointer64', ['void']]],
    'StartVa' : [ 0x20, ['pointer64', ['void']]],
    'ByteCount' : [ 0x28, ['unsigned long']],
    'ByteOffset' : [ 0x2c, ['unsigned long']],
} ],
  '__unnamed_111b' : [ 0x8, {
    'MasterIrp' : [ 0x0, ['pointer64', ['_IRP']]],
    'IrpCount' : [ 0x0, ['long']],
    'SystemBuffer' : [ 0x0, ['pointer64', ['void']]],
} ],
  '__unnamed_1122' : [ 0x10, {
    'UserApcRoutine' : [ 0x0, ['pointer64', ['void']]],
    'IssuingProcess' : [ 0x0, ['pointer64', ['void']]],
    'UserApcContext' : [ 0x8, ['pointer64', ['void']]],
} ],
  '__unnamed_1124' : [ 0x10, {
    'AsynchronousParameters' : [ 0x0, ['__unnamed_1122']],
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1131' : [ 0x50, {
    'DeviceQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DriverContext' : [ 0x0, ['array', 4, ['pointer64', ['void']]]],
    'Thread' : [ 0x20, ['pointer64', ['_ETHREAD']]],
    'AuxiliaryBuffer' : [ 0x28, ['pointer64', ['unsigned char']]],
    'ListEntry' : [ 0x30, ['_LIST_ENTRY']],
    'CurrentStackLocation' : [ 0x40, ['pointer64', ['_IO_STACK_LOCATION']]],
    'PacketType' : [ 0x40, ['unsigned long']],
    'OriginalFileObject' : [ 0x48, ['pointer64', ['_FILE_OBJECT']]],
} ],
  '__unnamed_1134' : [ 0x58, {
    'Overlay' : [ 0x0, ['__unnamed_1131']],
    'Apc' : [ 0x0, ['_KAPC']],
    'CompletionKey' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_IRP' : [ 0xd0, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'MdlAddress' : [ 0x8, ['pointer64', ['_MDL']]],
    'Flags' : [ 0x10, ['unsigned long']],
    'AssociatedIrp' : [ 0x18, ['__unnamed_111b']],
    'ThreadListEntry' : [ 0x20, ['_LIST_ENTRY']],
    'IoStatus' : [ 0x30, ['_IO_STATUS_BLOCK']],
    'RequestorMode' : [ 0x40, ['unsigned char']],
    'PendingReturned' : [ 0x41, ['unsigned char']],
    'StackCount' : [ 0x42, ['unsigned char']],
    'CurrentLocation' : [ 0x43, ['unsigned char']],
    'Cancel' : [ 0x44, ['unsigned char']],
    'CancelIrql' : [ 0x45, ['unsigned char']],
    'ApcEnvironment' : [ 0x46, ['unsigned char']],
    'AllocationFlags' : [ 0x47, ['unsigned char']],
    'UserIosb' : [ 0x48, ['pointer64', ['_IO_STATUS_BLOCK']]],
    'UserEvent' : [ 0x50, ['pointer64', ['_KEVENT']]],
    'Overlay' : [ 0x58, ['__unnamed_1124']],
    'CancelRoutine' : [ 0x68, ['pointer64', ['void']]],
    'UserBuffer' : [ 0x70, ['pointer64', ['void']]],
    'Tail' : [ 0x78, ['__unnamed_1134']],
} ],
  '__unnamed_113b' : [ 0x20, {
    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x8, ['unsigned long']],
    'FileAttributes' : [ 0x10, ['unsigned short']],
    'ShareAccess' : [ 0x12, ['unsigned short']],
    'EaLength' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_113f' : [ 0x20, {
    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0x10, ['unsigned short']],
    'ShareAccess' : [ 0x12, ['unsigned short']],
    'Parameters' : [ 0x18, ['pointer64', ['_NAMED_PIPE_CREATE_PARAMETERS']]],
} ],
  '__unnamed_1143' : [ 0x20, {
    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0x10, ['unsigned short']],
    'ShareAccess' : [ 0x12, ['unsigned short']],
    'Parameters' : [ 0x18, ['pointer64', ['_MAILSLOT_CREATE_PARAMETERS']]],
} ],
  '__unnamed_1145' : [ 0x18, {
    'Length' : [ 0x0, ['unsigned long']],
    'Key' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['unsigned long']],
    'ByteOffset' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1149' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileName' : [ 0x8, ['pointer64', ['_UNICODE_STRING']]],
    'FileInformationClass' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileDispositionInformationEx', 65: u'FileRenameInformationEx', 66: u'FileRenameInformationExBypassAccessCheck', 67: u'FileDesiredStorageClassInformation', 68: u'FileStatInformation', 69: u'FileMemoryPartitionInformation', 70: u'FileStatLxInformation', 71: u'FileCaseSensitiveInformation', 72: u'FileLinkInformationEx', 73: u'FileLinkInformationExBypassAccessCheck', 74: u'FileStorageReserveIdInformation', 75: u'FileCaseSensitiveInformationForceAccessCheck', 76: u'FileMaximumInformation'})]],
    'FileIndex' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_114b' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'CompletionFilter' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_114f' : [ 0x18, {
    'Length' : [ 0x0, ['unsigned long']],
    'CompletionFilter' : [ 0x8, ['unsigned long']],
    'DirectoryNotifyInformationClass' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {1: u'DirectoryNotifyInformation', 2: u'DirectoryNotifyExtendedInformation'})]],
} ],
  '__unnamed_1151' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileDispositionInformationEx', 65: u'FileRenameInformationEx', 66: u'FileRenameInformationExBypassAccessCheck', 67: u'FileDesiredStorageClassInformation', 68: u'FileStatInformation', 69: u'FileMemoryPartitionInformation', 70: u'FileStatLxInformation', 71: u'FileCaseSensitiveInformation', 72: u'FileLinkInformationEx', 73: u'FileLinkInformationExBypassAccessCheck', 74: u'FileStorageReserveIdInformation', 75: u'FileCaseSensitiveInformationForceAccessCheck', 76: u'FileMaximumInformation'})]],
} ],
  '__unnamed_1153' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileDispositionInformationEx', 65: u'FileRenameInformationEx', 66: u'FileRenameInformationExBypassAccessCheck', 67: u'FileDesiredStorageClassInformation', 68: u'FileStatInformation', 69: u'FileMemoryPartitionInformation', 70: u'FileStatLxInformation', 71: u'FileCaseSensitiveInformation', 72: u'FileLinkInformationEx', 73: u'FileLinkInformationExBypassAccessCheck', 74: u'FileStorageReserveIdInformation', 75: u'FileCaseSensitiveInformationForceAccessCheck', 76: u'FileMaximumInformation'})]],
    'FileObject' : [ 0x10, ['pointer64', ['_FILE_OBJECT']]],
    'ReplaceIfExists' : [ 0x18, ['unsigned char']],
    'AdvanceOnly' : [ 0x19, ['unsigned char']],
    'ClusterCount' : [ 0x18, ['unsigned long']],
    'DeleteHandle' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1155' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'EaList' : [ 0x8, ['pointer64', ['void']]],
    'EaListLength' : [ 0x10, ['unsigned long']],
    'EaIndex' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1157' : [ 0x4, {
    'Length' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_115b' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FsInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: u'FileFsVolumeInformation', 2: u'FileFsLabelInformation', 3: u'FileFsSizeInformation', 4: u'FileFsDeviceInformation', 5: u'FileFsAttributeInformation', 6: u'FileFsControlInformation', 7: u'FileFsFullSizeInformation', 8: u'FileFsObjectIdInformation', 9: u'FileFsDriverPathInformation', 10: u'FileFsVolumeFlagsInformation', 11: u'FileFsSectorSizeInformation', 12: u'FileFsDataCopyInformation', 13: u'FileFsMetadataSizeInformation', 14: u'FileFsFullSizeInformationEx', 15: u'FileFsMaximumInformation'})]],
} ],
  '__unnamed_115d' : [ 0x20, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x8, ['unsigned long']],
    'FsControlCode' : [ 0x10, ['unsigned long']],
    'Type3InputBuffer' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1160' : [ 0x18, {
    'Length' : [ 0x0, ['pointer64', ['_LARGE_INTEGER']]],
    'Key' : [ 0x8, ['unsigned long']],
    'ByteOffset' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1162' : [ 0x20, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x8, ['unsigned long']],
    'IoControlCode' : [ 0x10, ['unsigned long']],
    'Type3InputBuffer' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1164' : [ 0x10, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1166' : [ 0x10, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'SecurityDescriptor' : [ 0x8, ['pointer64', ['void']]],
} ],
  '__unnamed_116a' : [ 0x10, {
    'Vpb' : [ 0x0, ['pointer64', ['_VPB']]],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
} ],
  '__unnamed_116e' : [ 0x8, {
    'Srb' : [ 0x0, ['pointer64', ['_SCSI_REQUEST_BLOCK']]],
} ],
  '__unnamed_1172' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'StartSid' : [ 0x8, ['pointer64', ['void']]],
    'SidList' : [ 0x10, ['pointer64', ['_FILE_GET_QUOTA_INFORMATION']]],
    'SidListLength' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1176' : [ 0x4, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'BusRelations', 1: u'EjectionRelations', 2: u'PowerRelations', 3: u'RemovalRelations', 4: u'TargetDeviceRelation', 5: u'SingleBusRelations', 6: u'TransportRelations'})]],
} ],
  '__unnamed_117d' : [ 0x20, {
    'InterfaceType' : [ 0x0, ['pointer64', ['_GUID']]],
    'Size' : [ 0x8, ['unsigned short']],
    'Version' : [ 0xa, ['unsigned short']],
    'Interface' : [ 0x10, ['pointer64', ['_INTERFACE']]],
    'InterfaceSpecificData' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1181' : [ 0x8, {
    'Capabilities' : [ 0x0, ['pointer64', ['_DEVICE_CAPABILITIES']]],
} ],
  '__unnamed_1185' : [ 0x8, {
    'IoResourceRequirementList' : [ 0x0, ['pointer64', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
} ],
  '__unnamed_1187' : [ 0x20, {
    'WhichSpace' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x8, ['pointer64', ['void']]],
    'Offset' : [ 0x10, ['unsigned long']],
    'Length' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1189' : [ 0x1, {
    'Lock' : [ 0x0, ['unsigned char']],
} ],
  '__unnamed_118d' : [ 0x4, {
    'IdType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'BusQueryDeviceID', 1: u'BusQueryHardwareIDs', 2: u'BusQueryCompatibleIDs', 3: u'BusQueryInstanceID', 4: u'BusQueryDeviceSerialNumber', 5: u'BusQueryContainerID'})]],
} ],
  '__unnamed_1191' : [ 0x10, {
    'DeviceTextType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'DeviceTextDescription', 1: u'DeviceTextLocationInformation'})]],
    'LocaleId' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1196' : [ 0x10, {
    'InPath' : [ 0x0, ['unsigned char']],
    'Reserved' : [ 0x1, ['array', 3, ['unsigned char']]],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'DeviceUsageTypeUndefined', 1: u'DeviceUsageTypePaging', 2: u'DeviceUsageTypeHibernation', 3: u'DeviceUsageTypeDumpFile', 4: u'DeviceUsageTypeBoot', 5: u'DeviceUsageTypePostDisplay', 6: u'DeviceUsageTypeGuestAssigned'})]],
} ],
  '__unnamed_119a' : [ 0x4, {
    'PowerState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PowerSystemUnspecified', 1: u'PowerSystemWorking', 2: u'PowerSystemSleeping1', 3: u'PowerSystemSleeping2', 4: u'PowerSystemSleeping3', 5: u'PowerSystemHibernate', 6: u'PowerSystemShutdown', 7: u'PowerSystemMaximum'})]],
} ],
  '__unnamed_119e' : [ 0x8, {
    'PowerSequence' : [ 0x0, ['pointer64', ['_POWER_SEQUENCE']]],
} ],
  '__unnamed_11a6' : [ 0x20, {
    'SystemContext' : [ 0x0, ['unsigned long']],
    'SystemPowerStateContext' : [ 0x0, ['_SYSTEM_POWER_STATE_CONTEXT']],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'SystemPowerState', 1: u'DevicePowerState'})]],
    'State' : [ 0x10, ['_POWER_STATE']],
    'ShutdownType' : [ 0x18, ['Enumeration', dict(target = 'long', choices = {0: u'PowerActionNone', 1: u'PowerActionReserved', 2: u'PowerActionSleep', 3: u'PowerActionHibernate', 4: u'PowerActionShutdown', 5: u'PowerActionShutdownReset', 6: u'PowerActionShutdownOff', 7: u'PowerActionWarmEject', 8: u'PowerActionDisplayOff'})]],
} ],
  '__unnamed_11aa' : [ 0x10, {
    'AllocatedResources' : [ 0x0, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'AllocatedResourcesTranslated' : [ 0x8, ['pointer64', ['_CM_RESOURCE_LIST']]],
} ],
  '__unnamed_11ac' : [ 0x20, {
    'ProviderId' : [ 0x0, ['unsigned long long']],
    'DataPath' : [ 0x8, ['pointer64', ['void']]],
    'BufferSize' : [ 0x10, ['unsigned long']],
    'Buffer' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_11ae' : [ 0x20, {
    'Argument1' : [ 0x0, ['pointer64', ['void']]],
    'Argument2' : [ 0x8, ['pointer64', ['void']]],
    'Argument3' : [ 0x10, ['pointer64', ['void']]],
    'Argument4' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_11b0' : [ 0x20, {
    'Create' : [ 0x0, ['__unnamed_113b']],
    'CreatePipe' : [ 0x0, ['__unnamed_113f']],
    'CreateMailslot' : [ 0x0, ['__unnamed_1143']],
    'Read' : [ 0x0, ['__unnamed_1145']],
    'Write' : [ 0x0, ['__unnamed_1145']],
    'QueryDirectory' : [ 0x0, ['__unnamed_1149']],
    'NotifyDirectory' : [ 0x0, ['__unnamed_114b']],
    'NotifyDirectoryEx' : [ 0x0, ['__unnamed_114f']],
    'QueryFile' : [ 0x0, ['__unnamed_1151']],
    'SetFile' : [ 0x0, ['__unnamed_1153']],
    'QueryEa' : [ 0x0, ['__unnamed_1155']],
    'SetEa' : [ 0x0, ['__unnamed_1157']],
    'QueryVolume' : [ 0x0, ['__unnamed_115b']],
    'SetVolume' : [ 0x0, ['__unnamed_115b']],
    'FileSystemControl' : [ 0x0, ['__unnamed_115d']],
    'LockControl' : [ 0x0, ['__unnamed_1160']],
    'DeviceIoControl' : [ 0x0, ['__unnamed_1162']],
    'QuerySecurity' : [ 0x0, ['__unnamed_1164']],
    'SetSecurity' : [ 0x0, ['__unnamed_1166']],
    'MountVolume' : [ 0x0, ['__unnamed_116a']],
    'VerifyVolume' : [ 0x0, ['__unnamed_116a']],
    'Scsi' : [ 0x0, ['__unnamed_116e']],
    'QueryQuota' : [ 0x0, ['__unnamed_1172']],
    'SetQuota' : [ 0x0, ['__unnamed_1157']],
    'QueryDeviceRelations' : [ 0x0, ['__unnamed_1176']],
    'QueryInterface' : [ 0x0, ['__unnamed_117d']],
    'DeviceCapabilities' : [ 0x0, ['__unnamed_1181']],
    'FilterResourceRequirements' : [ 0x0, ['__unnamed_1185']],
    'ReadWriteConfig' : [ 0x0, ['__unnamed_1187']],
    'SetLock' : [ 0x0, ['__unnamed_1189']],
    'QueryId' : [ 0x0, ['__unnamed_118d']],
    'QueryDeviceText' : [ 0x0, ['__unnamed_1191']],
    'UsageNotification' : [ 0x0, ['__unnamed_1196']],
    'WaitWake' : [ 0x0, ['__unnamed_119a']],
    'PowerSequence' : [ 0x0, ['__unnamed_119e']],
    'Power' : [ 0x0, ['__unnamed_11a6']],
    'StartDevice' : [ 0x0, ['__unnamed_11aa']],
    'WMI' : [ 0x0, ['__unnamed_11ac']],
    'Others' : [ 0x0, ['__unnamed_11ae']],
} ],
  '_IO_STACK_LOCATION' : [ 0x48, {
    'MajorFunction' : [ 0x0, ['unsigned char']],
    'MinorFunction' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned char']],
    'Control' : [ 0x3, ['unsigned char']],
    'Parameters' : [ 0x8, ['__unnamed_11b0']],
    'DeviceObject' : [ 0x28, ['pointer64', ['_DEVICE_OBJECT']]],
    'FileObject' : [ 0x30, ['pointer64', ['_FILE_OBJECT']]],
    'CompletionRoutine' : [ 0x38, ['pointer64', ['void']]],
    'Context' : [ 0x40, ['pointer64', ['void']]],
} ],
  '__unnamed_11c7' : [ 0x48, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Wcb' : [ 0x0, ['_WAIT_CONTEXT_BLOCK']],
} ],
  '_DEVICE_OBJECT' : [ 0x150, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'ReferenceCount' : [ 0x4, ['long']],
    'DriverObject' : [ 0x8, ['pointer64', ['_DRIVER_OBJECT']]],
    'NextDevice' : [ 0x10, ['pointer64', ['_DEVICE_OBJECT']]],
    'AttachedDevice' : [ 0x18, ['pointer64', ['_DEVICE_OBJECT']]],
    'CurrentIrp' : [ 0x20, ['pointer64', ['_IRP']]],
    'Timer' : [ 0x28, ['pointer64', ['_IO_TIMER']]],
    'Flags' : [ 0x30, ['unsigned long']],
    'Characteristics' : [ 0x34, ['unsigned long']],
    'Vpb' : [ 0x38, ['pointer64', ['_VPB']]],
    'DeviceExtension' : [ 0x40, ['pointer64', ['void']]],
    'DeviceType' : [ 0x48, ['unsigned long']],
    'StackSize' : [ 0x4c, ['unsigned char']],
    'Queue' : [ 0x50, ['__unnamed_11c7']],
    'AlignmentRequirement' : [ 0x98, ['unsigned long']],
    'DeviceQueue' : [ 0xa0, ['_KDEVICE_QUEUE']],
    'Dpc' : [ 0xc8, ['_KDPC']],
    'ActiveThreadCount' : [ 0x108, ['unsigned long']],
    'SecurityDescriptor' : [ 0x110, ['pointer64', ['void']]],
    'DeviceLock' : [ 0x118, ['_KEVENT']],
    'SectorSize' : [ 0x130, ['unsigned short']],
    'Spare1' : [ 0x132, ['unsigned short']],
    'DeviceObjectExtension' : [ 0x138, ['pointer64', ['_DEVOBJ_EXTENSION']]],
    'Reserved' : [ 0x140, ['pointer64', ['void']]],
} ],
  '_KDPC' : [ 0x40, {
    'TargetInfoAsUlong' : [ 0x0, ['unsigned long']],
    'Type' : [ 0x0, ['unsigned char']],
    'Importance' : [ 0x1, ['unsigned char']],
    'Number' : [ 0x2, ['unsigned short']],
    'DpcListEntry' : [ 0x8, ['_SINGLE_LIST_ENTRY']],
    'ProcessorHistory' : [ 0x10, ['unsigned long long']],
    'DeferredRoutine' : [ 0x18, ['pointer64', ['void']]],
    'DeferredContext' : [ 0x20, ['pointer64', ['void']]],
    'SystemArgument1' : [ 0x28, ['pointer64', ['void']]],
    'SystemArgument2' : [ 0x30, ['pointer64', ['void']]],
    'DpcData' : [ 0x38, ['pointer64', ['void']]],
} ],
  '_EVENT_DATA_DESCRIPTOR' : [ 0x10, {
    'Ptr' : [ 0x0, ['unsigned long long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned char']],
    'Reserved1' : [ 0xd, ['unsigned char']],
    'Reserved2' : [ 0xe, ['unsigned short']],
} ],
  '_EVENT_DESCRIPTOR' : [ 0x10, {
    'Id' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned char']],
    'Channel' : [ 0x3, ['unsigned char']],
    'Level' : [ 0x4, ['unsigned char']],
    'Opcode' : [ 0x5, ['unsigned char']],
    'Task' : [ 0x6, ['unsigned short']],
    'Keyword' : [ 0x8, ['unsigned long long']],
} ],
  '_RTL_SPLAY_LINKS' : [ 0x18, {
    'Parent' : [ 0x0, ['pointer64', ['_RTL_SPLAY_LINKS']]],
    'LeftChild' : [ 0x8, ['pointer64', ['_RTL_SPLAY_LINKS']]],
    'RightChild' : [ 0x10, ['pointer64', ['_RTL_SPLAY_LINKS']]],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_CONTEXT' : [ 0x18, {
    'ChainHead' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
    'PrevLinkage' : [ 0x8, ['pointer64', ['_LIST_ENTRY']]],
    'Signature' : [ 0x10, ['unsigned long long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_ENUMERATOR' : [ 0x28, {
    'HashEntry' : [ 0x0, ['_RTL_DYNAMIC_HASH_TABLE_ENTRY']],
    'CurEntry' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
    'ChainHead' : [ 0x18, ['pointer64', ['_LIST_ENTRY']]],
    'BucketIndex' : [ 0x20, ['unsigned long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE' : [ 0x28, {
    'Flags' : [ 0x0, ['unsigned long']],
    'Shift' : [ 0x4, ['unsigned long']],
    'TableSize' : [ 0x8, ['unsigned long']],
    'Pivot' : [ 0xc, ['unsigned long']],
    'DivisorMask' : [ 0x10, ['unsigned long']],
    'NumEntries' : [ 0x14, ['unsigned long']],
    'NonEmptyBuckets' : [ 0x18, ['unsigned long']],
    'NumEnumerators' : [ 0x1c, ['unsigned long']],
    'Directory' : [ 0x20, ['pointer64', ['void']]],
} ],
  '_LUID' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG' : [ 0x10, {
    'Size' : [ 0x0, ['unsigned long']],
    'TriggerId' : [ 0x8, ['pointer64', ['wchar']]],
} ],
  '_KPCR' : [ 0x178, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'GdtBase' : [ 0x0, ['pointer64', ['_KGDTENTRY64']]],
    'TssBase' : [ 0x8, ['pointer64', ['_KTSS64']]],
    'UserRsp' : [ 0x10, ['unsigned long long']],
    'Self' : [ 0x18, ['pointer64', ['_KPCR']]],
    'CurrentPrcb' : [ 0x20, ['pointer64', ['_KPRCB']]],
    'LockArray' : [ 0x28, ['pointer64', ['_KSPIN_LOCK_QUEUE']]],
    'Used_Self' : [ 0x30, ['pointer64', ['void']]],
    'IdtBase' : [ 0x38, ['pointer64', ['_KIDTENTRY64']]],
    'Unused' : [ 0x40, ['array', 2, ['unsigned long long']]],
    'Irql' : [ 0x50, ['unsigned char']],
    'SecondLevelCacheAssociativity' : [ 0x51, ['unsigned char']],
    'ObsoleteNumber' : [ 0x52, ['unsigned char']],
    'Fill0' : [ 0x53, ['unsigned char']],
    'Unused0' : [ 0x54, ['array', 3, ['unsigned long']]],
    'MajorVersion' : [ 0x60, ['unsigned short']],
    'MinorVersion' : [ 0x62, ['unsigned short']],
    'StallScaleFactor' : [ 0x64, ['unsigned long']],
    'Unused1' : [ 0x68, ['array', 3, ['pointer64', ['void']]]],
    'KernelReserved' : [ 0x80, ['array', 15, ['unsigned long']]],
    'SecondLevelCacheSize' : [ 0xbc, ['unsigned long']],
    'HalReserved' : [ 0xc0, ['array', 16, ['unsigned long']]],
    'Unused2' : [ 0x100, ['unsigned long']],
    'KdVersionBlock' : [ 0x108, ['pointer64', ['void']]],
    'Unused3' : [ 0x110, ['pointer64', ['void']]],
    'PcrAlign1' : [ 0x118, ['array', 24, ['unsigned long']]],
} ],
  '_IO_DRIVER_CREATE_CONTEXT' : [ 0x28, {
    'Size' : [ 0x0, ['short']],
    'ExtraCreateParameter' : [ 0x8, ['pointer64', ['_ECP_LIST']]],
    'DeviceObjectHint' : [ 0x10, ['pointer64', ['void']]],
    'TxnParameters' : [ 0x18, ['pointer64', ['_TXN_PARAMETER_BLOCK']]],
    'SiloContext' : [ 0x20, ['pointer64', ['_EJOB']]],
} ],
  '__unnamed_123f' : [ 0x3a4, {
    'XpfMceDescriptor' : [ 0x0, ['_WHEA_XPF_MCE_DESCRIPTOR']],
    'XpfCmcDescriptor' : [ 0x0, ['_WHEA_XPF_CMC_DESCRIPTOR']],
    'XpfNmiDescriptor' : [ 0x0, ['_WHEA_XPF_NMI_DESCRIPTOR']],
    'IpfMcaDescriptor' : [ 0x0, ['_WHEA_IPF_MCA_DESCRIPTOR']],
    'IpfCmcDescriptor' : [ 0x0, ['_WHEA_IPF_CMC_DESCRIPTOR']],
    'IpfCpeDescriptor' : [ 0x0, ['_WHEA_IPF_CPE_DESCRIPTOR']],
    'AerRootportDescriptor' : [ 0x0, ['_WHEA_AER_ROOTPORT_DESCRIPTOR']],
    'AerEndpointDescriptor' : [ 0x0, ['_WHEA_AER_ENDPOINT_DESCRIPTOR']],
    'AerBridgeDescriptor' : [ 0x0, ['_WHEA_AER_BRIDGE_DESCRIPTOR']],
    'GenErrDescriptor' : [ 0x0, ['_WHEA_GENERIC_ERROR_DESCRIPTOR']],
    'GenErrDescriptorV2' : [ 0x0, ['_WHEA_GENERIC_ERROR_DESCRIPTOR_V2']],
    'DeviceDriverDescriptor' : [ 0x0, ['_WHEA_DEVICE_DRIVER_DESCRIPTOR']],
} ],
  '_WHEA_ERROR_SOURCE_DESCRIPTOR' : [ 0x3cc, {
    'Length' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSrcTypeMCE', 1: u'WheaErrSrcTypeCMC', 2: u'WheaErrSrcTypeCPE', 3: u'WheaErrSrcTypeNMI', 4: u'WheaErrSrcTypePCIe', 5: u'WheaErrSrcTypeGeneric', 6: u'WheaErrSrcTypeINIT', 7: u'WheaErrSrcTypeBOOT', 8: u'WheaErrSrcTypeSCIGeneric', 9: u'WheaErrSrcTypeIPFMCA', 10: u'WheaErrSrcTypeIPFCMC', 11: u'WheaErrSrcTypeIPFCPE', 12: u'WheaErrSrcTypeGenericV2', 13: u'WheaErrSrcTypeSCIGenericV2', 14: u'WheaErrSrcTypeBMC', 15: u'WheaErrSrcTypePMEM', 16: u'WheaErrSrcTypeDeviceDriver', 17: u'WheaErrSrcTypeMax'})]],
    'State' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {1: u'WheaErrSrcStateStopped', 2: u'WheaErrSrcStateStarted', 3: u'WheaErrSrcStateRemoved', 4: u'WheaErrSrcStateRemovePending'})]],
    'MaxRawDataLength' : [ 0x10, ['unsigned long']],
    'NumRecordsToPreallocate' : [ 0x14, ['unsigned long']],
    'MaxSectionsPerRecord' : [ 0x18, ['unsigned long']],
    'ErrorSourceId' : [ 0x1c, ['unsigned long']],
    'PlatformErrorSourceId' : [ 0x20, ['unsigned long']],
    'Flags' : [ 0x24, ['unsigned long']],
    'Info' : [ 0x28, ['__unnamed_123f']],
} ],
  '_WHEA_EVENT_LOG_ENTRY' : [ 0x20, {
    'Header' : [ 0x0, ['_WHEA_EVENT_LOG_ENTRY_HEADER']],
} ],
  '_WHEA_EVENT_LOG_ENTRY_FLAGS' : [ 0x4, {
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'LogInternalEtw' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'LogBlackbox' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'LogSel' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'RawSel' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'NoFormat' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Driver' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_WHEA_ERROR_PACKET_V2' : [ 0x50, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'Length' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_PACKET_FLAGS']],
    'ErrorType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrTypeProcessor', 1: u'WheaErrTypeMemory', 2: u'WheaErrTypePCIExpress', 3: u'WheaErrTypeNMI', 4: u'WheaErrTypePCIXBus', 5: u'WheaErrTypePCIXDevice', 6: u'WheaErrTypeGeneric', 7: u'WheaErrTypePmem'})]],
    'ErrorSeverity' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSevRecoverable', 1: u'WheaErrSevFatal', 2: u'WheaErrSevCorrected', 3: u'WheaErrSevInformational'})]],
    'ErrorSourceId' : [ 0x18, ['unsigned long']],
    'ErrorSourceType' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSrcTypeMCE', 1: u'WheaErrSrcTypeCMC', 2: u'WheaErrSrcTypeCPE', 3: u'WheaErrSrcTypeNMI', 4: u'WheaErrSrcTypePCIe', 5: u'WheaErrSrcTypeGeneric', 6: u'WheaErrSrcTypeINIT', 7: u'WheaErrSrcTypeBOOT', 8: u'WheaErrSrcTypeSCIGeneric', 9: u'WheaErrSrcTypeIPFMCA', 10: u'WheaErrSrcTypeIPFCMC', 11: u'WheaErrSrcTypeIPFCPE', 12: u'WheaErrSrcTypeGenericV2', 13: u'WheaErrSrcTypeSCIGenericV2', 14: u'WheaErrSrcTypeBMC', 15: u'WheaErrSrcTypePMEM', 16: u'WheaErrSrcTypeDeviceDriver', 17: u'WheaErrSrcTypeMax'})]],
    'NotifyType' : [ 0x20, ['_GUID']],
    'Context' : [ 0x30, ['unsigned long long']],
    'DataFormat' : [ 0x38, ['Enumeration', dict(target = 'long', choices = {0: u'WheaDataFormatIPFSalRecord', 1: u'WheaDataFormatXPFMCA', 2: u'WheaDataFormatMemory', 3: u'WheaDataFormatPCIExpress', 4: u'WheaDataFormatNMIPort', 5: u'WheaDataFormatPCIXBus', 6: u'WheaDataFormatPCIXDevice', 7: u'WheaDataFormatGeneric', 8: u'WheaDataFormatMax'})]],
    'Reserved1' : [ 0x3c, ['unsigned long']],
    'DataOffset' : [ 0x40, ['unsigned long']],
    'DataLength' : [ 0x44, ['unsigned long']],
    'PshedDataOffset' : [ 0x48, ['unsigned long']],
    'PshedDataLength' : [ 0x4c, ['unsigned long']],
} ],
  '_WHEA_ERROR_RECORD' : [ 0xc8, {
    'Header' : [ 0x0, ['_WHEA_ERROR_RECORD_HEADER']],
    'SectionDescriptor' : [ 0x80, ['array', 1, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR']]],
} ],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR' : [ 0x48, {
    'SectionOffset' : [ 0x0, ['unsigned long']],
    'SectionLength' : [ 0x4, ['unsigned long']],
    'Revision' : [ 0x8, ['_WHEA_REVISION']],
    'ValidBits' : [ 0xa, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS']],
    'Reserved' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS']],
    'SectionType' : [ 0x10, ['_GUID']],
    'FRUId' : [ 0x20, ['_GUID']],
    'SectionSeverity' : [ 0x30, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSevRecoverable', 1: u'WheaErrSevFatal', 2: u'WheaErrSevCorrected', 3: u'WheaErrSevInformational'})]],
    'FRUText' : [ 0x34, ['array', 20, ['unsigned char']]],
} ],
  '_GUID' : [ 0x10, {
    'Data1' : [ 0x0, ['unsigned long']],
    'Data2' : [ 0x4, ['unsigned short']],
    'Data3' : [ 0x6, ['unsigned short']],
    'Data4' : [ 0x8, ['array', 8, ['unsigned char']]],
} ],
  '_RTL_RB_TREE' : [ 0x10, {
    'Root' : [ 0x0, ['pointer64', ['_RTL_BALANCED_NODE']]],
    'Encoded' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Min' : [ 0x8, ['pointer64', ['_RTL_BALANCED_NODE']]],
} ],
  '_RTL_BALANCED_NODE' : [ 0x18, {
    'Children' : [ 0x0, ['array', 2, ['pointer64', ['_RTL_BALANCED_NODE']]]],
    'Left' : [ 0x0, ['pointer64', ['_RTL_BALANCED_NODE']]],
    'Right' : [ 0x8, ['pointer64', ['_RTL_BALANCED_NODE']]],
    'Red' : [ 0x10, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Balance' : [ 0x10, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'ParentValue' : [ 0x10, ['unsigned long long']],
} ],
  '_RTL_AVL_TREE' : [ 0x8, {
    'Root' : [ 0x0, ['pointer64', ['_RTL_BALANCED_NODE']]],
} ],
  '_KPRCB' : [ 0x700, {
    'MxCsr' : [ 0x0, ['unsigned long']],
    'LegacyNumber' : [ 0x4, ['unsigned char']],
    'ReservedMustBeZero' : [ 0x5, ['unsigned char']],
    'InterruptRequest' : [ 0x6, ['unsigned char']],
    'IdleHalt' : [ 0x7, ['unsigned char']],
    'CurrentThread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
    'NextThread' : [ 0x10, ['pointer64', ['_KTHREAD']]],
    'IdleThread' : [ 0x18, ['pointer64', ['_KTHREAD']]],
    'NestingLevel' : [ 0x20, ['unsigned char']],
    'ClockOwner' : [ 0x21, ['unsigned char']],
    'PendingTickFlags' : [ 0x22, ['unsigned char']],
    'PendingTick' : [ 0x22, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'PendingBackupTick' : [ 0x22, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'IdleState' : [ 0x23, ['unsigned char']],
    'Number' : [ 0x24, ['unsigned long']],
    'RspBase' : [ 0x28, ['unsigned long long']],
    'PrcbLock' : [ 0x30, ['unsigned long long']],
    'PriorityState' : [ 0x38, ['pointer64', ['unsigned char']]],
    'CpuType' : [ 0x40, ['unsigned char']],
    'CpuID' : [ 0x41, ['unsigned char']],
    'CpuStep' : [ 0x42, ['unsigned short']],
    'CpuStepping' : [ 0x42, ['unsigned char']],
    'CpuModel' : [ 0x43, ['unsigned char']],
    'MHz' : [ 0x44, ['unsigned long']],
    'HalReserved' : [ 0x48, ['array', 8, ['unsigned long long']]],
    'MinorVersion' : [ 0x88, ['unsigned short']],
    'MajorVersion' : [ 0x8a, ['unsigned short']],
    'BuildType' : [ 0x8c, ['unsigned char']],
    'CpuVendor' : [ 0x8d, ['unsigned char']],
    'CoresPerPhysicalProcessor' : [ 0x8e, ['unsigned char']],
    'LogicalProcessorsPerCore' : [ 0x8f, ['unsigned char']],
    'TscFrequency' : [ 0x90, ['unsigned long long']],
    'PrcbPad04' : [ 0x98, ['array', 5, ['unsigned long long']]],
    'ParentNode' : [ 0xc0, ['pointer64', ['_KNODE']]],
    'GroupSetMember' : [ 0xc8, ['unsigned long long']],
    'Group' : [ 0xd0, ['unsigned char']],
    'GroupIndex' : [ 0xd1, ['unsigned char']],
    'PrcbPad05' : [ 0xd2, ['array', 2, ['unsigned char']]],
    'InitialApicId' : [ 0xd4, ['unsigned long']],
    'ScbOffset' : [ 0xd8, ['unsigned long']],
    'ApicMask' : [ 0xdc, ['unsigned long']],
    'AcpiReserved' : [ 0xe0, ['pointer64', ['void']]],
    'CFlushSize' : [ 0xe8, ['unsigned long']],
    'PrcbPad11' : [ 0xf0, ['array', 2, ['unsigned long long']]],
    'ProcessorState' : [ 0x100, ['_KPROCESSOR_STATE']],
    'ExtendedSupervisorState' : [ 0x6c0, ['pointer64', ['_XSAVE_AREA_HEADER']]],
    'ProcessorSignature' : [ 0x6c8, ['unsigned long']],
    'ProcessorFlags' : [ 0x6cc, ['unsigned long']],
    'PrcbPad12a' : [ 0x6d0, ['unsigned long long']],
    'PrcbPad12' : [ 0x6d8, ['array', 3, ['unsigned long long']]],
} ],
  '_EX_PUSH_LOCK' : [ 0x8, {
    'Locked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Waiting' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Waking' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'MultipleShared' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'Shared' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 64, native_type='unsigned long long')]],
    'Value' : [ 0x0, ['unsigned long long']],
    'Ptr' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_HALP_ALLOC_CONTEXT' : [ 0x18, {
    'BufferList' : [ 0x0, ['_LIST_ENTRY']],
    'Lock' : [ 0x10, ['unsigned long long']],
} ],
  '_MCUPDATE_INFO' : [ 0x30, {
    'List' : [ 0x0, ['_LIST_ENTRY']],
    'Status' : [ 0x10, ['unsigned long']],
    'Id' : [ 0x18, ['unsigned long long']],
    'VendorScratch' : [ 0x20, ['array', 2, ['unsigned long long']]],
} ],
  '_HARDWARE_PTE' : [ 0x8, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Write' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Owner' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'WriteThrough' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'CacheDisable' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'Accessed' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
    'Dirty' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long long')]],
    'LargePage' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long long')]],
    'Global' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'CopyOnWrite' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'Prototype' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'reserved0' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'PageFrameNumber' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 48, native_type='unsigned long long')]],
    'reserved1' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 52, native_type='unsigned long long')]],
    'SoftwareWsIndex' : [ 0x0, ['BitField', dict(start_bit = 52, end_bit = 63, native_type='unsigned long long')]],
    'NoExecute' : [ 0x0, ['BitField', dict(start_bit = 63, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_DEVPROPKEY' : [ 0x14, {
    'fmtid' : [ 0x0, ['_GUID']],
    'pid' : [ 0x10, ['unsigned long']],
} ],
  '_WHEA_IPF_CMC_DESCRIPTOR' : [ 0x4, {
    'Type' : [ 0x0, ['unsigned short']],
    'Enabled' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
} ],
  '_WHEA_AER_ENDPOINT_DESCRIPTOR' : [ 0x20, {
    'Type' : [ 0x0, ['unsigned short']],
    'Enabled' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
    'BusNumber' : [ 0x4, ['unsigned long']],
    'Slot' : [ 0x8, ['_WHEA_PCI_SLOT_NUMBER']],
    'DeviceControl' : [ 0xc, ['unsigned short']],
    'Flags' : [ 0xe, ['_AER_ENDPOINT_DESCRIPTOR_FLAGS']],
    'UncorrectableErrorMask' : [ 0x10, ['unsigned long']],
    'UncorrectableErrorSeverity' : [ 0x14, ['unsigned long']],
    'CorrectableErrorMask' : [ 0x18, ['unsigned long']],
    'AdvancedCapsAndControl' : [ 0x1c, ['unsigned long']],
} ],
  '_WHEA_AER_BRIDGE_DESCRIPTOR' : [ 0x2c, {
    'Type' : [ 0x0, ['unsigned short']],
    'Enabled' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
    'BusNumber' : [ 0x4, ['unsigned long']],
    'Slot' : [ 0x8, ['_WHEA_PCI_SLOT_NUMBER']],
    'DeviceControl' : [ 0xc, ['unsigned short']],
    'Flags' : [ 0xe, ['_AER_BRIDGE_DESCRIPTOR_FLAGS']],
    'UncorrectableErrorMask' : [ 0x10, ['unsigned long']],
    'UncorrectableErrorSeverity' : [ 0x14, ['unsigned long']],
    'CorrectableErrorMask' : [ 0x18, ['unsigned long']],
    'AdvancedCapsAndControl' : [ 0x1c, ['unsigned long']],
    'SecondaryUncorrectableErrorMask' : [ 0x20, ['unsigned long']],
    'SecondaryUncorrectableErrorSev' : [ 0x24, ['unsigned long']],
    'SecondaryCapsAndControl' : [ 0x28, ['unsigned long']],
} ],
  '_INTERFACE' : [ 0x20, {
    'Size' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned short']],
    'Context' : [ 0x8, ['pointer64', ['void']]],
    'InterfaceReference' : [ 0x10, ['pointer64', ['void']]],
    'InterfaceDereference' : [ 0x18, ['pointer64', ['void']]],
} ],
  '_DEVICE_CAPABILITIES' : [ 0x40, {
    'Size' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned short']],
    'DeviceD1' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DeviceD2' : [ 0x4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'LockSupported' : [ 0x4, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'EjectSupported' : [ 0x4, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Removable' : [ 0x4, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DockDevice' : [ 0x4, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'UniqueID' : [ 0x4, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'SilentInstall' : [ 0x4, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'RawDeviceOK' : [ 0x4, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'SurpriseRemovalOK' : [ 0x4, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'WakeFromD0' : [ 0x4, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'WakeFromD1' : [ 0x4, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'WakeFromD2' : [ 0x4, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'WakeFromD3' : [ 0x4, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'HardwareDisabled' : [ 0x4, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'NonDynamic' : [ 0x4, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'WarmEjectSupported' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'NoDisplayInUI' : [ 0x4, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'Reserved1' : [ 0x4, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'WakeFromInterrupt' : [ 0x4, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'SecureDevice' : [ 0x4, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'ChildOfVgaEnabledBridge' : [ 0x4, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'DecodeIoOnBoot' : [ 0x4, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'Reserved' : [ 0x4, ['BitField', dict(start_bit = 23, end_bit = 32, native_type='unsigned long')]],
    'Address' : [ 0x8, ['unsigned long']],
    'UINumber' : [ 0xc, ['unsigned long']],
    'DeviceState' : [ 0x10, ['array', 7, ['Enumeration', dict(target = 'long', choices = {0: u'PowerDeviceUnspecified', 1: u'PowerDeviceD0', 2: u'PowerDeviceD1', 3: u'PowerDeviceD2', 4: u'PowerDeviceD3', 5: u'PowerDeviceMaximum'})]]],
    'SystemWake' : [ 0x2c, ['Enumeration', dict(target = 'long', choices = {0: u'PowerSystemUnspecified', 1: u'PowerSystemWorking', 2: u'PowerSystemSleeping1', 3: u'PowerSystemSleeping2', 4: u'PowerSystemSleeping3', 5: u'PowerSystemHibernate', 6: u'PowerSystemShutdown', 7: u'PowerSystemMaximum'})]],
    'DeviceWake' : [ 0x30, ['Enumeration', dict(target = 'long', choices = {0: u'PowerDeviceUnspecified', 1: u'PowerDeviceD0', 2: u'PowerDeviceD1', 3: u'PowerDeviceD2', 4: u'PowerDeviceD3', 5: u'PowerDeviceMaximum'})]],
    'D1Latency' : [ 0x34, ['unsigned long']],
    'D2Latency' : [ 0x38, ['unsigned long']],
    'D3Latency' : [ 0x3c, ['unsigned long']],
} ],
  '_WHEA_XPF_PROCESSOR_ERROR_SECTION' : [ 0x41, {
    'ValidBits' : [ 0x0, ['_WHEA_XPF_PROCESSOR_ERROR_SECTION_VALIDBITS']],
    'LocalAPICId' : [ 0x8, ['unsigned long long']],
    'CpuId' : [ 0x10, ['array', 48, ['unsigned char']]],
    'VariableInfo' : [ 0x40, ['array', 1, ['unsigned char']]],
} ],
  '_WHEA_XPF_CMC_DESCRIPTOR' : [ 0x3a4, {
    'Type' : [ 0x0, ['unsigned short']],
    'Enabled' : [ 0x2, ['unsigned char']],
    'NumberOfBanks' : [ 0x3, ['unsigned char']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Notify' : [ 0x8, ['_WHEA_NOTIFICATION_DESCRIPTOR']],
    'Banks' : [ 0x24, ['array', 32, ['_WHEA_XPF_MC_BANK_DESCRIPTOR']]],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_ENTRY' : [ 0x18, {
    'Linkage' : [ 0x0, ['_LIST_ENTRY']],
    'Signature' : [ 0x10, ['unsigned long long']],
} ],
  '_WHEA_GENERIC_ERROR_DESCRIPTOR_V2' : [ 0x50, {
    'Type' : [ 0x0, ['unsigned short']],
    'Reserved' : [ 0x2, ['unsigned char']],
    'Enabled' : [ 0x3, ['unsigned char']],
    'ErrStatusBlockLength' : [ 0x4, ['unsigned long']],
    'RelatedErrorSourceId' : [ 0x8, ['unsigned long']],
    'ErrStatusAddressSpaceID' : [ 0xc, ['unsigned char']],
    'ErrStatusAddressBitWidth' : [ 0xd, ['unsigned char']],
    'ErrStatusAddressBitOffset' : [ 0xe, ['unsigned char']],
    'ErrStatusAddressAccessSize' : [ 0xf, ['unsigned char']],
    'ErrStatusAddress' : [ 0x10, ['_LARGE_INTEGER']],
    'Notify' : [ 0x18, ['_WHEA_NOTIFICATION_DESCRIPTOR']],
    'ReadAckAddressSpaceID' : [ 0x34, ['unsigned char']],
    'ReadAckAddressBitWidth' : [ 0x35, ['unsigned char']],
    'ReadAckAddressBitOffset' : [ 0x36, ['unsigned char']],
    'ReadAckAddressAccessSize' : [ 0x37, ['unsigned char']],
    'ReadAckAddress' : [ 0x38, ['_LARGE_INTEGER']],
    'ReadAckPreserveMask' : [ 0x40, ['unsigned long long']],
    'ReadAckWriteMask' : [ 0x48, ['unsigned long long']],
} ],
  '_SECONDARY_INTERRUPT_LINE_STATE' : [ 0x10, {
    'Polarity' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptPolarityUnknown', 1: u'InterruptRisingEdge', 2: u'InterruptFallingEdge', 3: u'InterruptActiveBothTriggerLow', 4: u'InterruptActiveBothTriggerHigh'})]],
    'Mode' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'LevelSensitive', 1: u'Latched'})]],
    'Vector' : [ 0x8, ['unsigned long']],
    'Unmasked' : [ 0xc, ['unsigned char']],
} ],
  '_AER_ENDPOINT_DESCRIPTOR_FLAGS' : [ 0x2, {
    'UncorrectableErrorMaskRW' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'UncorrectableErrorSeverityRW' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'CorrectableErrorMaskRW' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'AdvancedCapsAndControlRW' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 16, native_type='unsigned short')]],
    'AsUSHORT' : [ 0x0, ['unsigned short']],
} ],
  '_GENERAL_LOOKASIDE' : [ 0x80, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'SingleListHead' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x10, ['unsigned short']],
    'MaximumDepth' : [ 0x12, ['unsigned short']],
    'TotalAllocates' : [ 0x14, ['unsigned long']],
    'AllocateMisses' : [ 0x18, ['unsigned long']],
    'AllocateHits' : [ 0x18, ['unsigned long']],
    'TotalFrees' : [ 0x1c, ['unsigned long']],
    'FreeMisses' : [ 0x20, ['unsigned long']],
    'FreeHits' : [ 0x20, ['unsigned long']],
    'Type' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: u'NonPagedPoolBase', 1: u'PagedPool', 2: u'NonPagedPoolBaseMustSucceed', 3: u'DontUseThisType', 4: u'NonPagedPoolBaseCacheAligned', 5: u'PagedPoolCacheAligned', 6: u'NonPagedPoolBaseCacheAlignedMustS', 7: u'MaxPoolType', 34: u'NonPagedPoolMustSucceedSession', 516: u'NonPagedPoolNxCacheAligned', 35: u'DontUseThisTypeSession', 32: u'NonPagedPoolSession', 512: u'NonPagedPoolNx', 544: u'NonPagedPoolSessionNx', 36: u'NonPagedPoolCacheAlignedSession', 33: u'PagedPoolSession', 38: u'NonPagedPoolCacheAlignedMustSSession', 37: u'PagedPoolCacheAlignedSession'})]],
    'Tag' : [ 0x28, ['unsigned long']],
    'Size' : [ 0x2c, ['unsigned long']],
    'AllocateEx' : [ 0x30, ['pointer64', ['void']]],
    'Allocate' : [ 0x30, ['pointer64', ['void']]],
    'FreeEx' : [ 0x38, ['pointer64', ['void']]],
    'Free' : [ 0x38, ['pointer64', ['void']]],
    'ListEntry' : [ 0x40, ['_LIST_ENTRY']],
    'LastTotalAllocates' : [ 0x50, ['unsigned long']],
    'LastAllocateMisses' : [ 0x54, ['unsigned long']],
    'LastAllocateHits' : [ 0x54, ['unsigned long']],
    'Future' : [ 0x58, ['array', 2, ['unsigned long']]],
} ],
  '_WHEA_XPF_PROCESSOR_ERROR_SECTION_VALIDBITS' : [ 0x8, {
    'LocalAPICId' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'CpuId' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'ProcInfoCount' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned long long')]],
    'ContextInfoCount' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 14, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 64, native_type='unsigned long long')]],
    'ValidBits' : [ 0x0, ['unsigned long long']],
} ],
  '_IO_APIC_DATA' : [ 0x30, {
    'PhysicalAddress' : [ 0x0, ['unsigned long long']],
    'Identifier' : [ 0x8, ['unsigned long']],
    'BaseAddress' : [ 0x10, ['pointer64', ['_IO_APIC_REGISTERS']]],
    'Version' : [ 0x18, ['unsigned char']],
    'PinCount' : [ 0x19, ['unsigned char']],
    'Initialized' : [ 0x1a, ['unsigned char']],
    'InitializedFirstLocalUnit' : [ 0x1b, ['unsigned char']],
    'GsiBase' : [ 0x1c, ['unsigned long']],
    'CmciRegister' : [ 0x20, ['unsigned long']],
    'DeferredErrorRegister' : [ 0x24, ['unsigned long']],
    'IoUnitMissing' : [ 0x28, ['unsigned char']],
} ],
  '_WHEA_GENERIC_ERROR_DESCRIPTOR' : [ 0x34, {
    'Type' : [ 0x0, ['unsigned short']],
    'Reserved' : [ 0x2, ['unsigned char']],
    'Enabled' : [ 0x3, ['unsigned char']],
    'ErrStatusBlockLength' : [ 0x4, ['unsigned long']],
    'RelatedErrorSourceId' : [ 0x8, ['unsigned long']],
    'ErrStatusAddressSpaceID' : [ 0xc, ['unsigned char']],
    'ErrStatusAddressBitWidth' : [ 0xd, ['unsigned char']],
    'ErrStatusAddressBitOffset' : [ 0xe, ['unsigned char']],
    'ErrStatusAddressAccessSize' : [ 0xf, ['unsigned char']],
    'ErrStatusAddress' : [ 0x10, ['_LARGE_INTEGER']],
    'Notify' : [ 0x18, ['_WHEA_NOTIFICATION_DESCRIPTOR']],
} ],
  '_REGISTERED_INTERRUPT_CONTROLLER' : [ 0x160, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'InternalData' : [ 0x10, ['pointer64', ['void']]],
    'InternalDataSize' : [ 0x18, ['unsigned long']],
    'FunctionTable' : [ 0x20, ['_INTERRUPT_FUNCTION_TABLE']],
    'KnownType' : [ 0xd8, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptControllerInvalid', 1: u'InterruptControllerPic', 2: u'InterruptControllerApic', 3: u'InterruptControllerGic', 4: u'InterruptControllerGicV3', 5: u'InterruptControllerGicV4', 6: u'InterruptControllerBcm', 4096: u'InterruptControllerUnknown'})]],
    'Capabilities' : [ 0xdc, ['unsigned long']],
    'Flags' : [ 0xe0, ['unsigned long']],
    'MaxPriority' : [ 0xe4, ['unsigned long']],
    'UnitId' : [ 0xe8, ['unsigned long']],
    'LinesHead' : [ 0xf0, ['_LIST_ENTRY']],
    'OutputLinesHead' : [ 0x100, ['_LIST_ENTRY']],
    'MinLine' : [ 0x110, ['long']],
    'MaxLine' : [ 0x114, ['long']],
    'MaxClusterSize' : [ 0x118, ['unsigned long']],
    'MaxClusters' : [ 0x11c, ['unsigned long']],
    'InterruptReplayDataSize' : [ 0x120, ['unsigned long']],
    'Problem' : [ 0x124, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptProblemNone', 1: u'InterruptProblemMadtParsingFailure', 2: u'InterruptProblemNoControllersFound', 3: u'InterruptProblemFailedDiscovery', 4: u'InterruptProblemInitializeLocalUnitFailed', 5: u'InterruptProblemInitializeIoUnitFailed', 6: u'InterruptProblemSetLogicalIdFailed', 7: u'InterruptProblemSetLineStateFailed', 8: u'InterruptProblemGenerateMessageFailed', 9: u'InterruptProblemConvertIdFailed', 10: u'InterruptProblemCmciSetupFailed', 11: u'InterruptProblemQueryMaxProcessorsCalledTooEarly', 12: u'InterruptProblemProcessorReset', 13: u'InterruptProblemStartProcessorFailed', 14: u'InterruptProblemProcessorNotAlive', 15: u'InterruptProblemLowerIrqlViolation', 16: u'InterruptProblemInvalidIrql', 17: u'InterruptProblemNoSuchController', 18: u'InterruptProblemNoSuchLines', 19: u'InterruptProblemBadConnectionData', 20: u'InterruptProblemBadRoutingData', 21: u'InterruptProblemInvalidProcessor', 22: u'InterruptProblemFailedToAttainTarget', 23: u'InterruptProblemUnsupportedWiringConfiguration', 24: u'InterruptProblemSpareAlreadyStarted', 25: u'InterruptProblemClusterNotFullyReplaced', 26: u'InterruptProblemNewClusterAlreadyActive', 27: u'InterruptProblemNewClusterTooLarge', 28: u'InterruptProblemCannotHardwareQuiesce', 29: u'InterruptProblemIpiDestinationUpdateFailed', 30: u'InterruptProblemNoMemory', 31: u'InterruptProblemNoIrtEntries', 32: u'InterruptProblemConnectionDataBaitAndSwitch', 33: u'InterruptProblemInvalidLogicalFlatId', 34: u'InterruptProblemDeinitializeLocalUnitFailed', 35: u'InterruptProblemDeinitializeIoUnitFailed', 36: u'InterruptProblemMismatchedThermalLvtIsr', 37: u'InterruptProblemHvRetargetFailed', 38: u'InterruptProblemDeferredErrorSetupFailed'})]],
    'ProblemStatus' : [ 0x128, ['long']],
    'ProblemSourceFile' : [ 0x130, ['pointer64', ['unsigned char']]],
    'ProblemSourceLine' : [ 0x138, ['unsigned long']],
    'CustomProblem' : [ 0x13c, ['unsigned long']],
    'CustomProblemStatus' : [ 0x140, ['long']],
    'ResourceId' : [ 0x148, ['_UNICODE_STRING']],
    'PowerHandle' : [ 0x158, ['pointer64', ['POHANDLE__']]],
} ],
  '__unnamed_136d' : [ 0x4, {
    'DeviceNumber' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 5, native_type='unsigned long')]],
    'FunctionNumber' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 8, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_136f' : [ 0x4, {
    'bits' : [ 0x0, ['__unnamed_136d']],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_WHEA_PCI_SLOT_NUMBER' : [ 0x4, {
    'u' : [ 0x0, ['__unnamed_136f']],
} ],
  '_WHEA_XPF_MCE_DESCRIPTOR' : [ 0x398, {
    'Type' : [ 0x0, ['unsigned short']],
    'Enabled' : [ 0x2, ['unsigned char']],
    'NumberOfBanks' : [ 0x3, ['unsigned char']],
    'Flags' : [ 0x4, ['_XPF_MCE_FLAGS']],
    'MCG_Capability' : [ 0x8, ['unsigned long long']],
    'MCG_GlobalControl' : [ 0x10, ['unsigned long long']],
    'Banks' : [ 0x18, ['array', 32, ['_WHEA_XPF_MC_BANK_DESCRIPTOR']]],
} ],
  '_FILE_OBJECT' : [ 0xd8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'Vpb' : [ 0x10, ['pointer64', ['_VPB']]],
    'FsContext' : [ 0x18, ['pointer64', ['void']]],
    'FsContext2' : [ 0x20, ['pointer64', ['void']]],
    'SectionObjectPointer' : [ 0x28, ['pointer64', ['_SECTION_OBJECT_POINTERS']]],
    'PrivateCacheMap' : [ 0x30, ['pointer64', ['void']]],
    'FinalStatus' : [ 0x38, ['long']],
    'RelatedFileObject' : [ 0x40, ['pointer64', ['_FILE_OBJECT']]],
    'LockOperation' : [ 0x48, ['unsigned char']],
    'DeletePending' : [ 0x49, ['unsigned char']],
    'ReadAccess' : [ 0x4a, ['unsigned char']],
    'WriteAccess' : [ 0x4b, ['unsigned char']],
    'DeleteAccess' : [ 0x4c, ['unsigned char']],
    'SharedRead' : [ 0x4d, ['unsigned char']],
    'SharedWrite' : [ 0x4e, ['unsigned char']],
    'SharedDelete' : [ 0x4f, ['unsigned char']],
    'Flags' : [ 0x50, ['unsigned long']],
    'FileName' : [ 0x58, ['_UNICODE_STRING']],
    'CurrentByteOffset' : [ 0x68, ['_LARGE_INTEGER']],
    'Waiters' : [ 0x70, ['unsigned long']],
    'Busy' : [ 0x74, ['unsigned long']],
    'LastLock' : [ 0x78, ['pointer64', ['void']]],
    'Lock' : [ 0x80, ['_KEVENT']],
    'Event' : [ 0x98, ['_KEVENT']],
    'CompletionContext' : [ 0xb0, ['pointer64', ['_IO_COMPLETION_CONTEXT']]],
    'IrpListLock' : [ 0xb8, ['unsigned long long']],
    'IrpList' : [ 0xc0, ['_LIST_ENTRY']],
    'FileObjectExtension' : [ 0xd0, ['pointer64', ['void']]],
} ],
  '_PROCLOCALSAPIC' : [ 0x11, {
    'Type' : [ 0x0, ['unsigned char']],
    'Length' : [ 0x1, ['unsigned char']],
    'ACPIProcessorID' : [ 0x2, ['unsigned char']],
    'APICID' : [ 0x3, ['unsigned char']],
    'APICEID' : [ 0x4, ['unsigned char']],
    'Reserved' : [ 0x5, ['array', 3, ['unsigned char']]],
    'Flags' : [ 0x8, ['unsigned long']],
    'ACPIProcessorUIDInteger' : [ 0xc, ['unsigned long']],
    'ACPIProcessorUIDString' : [ 0x10, ['array', 1, ['unsigned char']]],
} ],
  '_GENERAL_LOOKASIDE_POOL' : [ 0x60, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'SingleListHead' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x10, ['unsigned short']],
    'MaximumDepth' : [ 0x12, ['unsigned short']],
    'TotalAllocates' : [ 0x14, ['unsigned long']],
    'AllocateMisses' : [ 0x18, ['unsigned long']],
    'AllocateHits' : [ 0x18, ['unsigned long']],
    'TotalFrees' : [ 0x1c, ['unsigned long']],
    'FreeMisses' : [ 0x20, ['unsigned long']],
    'FreeHits' : [ 0x20, ['unsigned long']],
    'Type' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: u'NonPagedPoolBase', 1: u'PagedPool', 2: u'NonPagedPoolBaseMustSucceed', 3: u'DontUseThisType', 4: u'NonPagedPoolBaseCacheAligned', 5: u'PagedPoolCacheAligned', 6: u'NonPagedPoolBaseCacheAlignedMustS', 7: u'MaxPoolType', 34: u'NonPagedPoolMustSucceedSession', 516: u'NonPagedPoolNxCacheAligned', 35: u'DontUseThisTypeSession', 32: u'NonPagedPoolSession', 512: u'NonPagedPoolNx', 544: u'NonPagedPoolSessionNx', 36: u'NonPagedPoolCacheAlignedSession', 33: u'PagedPoolSession', 38: u'NonPagedPoolCacheAlignedMustSSession', 37: u'PagedPoolCacheAlignedSession'})]],
    'Tag' : [ 0x28, ['unsigned long']],
    'Size' : [ 0x2c, ['unsigned long']],
    'AllocateEx' : [ 0x30, ['pointer64', ['void']]],
    'Allocate' : [ 0x30, ['pointer64', ['void']]],
    'FreeEx' : [ 0x38, ['pointer64', ['void']]],
    'Free' : [ 0x38, ['pointer64', ['void']]],
    'ListEntry' : [ 0x40, ['_LIST_ENTRY']],
    'LastTotalAllocates' : [ 0x50, ['unsigned long']],
    'LastAllocateMisses' : [ 0x54, ['unsigned long']],
    'LastAllocateHits' : [ 0x54, ['unsigned long']],
    'Future' : [ 0x58, ['array', 2, ['unsigned long']]],
} ],
  '_DISPATCHER_HEADER' : [ 0x18, {
    'Lock' : [ 0x0, ['long']],
    'LockNV' : [ 0x0, ['long']],
    'Type' : [ 0x0, ['unsigned char']],
    'Signalling' : [ 0x1, ['unsigned char']],
    'Size' : [ 0x2, ['unsigned char']],
    'Reserved1' : [ 0x3, ['unsigned char']],
    'TimerType' : [ 0x0, ['unsigned char']],
    'TimerControlFlags' : [ 0x1, ['unsigned char']],
    'Absolute' : [ 0x1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Wake' : [ 0x1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'EncodedTolerableDelay' : [ 0x1, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'Hand' : [ 0x2, ['unsigned char']],
    'TimerMiscFlags' : [ 0x3, ['unsigned char']],
    'Index' : [ 0x3, ['BitField', dict(start_bit = 0, end_bit = 6, native_type='unsigned char')]],
    'Inserted' : [ 0x3, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'Expired' : [ 0x3, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'Timer2Type' : [ 0x0, ['unsigned char']],
    'Timer2Flags' : [ 0x1, ['unsigned char']],
    'Timer2Inserted' : [ 0x1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Timer2Expiring' : [ 0x1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Timer2CancelPending' : [ 0x1, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Timer2SetPending' : [ 0x1, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Timer2Running' : [ 0x1, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'Timer2Disabled' : [ 0x1, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'Timer2ReservedFlags' : [ 0x1, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'Timer2ComponentId' : [ 0x2, ['unsigned char']],
    'Timer2RelativeId' : [ 0x3, ['unsigned char']],
    'QueueType' : [ 0x0, ['unsigned char']],
    'QueueControlFlags' : [ 0x1, ['unsigned char']],
    'Abandoned' : [ 0x1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'DisableIncrement' : [ 0x1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'QueueReservedControlFlags' : [ 0x1, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'QueueSize' : [ 0x2, ['unsigned char']],
    'QueueReserved' : [ 0x3, ['unsigned char']],
    'ThreadType' : [ 0x0, ['unsigned char']],
    'ThreadReserved' : [ 0x1, ['unsigned char']],
    'ThreadControlFlags' : [ 0x2, ['unsigned char']],
    'CycleProfiling' : [ 0x2, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'CounterProfiling' : [ 0x2, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'GroupScheduling' : [ 0x2, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'AffinitySet' : [ 0x2, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Tagged' : [ 0x2, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'EnergyProfiling' : [ 0x2, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'SchedulerAssist' : [ 0x2, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'ThreadReservedControlFlags' : [ 0x2, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'DebugActive' : [ 0x3, ['unsigned char']],
    'ActiveDR7' : [ 0x3, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Instrumented' : [ 0x3, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Minimal' : [ 0x3, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Reserved4' : [ 0x3, ['BitField', dict(start_bit = 3, end_bit = 5, native_type='unsigned char')]],
    'AltSyscall' : [ 0x3, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'UmsScheduled' : [ 0x3, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'UmsPrimary' : [ 0x3, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'MutantType' : [ 0x0, ['unsigned char']],
    'MutantSize' : [ 0x1, ['unsigned char']],
    'DpcActive' : [ 0x2, ['unsigned char']],
    'MutantReserved' : [ 0x3, ['unsigned char']],
    'SignalState' : [ 0x4, ['long']],
    'WaitListHead' : [ 0x8, ['_LIST_ENTRY']],
} ],
  '_NAMED_PIPE_CREATE_PARAMETERS' : [ 0x28, {
    'NamedPipeType' : [ 0x0, ['unsigned long']],
    'ReadMode' : [ 0x4, ['unsigned long']],
    'CompletionMode' : [ 0x8, ['unsigned long']],
    'MaximumInstances' : [ 0xc, ['unsigned long']],
    'InboundQuota' : [ 0x10, ['unsigned long']],
    'OutboundQuota' : [ 0x14, ['unsigned long']],
    'DefaultTimeout' : [ 0x18, ['_LARGE_INTEGER']],
    'TimeoutSpecified' : [ 0x20, ['unsigned char']],
} ],
  '_WAIT_CONTEXT_BLOCK' : [ 0x48, {
    'WaitQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DmaWaitEntry' : [ 0x0, ['_LIST_ENTRY']],
    'NumberOfChannels' : [ 0x10, ['unsigned long']],
    'SyncCallback' : [ 0x14, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DmaContext' : [ 0x14, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ZeroMapRegisters' : [ 0x14, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Reserved' : [ 0x14, ['BitField', dict(start_bit = 3, end_bit = 12, native_type='unsigned long')]],
    'NumberOfRemapPages' : [ 0x14, ['BitField', dict(start_bit = 12, end_bit = 32, native_type='unsigned long')]],
    'DeviceRoutine' : [ 0x18, ['pointer64', ['void']]],
    'DeviceContext' : [ 0x20, ['pointer64', ['void']]],
    'NumberOfMapRegisters' : [ 0x28, ['unsigned long']],
    'DeviceObject' : [ 0x30, ['pointer64', ['void']]],
    'CurrentIrp' : [ 0x38, ['pointer64', ['void']]],
    'BufferChainingDpc' : [ 0x40, ['pointer64', ['_KDPC']]],
} ],
  '_KSPIN_LOCK_QUEUE' : [ 0x10, {
    'Next' : [ 0x0, ['pointer64', ['_KSPIN_LOCK_QUEUE']]],
    'Lock' : [ 0x8, ['pointer64', ['unsigned long long']]],
} ],
  '_GEN_ADDR' : [ 0xc, {
    'AddressSpaceID' : [ 0x0, ['unsigned char']],
    'BitWidth' : [ 0x1, ['unsigned char']],
    'BitOffset' : [ 0x2, ['unsigned char']],
    'AccessSize' : [ 0x3, ['unsigned char']],
    'Address' : [ 0x4, ['_LARGE_INTEGER']],
} ],
  '_WHEA_IPF_MCA_DESCRIPTOR' : [ 0x4, {
    'Type' : [ 0x0, ['unsigned short']],
    'Enabled' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
} ],
  '_WHEA_AER_ROOTPORT_DESCRIPTOR' : [ 0x24, {
    'Type' : [ 0x0, ['unsigned short']],
    'Enabled' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
    'BusNumber' : [ 0x4, ['unsigned long']],
    'Slot' : [ 0x8, ['_WHEA_PCI_SLOT_NUMBER']],
    'DeviceControl' : [ 0xc, ['unsigned short']],
    'Flags' : [ 0xe, ['_AER_ROOTPORT_DESCRIPTOR_FLAGS']],
    'UncorrectableErrorMask' : [ 0x10, ['unsigned long']],
    'UncorrectableErrorSeverity' : [ 0x14, ['unsigned long']],
    'CorrectableErrorMask' : [ 0x18, ['unsigned long']],
    'AdvancedCapsAndControl' : [ 0x1c, ['unsigned long']],
    'RootErrorCommand' : [ 0x20, ['unsigned long']],
} ],
  '_IO_COMPLETION_CONTEXT' : [ 0x10, {
    'Port' : [ 0x0, ['pointer64', ['void']]],
    'Key' : [ 0x8, ['pointer64', ['void']]],
} ],
  '_POWER_STATE' : [ 0x4, {
    'SystemState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PowerSystemUnspecified', 1: u'PowerSystemWorking', 2: u'PowerSystemSleeping1', 3: u'PowerSystemSleeping2', 4: u'PowerSystemSleeping3', 5: u'PowerSystemHibernate', 6: u'PowerSystemShutdown', 7: u'PowerSystemMaximum'})]],
    'DeviceState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PowerDeviceUnspecified', 1: u'PowerDeviceD0', 2: u'PowerDeviceD1', 3: u'PowerDeviceD2', 4: u'PowerDeviceD3', 5: u'PowerDeviceMaximum'})]],
} ],
  '_DEVOBJ_EXTENSION' : [ 0x70, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'PowerFlags' : [ 0x10, ['unsigned long']],
    'Dope' : [ 0x18, ['pointer64', ['_DEVICE_OBJECT_POWER_EXTENSION']]],
    'ExtensionFlags' : [ 0x20, ['unsigned long']],
    'DeviceNode' : [ 0x28, ['pointer64', ['void']]],
    'AttachedTo' : [ 0x30, ['pointer64', ['_DEVICE_OBJECT']]],
    'StartIoCount' : [ 0x38, ['long']],
    'StartIoKey' : [ 0x3c, ['long']],
    'StartIoFlags' : [ 0x40, ['unsigned long']],
    'Vpb' : [ 0x48, ['pointer64', ['_VPB']]],
    'DependencyNode' : [ 0x50, ['pointer64', ['void']]],
    'InterruptContext' : [ 0x58, ['pointer64', ['void']]],
    'InterruptCount' : [ 0x60, ['long']],
    'VerifierContext' : [ 0x68, ['pointer64', ['void']]],
} ],
  '_AER_ROOTPORT_DESCRIPTOR_FLAGS' : [ 0x2, {
    'UncorrectableErrorMaskRW' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'UncorrectableErrorSeverityRW' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'CorrectableErrorMaskRW' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'AdvancedCapsAndControlRW' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'RootErrorCommandRW' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 16, native_type='unsigned short')]],
    'AsUSHORT' : [ 0x0, ['unsigned short']],
} ],
  '_KDEVICE_QUEUE' : [ 0x28, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceListHead' : [ 0x8, ['_LIST_ENTRY']],
    'Lock' : [ 0x18, ['unsigned long long']],
    'Busy' : [ 0x20, ['unsigned char']],
    'Reserved' : [ 0x20, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='long long')]],
    'Hint' : [ 0x20, ['BitField', dict(start_bit = 8, end_bit = 64, native_type='long long')]],
} ],
  '__unnamed_13b8' : [ 0x4, {
    'BaseMiddle' : [ 0x0, ['unsigned char']],
    'Flags1' : [ 0x1, ['unsigned char']],
    'Flags2' : [ 0x2, ['unsigned char']],
    'BaseHigh' : [ 0x3, ['unsigned char']],
} ],
  '__unnamed_13c0' : [ 0x4, {
    'BaseMiddle' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
    'Type' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 13, native_type='unsigned long')]],
    'Dpl' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 15, native_type='unsigned long')]],
    'Present' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'LimitHigh' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 20, native_type='unsigned long')]],
    'System' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'LongMode' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'DefaultBig' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'Granularity' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'BaseHigh' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
} ],
  '_KGDTENTRY64' : [ 0x10, {
    'LimitLow' : [ 0x0, ['unsigned short']],
    'BaseLow' : [ 0x2, ['unsigned short']],
    'Bytes' : [ 0x4, ['__unnamed_13b8']],
    'Bits' : [ 0x4, ['__unnamed_13c0']],
    'BaseUpper' : [ 0x8, ['unsigned long']],
    'MustBeZero' : [ 0xc, ['unsigned long']],
    'DataLow' : [ 0x0, ['long long']],
    'DataHigh' : [ 0x8, ['long long']],
} ],
  '_WHEA_REVISION' : [ 0x2, {
    'MinorRevision' : [ 0x0, ['unsigned char']],
    'MajorRevision' : [ 0x1, ['unsigned char']],
    'AsUSHORT' : [ 0x0, ['unsigned short']],
} ],
  '_KAPC' : [ 0x58, {
    'Type' : [ 0x0, ['unsigned char']],
    'SpareByte0' : [ 0x1, ['unsigned char']],
    'Size' : [ 0x2, ['unsigned char']],
    'SpareByte1' : [ 0x3, ['unsigned char']],
    'SpareLong0' : [ 0x4, ['unsigned long']],
    'Thread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
    'ApcListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'Reserved' : [ 0x20, ['array', 3, ['pointer64', ['void']]]],
    'NormalContext' : [ 0x38, ['pointer64', ['void']]],
    'SystemArgument1' : [ 0x40, ['pointer64', ['void']]],
    'SystemArgument2' : [ 0x48, ['pointer64', ['void']]],
    'ApcStateIndex' : [ 0x50, ['unsigned char']],
    'ApcMode' : [ 0x51, ['unsigned char']],
    'Inserted' : [ 0x52, ['unsigned char']],
} ],
  '_WHEA_XPF_MCA_SECTION' : [ 0x110, {
    'VersionNumber' : [ 0x0, ['unsigned long']],
    'CpuVendor' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'WheaCpuVendorOther', 1: u'WheaCpuVendorIntel', 2: u'WheaCpuVendorAmd'})]],
    'Timestamp' : [ 0x8, ['_LARGE_INTEGER']],
    'ProcessorNumber' : [ 0x10, ['unsigned long']],
    'GlobalStatus' : [ 0x14, ['_MCG_STATUS']],
    'InstructionPointer' : [ 0x1c, ['unsigned long long']],
    'BankNumber' : [ 0x24, ['unsigned long']],
    'Status' : [ 0x28, ['_MCI_STATUS']],
    'Address' : [ 0x30, ['unsigned long long']],
    'Misc' : [ 0x38, ['unsigned long long']],
    'ExtendedRegisterCount' : [ 0x40, ['unsigned long']],
    'ApicId' : [ 0x44, ['unsigned long']],
    'ExtendedRegisters' : [ 0x48, ['array', 24, ['unsigned long long']]],
    'AMDExtendedRegisters' : [ 0x48, ['_WHEA_AMD_EXTENDED_REGISTERS']],
    'GlobalCapability' : [ 0x108, ['_MCG_CAP']],
} ],
  '_SYSTEM_POWER_STATE_CONTEXT' : [ 0x4, {
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
    'TargetSystemState' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 12, native_type='unsigned long')]],
    'EffectiveSystemState' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 16, native_type='unsigned long')]],
    'CurrentSystemState' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 20, native_type='unsigned long')]],
    'IgnoreHibernationPath' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'PseudoTransition' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'KernelSoftReboot' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'DirectedDripsTransition' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'ContextAsUlong' : [ 0x0, ['unsigned long']],
} ],
  '_IOSAPIC' : [ 0x10, {
    'Type' : [ 0x0, ['unsigned char']],
    'Length' : [ 0x1, ['unsigned char']],
    'IOSAPICID' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
    'SystemVectorBase' : [ 0x4, ['unsigned long']],
    'IOSAPICAddress' : [ 0x8, ['unsigned long long']],
} ],
  '_KIDTENTRY64' : [ 0x10, {
    'OffsetLow' : [ 0x0, ['unsigned short']],
    'Selector' : [ 0x2, ['unsigned short']],
    'IstIndex' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned short')]],
    'Reserved0' : [ 0x4, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned short')]],
    'Type' : [ 0x4, ['BitField', dict(start_bit = 8, end_bit = 13, native_type='unsigned short')]],
    'Dpl' : [ 0x4, ['BitField', dict(start_bit = 13, end_bit = 15, native_type='unsigned short')]],
    'Present' : [ 0x4, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned short')]],
    'OffsetMiddle' : [ 0x6, ['unsigned short']],
    'OffsetHigh' : [ 0x8, ['unsigned long']],
    'Reserved1' : [ 0xc, ['unsigned long']],
    'Alignment' : [ 0x0, ['unsigned long long']],
} ],
  '_XSAVE_AREA_HEADER' : [ 0x40, {
    'Mask' : [ 0x0, ['unsigned long long']],
    'CompactionMask' : [ 0x8, ['unsigned long long']],
    'Reserved2' : [ 0x10, ['array', 6, ['unsigned long long']]],
} ],
  '_KPROCESSOR_STATE' : [ 0x5c0, {
    'SpecialRegisters' : [ 0x0, ['_KSPECIAL_REGISTERS']],
    'ContextFrame' : [ 0xf0, ['_CONTEXT']],
} ],
  '_KDEVICE_QUEUE_ENTRY' : [ 0x18, {
    'DeviceListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'SortKey' : [ 0x10, ['unsigned long']],
    'Inserted' : [ 0x14, ['unsigned char']],
} ],
  '_SECTION_OBJECT_POINTERS' : [ 0x18, {
    'DataSectionObject' : [ 0x0, ['pointer64', ['void']]],
    'SharedCacheMap' : [ 0x8, ['pointer64', ['void']]],
    'ImageSectionObject' : [ 0x10, ['pointer64', ['void']]],
} ],
  '_ACPI_CACHED_TABLE' : [ 0x40, {
    'Links' : [ 0x0, ['_LIST_ENTRY']],
    'PhysicalAddress' : [ 0x10, ['_LARGE_INTEGER']],
    'Header' : [ 0x18, ['_DESCRIPTION_HEADER']],
} ],
  '__unnamed_13f6' : [ 0x4, {
    'PollInterval' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_13f8' : [ 0x18, {
    'PollInterval' : [ 0x0, ['unsigned long']],
    'Vector' : [ 0x4, ['unsigned long']],
    'SwitchToPollingThreshold' : [ 0x8, ['unsigned long']],
    'SwitchToPollingWindow' : [ 0xc, ['unsigned long']],
    'ErrorThreshold' : [ 0x10, ['unsigned long']],
    'ErrorThresholdWindow' : [ 0x14, ['unsigned long']],
} ],
  '__unnamed_13fa' : [ 0x18, {
    'Polled' : [ 0x0, ['__unnamed_13f6']],
    'Interrupt' : [ 0x0, ['__unnamed_13f8']],
    'LocalInterrupt' : [ 0x0, ['__unnamed_13f8']],
    'Sci' : [ 0x0, ['__unnamed_13f8']],
    'Nmi' : [ 0x0, ['__unnamed_13f8']],
    'Sea' : [ 0x0, ['__unnamed_13f8']],
    'Sei' : [ 0x0, ['__unnamed_13f8']],
    'Gsiv' : [ 0x0, ['__unnamed_13f8']],
} ],
  '_WHEA_NOTIFICATION_DESCRIPTOR' : [ 0x1c, {
    'Type' : [ 0x0, ['unsigned char']],
    'Length' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['_WHEA_NOTIFICATION_FLAGS']],
    'u' : [ 0x4, ['__unnamed_13fa']],
} ],
  '_IO_APIC_REGISTERS' : [ 0x44, {
    'RegisterIndex' : [ 0x0, ['unsigned long']],
    'Reserved1' : [ 0x4, ['array', 3, ['unsigned long']]],
    'RegisterValue' : [ 0x10, ['unsigned long']],
    'Reserved2' : [ 0x14, ['array', 11, ['unsigned long']]],
    'EndOfInterrupt' : [ 0x40, ['unsigned long']],
} ],
  '_IO_RESOURCE_REQUIREMENTS_LIST' : [ 0x48, {
    'ListSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'SlotNumber' : [ 0xc, ['unsigned long']],
    'Reserved' : [ 0x10, ['array', 3, ['unsigned long']]],
    'AlternativeLists' : [ 0x1c, ['unsigned long']],
    'List' : [ 0x20, ['array', 1, ['_IO_RESOURCE_LIST']]],
} ],
  '_IO_SECURITY_CONTEXT' : [ 0x18, {
    'SecurityQos' : [ 0x0, ['pointer64', ['_SECURITY_QUALITY_OF_SERVICE']]],
    'AccessState' : [ 0x8, ['pointer64', ['_ACCESS_STATE']]],
    'DesiredAccess' : [ 0x10, ['unsigned long']],
    'FullCreateOptions' : [ 0x14, ['unsigned long']],
} ],
  '_KTSS64' : [ 0x68, {
    'Reserved0' : [ 0x0, ['unsigned long']],
    'Rsp0' : [ 0x4, ['unsigned long long']],
    'Rsp1' : [ 0xc, ['unsigned long long']],
    'Rsp2' : [ 0x14, ['unsigned long long']],
    'Ist' : [ 0x1c, ['array', 8, ['unsigned long long']]],
    'Reserved1' : [ 0x5c, ['unsigned long long']],
    'Reserved2' : [ 0x64, ['unsigned short']],
    'IoMapBase' : [ 0x66, ['unsigned short']],
} ],
  '_VPB' : [ 0x60, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'Flags' : [ 0x4, ['unsigned short']],
    'VolumeLabelLength' : [ 0x6, ['unsigned short']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'RealDevice' : [ 0x10, ['pointer64', ['_DEVICE_OBJECT']]],
    'SerialNumber' : [ 0x18, ['unsigned long']],
    'ReferenceCount' : [ 0x1c, ['unsigned long']],
    'VolumeLabel' : [ 0x20, ['array', 32, ['wchar']]],
} ],
  '_MAILSLOT_CREATE_PARAMETERS' : [ 0x18, {
    'MailslotQuota' : [ 0x0, ['unsigned long']],
    'MaximumMessageSize' : [ 0x4, ['unsigned long']],
    'ReadTimeout' : [ 0x8, ['_LARGE_INTEGER']],
    'TimeoutSpecified' : [ 0x10, ['unsigned char']],
} ],
  '_NT_TIB' : [ 0x38, {
    'ExceptionList' : [ 0x0, ['pointer64', ['_EXCEPTION_REGISTRATION_RECORD']]],
    'StackBase' : [ 0x8, ['pointer64', ['void']]],
    'StackLimit' : [ 0x10, ['pointer64', ['void']]],
    'SubSystemTib' : [ 0x18, ['pointer64', ['void']]],
    'FiberData' : [ 0x20, ['pointer64', ['void']]],
    'Version' : [ 0x20, ['unsigned long']],
    'ArbitraryUserPointer' : [ 0x28, ['pointer64', ['void']]],
    'Self' : [ 0x30, ['pointer64', ['_NT_TIB']]],
} ],
  '_POWER_SEQUENCE' : [ 0xc, {
    'SequenceD1' : [ 0x0, ['unsigned long']],
    'SequenceD2' : [ 0x4, ['unsigned long']],
    'SequenceD3' : [ 0x8, ['unsigned long']],
} ],
  '_WHEA_ERROR_RECORD_HEADER' : [ 0x80, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Revision' : [ 0x4, ['_WHEA_REVISION']],
    'SignatureEnd' : [ 0x6, ['unsigned long']],
    'SectionCount' : [ 0xa, ['unsigned short']],
    'Severity' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSevRecoverable', 1: u'WheaErrSevFatal', 2: u'WheaErrSevCorrected', 3: u'WheaErrSevInformational'})]],
    'ValidBits' : [ 0x10, ['_WHEA_ERROR_RECORD_HEADER_VALIDBITS']],
    'Length' : [ 0x14, ['unsigned long']],
    'Timestamp' : [ 0x18, ['_WHEA_TIMESTAMP']],
    'PlatformId' : [ 0x20, ['_GUID']],
    'PartitionId' : [ 0x30, ['_GUID']],
    'CreatorId' : [ 0x40, ['_GUID']],
    'NotifyType' : [ 0x50, ['_GUID']],
    'RecordId' : [ 0x60, ['unsigned long long']],
    'Flags' : [ 0x68, ['_WHEA_ERROR_RECORD_HEADER_FLAGS']],
    'PersistenceInfo' : [ 0x6c, ['_WHEA_PERSISTENCE_INFO']],
    'Reserved' : [ 0x74, ['array', 12, ['unsigned char']]],
} ],
  '_EXCEPTION_REGISTRATION_RECORD' : [ 0x10, {
    'Next' : [ 0x0, ['pointer64', ['_EXCEPTION_REGISTRATION_RECORD']]],
    'Handler' : [ 0x8, ['pointer64', ['void']]],
} ],
  '_FADT' : [ 0x10c, {
    'Header' : [ 0x0, ['_DESCRIPTION_HEADER']],
    'facs' : [ 0x24, ['unsigned long']],
    'dsdt' : [ 0x28, ['unsigned long']],
    'int_model' : [ 0x2c, ['unsigned char']],
    'pm_profile' : [ 0x2d, ['unsigned char']],
    'sci_int_vector' : [ 0x2e, ['unsigned short']],
    'smi_cmd_io_port' : [ 0x30, ['unsigned long']],
    'acpi_on_value' : [ 0x34, ['unsigned char']],
    'acpi_off_value' : [ 0x35, ['unsigned char']],
    's4bios_req' : [ 0x36, ['unsigned char']],
    'pstate_control' : [ 0x37, ['unsigned char']],
    'pm1a_evt_blk_io_port' : [ 0x38, ['unsigned long']],
    'pm1b_evt_blk_io_port' : [ 0x3c, ['unsigned long']],
    'pm1a_ctrl_blk_io_port' : [ 0x40, ['unsigned long']],
    'pm1b_ctrl_blk_io_port' : [ 0x44, ['unsigned long']],
    'pm2_ctrl_blk_io_port' : [ 0x48, ['unsigned long']],
    'pm_tmr_blk_io_port' : [ 0x4c, ['unsigned long']],
    'gp0_blk_io_port' : [ 0x50, ['unsigned long']],
    'gp1_blk_io_port' : [ 0x54, ['unsigned long']],
    'pm1_evt_len' : [ 0x58, ['unsigned char']],
    'pm1_ctrl_len' : [ 0x59, ['unsigned char']],
    'pm2_ctrl_len' : [ 0x5a, ['unsigned char']],
    'pm_tmr_len' : [ 0x5b, ['unsigned char']],
    'gp0_blk_len' : [ 0x5c, ['unsigned char']],
    'gp1_blk_len' : [ 0x5d, ['unsigned char']],
    'gp1_base' : [ 0x5e, ['unsigned char']],
    'cstate_control' : [ 0x5f, ['unsigned char']],
    'lvl2_latency' : [ 0x60, ['unsigned short']],
    'lvl3_latency' : [ 0x62, ['unsigned short']],
    'flush_size' : [ 0x64, ['unsigned short']],
    'flush_stride' : [ 0x66, ['unsigned short']],
    'duty_offset' : [ 0x68, ['unsigned char']],
    'duty_width' : [ 0x69, ['unsigned char']],
    'day_alarm_index' : [ 0x6a, ['unsigned char']],
    'month_alarm_index' : [ 0x6b, ['unsigned char']],
    'century_alarm_index' : [ 0x6c, ['unsigned char']],
    'boot_arch' : [ 0x6d, ['unsigned short']],
    'reserved3' : [ 0x6f, ['array', 1, ['unsigned char']]],
    'flags' : [ 0x70, ['unsigned long']],
    'reset_reg' : [ 0x74, ['_GEN_ADDR']],
    'reset_val' : [ 0x80, ['unsigned char']],
    'arm_boot_arch' : [ 0x81, ['unsigned short']],
    'minor_version_number' : [ 0x83, ['unsigned char']],
    'x_firmware_ctrl' : [ 0x84, ['_LARGE_INTEGER']],
    'x_dsdt' : [ 0x8c, ['_LARGE_INTEGER']],
    'x_pm1a_evt_blk' : [ 0x94, ['_GEN_ADDR']],
    'x_pm1b_evt_blk' : [ 0xa0, ['_GEN_ADDR']],
    'x_pm1a_ctrl_blk' : [ 0xac, ['_GEN_ADDR']],
    'x_pm1b_ctrl_blk' : [ 0xb8, ['_GEN_ADDR']],
    'x_pm2_ctrl_blk' : [ 0xc4, ['_GEN_ADDR']],
    'x_pm_tmr_blk' : [ 0xd0, ['_GEN_ADDR']],
    'x_gp0_blk' : [ 0xdc, ['_GEN_ADDR']],
    'x_gp1_blk' : [ 0xe8, ['_GEN_ADDR']],
    'sleep_control_reg' : [ 0xf4, ['_GEN_ADDR']],
    'sleep_status_reg' : [ 0x100, ['_GEN_ADDR']],
} ],
  '_PROCLOCALAPIC' : [ 0x8, {
    'Type' : [ 0x0, ['unsigned char']],
    'Length' : [ 0x1, ['unsigned char']],
    'ACPIProcessorID' : [ 0x2, ['unsigned char']],
    'APICID' : [ 0x3, ['unsigned char']],
    'Flags' : [ 0x4, ['unsigned long']],
} ],
  '_AER_BRIDGE_DESCRIPTOR_FLAGS' : [ 0x2, {
    'UncorrectableErrorMaskRW' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'UncorrectableErrorSeverityRW' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'CorrectableErrorMaskRW' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'AdvancedCapsAndControlRW' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'SecondaryUncorrectableErrorMaskRW' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'SecondaryUncorrectableErrorSevRW' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'SecondaryCapsAndControlRW' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 16, native_type='unsigned short')]],
    'AsUSHORT' : [ 0x0, ['unsigned short']],
} ],
  '_RSDT_32' : [ 0x28, {
    'Header' : [ 0x0, ['_DESCRIPTION_HEADER']],
    'Tables' : [ 0x24, ['array', 1, ['unsigned long']]],
} ],
  '_LOCAL_NMISOURCE' : [ 0x6, {
    'Type' : [ 0x0, ['unsigned char']],
    'Length' : [ 0x1, ['unsigned char']],
    'ProcessorID' : [ 0x2, ['unsigned char']],
    'Flags' : [ 0x3, ['unsigned short']],
    'LINTIN' : [ 0x5, ['unsigned char']],
} ],
  '_CM_RESOURCE_LIST' : [ 0x28, {
    'Count' : [ 0x0, ['unsigned long']],
    'List' : [ 0x4, ['array', 1, ['_CM_FULL_RESOURCE_DESCRIPTOR']]],
} ],
  '_SECURITY_QUALITY_OF_SERVICE' : [ 0xc, {
    'Length' : [ 0x0, ['unsigned long']],
    'ImpersonationLevel' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'SecurityAnonymous', 1: u'SecurityIdentification', 2: u'SecurityImpersonation', 3: u'SecurityDelegation'})]],
    'ContextTrackingMode' : [ 0x8, ['unsigned char']],
    'EffectiveOnly' : [ 0x9, ['unsigned char']],
} ],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS' : [ 0x4, {
    'Primary' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ContainmentWarning' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Reset' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ThresholdExceeded' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ResourceNotAvailable' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'LatentError' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Propagated' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_WHEA_EVENT_LOG_ENTRY_HEADER' : [ 0x20, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'Length' : [ 0x8, ['unsigned long']],
    'Type' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'WheaEventLogEntryTypeInformational', 1: u'WheaEventLogEntryTypeWarning', 2: u'WheaEventLogEntryTypeError'})]],
    'OwnerTag' : [ 0x10, ['unsigned long']],
    'Id' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {-2147483647: u'WheaEventLogEntryIdCmcPollingTimeout', -2147483646: u'WheaEventLogEntryIdWheaInit', -2147483645: u'WheaEventLogEntryIdCmcSwitchToPolling', -2147483644: u'WheaEventLogEntryIdDroppedCorrectedError', -2147483643: u'WheaEventLogEntryIdStartedReportHwError', -2147483642: u'WheaEventLogEntryIdPFAMemoryOfflined', -2147483641: u'WheaEventLogEntryIdPFAMemoryRemoveMonitor', -2147483640: u'WheaEventLogEntryIdPFAMemoryPolicy', -2147483639: u'WheaEventLogEntryIdPshedInjectError', -2147483638: u'WheaEventLogEntryIdOscCapabilities', -2147483637: u'WheaEventLogEntryIdPshedPluginRegister', -2147483636: u'WheaEventLogEntryIdAddRemoveErrorSource', -2147483635: u'WheaEventLogEntryIdWorkQueueItem', -2147483634: u'WheaEventLogEntryIdAttemptErrorRecovery', -2147483633: u'WheaEventLogEntryIdMcaFoundErrorInBank', -2147483632: u'WheaEventLogEntryIdMcaStuckErrorCheck', -2147483631: u'WheaEventLogEntryIdMcaErrorCleared', -2147483630: u'WheaEventLogEntryIdClearedPoison', -2147483629: u'WheaEventLogEntryIdProcessEINJ', -2147483628: u'WheaEventLogEntryIdProcessHEST', -2147483627: u'WheaEventLogEntryIdCreateGenericRecord', -2147483626: u'WheaEventLogEntryIdErrorRecord', -2147483625: u'WheaEventLogEntryIdErrorRecordLimit', -2147483623: u'WheaEventLogEntryIdErrSrcArrayInvalid', -2147483622: u'WheaEventLogEntryIdAcpiTimeOut', -2147483621: u'WheaEventLogCmciRestart', -2147483620: u'WheaEventLogCmciFinalRestart', -2147483619: u'WheaEventLogEntryEtwOverFlow', -2147483618: u'WheaEventLogAzccRootBusSearchErr', -2147483617: u'WheaEventLogAzccRootBusList', -2147483616: u'WheaEventLogEntryIdErrSrcInvalid', -2147483615: u'WheaEventLogEntryIdGenericErrMemMap', -2147483614: u'WheaEventLogEntryIdPshedCallbackCollision', -2147483613: u'WheaEventLogEntryIdSELBugCheckProgress', -2147483612: u'WheaEventLogEntryIdPshedPluginLoad', -2147483611: u'WheaEventLogEntryIdPshedPluginUnload', -2147483610: u'WheaEventLogEntryIdPshedPluginSupported', -2147483609: u'WheaEventLogEntryIdDeviceDriver', -2147483608: u'WheaEventLogEntryIdCmciImplPresent', -2147483607: u'WheaEventLogEntryIdCmciInitError', -2147483606: u'WheaEventLogEntryIdSELBugCheckRecovery', -2147483605: u'WheaEventLogEntryIdDrvErrSrcInvalid', -2147483604: u'WheaEventLogEntryIdDrvHandleBusy', -2147483603: u'WheaEventLogEntryIdWheaHeartbeat', -2147483602: u'WheaEventLogAzccRootBusPoisonSet', -2147483601: u'WheaEventLogEntryIdSELBugCheckInfo', -2147483600: u'WheaEventLogEntryIdErrDimmInfoMismatch', -2147483599: u'WheaEventLogEntryIdeDpcEnabled'})]],
    'Flags' : [ 0x18, ['_WHEA_EVENT_LOG_ENTRY_FLAGS']],
    'PayloadLength' : [ 0x1c, ['unsigned long']],
} ],
  '_INTERRUPT_FUNCTION_TABLE' : [ 0xb8, {
    'InitializeLocalUnit' : [ 0x0, ['pointer64', ['void']]],
    'InitializeIoUnit' : [ 0x8, ['pointer64', ['void']]],
    'SetPriority' : [ 0x10, ['pointer64', ['void']]],
    'GetLocalUnitError' : [ 0x18, ['pointer64', ['void']]],
    'ClearLocalUnitError' : [ 0x20, ['pointer64', ['void']]],
    'GetLogicalId' : [ 0x28, ['pointer64', ['void']]],
    'SetLogicalId' : [ 0x30, ['pointer64', ['void']]],
    'AcceptAndGetSource' : [ 0x38, ['pointer64', ['void']]],
    'EndOfInterrupt' : [ 0x40, ['pointer64', ['void']]],
    'FastEndOfInterrupt' : [ 0x48, ['pointer64', ['void']]],
    'SetLineState' : [ 0x50, ['pointer64', ['void']]],
    'RequestInterrupt' : [ 0x58, ['pointer64', ['void']]],
    'StartProcessor' : [ 0x60, ['pointer64', ['void']]],
    'GenerateMessage' : [ 0x68, ['pointer64', ['void']]],
    'ConvertId' : [ 0x70, ['pointer64', ['void']]],
    'SaveLocalInterrupts' : [ 0x78, ['pointer64', ['void']]],
    'ReplayLocalInterrupts' : [ 0x80, ['pointer64', ['void']]],
    'DeinitializeLocalUnit' : [ 0x88, ['pointer64', ['void']]],
    'DeinitializeIoUnit' : [ 0x90, ['pointer64', ['void']]],
    'QueryAndGetSource' : [ 0x98, ['pointer64', ['void']]],
    'DeactivateInterrupt' : [ 0xa0, ['pointer64', ['void']]],
    'DirectedEndOfInterrupt' : [ 0xa8, ['pointer64', ['void']]],
    'QueryLocalUnitInfo' : [ 0xb0, ['pointer64', ['void']]],
} ],
  '_WHEA_DEVICE_DRIVER_DESCRIPTOR' : [ 0x74, {
    'Type' : [ 0x0, ['unsigned short']],
    'Enabled' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
    'SourceGuid' : [ 0x4, ['_GUID']],
    'LogTag' : [ 0x14, ['unsigned short']],
    'Reserved2' : [ 0x16, ['unsigned short']],
    'PacketLength' : [ 0x18, ['unsigned long']],
    'PacketCount' : [ 0x1c, ['unsigned long']],
    'PacketBuffer' : [ 0x20, ['pointer64', ['unsigned char']]],
    'Config' : [ 0x28, ['_WHEA_ERROR_SOURCE_CONFIGURATION_DD']],
    'CreatorId' : [ 0x40, ['_GUID']],
    'PartitionId' : [ 0x50, ['_GUID']],
    'MaxSectionDataLength' : [ 0x60, ['unsigned long']],
    'MaxSectionsPerRecord' : [ 0x64, ['unsigned long']],
    'PacketStateBuffer' : [ 0x68, ['pointer64', ['unsigned char']]],
    'OpenHandles' : [ 0x70, ['long']],
} ],
  '_PLATFORM_INTERRUPT' : [ 0x10, {
    'Type' : [ 0x0, ['unsigned char']],
    'Length' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned short']],
    'InterruptType' : [ 0x4, ['unsigned char']],
    'APICID' : [ 0x5, ['unsigned char']],
    'ACPIEID' : [ 0x6, ['unsigned char']],
    'IOSAPICVector' : [ 0x7, ['unsigned char']],
    'GlobalVector' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
} ],
  '_ADAPTER_OBJECT' : [ 0x278, {
    'AdapterObject' : [ 0x0, ['_HALP_DMA_ADAPTER_OBJECT']],
    'MasterAdapter' : [ 0x98, ['pointer64', ['_HALP_DMA_MASTER_ADAPTER_OBJECT']]],
    'WaitQueueEntry' : [ 0xa0, ['_LIST_ENTRY']],
    'ChannelWaitQueue' : [ 0xb0, ['_KDEVICE_QUEUE']],
    'ResourceWaitLock' : [ 0xb0, ['unsigned long long']],
    'ResourceWaitQueue' : [ 0xb8, ['_LIST_ENTRY']],
    'ChannelResourceWaitQueue' : [ 0xc8, ['_LIST_ENTRY']],
    'ResourceQueueBusy' : [ 0xd8, ['unsigned char']],
    'MapRegistersPerChannel' : [ 0xe0, ['unsigned long']],
    'MapRegisterBase' : [ 0xe8, ['pointer64', ['void']]],
    'NumberOfMapRegisters' : [ 0xf0, ['unsigned long']],
    'MaxTransferLength' : [ 0xf4, ['unsigned long']],
    'CrashDumpRegisterBase' : [ 0xf8, ['array', 2, ['pointer64', ['void']]]],
    'NumberOfCrashDumpRegisters' : [ 0x108, ['array', 2, ['unsigned long']]],
    'CrashDumpRegisterRefCount' : [ 0x110, ['array', 2, ['unsigned long']]],
    'AdapterCrashDumpList' : [ 0x118, ['_LIST_ENTRY']],
    'MapRegisterMdl' : [ 0x128, ['pointer64', ['_MDL']]],
    'MapRegisterMdlLock' : [ 0x130, ['unsigned long long']],
    'AllocationHandle' : [ 0x138, ['pointer64', ['void']]],
    'VirtualAddress' : [ 0x140, ['pointer64', ['void']]],
    'IsAllocationMdlBased' : [ 0x148, ['unsigned char']],
    'NoLocalPool' : [ 0x149, ['unsigned char']],
    'CurrentWcb' : [ 0x150, ['pointer64', ['_WAIT_CONTEXT_BLOCK']]],
    'CurrentTransferContext' : [ 0x158, ['pointer64', ['_DMA_TRANSFER_CONTEXT']]],
    'DmaController' : [ 0x160, ['pointer64', ['_HALP_DMA_CONTROLLER']]],
    'Controller' : [ 0x168, ['unsigned long']],
    'ChannelNumber' : [ 0x16c, ['unsigned long']],
    'RequestLine' : [ 0x170, ['unsigned long']],
    'RequestedChannelCount' : [ 0x174, ['unsigned long']],
    'AllocatedChannelCount' : [ 0x178, ['unsigned long']],
    'AllocatedChannels' : [ 0x17c, ['array', 8, ['unsigned long']]],
    'ChannelAdapter' : [ 0x1a0, ['pointer64', ['void']]],
    'NeedsMapRegisters' : [ 0x1a8, ['unsigned char']],
    'MasterDevice' : [ 0x1a9, ['unsigned char']],
    'ScatterGather' : [ 0x1aa, ['unsigned char']],
    'AutoInitialize' : [ 0x1ab, ['unsigned char']],
    'IgnoreCount' : [ 0x1ac, ['unsigned char']],
    'CacheCoherent' : [ 0x1ad, ['unsigned char']],
    'Dma32BitAddresses' : [ 0x1b0, ['unsigned char']],
    'Dma64BitAddresses' : [ 0x1b1, ['unsigned char']],
    'DmaAddressWidth' : [ 0x1b0, ['unsigned long']],
    'DmaPortWidth' : [ 0x1b4, ['Enumeration', dict(target = 'long', choices = {0: u'Width8Bits', 1: u'Width16Bits', 2: u'Width32Bits', 3: u'Width64Bits', 4: u'WidthNoWrap', 5: u'MaximumDmaWidth'})]],
    'DeviceAddress' : [ 0x1b8, ['_LARGE_INTEGER']],
    'AdapterList' : [ 0x1c0, ['_LIST_ENTRY']],
    'WorkItem' : [ 0x1d0, ['_WORK_QUEUE_ITEM']],
    'DomainPointer' : [ 0x1f0, ['pointer64', ['_HALP_DMA_DOMAIN_OBJECT']]],
    'TranslationType' : [ 0x1f8, ['Enumeration', dict(target = 'long', choices = {0: u'ExtTranslationTypePassThrough', 1: u'ExtTranslationTypeBlocked', 2: u'ExtTranslationTypeTranslate', 3: u'ExtTranslationTypeSafePassThrough', 4: u'ExtTranslationTypeInvalid'})]],
    'AdapterInUse' : [ 0x1fc, ['unsigned char']],
    'DeviceObject' : [ 0x200, ['pointer64', ['_DEVICE_OBJECT']]],
    'DeviceId' : [ 0x208, ['pointer64', ['_EXT_IOMMU_DEVICE_ID']]],
    'IommuDevice' : [ 0x210, ['pointer64', ['void']]],
    'ScatterGatherMdl' : [ 0x218, ['pointer64', ['_MDL']]],
    'LowMemoryLogicalAddressBase' : [ 0x220, ['unsigned long long']],
    'LowMemoryLogicalAddressQueueLock' : [ 0x228, ['unsigned long long']],
    'LowMemoryLogicalAddressQueue' : [ 0x230, ['_LIST_ENTRY']],
    'LowMemoryLogicalAddressQueueInUse' : [ 0x240, ['unsigned char']],
    'LowMemoryLogicalAddressQueueEntry' : [ 0x248, ['_HALP_EMERGENCY_LA_QUEUE_ENTRY']],
    'AllocationState' : [ 0x260, ['Enumeration', dict(target = 'long', choices = {0: u'HalpDmaAdapterAllocationStateNone', 1: u'HalpDmaAdapterAllocateChannel', 2: u'HalpDmaAdapterAllocateMapRegisters', 3: u'HalpDmaAdapterAllocateChannelRemapResources', 4: u'HalpDmaAdapterAllocationStateComplete', 5: u'HalpDmaAdapterAllocationStateMax'})]],
    'ScatterGatherBufferLength' : [ 0x264, ['unsigned long']],
    'ScatterGatherBuffer' : [ 0x268, ['_SCATTER_GATHER_LIST']],
} ],
  '_RSDP' : [ 0x24, {
    'Signature' : [ 0x0, ['unsigned long long']],
    'Checksum' : [ 0x8, ['unsigned char']],
    'OEMID' : [ 0x9, ['array', 6, ['unsigned char']]],
    'Revision' : [ 0xf, ['unsigned char']],
    'RsdtAddress' : [ 0x10, ['unsigned long']],
    'Length' : [ 0x14, ['unsigned long']],
    'XsdtAddress' : [ 0x18, ['_LARGE_INTEGER']],
    'XChecksum' : [ 0x20, ['unsigned char']],
    'Reserved' : [ 0x21, ['array', 3, ['unsigned char']]],
} ],
  '_WHEA_IPF_CPE_DESCRIPTOR' : [ 0x4, {
    'Type' : [ 0x0, ['unsigned short']],
    'Enabled' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
} ],
  '_XPF_MCE_FLAGS' : [ 0x4, {
    'MCG_CapabilityRW' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MCG_GlobalControlRW' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_MCG_STATUS' : [ 0x8, {
    'RestartIpValid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ErrorIpValid' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'MachineCheckInProgress' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'LocalMceValid' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
    'Reserved2' : [ 0x4, ['unsigned long']],
    'QuadPart' : [ 0x0, ['unsigned long long']],
} ],
  '_XSDT' : [ 0x2c, {
    'Header' : [ 0x0, ['_DESCRIPTION_HEADER']],
    'Tables' : [ 0x24, ['array', 1, ['_LARGE_INTEGER']]],
} ],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS' : [ 0x1, {
    'FRUId' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'FRUText' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'AsUCHAR' : [ 0x0, ['unsigned char']],
} ],
  '_CONTEXT' : [ 0x4d0, {
    'P1Home' : [ 0x0, ['unsigned long long']],
    'P2Home' : [ 0x8, ['unsigned long long']],
    'P3Home' : [ 0x10, ['unsigned long long']],
    'P4Home' : [ 0x18, ['unsigned long long']],
    'P5Home' : [ 0x20, ['unsigned long long']],
    'P6Home' : [ 0x28, ['unsigned long long']],
    'ContextFlags' : [ 0x30, ['unsigned long']],
    'MxCsr' : [ 0x34, ['unsigned long']],
    'SegCs' : [ 0x38, ['unsigned short']],
    'SegDs' : [ 0x3a, ['unsigned short']],
    'SegEs' : [ 0x3c, ['unsigned short']],
    'SegFs' : [ 0x3e, ['unsigned short']],
    'SegGs' : [ 0x40, ['unsigned short']],
    'SegSs' : [ 0x42, ['unsigned short']],
    'EFlags' : [ 0x44, ['unsigned long']],
    'Dr0' : [ 0x48, ['unsigned long long']],
    'Dr1' : [ 0x50, ['unsigned long long']],
    'Dr2' : [ 0x58, ['unsigned long long']],
    'Dr3' : [ 0x60, ['unsigned long long']],
    'Dr6' : [ 0x68, ['unsigned long long']],
    'Dr7' : [ 0x70, ['unsigned long long']],
    'Rax' : [ 0x78, ['unsigned long long']],
    'Rcx' : [ 0x80, ['unsigned long long']],
    'Rdx' : [ 0x88, ['unsigned long long']],
    'Rbx' : [ 0x90, ['unsigned long long']],
    'Rsp' : [ 0x98, ['unsigned long long']],
    'Rbp' : [ 0xa0, ['unsigned long long']],
    'Rsi' : [ 0xa8, ['unsigned long long']],
    'Rdi' : [ 0xb0, ['unsigned long long']],
    'R8' : [ 0xb8, ['unsigned long long']],
    'R9' : [ 0xc0, ['unsigned long long']],
    'R10' : [ 0xc8, ['unsigned long long']],
    'R11' : [ 0xd0, ['unsigned long long']],
    'R12' : [ 0xd8, ['unsigned long long']],
    'R13' : [ 0xe0, ['unsigned long long']],
    'R14' : [ 0xe8, ['unsigned long long']],
    'R15' : [ 0xf0, ['unsigned long long']],
    'Rip' : [ 0xf8, ['unsigned long long']],
    'FltSave' : [ 0x100, ['_XSAVE_FORMAT']],
    'Header' : [ 0x100, ['array', 2, ['_M128A']]],
    'Legacy' : [ 0x120, ['array', 8, ['_M128A']]],
    'Xmm0' : [ 0x1a0, ['_M128A']],
    'Xmm1' : [ 0x1b0, ['_M128A']],
    'Xmm2' : [ 0x1c0, ['_M128A']],
    'Xmm3' : [ 0x1d0, ['_M128A']],
    'Xmm4' : [ 0x1e0, ['_M128A']],
    'Xmm5' : [ 0x1f0, ['_M128A']],
    'Xmm6' : [ 0x200, ['_M128A']],
    'Xmm7' : [ 0x210, ['_M128A']],
    'Xmm8' : [ 0x220, ['_M128A']],
    'Xmm9' : [ 0x230, ['_M128A']],
    'Xmm10' : [ 0x240, ['_M128A']],
    'Xmm11' : [ 0x250, ['_M128A']],
    'Xmm12' : [ 0x260, ['_M128A']],
    'Xmm13' : [ 0x270, ['_M128A']],
    'Xmm14' : [ 0x280, ['_M128A']],
    'Xmm15' : [ 0x290, ['_M128A']],
    'VectorRegister' : [ 0x300, ['array', 26, ['_M128A']]],
    'VectorControl' : [ 0x4a0, ['unsigned long long']],
    'DebugControl' : [ 0x4a8, ['unsigned long long']],
    'LastBranchToRip' : [ 0x4b0, ['unsigned long long']],
    'LastBranchFromRip' : [ 0x4b8, ['unsigned long long']],
    'LastExceptionToRip' : [ 0x4c0, ['unsigned long long']],
    'LastExceptionFromRip' : [ 0x4c8, ['unsigned long long']],
} ],
  '_IOAPIC' : [ 0xc, {
    'Type' : [ 0x0, ['unsigned char']],
    'Length' : [ 0x1, ['unsigned char']],
    'IOAPICID' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
    'IOAPICAddress' : [ 0x4, ['unsigned long']],
    'SystemVectorBase' : [ 0x8, ['unsigned long']],
} ],
  '_WHEA_ERROR_PACKET_FLAGS' : [ 0x4, {
    'PreviousError' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'CriticalEvent' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'HypervisorError' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Simulated' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'PlatformPfaControl' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'PlatformDirectedOffline' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'AddressTranslationRequired' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'AddressTranslationCompleted' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_IO_STATUS_BLOCK' : [ 0x10, {
    'Status' : [ 0x0, ['long']],
    'Pointer' : [ 0x0, ['pointer64', ['void']]],
    'Information' : [ 0x8, ['unsigned long long']],
} ],
  '_M128A' : [ 0x10, {
    'Low' : [ 0x0, ['unsigned long long']],
    'High' : [ 0x8, ['long long']],
} ],
  '_MCG_CAP' : [ 0x8, {
    'CountField' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long long')]],
    'ControlMsrPresent' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'ExtendedMsrsPresent' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'SignalingExtensionPresent' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'ThresholdErrorStatusPresent' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 16, native_type='unsigned long long')]],
    'ExtendedRegisterCount' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 24, native_type='unsigned long long')]],
    'SoftwareErrorRecoverySupported' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long long')]],
    'EnhancedMachineCheckCapability' : [ 0x0, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long long')]],
    'ExtendedErrorLogging' : [ 0x0, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long long')]],
    'LocalMachineCheckException' : [ 0x0, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long long')]],
    'QuadPart' : [ 0x0, ['unsigned long long']],
} ],
  '_WHEA_ERROR_SOURCE_CONFIGURATION_DD' : [ 0x18, {
    'Initialize' : [ 0x0, ['pointer64', ['void']]],
    'Uninitialize' : [ 0x8, ['pointer64', ['void']]],
    'Correct' : [ 0x10, ['pointer64', ['void']]],
} ],
  '_WHEA_ERROR_RECORD_HEADER_VALIDBITS' : [ 0x4, {
    'PlatformId' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Timestamp' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'PartitionId' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_INTERRUPT_LINE' : [ 0x8, {
    'UnitId' : [ 0x0, ['unsigned long']],
    'Line' : [ 0x4, ['long']],
} ],
  '_HALP_DMA_CONTROLLER' : [ 0xe0, {
    'Controllers' : [ 0x0, ['_LIST_ENTRY']],
    'AdapterList' : [ 0x10, ['_LIST_ENTRY']],
    'ControllerId' : [ 0x20, ['unsigned long']],
    'MinimumRequestLine' : [ 0x24, ['unsigned long']],
    'MaximumRequestLine' : [ 0x28, ['unsigned long']],
    'ChannelCount' : [ 0x2c, ['unsigned long']],
    'ScatterGatherLimit' : [ 0x30, ['unsigned long']],
    'Channels' : [ 0x38, ['pointer64', ['_HALP_DMA_CHANNEL']]],
    'ExtensionData' : [ 0x40, ['pointer64', ['void']]],
    'CacheCoherent' : [ 0x48, ['unsigned char']],
    'DmaAddressWidth' : [ 0x4c, ['unsigned long']],
    'Operations' : [ 0x50, ['_DMA_FUNCTION_TABLE']],
    'SupportedPortWidths' : [ 0xa0, ['unsigned long']],
    'MinimumTransferUnit' : [ 0xa4, ['unsigned long']],
    'Lock' : [ 0xa8, ['unsigned long long']],
    'Irql' : [ 0xb0, ['unsigned char']],
    'GeneratesInterrupt' : [ 0xb1, ['unsigned char']],
    'Gsi' : [ 0xb4, ['long']],
    'InterruptPolarity' : [ 0xb8, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptPolarityUnknown', 1: u'InterruptRisingEdge', 2: u'InterruptFallingEdge', 3: u'InterruptActiveBothTriggerLow', 4: u'InterruptActiveBothTriggerHigh'})]],
    'InterruptMode' : [ 0xbc, ['Enumeration', dict(target = 'long', choices = {0: u'LevelSensitive', 1: u'Latched'})]],
    'ResourceId' : [ 0xc0, ['_UNICODE_STRING']],
    'PowerHandle' : [ 0xd0, ['pointer64', ['POHANDLE__']]],
    'PowerActive' : [ 0xd8, ['unsigned char']],
} ],
  '_HAL_INTEL_ENLIGHTENMENT_INFORMATION' : [ 0x1f0, {
    'Enlightenments' : [ 0x0, ['unsigned long']],
    'HypervisorConnected' : [ 0x4, ['unsigned long']],
    'EndOfInterrupt' : [ 0x8, ['pointer64', ['void']]],
    'ApicWriteIcr' : [ 0x10, ['pointer64', ['void']]],
    'Reserved0' : [ 0x18, ['unsigned long']],
    'SpinCountMask' : [ 0x1c, ['unsigned long']],
    'LongSpinWait' : [ 0x20, ['pointer64', ['void']]],
    'GetReferenceTime' : [ 0x28, ['pointer64', ['void']]],
    'SetSystemSleepProperty' : [ 0x30, ['pointer64', ['void']]],
    'EnterSleepState' : [ 0x38, ['pointer64', ['void']]],
    'NotifyDebugDeviceAvailable' : [ 0x40, ['pointer64', ['void']]],
    'MapDeviceInterrupt' : [ 0x48, ['pointer64', ['void']]],
    'UnmapDeviceInterrupt' : [ 0x50, ['pointer64', ['void']]],
    'RetargetDeviceInterrupt' : [ 0x58, ['pointer64', ['void']]],
    'SetHpetConfig' : [ 0x60, ['pointer64', ['void']]],
    'NotifyHpetEnabled' : [ 0x68, ['pointer64', ['void']]],
    'QueryAssociatedProcessors' : [ 0x70, ['pointer64', ['void']]],
    'ReadMultipleMsr' : [ 0x78, ['pointer64', ['void']]],
    'WriteMultipleMsr' : [ 0x80, ['pointer64', ['void']]],
    'ReadCpuid' : [ 0x88, ['pointer64', ['void']]],
    'LpWritebackInvalidate' : [ 0x90, ['pointer64', ['void']]],
    'GetMachineCheckContext' : [ 0x98, ['pointer64', ['void']]],
    'SuspendPartition' : [ 0xa0, ['pointer64', ['void']]],
    'ResumePartition' : [ 0xa8, ['pointer64', ['void']]],
    'SetSystemMachineCheckProperty' : [ 0xb0, ['pointer64', ['void']]],
    'WheaErrorNotification' : [ 0xb8, ['pointer64', ['void']]],
    'GetProcessorIndexFromVpIndex' : [ 0xc0, ['pointer64', ['void']]],
    'SyntheticClusterIpi' : [ 0xc8, ['pointer64', ['void']]],
    'VpStartEnabled' : [ 0xd0, ['pointer64', ['void']]],
    'StartVirtualProcessor' : [ 0xd8, ['pointer64', ['void']]],
    'GetVpIndexFromApicId' : [ 0xe0, ['pointer64', ['void']]],
    'IumAccessPciDevice' : [ 0xe8, ['pointer64', ['void']]],
    'IumEfiRuntimeService' : [ 0xf0, ['pointer64', ['void']]],
    'SvmGetSystemCapabilities' : [ 0xf8, ['pointer64', ['void']]],
    'SvmGetDeviceCapabilities' : [ 0x100, ['pointer64', ['void']]],
    'SvmCreatePasidSpace' : [ 0x108, ['pointer64', ['void']]],
    'SvmSetPasidAddressSpace' : [ 0x110, ['pointer64', ['void']]],
    'SvmFlushPasid' : [ 0x118, ['pointer64', ['void']]],
    'SvmAttachPasidSpace' : [ 0x120, ['pointer64', ['void']]],
    'SvmDetachPasidSpace' : [ 0x128, ['pointer64', ['void']]],
    'SvmEnablePasid' : [ 0x130, ['pointer64', ['void']]],
    'SvmDisablePasid' : [ 0x138, ['pointer64', ['void']]],
    'SvmAcknowledgePageRequest' : [ 0x140, ['pointer64', ['void']]],
    'SvmCreatePrQueue' : [ 0x148, ['pointer64', ['void']]],
    'SvmDeletePrQueue' : [ 0x150, ['pointer64', ['void']]],
    'SvmClearPrqStalled' : [ 0x158, ['pointer64', ['void']]],
    'SvmSetDeviceEnabled' : [ 0x160, ['pointer64', ['void']]],
    'HvDebuggerPowerHandler' : [ 0x168, ['pointer64', ['void']]],
    'SetQpcBias' : [ 0x170, ['pointer64', ['void']]],
    'GetQpcBias' : [ 0x178, ['pointer64', ['void']]],
    'RegisterDeviceId' : [ 0x180, ['pointer64', ['void']]],
    'UnregisterDeviceId' : [ 0x188, ['pointer64', ['void']]],
    'AllocateDeviceDomain' : [ 0x190, ['pointer64', ['void']]],
    'AttachDeviceDomain' : [ 0x198, ['pointer64', ['void']]],
    'DetachDeviceDomain' : [ 0x1a0, ['pointer64', ['void']]],
    'DeleteDeviceDomain' : [ 0x1a8, ['pointer64', ['void']]],
    'MapDeviceLogicalRange' : [ 0x1b0, ['pointer64', ['void']]],
    'UnmapDeviceLogicalRange' : [ 0x1b8, ['pointer64', ['void']]],
    'MapDeviceSparsePages' : [ 0x1c0, ['pointer64', ['void']]],
    'UnmapDeviceSparsePages' : [ 0x1c8, ['pointer64', ['void']]],
    'GetDmaGuardEnabled' : [ 0x1d0, ['pointer64', ['void']]],
    'UpdateMicrocode' : [ 0x1d8, ['pointer64', ['void']]],
    'GetSintMessage' : [ 0x1e0, ['pointer64', ['void']]],
    'SetRootFaultReportingReady' : [ 0x1e8, ['pointer64', ['void']]],
} ],
  '_WHEA_XPF_MC_BANK_DESCRIPTOR' : [ 0x1c, {
    'BankNumber' : [ 0x0, ['unsigned char']],
    'ClearOnInitialization' : [ 0x1, ['unsigned char']],
    'StatusDataFormat' : [ 0x2, ['unsigned char']],
    'Flags' : [ 0x3, ['_XPF_MC_BANK_FLAGS']],
    'ControlMsr' : [ 0x4, ['unsigned long']],
    'StatusMsr' : [ 0x8, ['unsigned long']],
    'AddressMsr' : [ 0xc, ['unsigned long']],
    'MiscMsr' : [ 0x10, ['unsigned long']],
    'ControlData' : [ 0x14, ['unsigned long long']],
} ],
  '_DESCRIPTION_HEADER' : [ 0x24, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
    'Revision' : [ 0x8, ['unsigned char']],
    'Checksum' : [ 0x9, ['unsigned char']],
    'OEMID' : [ 0xa, ['array', 6, ['unsigned char']]],
    'OEMTableID' : [ 0x10, ['array', 8, ['unsigned char']]],
    'OEMRevision' : [ 0x18, ['unsigned long']],
    'CreatorID' : [ 0x1c, ['array', 4, ['unsigned char']]],
    'CreatorRev' : [ 0x20, ['unsigned long']],
} ],
  '_CONTROLLER_OBJECT' : [ 0x48, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'ControllerExtension' : [ 0x8, ['pointer64', ['void']]],
    'DeviceWaitQueue' : [ 0x10, ['_KDEVICE_QUEUE']],
    'Spare1' : [ 0x38, ['unsigned long']],
    'Spare2' : [ 0x40, ['_LARGE_INTEGER']],
} ],
  '_SCATTER_GATHER_LIST' : [ 0x10, {
    'NumberOfElements' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned long long']],
    'Elements' : [ 0x10, ['array', 0, ['_SCATTER_GATHER_ELEMENT']]],
} ],
  '_HAL_HV_SVM_SYSTEM_CAPABILITIES' : [ 0x18, {
    'SvmSupported' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'GpaAlwaysValid' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'MaxPasidSpaceCount' : [ 0x4, ['unsigned long']],
    'MaxPasidSpacePasidCount' : [ 0x8, ['unsigned long']],
    'MaxPrqSize' : [ 0xc, ['unsigned long']],
    'IommuCount' : [ 0x10, ['unsigned long']],
    'MinIommuPasidCount' : [ 0x14, ['unsigned long']],
} ],
  '_WHEA_TIMESTAMP' : [ 0x8, {
    'Seconds' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long long')]],
    'Minutes' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned long long')]],
    'Hours' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 24, native_type='unsigned long long')]],
    'Precise' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 25, end_bit = 32, native_type='unsigned long long')]],
    'Day' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 40, native_type='unsigned long long')]],
    'Month' : [ 0x0, ['BitField', dict(start_bit = 40, end_bit = 48, native_type='unsigned long long')]],
    'Year' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 56, native_type='unsigned long long')]],
    'Century' : [ 0x0, ['BitField', dict(start_bit = 56, end_bit = 64, native_type='unsigned long long')]],
    'AsLARGE_INTEGER' : [ 0x0, ['_LARGE_INTEGER']],
} ],
  '_WHEA_XPF_NMI_DESCRIPTOR' : [ 0x3, {
    'Type' : [ 0x0, ['unsigned short']],
    'Enabled' : [ 0x2, ['unsigned char']],
} ],
  '_HALP_DMA_MASTER_ADAPTER_OBJECT' : [ 0xd8, {
    'AdapterObject' : [ 0x0, ['_HALP_DMA_ADAPTER_OBJECT']],
    'ContiguousAdapterQueue' : [ 0x98, ['_LIST_ENTRY']],
    'ScatterAdapterQueue' : [ 0xa8, ['_LIST_ENTRY']],
    'MapBufferSize' : [ 0xb8, ['unsigned long']],
    'MapBufferPhysicalAddress' : [ 0xc0, ['_LARGE_INTEGER']],
    'ContiguousPageCount' : [ 0xc8, ['unsigned long']],
    'ContiguousPageLimit' : [ 0xcc, ['unsigned long']],
    'ScatterPageCount' : [ 0xd0, ['unsigned long']],
    'ScatterPageLimit' : [ 0xd4, ['unsigned long']],
} ],
  '_TXN_PARAMETER_BLOCK' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned short']],
    'TxFsContext' : [ 0x2, ['unsigned short']],
    'TransactionObject' : [ 0x8, ['pointer64', ['void']]],
} ],
  '_HALP_DMA_CHANNEL' : [ 0xa0, {
    'ChannelNumber' : [ 0x0, ['unsigned long']],
    'Initialized' : [ 0x4, ['unsigned char']],
    'Busy' : [ 0x5, ['unsigned char']],
    'Complete' : [ 0x6, ['unsigned char']],
    'CurrentCompletionRoutine' : [ 0x8, ['pointer64', ['void']]],
    'CurrentCompletionContext' : [ 0x10, ['pointer64', ['void']]],
    'CurrentChildAdapter' : [ 0x18, ['pointer64', ['_ADAPTER_OBJECT']]],
    'CurrentInterruptType' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptTypeCompletion', 1: u'InterruptTypeError', 2: u'InterruptTypeCancelled'})]],
    'Dpc' : [ 0x28, ['_KDPC']],
    'GeneratesInterrupt' : [ 0x68, ['unsigned char']],
    'Gsi' : [ 0x6c, ['long']],
    'InterruptPolarity' : [ 0x70, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptPolarityUnknown', 1: u'InterruptRisingEdge', 2: u'InterruptFallingEdge', 3: u'InterruptActiveBothTriggerLow', 4: u'InterruptActiveBothTriggerHigh'})]],
    'InterruptMode' : [ 0x74, ['Enumeration', dict(target = 'long', choices = {0: u'LevelSensitive', 1: u'Latched'})]],
    'CommonBufferLength' : [ 0x78, ['unsigned long']],
    'CommonBufferVirtualAddress' : [ 0x80, ['pointer64', ['void']]],
    'CommonBufferLogicalAddress' : [ 0x88, ['_LARGE_INTEGER']],
    'AdapterQueue' : [ 0x90, ['_LIST_ENTRY']],
} ],
  '_WHEA_PERSISTENCE_INFO' : [ 0x8, {
    'Signature' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'Length' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 40, native_type='unsigned long long')]],
    'Identifier' : [ 0x0, ['BitField', dict(start_bit = 40, end_bit = 56, native_type='unsigned long long')]],
    'Attributes' : [ 0x0, ['BitField', dict(start_bit = 56, end_bit = 58, native_type='unsigned long long')]],
    'DoNotLog' : [ 0x0, ['BitField', dict(start_bit = 58, end_bit = 59, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 59, end_bit = 64, native_type='unsigned long long')]],
    'AsULONGLONG' : [ 0x0, ['unsigned long long']],
} ],
  '_GROUP_AFFINITY' : [ 0x10, {
    'Mask' : [ 0x0, ['unsigned long long']],
    'Group' : [ 0x8, ['unsigned short']],
    'Reserved' : [ 0xa, ['array', 3, ['unsigned short']]],
} ],
  '_DMA_ADAPTER' : [ 0x10, {
    'Version' : [ 0x0, ['unsigned short']],
    'Size' : [ 0x2, ['unsigned short']],
    'DmaOperations' : [ 0x8, ['pointer64', ['_DMA_OPERATIONS']]],
} ],
  '__unnamed_15a6' : [ 0x10, {
    'Low32' : [ 0x0, ['unsigned long']],
    'High32' : [ 0x4, ['unsigned long']],
    'InterruptData' : [ 0x8, ['unsigned long long']],
} ],
  '_INTERRUPT_TARGET' : [ 0x18, {
    'Target' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptTargetInvalid', 1: u'InterruptTargetAllIncludingSelf', 2: u'InterruptTargetAllExcludingSelf', 3: u'InterruptTargetSelfOnly', 4: u'InterruptTargetPhysical', 5: u'InterruptTargetLogicalFlat', 6: u'InterruptTargetLogicalClustered', 7: u'InterruptTargetRemapIndex', 8: u'InterruptTargetHypervisor'})]],
    'PhysicalTarget' : [ 0x8, ['unsigned long']],
    'LogicalFlatTarget' : [ 0x8, ['unsigned long']],
    'RemapIndex' : [ 0x8, ['unsigned long']],
    'ClusterId' : [ 0x8, ['unsigned long']],
    'ClusterMask' : [ 0xc, ['unsigned long']],
    'HypervisorTarget' : [ 0x8, ['__unnamed_15a6']],
} ],
  '_FACS' : [ 0x40, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
    'HardwareSignature' : [ 0x8, ['unsigned long']],
    'pFirmwareWakingVector' : [ 0xc, ['unsigned long']],
    'GlobalLock' : [ 0x10, ['unsigned long']],
    'Flags' : [ 0x14, ['unsigned long']],
    'x_FirmwareWakingVector' : [ 0x18, ['_LARGE_INTEGER']],
    'version' : [ 0x20, ['unsigned char']],
    'Reserved' : [ 0x21, ['array', 31, ['unsigned char']]],
} ],
  '_WHEA_AMD_EXTENDED_REGISTERS' : [ 0xc0, {
    'IPID' : [ 0x0, ['unsigned long long']],
    'SYND' : [ 0x8, ['unsigned long long']],
    'CONFIG' : [ 0x10, ['unsigned long long']],
    'DESTAT' : [ 0x18, ['unsigned long long']],
    'DEADDR' : [ 0x20, ['unsigned long long']],
    'MISC1' : [ 0x28, ['unsigned long long']],
    'MISC2' : [ 0x30, ['unsigned long long']],
    'MISC3' : [ 0x38, ['unsigned long long']],
    'MISC4' : [ 0x40, ['unsigned long long']],
    'RasCap' : [ 0x48, ['unsigned long long']],
    'Reserved' : [ 0x50, ['array', 14, ['unsigned long long']]],
} ],
  '_DMA_TRANSFER_CONTEXT' : [ 0x60, {
    'Version' : [ 0x0, ['unsigned long']],
    'V1' : [ 0x8, ['_DMA_TRANSFER_CONTEXT_V1']],
} ],
  '_SECONDARY_IC_LIST_ENTRY' : [ 0xb0, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'GsivBase' : [ 0x10, ['unsigned long']],
    'GsivSize' : [ 0x14, ['unsigned long']],
    'Interface' : [ 0x18, ['_SECONDARY_INTERRUPT_PROVIDER_INTERFACE']],
    'BusyCount' : [ 0x70, ['long']],
    'ExclusiveWaiterCount' : [ 0x74, ['long']],
    'NotificationEvent' : [ 0x78, ['_KEVENT']],
    'SignalListEntry' : [ 0x90, ['_LIST_ENTRY']],
    'State' : [ 0xa0, ['array', 1, ['_SECONDARY_INTERRUPT_LINE_STATE']]],
} ],
  '_DRIVER_OBJECT' : [ 0x150, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'Flags' : [ 0x10, ['unsigned long']],
    'DriverStart' : [ 0x18, ['pointer64', ['void']]],
    'DriverSize' : [ 0x20, ['unsigned long']],
    'DriverSection' : [ 0x28, ['pointer64', ['void']]],
    'DriverExtension' : [ 0x30, ['pointer64', ['_DRIVER_EXTENSION']]],
    'DriverName' : [ 0x38, ['_UNICODE_STRING']],
    'HardwareDatabase' : [ 0x48, ['pointer64', ['_UNICODE_STRING']]],
    'FastIoDispatch' : [ 0x50, ['pointer64', ['_FAST_IO_DISPATCH']]],
    'DriverInit' : [ 0x58, ['pointer64', ['void']]],
    'DriverStartIo' : [ 0x60, ['pointer64', ['void']]],
    'DriverUnload' : [ 0x68, ['pointer64', ['void']]],
    'MajorFunction' : [ 0x70, ['array', 28, ['pointer64', ['void']]]],
} ],
  '_HAL_HV_DMA_DOMAIN_INFO' : [ 0x8, {
    'DomainId' : [ 0x0, ['unsigned long']],
    'IsStage1' : [ 0x4, ['unsigned char']],
} ],
  '_HAL_HV_SVM_DEVICE_CAPABILITIES' : [ 0xc, {
    'SvmSupported' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PciExecute' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'NoExecute' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 31, native_type='unsigned long')]],
    'OverflowPossible' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'PasidCount' : [ 0x4, ['unsigned long']],
    'IommuIndex' : [ 0x8, ['unsigned long']],
} ],
  '_XPF_MC_BANK_FLAGS' : [ 0x1, {
    'ClearOnInitializationRW' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'ControlDataRW' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'AsUCHAR' : [ 0x0, ['unsigned char']],
} ],
  '_IO_NMISOURCE' : [ 0x8, {
    'Type' : [ 0x0, ['unsigned char']],
    'Length' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned short']],
    'GlobalSystemInterruptVector' : [ 0x4, ['unsigned long']],
} ],
  '_DRIVER_EXTENSION' : [ 0x28, {
    'DriverObject' : [ 0x0, ['pointer64', ['_DRIVER_OBJECT']]],
    'AddDevice' : [ 0x8, ['pointer64', ['void']]],
    'Count' : [ 0x10, ['unsigned long']],
    'ServiceKeyName' : [ 0x18, ['_UNICODE_STRING']],
} ],
  '_ISA_VECTOR' : [ 0xa, {
    'Type' : [ 0x0, ['unsigned char']],
    'Length' : [ 0x1, ['unsigned char']],
    'Bus' : [ 0x2, ['unsigned char']],
    'Source' : [ 0x3, ['unsigned char']],
    'GlobalSystemInterruptVector' : [ 0x4, ['unsigned long']],
    'Flags' : [ 0x8, ['unsigned short']],
} ],
  '_IO_RESOURCE_LIST' : [ 0x28, {
    'Version' : [ 0x0, ['unsigned short']],
    'Revision' : [ 0x2, ['unsigned short']],
    'Count' : [ 0x4, ['unsigned long']],
    'Descriptors' : [ 0x8, ['array', 1, ['_IO_RESOURCE_DESCRIPTOR']]],
} ],
  '_KSPECIAL_REGISTERS' : [ 0xf0, {
    'Cr0' : [ 0x0, ['unsigned long long']],
    'Cr2' : [ 0x8, ['unsigned long long']],
    'Cr3' : [ 0x10, ['unsigned long long']],
    'Cr4' : [ 0x18, ['unsigned long long']],
    'KernelDr0' : [ 0x20, ['unsigned long long']],
    'KernelDr1' : [ 0x28, ['unsigned long long']],
    'KernelDr2' : [ 0x30, ['unsigned long long']],
    'KernelDr3' : [ 0x38, ['unsigned long long']],
    'KernelDr6' : [ 0x40, ['unsigned long long']],
    'KernelDr7' : [ 0x48, ['unsigned long long']],
    'Gdtr' : [ 0x50, ['_KDESCRIPTOR']],
    'Idtr' : [ 0x60, ['_KDESCRIPTOR']],
    'Tr' : [ 0x70, ['unsigned short']],
    'Ldtr' : [ 0x72, ['unsigned short']],
    'MxCsr' : [ 0x74, ['unsigned long']],
    'DebugControl' : [ 0x78, ['unsigned long long']],
    'LastBranchToRip' : [ 0x80, ['unsigned long long']],
    'LastBranchFromRip' : [ 0x88, ['unsigned long long']],
    'LastExceptionToRip' : [ 0x90, ['unsigned long long']],
    'LastExceptionFromRip' : [ 0x98, ['unsigned long long']],
    'Cr8' : [ 0xa0, ['unsigned long long']],
    'MsrGsBase' : [ 0xa8, ['unsigned long long']],
    'MsrGsSwap' : [ 0xb0, ['unsigned long long']],
    'MsrStar' : [ 0xb8, ['unsigned long long']],
    'MsrLStar' : [ 0xc0, ['unsigned long long']],
    'MsrCStar' : [ 0xc8, ['unsigned long long']],
    'MsrSyscallMask' : [ 0xd0, ['unsigned long long']],
    'Xcr0' : [ 0xd8, ['unsigned long long']],
    'MsrFsBase' : [ 0xe0, ['unsigned long long']],
    'SpecialPadding0' : [ 0xe8, ['unsigned long long']],
} ],
  'POHANDLE__' : [ 0x4, {
    'unused' : [ 0x0, ['long']],
} ],
  '_INTERRUPT_LINE_STATE' : [ 0x38, {
    'Polarity' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptPolarityUnknown', 1: u'InterruptRisingEdge', 2: u'InterruptFallingEdge', 3: u'InterruptActiveBothTriggerLow', 4: u'InterruptActiveBothTriggerHigh'})]],
    'EmulateActiveBoth' : [ 0x4, ['unsigned char']],
    'TriggerMode' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'LevelSensitive', 1: u'Latched'})]],
    'Flags' : [ 0xc, ['unsigned long']],
    'Routing' : [ 0x10, ['_INTERRUPT_LINE']],
    'ProcessorTarget' : [ 0x18, ['_INTERRUPT_TARGET']],
    'Vector' : [ 0x30, ['unsigned long']],
    'Priority' : [ 0x34, ['unsigned long']],
} ],
  '_MCI_STATUS' : [ 0x8, {
    'CommonBits' : [ 0x0, ['_MCI_STATUS_BITS_COMMON']],
    'AmdBits' : [ 0x0, ['_MCI_STATUS_AMD_BITS']],
    'IntelBits' : [ 0x0, ['_MCI_STATUS_INTEL_BITS']],
    'QuadPart' : [ 0x0, ['unsigned long long']],
} ],
  '_KAFFINITY_EX' : [ 0xa8, {
    'Count' : [ 0x0, ['unsigned short']],
    'Size' : [ 0x2, ['unsigned short']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Bitmap' : [ 0x8, ['array', 20, ['unsigned long long']]],
} ],
  '_XSAVE_FORMAT' : [ 0x200, {
    'ControlWord' : [ 0x0, ['unsigned short']],
    'StatusWord' : [ 0x2, ['unsigned short']],
    'TagWord' : [ 0x4, ['unsigned char']],
    'Reserved1' : [ 0x5, ['unsigned char']],
    'ErrorOpcode' : [ 0x6, ['unsigned short']],
    'ErrorOffset' : [ 0x8, ['unsigned long']],
    'ErrorSelector' : [ 0xc, ['unsigned short']],
    'Reserved2' : [ 0xe, ['unsigned short']],
    'DataOffset' : [ 0x10, ['unsigned long']],
    'DataSelector' : [ 0x14, ['unsigned short']],
    'Reserved3' : [ 0x16, ['unsigned short']],
    'MxCsr' : [ 0x18, ['unsigned long']],
    'MxCsr_Mask' : [ 0x1c, ['unsigned long']],
    'FloatRegisters' : [ 0x20, ['array', 8, ['_M128A']]],
    'XmmRegisters' : [ 0xa0, ['array', 16, ['_M128A']]],
    'Reserved4' : [ 0x1a0, ['array', 96, ['unsigned char']]],
} ],
  '_WHEA_NOTIFICATION_FLAGS' : [ 0x2, {
    'PollIntervalRW' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'SwitchToPollingThresholdRW' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'SwitchToPollingWindowRW' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'ErrorThresholdRW' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'ErrorThresholdWindowRW' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 16, native_type='unsigned short')]],
    'AsUSHORT' : [ 0x0, ['unsigned short']],
} ],
  '_MCI_STATUS_INTEL_BITS' : [ 0x8, {
    'McaErrorCode' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'ModelErrorCode' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long long')]],
    'OtherInfo' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 37, native_type='unsigned long long')]],
    'FirmwareUpdateError' : [ 0x0, ['BitField', dict(start_bit = 37, end_bit = 38, native_type='unsigned long long')]],
    'CorrectedErrorCount' : [ 0x0, ['BitField', dict(start_bit = 38, end_bit = 53, native_type='unsigned long long')]],
    'ThresholdErrorStatus' : [ 0x0, ['BitField', dict(start_bit = 53, end_bit = 55, native_type='unsigned long long')]],
    'ActionRequired' : [ 0x0, ['BitField', dict(start_bit = 55, end_bit = 56, native_type='unsigned long long')]],
    'Signalling' : [ 0x0, ['BitField', dict(start_bit = 56, end_bit = 57, native_type='unsigned long long')]],
    'ContextCorrupt' : [ 0x0, ['BitField', dict(start_bit = 57, end_bit = 58, native_type='unsigned long long')]],
    'AddressValid' : [ 0x0, ['BitField', dict(start_bit = 58, end_bit = 59, native_type='unsigned long long')]],
    'MiscValid' : [ 0x0, ['BitField', dict(start_bit = 59, end_bit = 60, native_type='unsigned long long')]],
    'ErrorEnabled' : [ 0x0, ['BitField', dict(start_bit = 60, end_bit = 61, native_type='unsigned long long')]],
    'UncorrectedError' : [ 0x0, ['BitField', dict(start_bit = 61, end_bit = 62, native_type='unsigned long long')]],
    'StatusOverFlow' : [ 0x0, ['BitField', dict(start_bit = 62, end_bit = 63, native_type='unsigned long long')]],
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 63, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_WHEA_PROCESSOR_GENERIC_ERROR_SECTION' : [ 0xc0, {
    'ValidBits' : [ 0x0, ['_WHEA_PROCESSOR_GENERIC_ERROR_SECTION_VALIDBITS']],
    'ProcessorType' : [ 0x8, ['unsigned char']],
    'InstructionSet' : [ 0x9, ['unsigned char']],
    'ErrorType' : [ 0xa, ['unsigned char']],
    'Operation' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['unsigned char']],
    'Level' : [ 0xd, ['unsigned char']],
    'Reserved' : [ 0xe, ['unsigned short']],
    'CPUVersion' : [ 0x10, ['unsigned long long']],
    'CPUBrandString' : [ 0x18, ['array', 128, ['unsigned char']]],
    'ProcessorId' : [ 0x98, ['unsigned long long']],
    'TargetAddress' : [ 0xa0, ['unsigned long long']],
    'RequesterId' : [ 0xa8, ['unsigned long long']],
    'ResponderId' : [ 0xb0, ['unsigned long long']],
    'InstructionPointer' : [ 0xb8, ['unsigned long long']],
} ],
  '_MAPIC' : [ 0x30, {
    'Header' : [ 0x0, ['_DESCRIPTION_HEADER']],
    'LocalAPICAddress' : [ 0x24, ['unsigned long']],
    'Flags' : [ 0x28, ['unsigned long']],
    'APICTables' : [ 0x2c, ['array', 1, ['unsigned long']]],
} ],
  '_DMA_OPERATIONS' : [ 0x138, {
    'Size' : [ 0x0, ['unsigned long']],
    'PutDmaAdapter' : [ 0x8, ['pointer64', ['void']]],
    'AllocateCommonBuffer' : [ 0x10, ['pointer64', ['void']]],
    'FreeCommonBuffer' : [ 0x18, ['pointer64', ['void']]],
    'AllocateAdapterChannel' : [ 0x20, ['pointer64', ['void']]],
    'FlushAdapterBuffers' : [ 0x28, ['pointer64', ['void']]],
    'FreeAdapterChannel' : [ 0x30, ['pointer64', ['void']]],
    'FreeMapRegisters' : [ 0x38, ['pointer64', ['void']]],
    'MapTransfer' : [ 0x40, ['pointer64', ['void']]],
    'GetDmaAlignment' : [ 0x48, ['pointer64', ['void']]],
    'ReadDmaCounter' : [ 0x50, ['pointer64', ['void']]],
    'GetScatterGatherList' : [ 0x58, ['pointer64', ['void']]],
    'PutScatterGatherList' : [ 0x60, ['pointer64', ['void']]],
    'CalculateScatterGatherList' : [ 0x68, ['pointer64', ['void']]],
    'BuildScatterGatherList' : [ 0x70, ['pointer64', ['void']]],
    'BuildMdlFromScatterGatherList' : [ 0x78, ['pointer64', ['void']]],
    'GetDmaAdapterInfo' : [ 0x80, ['pointer64', ['void']]],
    'GetDmaTransferInfo' : [ 0x88, ['pointer64', ['void']]],
    'InitializeDmaTransferContext' : [ 0x90, ['pointer64', ['void']]],
    'AllocateCommonBufferEx' : [ 0x98, ['pointer64', ['void']]],
    'AllocateAdapterChannelEx' : [ 0xa0, ['pointer64', ['void']]],
    'ConfigureAdapterChannel' : [ 0xa8, ['pointer64', ['void']]],
    'CancelAdapterChannel' : [ 0xb0, ['pointer64', ['void']]],
    'MapTransferEx' : [ 0xb8, ['pointer64', ['void']]],
    'GetScatterGatherListEx' : [ 0xc0, ['pointer64', ['void']]],
    'BuildScatterGatherListEx' : [ 0xc8, ['pointer64', ['void']]],
    'FlushAdapterBuffersEx' : [ 0xd0, ['pointer64', ['void']]],
    'FreeAdapterObject' : [ 0xd8, ['pointer64', ['void']]],
    'CancelMappedTransfer' : [ 0xe0, ['pointer64', ['void']]],
    'AllocateDomainCommonBuffer' : [ 0xe8, ['pointer64', ['void']]],
    'FlushDmaBuffer' : [ 0xf0, ['pointer64', ['void']]],
    'JoinDmaDomain' : [ 0xf8, ['pointer64', ['void']]],
    'LeaveDmaDomain' : [ 0x100, ['pointer64', ['void']]],
    'GetDmaDomain' : [ 0x108, ['pointer64', ['void']]],
    'AllocateCommonBufferWithBounds' : [ 0x110, ['pointer64', ['void']]],
    'AllocateCommonBufferVector' : [ 0x118, ['pointer64', ['void']]],
    'GetCommonBufferFromVectorByIndex' : [ 0x120, ['pointer64', ['void']]],
    'FreeCommonBufferFromVector' : [ 0x128, ['pointer64', ['void']]],
    'FreeCommonBufferVector' : [ 0x130, ['pointer64', ['void']]],
} ],
  '__unnamed_167c' : [ 0x18, {
    'Length' : [ 0x0, ['unsigned long']],
    'Alignment' : [ 0x4, ['unsigned long']],
    'MinimumAddress' : [ 0x8, ['_LARGE_INTEGER']],
    'MaximumAddress' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1680' : [ 0x18, {
    'MinimumVector' : [ 0x0, ['unsigned long']],
    'MaximumVector' : [ 0x4, ['unsigned long']],
    'AffinityPolicy' : [ 0x8, ['unsigned short']],
    'Group' : [ 0xa, ['unsigned short']],
    'PriorityPolicy' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'IrqPriorityUndefined', 1: u'IrqPriorityLow', 2: u'IrqPriorityNormal', 3: u'IrqPriorityHigh'})]],
    'TargetedProcessors' : [ 0x10, ['unsigned long long']],
} ],
  '__unnamed_1682' : [ 0x8, {
    'MinimumChannel' : [ 0x0, ['unsigned long']],
    'MaximumChannel' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_1684' : [ 0x10, {
    'RequestLine' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Channel' : [ 0x8, ['unsigned long']],
    'TransferWidth' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_1686' : [ 0xc, {
    'Data' : [ 0x0, ['array', 3, ['unsigned long']]],
} ],
  '__unnamed_1688' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'MinBusNumber' : [ 0x4, ['unsigned long']],
    'MaxBusNumber' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_168a' : [ 0xc, {
    'Priority' : [ 0x0, ['unsigned long']],
    'Reserved1' : [ 0x4, ['unsigned long']],
    'Reserved2' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_168c' : [ 0x18, {
    'Length40' : [ 0x0, ['unsigned long']],
    'Alignment40' : [ 0x4, ['unsigned long']],
    'MinimumAddress' : [ 0x8, ['_LARGE_INTEGER']],
    'MaximumAddress' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_168e' : [ 0x18, {
    'Length48' : [ 0x0, ['unsigned long']],
    'Alignment48' : [ 0x4, ['unsigned long']],
    'MinimumAddress' : [ 0x8, ['_LARGE_INTEGER']],
    'MaximumAddress' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1690' : [ 0x18, {
    'Length64' : [ 0x0, ['unsigned long']],
    'Alignment64' : [ 0x4, ['unsigned long']],
    'MinimumAddress' : [ 0x8, ['_LARGE_INTEGER']],
    'MaximumAddress' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1692' : [ 0xc, {
    'Class' : [ 0x0, ['unsigned char']],
    'Type' : [ 0x1, ['unsigned char']],
    'Reserved1' : [ 0x2, ['unsigned char']],
    'Reserved2' : [ 0x3, ['unsigned char']],
    'IdLowPart' : [ 0x4, ['unsigned long']],
    'IdHighPart' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1694' : [ 0x18, {
    'Port' : [ 0x0, ['__unnamed_167c']],
    'Memory' : [ 0x0, ['__unnamed_167c']],
    'Interrupt' : [ 0x0, ['__unnamed_1680']],
    'Dma' : [ 0x0, ['__unnamed_1682']],
    'DmaV3' : [ 0x0, ['__unnamed_1684']],
    'Generic' : [ 0x0, ['__unnamed_167c']],
    'DevicePrivate' : [ 0x0, ['__unnamed_1686']],
    'BusNumber' : [ 0x0, ['__unnamed_1688']],
    'ConfigData' : [ 0x0, ['__unnamed_168a']],
    'Memory40' : [ 0x0, ['__unnamed_168c']],
    'Memory48' : [ 0x0, ['__unnamed_168e']],
    'Memory64' : [ 0x0, ['__unnamed_1690']],
    'Connection' : [ 0x0, ['__unnamed_1692']],
} ],
  '_IO_RESOURCE_DESCRIPTOR' : [ 0x20, {
    'Option' : [ 0x0, ['unsigned char']],
    'Type' : [ 0x1, ['unsigned char']],
    'ShareDisposition' : [ 0x2, ['unsigned char']],
    'Spare1' : [ 0x3, ['unsigned char']],
    'Flags' : [ 0x4, ['unsigned short']],
    'Spare2' : [ 0x6, ['unsigned short']],
    'u' : [ 0x8, ['__unnamed_1694']],
} ],
  '_SCATTER_GATHER_ELEMENT' : [ 0x18, {
    'Address' : [ 0x0, ['_LARGE_INTEGER']],
    'Length' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0x10, ['unsigned long long']],
} ],
  '__unnamed_169c' : [ 0x8, {
    'NumberOfEntries' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 10, native_type='unsigned long long')]],
    'PageSize' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long long')]],
    'Va' : [ 0x0, ['pointer64', ['void']]],
    'VaLong' : [ 0x0, ['unsigned long long']],
} ],
  '_KTB_FLUSH_VA' : [ 0x8, {
    'u1' : [ 0x0, ['__unnamed_169c']],
} ],
  '__unnamed_16a3' : [ 0x2c, {
    'InitialPrivilegeSet' : [ 0x0, ['_INITIAL_PRIVILEGE_SET']],
    'PrivilegeSet' : [ 0x0, ['_PRIVILEGE_SET']],
} ],
  '_ACCESS_STATE' : [ 0xa0, {
    'OperationID' : [ 0x0, ['_LUID']],
    'SecurityEvaluated' : [ 0x8, ['unsigned char']],
    'GenerateAudit' : [ 0x9, ['unsigned char']],
    'GenerateOnClose' : [ 0xa, ['unsigned char']],
    'PrivilegesAllocated' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['unsigned long']],
    'RemainingDesiredAccess' : [ 0x10, ['unsigned long']],
    'PreviouslyGrantedAccess' : [ 0x14, ['unsigned long']],
    'OriginalDesiredAccess' : [ 0x18, ['unsigned long']],
    'SubjectSecurityContext' : [ 0x20, ['_SECURITY_SUBJECT_CONTEXT']],
    'SecurityDescriptor' : [ 0x40, ['pointer64', ['void']]],
    'AuxData' : [ 0x48, ['pointer64', ['void']]],
    'Privileges' : [ 0x50, ['__unnamed_16a3']],
    'AuditPrivileges' : [ 0x7c, ['unsigned char']],
    'ObjectName' : [ 0x80, ['_UNICODE_STRING']],
    'ObjectTypeName' : [ 0x90, ['_UNICODE_STRING']],
} ],
  '_HALP_EMERGENCY_LA_QUEUE_ENTRY' : [ 0x18, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'EntryType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: u'HalpDmaLegacyLaQueueEntry', 1: u'HalpDmaThinLaQueueEntry', 2: u'HalpDmaLaQueueEntryMax'})]],
} ],
  '__unnamed_16b0' : [ 0x20, {
    'ContiguousHint' : [ 0x0, ['_HALP_DMA_TRANSLATION_BUFFER_POSITION']],
    'ScatterHint' : [ 0x10, ['_HALP_DMA_TRANSLATION_BUFFER_POSITION']],
} ],
  '_HALP_DMA_ADAPTER_OBJECT' : [ 0x98, {
    'DmaHeader' : [ 0x0, ['_DMA_ADAPTER']],
    'ContiguousMapRegisters' : [ 0x10, ['pointer64', ['_RTL_BITMAP']]],
    'ScatterBufferListHead' : [ 0x18, ['pointer64', ['_HALP_DMA_TRANSLATION_ENTRY']]],
    'NumberOfFreeScatterBuffers' : [ 0x20, ['unsigned long']],
    'ContiguousTranslations' : [ 0x28, ['pointer64', ['_HALP_DMA_TRANSLATION_BUFFER']]],
    'ScatterTranslations' : [ 0x30, ['pointer64', ['_HALP_DMA_TRANSLATION_BUFFER']]],
    'ContiguousTranslationEnd' : [ 0x38, ['_HALP_DMA_TRANSLATION_BUFFER_POSITION']],
    'ScatterTranslationEnd' : [ 0x48, ['_HALP_DMA_TRANSLATION_BUFFER_POSITION']],
    'CrashDump' : [ 0x58, ['__unnamed_16b0']],
    'SpinLock' : [ 0x78, ['unsigned long long']],
    'GrowLock' : [ 0x80, ['unsigned long long']],
    'MaximumPhysicalAddress' : [ 0x88, ['_LARGE_INTEGER']],
    'IsMasterAdapter' : [ 0x90, ['unsigned char']],
    'DmaCanCross64K' : [ 0x91, ['unsigned char']],
    'LibraryVersion' : [ 0x94, ['unsigned long']],
} ],
  '_KDESCRIPTOR' : [ 0x10, {
    'Pad' : [ 0x0, ['array', 3, ['unsigned short']]],
    'Limit' : [ 0x6, ['unsigned short']],
    'Base' : [ 0x8, ['pointer64', ['void']]],
} ],
  '_EXCEPTION_RECORD' : [ 0x98, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['pointer64', ['_EXCEPTION_RECORD']]],
    'ExceptionAddress' : [ 0x10, ['pointer64', ['void']]],
    'NumberParameters' : [ 0x18, ['unsigned long']],
    'ExceptionInformation' : [ 0x20, ['array', 15, ['unsigned long long']]],
} ],
  '_WHEA_PROCESSOR_GENERIC_ERROR_SECTION_VALIDBITS' : [ 0x8, {
    'ProcessorType' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'InstructionSet' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'ErrorType' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'Operation' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'Flags' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'Level' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
    'CPUVersion' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long long')]],
    'CPUBrandString' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long long')]],
    'ProcessorId' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'TargetAddress' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'RequesterId' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'ResponderId' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'InstructionPointer' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 64, native_type='unsigned long long')]],
    'ValidBits' : [ 0x0, ['unsigned long long']],
} ],
  '_WHEA_ERROR_RECORD_HEADER_FLAGS' : [ 0x4, {
    'Recovered' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PreviousError' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Simulated' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DeviceDriver' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'CriticalEvent' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'PersistPfn' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_DMA_TRANSFER_INFO' : [ 0x14, {
    'Version' : [ 0x0, ['unsigned long']],
    'V1' : [ 0x4, ['_DMA_TRANSFER_INFO_V1']],
    'V2' : [ 0x4, ['_DMA_TRANSFER_INFO_V2']],
} ],
  '_MCI_STATUS_BITS_COMMON' : [ 0x8, {
    'McaErrorCode' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'ModelErrorCode' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 57, native_type='unsigned long long')]],
    'ContextCorrupt' : [ 0x0, ['BitField', dict(start_bit = 57, end_bit = 58, native_type='unsigned long long')]],
    'AddressValid' : [ 0x0, ['BitField', dict(start_bit = 58, end_bit = 59, native_type='unsigned long long')]],
    'MiscValid' : [ 0x0, ['BitField', dict(start_bit = 59, end_bit = 60, native_type='unsigned long long')]],
    'ErrorEnabled' : [ 0x0, ['BitField', dict(start_bit = 60, end_bit = 61, native_type='unsigned long long')]],
    'UncorrectedError' : [ 0x0, ['BitField', dict(start_bit = 61, end_bit = 62, native_type='unsigned long long')]],
    'StatusOverFlow' : [ 0x0, ['BitField', dict(start_bit = 62, end_bit = 63, native_type='unsigned long long')]],
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 63, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_DMA_TRANSFER_INFO_V2' : [ 0x10, {
    'MapRegisterCount' : [ 0x0, ['unsigned long']],
    'ScatterGatherElementCount' : [ 0x4, ['unsigned long']],
    'ScatterGatherListSize' : [ 0x8, ['unsigned long']],
    'LogicalPageCount' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_16c9' : [ 0x10, {
    'Address' : [ 0x0, ['unsigned long long']],
    'Consumed' : [ 0x8, ['unsigned char']],
    'ErrorCode' : [ 0xa, ['unsigned short']],
    'ErrorIpValid' : [ 0xc, ['unsigned char']],
    'RestartIpValid' : [ 0xd, ['unsigned char']],
    'ClearPoison' : [ 0xe, ['unsigned char']],
} ],
  '__unnamed_16cb' : [ 0x8, {
    'PmemErrInfo' : [ 0x0, ['unsigned long long']],
} ],
  '_WHEA_RECOVERY_CONTEXT' : [ 0x20, {
    'MemoryError' : [ 0x0, ['__unnamed_16c9']],
    'PmemError' : [ 0x0, ['__unnamed_16cb']],
    'PartitionId' : [ 0x10, ['unsigned long long']],
    'VpIndex' : [ 0x18, ['unsigned long']],
    'ErrorType' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {1: u'WheaRecoveryContextErrorTypeMemory', 2: u'WheaRecoveryContextErrorTypePmem', 3: u'WheaRecoveryContextErrorTypeMax'})]],
} ],
  '_HALP_DMA_TRANSLATION_BUFFER' : [ 0x18, {
    'Next' : [ 0x0, ['pointer64', ['_HALP_DMA_TRANSLATION_BUFFER']]],
    'EntryCount' : [ 0x8, ['unsigned long']],
    'Entries' : [ 0x10, ['pointer64', ['_HALP_DMA_TRANSLATION_ENTRY']]],
} ],
  '_SECONDARY_INTERRUPT_PROVIDER_INTERFACE' : [ 0x58, {
    'Size' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned short']],
    'Context' : [ 0x8, ['pointer64', ['void']]],
    'GsivBase' : [ 0x10, ['unsigned long']],
    'GsivSize' : [ 0x14, ['unsigned short']],
    'DriverObject' : [ 0x18, ['pointer64', ['_DRIVER_OBJECT']]],
    'Reserved1' : [ 0x20, ['pointer64', ['void']]],
    'Reserved2' : [ 0x28, ['pointer64', ['void']]],
    'Reserved3' : [ 0x30, ['pointer64', ['void']]],
    'Reserved4' : [ 0x38, ['pointer64', ['void']]],
    'Reserved5' : [ 0x40, ['pointer64', ['void']]],
    'Reserved6' : [ 0x48, ['pointer64', ['void']]],
    'Reserved7' : [ 0x50, ['pointer64', ['void']]],
} ],
  '_HALP_DMA_DOMAIN_OBJECT' : [ 0x88, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'MaximumPhysicalAddress' : [ 0x10, ['_LARGE_INTEGER']],
    'BoundaryAddressMultiple' : [ 0x18, ['_LARGE_INTEGER']],
    'CacheCoherent' : [ 0x20, ['unsigned char']],
    'FirmwareReserved' : [ 0x21, ['unsigned char']],
    'IommuDomainPointer' : [ 0x28, ['pointer64', ['void']]],
    'LaState' : [ 0x30, ['pointer64', ['void']]],
    'LaStateLock' : [ 0x38, ['unsigned long long']],
    'TranslationType' : [ 0x40, ['Enumeration', dict(target = 'long', choices = {0: u'ExtTranslationTypePassThrough', 1: u'ExtTranslationTypeBlocked', 2: u'ExtTranslationTypeTranslate', 3: u'ExtTranslationTypeSafePassThrough', 4: u'ExtTranslationTypeInvalid'})]],
    'OwningAdapter' : [ 0x48, ['pointer64', ['_ADAPTER_OBJECT']]],
    'CommonBufferRoot' : [ 0x50, ['_RTL_RB_TREE']],
    'CommonBufferTreeLock' : [ 0x60, ['unsigned long long']],
    'VectorCommonBufferListHead' : [ 0x68, ['_LIST_ENTRY']],
    'VectorCommonBufferLock' : [ 0x78, ['unsigned long long']],
    'DomainRefCount' : [ 0x80, ['unsigned long']],
} ],
  '_CM_FULL_RESOURCE_DESCRIPTOR' : [ 0x24, {
    'InterfaceType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x4, ['unsigned long']],
    'PartialResourceList' : [ 0x8, ['_CM_PARTIAL_RESOURCE_LIST']],
} ],
  '_DMA_TRANSFER_INFO_V1' : [ 0xc, {
    'MapRegisterCount' : [ 0x0, ['unsigned long']],
    'ScatterGatherElementCount' : [ 0x4, ['unsigned long']],
    'ScatterGatherListSize' : [ 0x8, ['unsigned long']],
} ],
  '_FAST_IO_DISPATCH' : [ 0xe0, {
    'SizeOfFastIoDispatch' : [ 0x0, ['unsigned long']],
    'FastIoCheckIfPossible' : [ 0x8, ['pointer64', ['void']]],
    'FastIoRead' : [ 0x10, ['pointer64', ['void']]],
    'FastIoWrite' : [ 0x18, ['pointer64', ['void']]],
    'FastIoQueryBasicInfo' : [ 0x20, ['pointer64', ['void']]],
    'FastIoQueryStandardInfo' : [ 0x28, ['pointer64', ['void']]],
    'FastIoLock' : [ 0x30, ['pointer64', ['void']]],
    'FastIoUnlockSingle' : [ 0x38, ['pointer64', ['void']]],
    'FastIoUnlockAll' : [ 0x40, ['pointer64', ['void']]],
    'FastIoUnlockAllByKey' : [ 0x48, ['pointer64', ['void']]],
    'FastIoDeviceControl' : [ 0x50, ['pointer64', ['void']]],
    'AcquireFileForNtCreateSection' : [ 0x58, ['pointer64', ['void']]],
    'ReleaseFileForNtCreateSection' : [ 0x60, ['pointer64', ['void']]],
    'FastIoDetachDevice' : [ 0x68, ['pointer64', ['void']]],
    'FastIoQueryNetworkOpenInfo' : [ 0x70, ['pointer64', ['void']]],
    'AcquireForModWrite' : [ 0x78, ['pointer64', ['void']]],
    'MdlRead' : [ 0x80, ['pointer64', ['void']]],
    'MdlReadComplete' : [ 0x88, ['pointer64', ['void']]],
    'PrepareMdlWrite' : [ 0x90, ['pointer64', ['void']]],
    'MdlWriteComplete' : [ 0x98, ['pointer64', ['void']]],
    'FastIoReadCompressed' : [ 0xa0, ['pointer64', ['void']]],
    'FastIoWriteCompressed' : [ 0xa8, ['pointer64', ['void']]],
    'MdlReadCompleteCompressed' : [ 0xb0, ['pointer64', ['void']]],
    'MdlWriteCompleteCompressed' : [ 0xb8, ['pointer64', ['void']]],
    'FastIoQueryOpen' : [ 0xc0, ['pointer64', ['void']]],
    'ReleaseForModWrite' : [ 0xc8, ['pointer64', ['void']]],
    'AcquireForCcFlush' : [ 0xd0, ['pointer64', ['void']]],
    'ReleaseForCcFlush' : [ 0xd8, ['pointer64', ['void']]],
} ],
  '__unnamed_1728' : [ 0x8, {
    'BoundToMaster' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'BoundToScatterPool' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'OwnedByMaster' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'OwnedByScatterPool' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'TemporaryMapping' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'ZeroBuffer' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
    'Address' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 64, native_type='unsigned long long')]],
} ],
  '__unnamed_172a' : [ 0x8, {
    'VirtualAddress' : [ 0x0, ['pointer64', ['void']]],
    'Flags' : [ 0x0, ['__unnamed_1728']],
} ],
  '_HALP_DMA_TRANSLATION_ENTRY' : [ 0x48, {
    'PhysicalAddress' : [ 0x0, ['unsigned long long']],
    'Next' : [ 0x8, ['pointer64', ['_HALP_DMA_TRANSLATION_ENTRY']]],
    'MappedLength' : [ 0x10, ['unsigned long']],
    'LogicalAddress' : [ 0x18, ['unsigned long long']],
    'LogicalMappedLength' : [ 0x20, ['unsigned long long']],
    'NextLogicalAddress' : [ 0x28, ['unsigned long long']],
    'u' : [ 0x30, ['__unnamed_172a']],
    'NextMapping' : [ 0x38, ['pointer64', ['_HALP_DMA_TRANSLATION_ENTRY']]],
    'LogicalBounceBufferPremapped' : [ 0x40, ['unsigned char']],
} ],
  '_ERESOURCE' : [ 0x68, {
    'SystemResourcesList' : [ 0x0, ['_LIST_ENTRY']],
    'OwnerTable' : [ 0x10, ['pointer64', ['_OWNER_ENTRY']]],
    'ActiveCount' : [ 0x18, ['short']],
    'Flag' : [ 0x1a, ['unsigned short']],
    'ReservedLowFlags' : [ 0x1a, ['unsigned char']],
    'WaiterPriority' : [ 0x1b, ['unsigned char']],
    'SharedWaiters' : [ 0x20, ['pointer64', ['void']]],
    'ExclusiveWaiters' : [ 0x28, ['pointer64', ['void']]],
    'OwnerEntry' : [ 0x30, ['_OWNER_ENTRY']],
    'ActiveEntries' : [ 0x40, ['unsigned long']],
    'ContentionCount' : [ 0x44, ['unsigned long']],
    'NumberOfSharedWaiters' : [ 0x48, ['unsigned long']],
    'NumberOfExclusiveWaiters' : [ 0x4c, ['unsigned long']],
    'Reserved2' : [ 0x50, ['pointer64', ['void']]],
    'Address' : [ 0x58, ['pointer64', ['void']]],
    'CreatorBackTraceIndex' : [ 0x58, ['unsigned long long']],
    'SpinLock' : [ 0x60, ['unsigned long long']],
} ],
  '_DMA_FUNCTION_TABLE' : [ 0x50, {
    'InitializeController' : [ 0x0, ['pointer64', ['void']]],
    'ValidateRequestLineBinding' : [ 0x8, ['pointer64', ['void']]],
    'QueryMaxFragments' : [ 0x10, ['pointer64', ['void']]],
    'ProgramChannel' : [ 0x18, ['pointer64', ['void']]],
    'ConfigureChannel' : [ 0x20, ['pointer64', ['void']]],
    'FlushChannel' : [ 0x28, ['pointer64', ['void']]],
    'HandleInterrupt' : [ 0x30, ['pointer64', ['void']]],
    'ReadDmaCounter' : [ 0x38, ['pointer64', ['void']]],
    'ReportCommonBuffer' : [ 0x40, ['pointer64', ['void']]],
    'CancelTransfer' : [ 0x48, ['pointer64', ['void']]],
} ],
  '_EXT_IOMMU_DEVICE_ID' : [ 0x18, {
    'DeviceType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'EXT_IOMMU_DEVICE_TYPE_INVALID', 1: u'EXT_IOMMU_DEVICE_TYPE_PCI', 2: u'EXT_IOMMU_DEVICE_TYPE_ACPI', 3: u'EXT_IOMMU_DEVICE_TYPE_IOAPIC', 4: u'EXT_IOMMU_DEVICE_TYPE_LOGICAL', 5: u'EXT_IOMMU_DEVICE_TYPE_GIC', 6: u'EXT_IOMMU_DEVICE_TYPE_TEST', 7: u'EXT_IOMMU_DEVICE_TYPE_MAX'})]],
    'Pci' : [ 0x8, ['_EXT_IOMMU_DEVICE_ID_PCI']],
    'Acpi' : [ 0x8, ['_EXT_IOMMU_DEVICE_ID_ACPI']],
    'IoApicId' : [ 0x8, ['unsigned char']],
    'LogicalId' : [ 0x8, ['unsigned long long']],
    'Test' : [ 0x8, ['_EXT_IOMMU_DEVICE_ID_TEST']],
    'Gic' : [ 0x8, ['_EXT_IOMMU_DEVICE_ID_GIC']],
} ],
  '_FILE_BASIC_INFORMATION' : [ 0x28, {
    'CreationTime' : [ 0x0, ['_LARGE_INTEGER']],
    'LastAccessTime' : [ 0x8, ['_LARGE_INTEGER']],
    'LastWriteTime' : [ 0x10, ['_LARGE_INTEGER']],
    'ChangeTime' : [ 0x18, ['_LARGE_INTEGER']],
    'FileAttributes' : [ 0x20, ['unsigned long']],
} ],
  '_DMA_TRANSFER_CONTEXT_V1' : [ 0x58, {
    'DmaState' : [ 0x0, ['long']],
    'TransferState' : [ 0x4, ['unsigned long']],
    'Wcb' : [ 0x8, ['_WAIT_CONTEXT_BLOCK']],
    'HalWcb' : [ 0x50, ['pointer64', ['void']]],
} ],
  '_DMA_COMMON_BUFFER_VECTOR' : [ 0x48, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'SizeOfEntries' : [ 0x10, ['unsigned long long']],
    'NumberOfEntries' : [ 0x18, ['unsigned long']],
    'Domain' : [ 0x20, ['pointer64', ['_HALP_DMA_DOMAIN_OBJECT']]],
    'Mdl' : [ 0x28, ['pointer64', ['_MDL']]],
    'BaseAddress' : [ 0x30, ['pointer64', ['void']]],
    'BaseLogicalAddress' : [ 0x38, ['unsigned long long']],
    'Entries' : [ 0x40, ['pointer64', ['_DMA_COMMON_BUFFER_ENTRY']]],
} ],
  '_PRIVILEGE_SET' : [ 0x14, {
    'PrivilegeCount' : [ 0x0, ['unsigned long']],
    'Control' : [ 0x4, ['unsigned long']],
    'Privilege' : [ 0x8, ['array', 1, ['_LUID_AND_ATTRIBUTES']]],
} ],
  '_INITIAL_PRIVILEGE_SET' : [ 0x2c, {
    'PrivilegeCount' : [ 0x0, ['unsigned long']],
    'Control' : [ 0x4, ['unsigned long']],
    'Privilege' : [ 0x8, ['array', 3, ['_LUID_AND_ATTRIBUTES']]],
} ],
  '_DMA_ADAPTER_INFO' : [ 0x18, {
    'Version' : [ 0x0, ['unsigned long']],
    'V1' : [ 0x4, ['_DMA_ADAPTER_INFO_V1']],
} ],
  '_HALP_DMA_TRANSLATION_BUFFER_POSITION' : [ 0x10, {
    'Buffer' : [ 0x0, ['pointer64', ['_HALP_DMA_TRANSLATION_BUFFER']]],
    'Offset' : [ 0x8, ['unsigned long']],
} ],
  '_MCI_STATUS_AMD_BITS' : [ 0x8, {
    'McaErrorCode' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'ModelErrorCode' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long long')]],
    'ImplementationSpecific2' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 43, native_type='unsigned long long')]],
    'Poison' : [ 0x0, ['BitField', dict(start_bit = 43, end_bit = 44, native_type='unsigned long long')]],
    'Deferred' : [ 0x0, ['BitField', dict(start_bit = 44, end_bit = 45, native_type='unsigned long long')]],
    'ImplementationSpecific1' : [ 0x0, ['BitField', dict(start_bit = 45, end_bit = 57, native_type='unsigned long long')]],
    'ContextCorrupt' : [ 0x0, ['BitField', dict(start_bit = 57, end_bit = 58, native_type='unsigned long long')]],
    'AddressValid' : [ 0x0, ['BitField', dict(start_bit = 58, end_bit = 59, native_type='unsigned long long')]],
    'MiscValid' : [ 0x0, ['BitField', dict(start_bit = 59, end_bit = 60, native_type='unsigned long long')]],
    'ErrorEnabled' : [ 0x0, ['BitField', dict(start_bit = 60, end_bit = 61, native_type='unsigned long long')]],
    'UncorrectedError' : [ 0x0, ['BitField', dict(start_bit = 61, end_bit = 62, native_type='unsigned long long')]],
    'StatusOverFlow' : [ 0x0, ['BitField', dict(start_bit = 62, end_bit = 63, native_type='unsigned long long')]],
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 63, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_EXT_IOMMU_DEVICE_ID_ACPI' : [ 0x8, {
    'ObjectName' : [ 0x0, ['pointer64', ['unsigned char']]],
} ],
  '_LUID_AND_ATTRIBUTES' : [ 0xc, {
    'Luid' : [ 0x0, ['_LUID']],
    'Attributes' : [ 0x8, ['unsigned long']],
} ],
  '_EXT_IOMMU_DEVICE_ID_TEST' : [ 0x8, {
    'UniqueId' : [ 0x0, ['unsigned long long']],
} ],
  '_FILE_NETWORK_OPEN_INFORMATION' : [ 0x38, {
    'CreationTime' : [ 0x0, ['_LARGE_INTEGER']],
    'LastAccessTime' : [ 0x8, ['_LARGE_INTEGER']],
    'LastWriteTime' : [ 0x10, ['_LARGE_INTEGER']],
    'ChangeTime' : [ 0x18, ['_LARGE_INTEGER']],
    'AllocationSize' : [ 0x20, ['_LARGE_INTEGER']],
    'EndOfFile' : [ 0x28, ['_LARGE_INTEGER']],
    'FileAttributes' : [ 0x30, ['unsigned long']],
} ],
  '_SECURITY_SUBJECT_CONTEXT' : [ 0x20, {
    'ClientToken' : [ 0x0, ['pointer64', ['void']]],
    'ImpersonationLevel' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'SecurityAnonymous', 1: u'SecurityIdentification', 2: u'SecurityImpersonation', 3: u'SecurityDelegation'})]],
    'PrimaryToken' : [ 0x10, ['pointer64', ['void']]],
    'ProcessAuditId' : [ 0x18, ['pointer64', ['void']]],
} ],
  '_OWNER_ENTRY' : [ 0x10, {
    'OwnerThread' : [ 0x0, ['unsigned long long']],
    'IoPriorityBoosted' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'OwnerReferenced' : [ 0x8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'IoQoSPriorityBoosted' : [ 0x8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'OwnerCount' : [ 0x8, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'TableSize' : [ 0x8, ['unsigned long']],
} ],
  '_DMA_ADAPTER_INFO_V1' : [ 0x14, {
    'ReadDmaCounterAvailable' : [ 0x0, ['unsigned long']],
    'ScatterGatherLimit' : [ 0x4, ['unsigned long']],
    'DmaAddressWidth' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['unsigned long']],
    'MinimumTransferUnit' : [ 0x10, ['unsigned long']],
} ],
  '_EXT_IOMMU_DEVICE_ID_GIC' : [ 0x4, {
    'LineNumber' : [ 0x0, ['unsigned long']],
} ],
  '_FILE_STANDARD_INFORMATION' : [ 0x18, {
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
    'EndOfFile' : [ 0x8, ['_LARGE_INTEGER']],
    'NumberOfLinks' : [ 0x10, ['unsigned long']],
    'DeletePending' : [ 0x14, ['unsigned char']],
    'Directory' : [ 0x15, ['unsigned char']],
} ],
  '_EXT_IOMMU_DEVICE_ID_PCI' : [ 0x10, {
    'AsUINT64' : [ 0x0, ['unsigned long long']],
    'PciSegmentNumber' : [ 0x0, ['unsigned short']],
    'PhantomFunctionBits' : [ 0x2, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned short')]],
    'BusRange' : [ 0x2, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'DevicePathLength' : [ 0x2, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned short')]],
    'StartBusNumber' : [ 0x2, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned short')]],
    'Bdf' : [ 0x4, ['unsigned short']],
    'SubordinateBus' : [ 0x4, ['unsigned char']],
    'SecondaryBus' : [ 0x5, ['unsigned char']],
    'DevicePath' : [ 0x8, ['pointer64', ['wchar']]],
} ],
  '_CM_PARTIAL_RESOURCE_LIST' : [ 0x1c, {
    'Version' : [ 0x0, ['unsigned short']],
    'Revision' : [ 0x2, ['unsigned short']],
    'Count' : [ 0x4, ['unsigned long']],
    'PartialDescriptors' : [ 0x8, ['array', 1, ['_CM_PARTIAL_RESOURCE_DESCRIPTOR']]],
} ],
  '__unnamed_178a' : [ 0xc, {
    'Start' : [ 0x0, ['_LARGE_INTEGER']],
    'Length' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_178c' : [ 0x10, {
    'Level' : [ 0x0, ['unsigned short']],
    'Group' : [ 0x2, ['unsigned short']],
    'Vector' : [ 0x4, ['unsigned long']],
    'Affinity' : [ 0x8, ['unsigned long long']],
} ],
  '__unnamed_178e' : [ 0x10, {
    'Group' : [ 0x0, ['unsigned short']],
    'MessageCount' : [ 0x2, ['unsigned short']],
    'Vector' : [ 0x4, ['unsigned long']],
    'Affinity' : [ 0x8, ['unsigned long long']],
} ],
  '__unnamed_1790' : [ 0x10, {
    'Raw' : [ 0x0, ['__unnamed_178e']],
    'Translated' : [ 0x0, ['__unnamed_178c']],
} ],
  '__unnamed_1792' : [ 0xc, {
    'Channel' : [ 0x0, ['unsigned long']],
    'Port' : [ 0x4, ['unsigned long']],
    'Reserved1' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1794' : [ 0xc, {
    'Channel' : [ 0x0, ['unsigned long']],
    'RequestLine' : [ 0x4, ['unsigned long']],
    'TransferWidth' : [ 0x8, ['unsigned char']],
    'Reserved1' : [ 0x9, ['unsigned char']],
    'Reserved2' : [ 0xa, ['unsigned char']],
    'Reserved3' : [ 0xb, ['unsigned char']],
} ],
  '__unnamed_1796' : [ 0xc, {
    'Start' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1798' : [ 0xc, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'Reserved1' : [ 0x4, ['unsigned long']],
    'Reserved2' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_179a' : [ 0xc, {
    'Start' : [ 0x0, ['_LARGE_INTEGER']],
    'Length40' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_179c' : [ 0xc, {
    'Start' : [ 0x0, ['_LARGE_INTEGER']],
    'Length48' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_179e' : [ 0xc, {
    'Start' : [ 0x0, ['_LARGE_INTEGER']],
    'Length64' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_17a0' : [ 0x10, {
    'Generic' : [ 0x0, ['__unnamed_178a']],
    'Port' : [ 0x0, ['__unnamed_178a']],
    'Interrupt' : [ 0x0, ['__unnamed_178c']],
    'MessageInterrupt' : [ 0x0, ['__unnamed_1790']],
    'Memory' : [ 0x0, ['__unnamed_178a']],
    'Dma' : [ 0x0, ['__unnamed_1792']],
    'DmaV3' : [ 0x0, ['__unnamed_1794']],
    'DevicePrivate' : [ 0x0, ['__unnamed_1686']],
    'BusNumber' : [ 0x0, ['__unnamed_1796']],
    'DeviceSpecificData' : [ 0x0, ['__unnamed_1798']],
    'Memory40' : [ 0x0, ['__unnamed_179a']],
    'Memory48' : [ 0x0, ['__unnamed_179c']],
    'Memory64' : [ 0x0, ['__unnamed_179e']],
    'Connection' : [ 0x0, ['__unnamed_1692']],
} ],
  '_CM_PARTIAL_RESOURCE_DESCRIPTOR' : [ 0x14, {
    'Type' : [ 0x0, ['unsigned char']],
    'ShareDisposition' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned short']],
    'u' : [ 0x4, ['__unnamed_17a0']],
} ],
  '_DMA_COMMON_BUFFER_ENTRY' : [ 0x10, {
    'VirtualAddress' : [ 0x0, ['pointer64', ['void']]],
    'LogicalAddress' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '_DMA_REQUEST_LINE_BINDING_DESCRIPTION' : [ 0x8, {
    'RequestLine' : [ 0x0, ['unsigned long']],
    'ChannelNumber' : [ 0x4, ['unsigned long']],
} ],
  '_DMA_SCATTER_GATHER_LIST' : [ 0x10, {
    'NumberOfElements' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned long long']],
    'Elements' : [ 0x10, ['array', 0, ['_SCATTER_GATHER_ELEMENT']]],
} ],
  '_PS_MITIGATION_OPTIONS_MAP' : [ 0x18, {
    'Map' : [ 0x0, ['array', 3, ['unsigned long long']]],
} ],
  '_PS_MITIGATION_AUDIT_OPTIONS_MAP' : [ 0x18, {
    'Map' : [ 0x0, ['array', 3, ['unsigned long long']]],
} ],
  '__unnamed_17c2' : [ 0x4, {
    'AllFlags' : [ 0x0, ['unsigned long']],
    'Win32Process' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Sgx2Enclave' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'VbsBasicEnclave' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'SpareBits' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
} ],
  '_KUSER_SHARED_DATA' : [ 0x720, {
    'TickCountLowDeprecated' : [ 0x0, ['unsigned long']],
    'TickCountMultiplier' : [ 0x4, ['unsigned long']],
    'InterruptTime' : [ 0x8, ['_KSYSTEM_TIME']],
    'SystemTime' : [ 0x14, ['_KSYSTEM_TIME']],
    'TimeZoneBias' : [ 0x20, ['_KSYSTEM_TIME']],
    'ImageNumberLow' : [ 0x2c, ['unsigned short']],
    'ImageNumberHigh' : [ 0x2e, ['unsigned short']],
    'NtSystemRoot' : [ 0x30, ['array', 260, ['wchar']]],
    'MaxStackTraceDepth' : [ 0x238, ['unsigned long']],
    'CryptoExponent' : [ 0x23c, ['unsigned long']],
    'TimeZoneId' : [ 0x240, ['unsigned long']],
    'LargePageMinimum' : [ 0x244, ['unsigned long']],
    'AitSamplingValue' : [ 0x248, ['unsigned long']],
    'AppCompatFlag' : [ 0x24c, ['unsigned long']],
    'RNGSeedVersion' : [ 0x250, ['unsigned long long']],
    'GlobalValidationRunlevel' : [ 0x258, ['unsigned long']],
    'TimeZoneBiasStamp' : [ 0x25c, ['long']],
    'NtBuildNumber' : [ 0x260, ['unsigned long']],
    'NtProductType' : [ 0x264, ['Enumeration', dict(target = 'long', choices = {1: u'NtProductWinNt', 2: u'NtProductLanManNt', 3: u'NtProductServer'})]],
    'ProductTypeIsValid' : [ 0x268, ['unsigned char']],
    'Reserved0' : [ 0x269, ['array', 1, ['unsigned char']]],
    'NativeProcessorArchitecture' : [ 0x26a, ['unsigned short']],
    'NtMajorVersion' : [ 0x26c, ['unsigned long']],
    'NtMinorVersion' : [ 0x270, ['unsigned long']],
    'ProcessorFeatures' : [ 0x274, ['array', 64, ['unsigned char']]],
    'Reserved1' : [ 0x2b4, ['unsigned long']],
    'Reserved3' : [ 0x2b8, ['unsigned long']],
    'TimeSlip' : [ 0x2bc, ['unsigned long']],
    'AlternativeArchitecture' : [ 0x2c0, ['Enumeration', dict(target = 'long', choices = {0: u'StandardDesign', 1: u'NEC98x86', 2: u'EndAlternatives'})]],
    'BootId' : [ 0x2c4, ['unsigned long']],
    'SystemExpirationDate' : [ 0x2c8, ['_LARGE_INTEGER']],
    'SuiteMask' : [ 0x2d0, ['unsigned long']],
    'KdDebuggerEnabled' : [ 0x2d4, ['unsigned char']],
    'MitigationPolicies' : [ 0x2d5, ['unsigned char']],
    'NXSupportPolicy' : [ 0x2d5, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'SEHValidationPolicy' : [ 0x2d5, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned char')]],
    'CurDirDevicesSkippedForDlls' : [ 0x2d5, ['BitField', dict(start_bit = 4, end_bit = 6, native_type='unsigned char')]],
    'Reserved' : [ 0x2d5, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'CyclesPerYield' : [ 0x2d6, ['unsigned short']],
    'ActiveConsoleId' : [ 0x2d8, ['unsigned long']],
    'DismountCount' : [ 0x2dc, ['unsigned long']],
    'ComPlusPackage' : [ 0x2e0, ['unsigned long']],
    'LastSystemRITEventTickCount' : [ 0x2e4, ['unsigned long']],
    'NumberOfPhysicalPages' : [ 0x2e8, ['unsigned long']],
    'SafeBootMode' : [ 0x2ec, ['unsigned char']],
    'VirtualizationFlags' : [ 0x2ed, ['unsigned char']],
    'Reserved12' : [ 0x2ee, ['array', 2, ['unsigned char']]],
    'SharedDataFlags' : [ 0x2f0, ['unsigned long']],
    'DbgErrorPortPresent' : [ 0x2f0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DbgElevationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DbgVirtEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DbgInstallerDetectEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DbgLkgEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DbgDynProcessorEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DbgConsoleBrokerEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DbgSecureBootEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'DbgMultiSessionSku' : [ 0x2f0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'DbgMultiUsersInSessionSku' : [ 0x2f0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DbgStateSeparationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'SpareBits' : [ 0x2f0, ['BitField', dict(start_bit = 11, end_bit = 32, native_type='unsigned long')]],
    'DataFlagsPad' : [ 0x2f4, ['array', 1, ['unsigned long']]],
    'TestRetInstruction' : [ 0x2f8, ['unsigned long long']],
    'QpcFrequency' : [ 0x300, ['long long']],
    'SystemCall' : [ 0x308, ['unsigned long']],
    'UserCetAvailableEnvironments' : [ 0x30c, ['__unnamed_17c2']],
    'SystemCallPad' : [ 0x310, ['array', 2, ['unsigned long long']]],
    'TickCount' : [ 0x320, ['_KSYSTEM_TIME']],
    'TickCountQuad' : [ 0x320, ['unsigned long long']],
    'ReservedTickCountOverlay' : [ 0x320, ['array', 3, ['unsigned long']]],
    'TickCountPad' : [ 0x32c, ['array', 1, ['unsigned long']]],
    'Cookie' : [ 0x330, ['unsigned long']],
    'CookiePad' : [ 0x334, ['array', 1, ['unsigned long']]],
    'ConsoleSessionForegroundProcessId' : [ 0x338, ['long long']],
    'TimeUpdateLock' : [ 0x340, ['unsigned long long']],
    'BaselineSystemTimeQpc' : [ 0x348, ['unsigned long long']],
    'BaselineInterruptTimeQpc' : [ 0x350, ['unsigned long long']],
    'QpcSystemTimeIncrement' : [ 0x358, ['unsigned long long']],
    'QpcInterruptTimeIncrement' : [ 0x360, ['unsigned long long']],
    'QpcSystemTimeIncrementShift' : [ 0x368, ['unsigned char']],
    'QpcInterruptTimeIncrementShift' : [ 0x369, ['unsigned char']],
    'UnparkedProcessorCount' : [ 0x36a, ['unsigned short']],
    'EnclaveFeatureMask' : [ 0x36c, ['array', 4, ['unsigned long']]],
    'TelemetryCoverageRound' : [ 0x37c, ['unsigned long']],
    'UserModeGlobalLogger' : [ 0x380, ['array', 16, ['unsigned short']]],
    'ImageFileExecutionOptions' : [ 0x3a0, ['unsigned long']],
    'LangGenerationCount' : [ 0x3a4, ['unsigned long']],
    'Reserved4' : [ 0x3a8, ['unsigned long long']],
    'InterruptTimeBias' : [ 0x3b0, ['unsigned long long']],
    'QpcBias' : [ 0x3b8, ['unsigned long long']],
    'ActiveProcessorCount' : [ 0x3c0, ['unsigned long']],
    'ActiveGroupCount' : [ 0x3c4, ['unsigned char']],
    'Reserved9' : [ 0x3c5, ['unsigned char']],
    'QpcData' : [ 0x3c6, ['unsigned short']],
    'QpcBypassEnabled' : [ 0x3c6, ['unsigned char']],
    'QpcShift' : [ 0x3c7, ['unsigned char']],
    'TimeZoneBiasEffectiveStart' : [ 0x3c8, ['_LARGE_INTEGER']],
    'TimeZoneBiasEffectiveEnd' : [ 0x3d0, ['_LARGE_INTEGER']],
    'XState' : [ 0x3d8, ['_XSTATE_CONFIGURATION']],
    'FeatureConfigurationChangeStamp' : [ 0x710, ['_KSYSTEM_TIME']],
    'Spare' : [ 0x71c, ['unsigned long']],
} ],
  '__unnamed_17db' : [ 0x4, {
    'LongFunction' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Persistent' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Private' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_17dd' : [ 0x4, {
    'Flags' : [ 0x0, ['unsigned long']],
    's' : [ 0x0, ['__unnamed_17db']],
} ],
  '_TP_CALLBACK_ENVIRON_V3' : [ 0x48, {
    'Version' : [ 0x0, ['unsigned long']],
    'Pool' : [ 0x8, ['pointer64', ['_TP_POOL']]],
    'CleanupGroup' : [ 0x10, ['pointer64', ['_TP_CLEANUP_GROUP']]],
    'CleanupGroupCancelCallback' : [ 0x18, ['pointer64', ['void']]],
    'RaceDll' : [ 0x20, ['pointer64', ['void']]],
    'ActivationContext' : [ 0x28, ['pointer64', ['_ACTIVATION_CONTEXT']]],
    'FinalizationCallback' : [ 0x30, ['pointer64', ['void']]],
    'u' : [ 0x38, ['__unnamed_17dd']],
    'CallbackPriority' : [ 0x3c, ['Enumeration', dict(target = 'long', choices = {0: u'TP_CALLBACK_PRIORITY_HIGH', 1: u'TP_CALLBACK_PRIORITY_NORMAL', 2: u'TP_CALLBACK_PRIORITY_LOW', 3: u'TP_CALLBACK_PRIORITY_COUNT'})]],
    'Size' : [ 0x40, ['unsigned long']],
} ],
  '_TEB' : [ 0x1838, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'EnvironmentPointer' : [ 0x38, ['pointer64', ['void']]],
    'ClientId' : [ 0x40, ['_CLIENT_ID']],
    'ActiveRpcHandle' : [ 0x50, ['pointer64', ['void']]],
    'ThreadLocalStoragePointer' : [ 0x58, ['pointer64', ['void']]],
    'ProcessEnvironmentBlock' : [ 0x60, ['pointer64', ['_PEB']]],
    'LastErrorValue' : [ 0x68, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x6c, ['unsigned long']],
    'CsrClientThread' : [ 0x70, ['pointer64', ['void']]],
    'Win32ThreadInfo' : [ 0x78, ['pointer64', ['void']]],
    'User32Reserved' : [ 0x80, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xe8, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0x100, ['pointer64', ['void']]],
    'CurrentLocale' : [ 0x108, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0x10c, ['unsigned long']],
    'ReservedForDebuggerInstrumentation' : [ 0x110, ['array', 16, ['pointer64', ['void']]]],
    'SystemReserved1' : [ 0x190, ['array', 30, ['pointer64', ['void']]]],
    'PlaceholderCompatibilityMode' : [ 0x280, ['unsigned char']],
    'PlaceholderHydrationAlwaysExplicit' : [ 0x281, ['unsigned char']],
    'PlaceholderReserved' : [ 0x282, ['array', 10, ['unsigned char']]],
    'ProxiedProcessId' : [ 0x28c, ['unsigned long']],
    '_ActivationStack' : [ 0x290, ['_ACTIVATION_CONTEXT_STACK']],
    'WorkingOnBehalfTicket' : [ 0x2b8, ['array', 8, ['unsigned char']]],
    'ExceptionCode' : [ 0x2c0, ['long']],
    'Padding0' : [ 0x2c4, ['array', 4, ['unsigned char']]],
    'ActivationContextStackPointer' : [ 0x2c8, ['pointer64', ['_ACTIVATION_CONTEXT_STACK']]],
    'InstrumentationCallbackSp' : [ 0x2d0, ['unsigned long long']],
    'InstrumentationCallbackPreviousPc' : [ 0x2d8, ['unsigned long long']],
    'InstrumentationCallbackPreviousSp' : [ 0x2e0, ['unsigned long long']],
    'TxFsContext' : [ 0x2e8, ['unsigned long']],
    'InstrumentationCallbackDisabled' : [ 0x2ec, ['unsigned char']],
    'UnalignedLoadStoreExceptions' : [ 0x2ed, ['unsigned char']],
    'Padding1' : [ 0x2ee, ['array', 2, ['unsigned char']]],
    'GdiTebBatch' : [ 0x2f0, ['_GDI_TEB_BATCH']],
    'RealClientId' : [ 0x7d8, ['_CLIENT_ID']],
    'GdiCachedProcessHandle' : [ 0x7e8, ['pointer64', ['void']]],
    'GdiClientPID' : [ 0x7f0, ['unsigned long']],
    'GdiClientTID' : [ 0x7f4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x7f8, ['pointer64', ['void']]],
    'Win32ClientInfo' : [ 0x800, ['array', 62, ['unsigned long long']]],
    'glDispatchTable' : [ 0x9f0, ['array', 233, ['pointer64', ['void']]]],
    'glReserved1' : [ 0x1138, ['array', 29, ['unsigned long long']]],
    'glReserved2' : [ 0x1220, ['pointer64', ['void']]],
    'glSectionInfo' : [ 0x1228, ['pointer64', ['void']]],
    'glSection' : [ 0x1230, ['pointer64', ['void']]],
    'glTable' : [ 0x1238, ['pointer64', ['void']]],
    'glCurrentRC' : [ 0x1240, ['pointer64', ['void']]],
    'glContext' : [ 0x1248, ['pointer64', ['void']]],
    'LastStatusValue' : [ 0x1250, ['unsigned long']],
    'Padding2' : [ 0x1254, ['array', 4, ['unsigned char']]],
    'StaticUnicodeString' : [ 0x1258, ['_UNICODE_STRING']],
    'StaticUnicodeBuffer' : [ 0x1268, ['array', 261, ['wchar']]],
    'Padding3' : [ 0x1472, ['array', 6, ['unsigned char']]],
    'DeallocationStack' : [ 0x1478, ['pointer64', ['void']]],
    'TlsSlots' : [ 0x1480, ['array', 64, ['pointer64', ['void']]]],
    'TlsLinks' : [ 0x1680, ['_LIST_ENTRY']],
    'Vdm' : [ 0x1690, ['pointer64', ['void']]],
    'ReservedForNtRpc' : [ 0x1698, ['pointer64', ['void']]],
    'DbgSsReserved' : [ 0x16a0, ['array', 2, ['pointer64', ['void']]]],
    'HardErrorMode' : [ 0x16b0, ['unsigned long']],
    'Padding4' : [ 0x16b4, ['array', 4, ['unsigned char']]],
    'Instrumentation' : [ 0x16b8, ['array', 11, ['pointer64', ['void']]]],
    'ActivityId' : [ 0x1710, ['_GUID']],
    'SubProcessTag' : [ 0x1720, ['pointer64', ['void']]],
    'PerflibData' : [ 0x1728, ['pointer64', ['void']]],
    'EtwTraceData' : [ 0x1730, ['pointer64', ['void']]],
    'WinSockData' : [ 0x1738, ['pointer64', ['void']]],
    'GdiBatchCount' : [ 0x1740, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0x1744, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0x1744, ['unsigned long']],
    'ReservedPad0' : [ 0x1744, ['unsigned char']],
    'ReservedPad1' : [ 0x1745, ['unsigned char']],
    'ReservedPad2' : [ 0x1746, ['unsigned char']],
    'IdealProcessor' : [ 0x1747, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0x1748, ['unsigned long']],
    'Padding5' : [ 0x174c, ['array', 4, ['unsigned char']]],
    'ReservedForPerf' : [ 0x1750, ['pointer64', ['void']]],
    'ReservedForOle' : [ 0x1758, ['pointer64', ['void']]],
    'WaitingOnLoaderLock' : [ 0x1760, ['unsigned long']],
    'Padding6' : [ 0x1764, ['array', 4, ['unsigned char']]],
    'SavedPriorityState' : [ 0x1768, ['pointer64', ['void']]],
    'ReservedForCodeCoverage' : [ 0x1770, ['unsigned long long']],
    'ThreadPoolData' : [ 0x1778, ['pointer64', ['void']]],
    'TlsExpansionSlots' : [ 0x1780, ['pointer64', ['pointer64', ['void']]]],
    'DeallocationBStore' : [ 0x1788, ['pointer64', ['void']]],
    'BStoreLimit' : [ 0x1790, ['pointer64', ['void']]],
    'MuiGeneration' : [ 0x1798, ['unsigned long']],
    'IsImpersonating' : [ 0x179c, ['unsigned long']],
    'NlsCache' : [ 0x17a0, ['pointer64', ['void']]],
    'pShimData' : [ 0x17a8, ['pointer64', ['void']]],
    'HeapData' : [ 0x17b0, ['unsigned long']],
    'Padding7' : [ 0x17b4, ['array', 4, ['unsigned char']]],
    'CurrentTransactionHandle' : [ 0x17b8, ['pointer64', ['void']]],
    'ActiveFrame' : [ 0x17c0, ['pointer64', ['_TEB_ACTIVE_FRAME']]],
    'FlsData' : [ 0x17c8, ['pointer64', ['void']]],
    'PreferredLanguages' : [ 0x17d0, ['pointer64', ['void']]],
    'UserPrefLanguages' : [ 0x17d8, ['pointer64', ['void']]],
    'MergedPrefLanguages' : [ 0x17e0, ['pointer64', ['void']]],
    'MuiImpersonation' : [ 0x17e8, ['unsigned long']],
    'CrossTebFlags' : [ 0x17ec, ['unsigned short']],
    'SpareCrossTebBits' : [ 0x17ec, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0x17ee, ['unsigned short']],
    'SafeThunkCall' : [ 0x17ee, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0x17ee, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0x17ee, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0x17ee, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0x17ee, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0x17ee, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0x17ee, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0x17ee, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0x17ee, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0x17ee, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0x17ee, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SessionAware' : [ 0x17ee, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
    'LoadOwner' : [ 0x17ee, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
    'LoaderWorker' : [ 0x17ee, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
    'SkipLoaderInit' : [ 0x17ee, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0x17ee, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0x17f0, ['pointer64', ['void']]],
    'TxnScopeExitCallback' : [ 0x17f8, ['pointer64', ['void']]],
    'TxnScopeContext' : [ 0x1800, ['pointer64', ['void']]],
    'LockCount' : [ 0x1808, ['unsigned long']],
    'WowTebOffset' : [ 0x180c, ['long']],
    'ResourceRetValue' : [ 0x1810, ['pointer64', ['void']]],
    'ReservedForWdf' : [ 0x1818, ['pointer64', ['void']]],
    'ReservedForCrt' : [ 0x1820, ['unsigned long long']],
    'EffectiveContainerId' : [ 0x1828, ['_GUID']],
} ],
  '_IMAGE_NT_HEADERS64' : [ 0x108, {
    'Signature' : [ 0x0, ['unsigned long']],
    'FileHeader' : [ 0x4, ['_IMAGE_FILE_HEADER']],
    'OptionalHeader' : [ 0x18, ['_IMAGE_OPTIONAL_HEADER64']],
} ],
  '_IMAGE_DOS_HEADER' : [ 0x40, {
    'e_magic' : [ 0x0, ['unsigned short']],
    'e_cblp' : [ 0x2, ['unsigned short']],
    'e_cp' : [ 0x4, ['unsigned short']],
    'e_crlc' : [ 0x6, ['unsigned short']],
    'e_cparhdr' : [ 0x8, ['unsigned short']],
    'e_minalloc' : [ 0xa, ['unsigned short']],
    'e_maxalloc' : [ 0xc, ['unsigned short']],
    'e_ss' : [ 0xe, ['unsigned short']],
    'e_sp' : [ 0x10, ['unsigned short']],
    'e_csum' : [ 0x12, ['unsigned short']],
    'e_ip' : [ 0x14, ['unsigned short']],
    'e_cs' : [ 0x16, ['unsigned short']],
    'e_lfarlc' : [ 0x18, ['unsigned short']],
    'e_ovno' : [ 0x1a, ['unsigned short']],
    'e_res' : [ 0x1c, ['array', 4, ['unsigned short']]],
    'e_oemid' : [ 0x24, ['unsigned short']],
    'e_oeminfo' : [ 0x26, ['unsigned short']],
    'e_res2' : [ 0x28, ['array', 10, ['unsigned short']]],
    'e_lfanew' : [ 0x3c, ['long']],
} ],
  '_KPCR' : [ 0xb080, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'GdtBase' : [ 0x0, ['pointer64', ['_KGDTENTRY64']]],
    'TssBase' : [ 0x8, ['pointer64', ['_KTSS64']]],
    'UserRsp' : [ 0x10, ['unsigned long long']],
    'Self' : [ 0x18, ['pointer64', ['_KPCR']]],
    'CurrentPrcb' : [ 0x20, ['pointer64', ['_KPRCB']]],
    'LockArray' : [ 0x28, ['pointer64', ['_KSPIN_LOCK_QUEUE']]],
    'Used_Self' : [ 0x30, ['pointer64', ['void']]],
    'IdtBase' : [ 0x38, ['pointer64', ['_KIDTENTRY64']]],
    'Unused' : [ 0x40, ['array', 2, ['unsigned long long']]],
    'Irql' : [ 0x50, ['unsigned char']],
    'SecondLevelCacheAssociativity' : [ 0x51, ['unsigned char']],
    'ObsoleteNumber' : [ 0x52, ['unsigned char']],
    'Fill0' : [ 0x53, ['unsigned char']],
    'Unused0' : [ 0x54, ['array', 3, ['unsigned long']]],
    'MajorVersion' : [ 0x60, ['unsigned short']],
    'MinorVersion' : [ 0x62, ['unsigned short']],
    'StallScaleFactor' : [ 0x64, ['unsigned long']],
    'Unused1' : [ 0x68, ['array', 3, ['pointer64', ['void']]]],
    'KernelReserved' : [ 0x80, ['array', 15, ['unsigned long']]],
    'SecondLevelCacheSize' : [ 0xbc, ['unsigned long']],
    'HalReserved' : [ 0xc0, ['array', 16, ['unsigned long']]],
    'Unused2' : [ 0x100, ['unsigned long']],
    'KdVersionBlock' : [ 0x108, ['pointer64', ['void']]],
    'Unused3' : [ 0x110, ['pointer64', ['void']]],
    'PcrAlign1' : [ 0x118, ['array', 24, ['unsigned long']]],
    'Prcb' : [ 0x180, ['_KPRCB']],
} ],
  '__unnamed_1845' : [ 0x38, {
    'UpdateCycle' : [ 0x0, ['unsigned long']],
    'PairLocal' : [ 0x4, ['short']],
    'PairLocalLow' : [ 0x4, ['unsigned char']],
    'PairLocalForceStibp' : [ 0x5, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Reserved' : [ 0x5, ['BitField', dict(start_bit = 1, end_bit = 5, native_type='unsigned char')]],
    'Frozen' : [ 0x5, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'ForceUntrusted' : [ 0x5, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'SynchIpi' : [ 0x5, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'PairRemote' : [ 0x6, ['short']],
    'PairRemoteLow' : [ 0x6, ['unsigned char']],
    'Reserved2' : [ 0x7, ['unsigned char']],
    'Trace' : [ 0x8, ['array', 24, ['unsigned char']]],
    'LocalDomain' : [ 0x20, ['unsigned long long']],
    'RemoteDomain' : [ 0x28, ['unsigned long long']],
    'Thread' : [ 0x30, ['pointer64', ['_KTHREAD']]],
} ],
  '_KPRCB' : [ 0xaf00, {
    'MxCsr' : [ 0x0, ['unsigned long']],
    'LegacyNumber' : [ 0x4, ['unsigned char']],
    'ReservedMustBeZero' : [ 0x5, ['unsigned char']],
    'InterruptRequest' : [ 0x6, ['unsigned char']],
    'IdleHalt' : [ 0x7, ['unsigned char']],
    'CurrentThread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
    'NextThread' : [ 0x10, ['pointer64', ['_KTHREAD']]],
    'IdleThread' : [ 0x18, ['pointer64', ['_KTHREAD']]],
    'NestingLevel' : [ 0x20, ['unsigned char']],
    'ClockOwner' : [ 0x21, ['unsigned char']],
    'PendingTickFlags' : [ 0x22, ['unsigned char']],
    'PendingTick' : [ 0x22, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'PendingBackupTick' : [ 0x22, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'IdleState' : [ 0x23, ['unsigned char']],
    'Number' : [ 0x24, ['unsigned long']],
    'RspBase' : [ 0x28, ['unsigned long long']],
    'PrcbLock' : [ 0x30, ['unsigned long long']],
    'PriorityState' : [ 0x38, ['pointer64', ['unsigned char']]],
    'CpuType' : [ 0x40, ['unsigned char']],
    'CpuID' : [ 0x41, ['unsigned char']],
    'CpuStep' : [ 0x42, ['unsigned short']],
    'CpuStepping' : [ 0x42, ['unsigned char']],
    'CpuModel' : [ 0x43, ['unsigned char']],
    'MHz' : [ 0x44, ['unsigned long']],
    'HalReserved' : [ 0x48, ['array', 8, ['unsigned long long']]],
    'MinorVersion' : [ 0x88, ['unsigned short']],
    'MajorVersion' : [ 0x8a, ['unsigned short']],
    'BuildType' : [ 0x8c, ['unsigned char']],
    'CpuVendor' : [ 0x8d, ['unsigned char']],
    'CoresPerPhysicalProcessor' : [ 0x8e, ['unsigned char']],
    'LogicalProcessorsPerCore' : [ 0x8f, ['unsigned char']],
    'TscFrequency' : [ 0x90, ['unsigned long long']],
    'PrcbPad04' : [ 0x98, ['array', 5, ['unsigned long long']]],
    'ParentNode' : [ 0xc0, ['pointer64', ['_KNODE']]],
    'GroupSetMember' : [ 0xc8, ['unsigned long long']],
    'Group' : [ 0xd0, ['unsigned char']],
    'GroupIndex' : [ 0xd1, ['unsigned char']],
    'PrcbPad05' : [ 0xd2, ['array', 2, ['unsigned char']]],
    'InitialApicId' : [ 0xd4, ['unsigned long']],
    'ScbOffset' : [ 0xd8, ['unsigned long']],
    'ApicMask' : [ 0xdc, ['unsigned long']],
    'AcpiReserved' : [ 0xe0, ['pointer64', ['void']]],
    'CFlushSize' : [ 0xe8, ['unsigned long']],
    'PrcbFlags' : [ 0xec, ['_KPRCBFLAG']],
    'TrappedSecurityDomain' : [ 0xf0, ['unsigned long long']],
    'BpbState' : [ 0xf8, ['unsigned char']],
    'BpbCpuIdle' : [ 0xf8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'BpbFlushRsbOnTrap' : [ 0xf8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'BpbIbpbOnReturn' : [ 0xf8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'BpbIbpbOnTrap' : [ 0xf8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'BpbIbpbOnRetpolineExit' : [ 0xf8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'BpbStateReserved' : [ 0xf8, ['BitField', dict(start_bit = 5, end_bit = 8, native_type='unsigned char')]],
    'BpbFeatures' : [ 0xf9, ['unsigned char']],
    'BpbClearOnIdle' : [ 0xf9, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'BpbEnabled' : [ 0xf9, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'BpbSmep' : [ 0xf9, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'BpbFeaturesReserved' : [ 0xf9, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned char')]],
    'BpbCurrentSpecCtrl' : [ 0xfa, ['unsigned char']],
    'BpbKernelSpecCtrl' : [ 0xfb, ['unsigned char']],
    'BpbNmiSpecCtrl' : [ 0xfc, ['unsigned char']],
    'BpbUserSpecCtrl' : [ 0xfd, ['unsigned char']],
    'PairRegister' : [ 0xfe, ['short']],
    'PrcbPad11' : [ 0xf0, ['array', 2, ['unsigned long long']]],
    'ProcessorState' : [ 0x100, ['_KPROCESSOR_STATE']],
    'ExtendedSupervisorState' : [ 0x6c0, ['pointer64', ['_XSAVE_AREA_HEADER']]],
    'ProcessorSignature' : [ 0x6c8, ['unsigned long']],
    'ProcessorFlags' : [ 0x6cc, ['unsigned long']],
    'BpbRetpolineExitSpecCtrl' : [ 0x6d0, ['unsigned char']],
    'BpbTrappedRetpolineExitSpecCtrl' : [ 0x6d1, ['unsigned char']],
    'BpbTrappedBpbState' : [ 0x6d2, ['unsigned char']],
    'BpbTrappedCpuIdle' : [ 0x6d2, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'BpbTrappedFlushRsbOnTrap' : [ 0x6d2, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'BpbTrappedIbpbOnReturn' : [ 0x6d2, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'BpbTrappedIbpbOnTrap' : [ 0x6d2, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'BpbTrappedIbpbOnRetpolineExit' : [ 0x6d2, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'BpbtrappedBpbStateReserved' : [ 0x6d2, ['BitField', dict(start_bit = 5, end_bit = 8, native_type='unsigned char')]],
    'BpbRetpolineState' : [ 0x6d3, ['unsigned char']],
    'BpbRunningNonRetpolineCode' : [ 0x6d3, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'BpbIndirectCallsSafe' : [ 0x6d3, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'BpbRetpolineEnabled' : [ 0x6d3, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'BpbRetpolineStateReserved' : [ 0x6d3, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned char')]],
    'PrcbPad12b' : [ 0x6d4, ['unsigned long']],
    'PrcbPad12a' : [ 0x6d0, ['unsigned long long']],
    'PrcbPad12' : [ 0x6d8, ['array', 3, ['unsigned long long']]],
    'LockQueue' : [ 0x6f0, ['array', 17, ['_KSPIN_LOCK_QUEUE']]],
    'PPLookasideList' : [ 0x800, ['array', 16, ['_PP_LOOKASIDE_LIST']]],
    'PPNxPagedLookasideList' : [ 0x900, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PPNPagedLookasideList' : [ 0x1500, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PPPagedLookasideList' : [ 0x2100, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'MsrIa32TsxCtrl' : [ 0x2d00, ['unsigned long long']],
    'DeferredReadyListHead' : [ 0x2d08, ['_SINGLE_LIST_ENTRY']],
    'MmPageFaultCount' : [ 0x2d10, ['long']],
    'MmCopyOnWriteCount' : [ 0x2d14, ['long']],
    'MmTransitionCount' : [ 0x2d18, ['long']],
    'MmDemandZeroCount' : [ 0x2d1c, ['long']],
    'MmPageReadCount' : [ 0x2d20, ['long']],
    'MmPageReadIoCount' : [ 0x2d24, ['long']],
    'MmDirtyPagesWriteCount' : [ 0x2d28, ['long']],
    'MmDirtyWriteIoCount' : [ 0x2d2c, ['long']],
    'MmMappedPagesWriteCount' : [ 0x2d30, ['long']],
    'MmMappedWriteIoCount' : [ 0x2d34, ['long']],
    'KeSystemCalls' : [ 0x2d38, ['unsigned long']],
    'KeContextSwitches' : [ 0x2d3c, ['unsigned long']],
    'PrcbPad40' : [ 0x2d40, ['unsigned long']],
    'CcFastReadNoWait' : [ 0x2d44, ['unsigned long']],
    'CcFastReadWait' : [ 0x2d48, ['unsigned long']],
    'CcFastReadNotPossible' : [ 0x2d4c, ['unsigned long']],
    'CcCopyReadNoWait' : [ 0x2d50, ['unsigned long']],
    'CcCopyReadWait' : [ 0x2d54, ['unsigned long']],
    'CcCopyReadNoWaitMiss' : [ 0x2d58, ['unsigned long']],
    'IoReadOperationCount' : [ 0x2d5c, ['long']],
    'IoWriteOperationCount' : [ 0x2d60, ['long']],
    'IoOtherOperationCount' : [ 0x2d64, ['long']],
    'IoReadTransferCount' : [ 0x2d68, ['_LARGE_INTEGER']],
    'IoWriteTransferCount' : [ 0x2d70, ['_LARGE_INTEGER']],
    'IoOtherTransferCount' : [ 0x2d78, ['_LARGE_INTEGER']],
    'PacketBarrier' : [ 0x2d80, ['long']],
    'TargetCount' : [ 0x2d84, ['long']],
    'IpiFrozen' : [ 0x2d88, ['unsigned long']],
    'PrcbPad30' : [ 0x2d8c, ['unsigned long']],
    'IsrDpcStats' : [ 0x2d90, ['pointer64', ['void']]],
    'DeviceInterrupts' : [ 0x2d98, ['unsigned long']],
    'LookasideIrpFloat' : [ 0x2d9c, ['long']],
    'InterruptLastCount' : [ 0x2da0, ['unsigned long']],
    'InterruptRate' : [ 0x2da4, ['unsigned long']],
    'PrcbPad31' : [ 0x2da8, ['unsigned long long']],
    'PairPrcb' : [ 0x2db0, ['pointer64', ['_KPRCB']]],
    'StaticAffinity' : [ 0x2db8, ['_KSTATIC_AFFINITY_BLOCK']],
    'PrcbPad35' : [ 0x3058, ['array', 5, ['unsigned long long']]],
    'InterruptObjectPool' : [ 0x3080, ['_SLIST_HEADER']],
    'DpcRuntimeHistoryHashTable' : [ 0x3090, ['pointer64', ['_RTL_HASH_TABLE']]],
    'DpcRuntimeHistoryHashTableCleanupDpc' : [ 0x3098, ['pointer64', ['_KDPC']]],
    'CurrentDpcRoutine' : [ 0x30a0, ['pointer64', ['void']]],
    'CurrentDpcRuntimeHistoryCached' : [ 0x30a8, ['unsigned long long']],
    'CurrentDpcStartTime' : [ 0x30b0, ['unsigned long long']],
    'PrcbPad41' : [ 0x30b8, ['array', 1, ['unsigned long long']]],
    'DpcData' : [ 0x30c0, ['array', 2, ['_KDPC_DATA']]],
    'DpcStack' : [ 0x3110, ['pointer64', ['void']]],
    'MaximumDpcQueueDepth' : [ 0x3118, ['long']],
    'DpcRequestRate' : [ 0x311c, ['unsigned long']],
    'MinimumDpcRate' : [ 0x3120, ['unsigned long']],
    'DpcLastCount' : [ 0x3124, ['unsigned long']],
    'ThreadDpcEnable' : [ 0x3128, ['unsigned char']],
    'QuantumEnd' : [ 0x3129, ['unsigned char']],
    'DpcRoutineActive' : [ 0x312a, ['unsigned char']],
    'IdleSchedule' : [ 0x312b, ['unsigned char']],
    'DpcRequestSummary' : [ 0x312c, ['long']],
    'DpcRequestSlot' : [ 0x312c, ['array', 2, ['short']]],
    'NormalDpcState' : [ 0x312c, ['short']],
    'ThreadDpcState' : [ 0x312e, ['short']],
    'DpcNormalProcessingActive' : [ 0x312c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DpcNormalProcessingRequested' : [ 0x312c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DpcNormalThreadSignal' : [ 0x312c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DpcNormalTimerExpiration' : [ 0x312c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DpcNormalDpcPresent' : [ 0x312c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DpcNormalLocalInterrupt' : [ 0x312c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DpcNormalSpare' : [ 0x312c, ['BitField', dict(start_bit = 6, end_bit = 16, native_type='unsigned long')]],
    'DpcThreadActive' : [ 0x312c, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'DpcThreadRequested' : [ 0x312c, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'DpcThreadSpare' : [ 0x312c, ['BitField', dict(start_bit = 18, end_bit = 32, native_type='unsigned long')]],
    'PrcbPad93' : [ 0x3130, ['unsigned long']],
    'LastTick' : [ 0x3134, ['unsigned long']],
    'ClockInterrupts' : [ 0x3138, ['unsigned long']],
    'ReadyScanTick' : [ 0x313c, ['unsigned long']],
    'InterruptObject' : [ 0x3140, ['array', 256, ['pointer64', ['void']]]],
    'TimerTable' : [ 0x3940, ['_KTIMER_TABLE']],
    'PrcbPad92' : [ 0x7b58, ['array', 10, ['unsigned long']]],
    'DpcGate' : [ 0x7b80, ['_KGATE']],
    'PrcbPad52' : [ 0x7b98, ['pointer64', ['void']]],
    'CallDpc' : [ 0x7ba0, ['_KDPC']],
    'ClockKeepAlive' : [ 0x7be0, ['long']],
    'PrcbPad60' : [ 0x7be4, ['array', 2, ['unsigned char']]],
    'NmiActive' : [ 0x7be6, ['unsigned char']],
    'MceActive' : [ 0x7be7, ['unsigned char']],
    'CombinedNmiMceActive' : [ 0x7be6, ['unsigned short']],
    'DpcWatchdogPeriod' : [ 0x7be8, ['long']],
    'DpcWatchdogCount' : [ 0x7bec, ['long']],
    'KeSpinLockOrdering' : [ 0x7bf0, ['long']],
    'DpcWatchdogProfileCumulativeDpcThreshold' : [ 0x7bf4, ['unsigned long']],
    'CachedPtes' : [ 0x7bf8, ['pointer64', ['void']]],
    'WaitListHead' : [ 0x7c00, ['_LIST_ENTRY']],
    'WaitLock' : [ 0x7c10, ['unsigned long long']],
    'ReadySummary' : [ 0x7c18, ['unsigned long']],
    'AffinitizedSelectionMask' : [ 0x7c1c, ['long']],
    'QueueIndex' : [ 0x7c20, ['unsigned long']],
    'PrcbPad75' : [ 0x7c24, ['array', 2, ['unsigned long']]],
    'DpcWatchdogSequenceNumber' : [ 0x7c2c, ['unsigned long']],
    'TimerExpirationDpc' : [ 0x7c30, ['_KDPC']],
    'ScbQueue' : [ 0x7c70, ['_RTL_RB_TREE']],
    'DispatcherReadyListHead' : [ 0x7c80, ['array', 32, ['_LIST_ENTRY']]],
    'InterruptCount' : [ 0x7e80, ['unsigned long']],
    'KernelTime' : [ 0x7e84, ['unsigned long']],
    'UserTime' : [ 0x7e88, ['unsigned long']],
    'DpcTime' : [ 0x7e8c, ['unsigned long']],
    'InterruptTime' : [ 0x7e90, ['unsigned long']],
    'AdjustDpcThreshold' : [ 0x7e94, ['unsigned long']],
    'DebuggerSavedIRQL' : [ 0x7e98, ['unsigned char']],
    'GroupSchedulingOverQuota' : [ 0x7e99, ['unsigned char']],
    'DeepSleep' : [ 0x7e9a, ['unsigned char']],
    'PrcbPad80' : [ 0x7e9b, ['unsigned char']],
    'DpcTimeCount' : [ 0x7e9c, ['unsigned long']],
    'DpcTimeLimit' : [ 0x7ea0, ['unsigned long']],
    'PeriodicCount' : [ 0x7ea4, ['unsigned long']],
    'PeriodicBias' : [ 0x7ea8, ['unsigned long']],
    'AvailableTime' : [ 0x7eac, ['unsigned long']],
    'KeExceptionDispatchCount' : [ 0x7eb0, ['unsigned long']],
    'ReadyThreadCount' : [ 0x7eb4, ['unsigned long']],
    'ReadyQueueExpectedRunTime' : [ 0x7eb8, ['unsigned long long']],
    'StartCycles' : [ 0x7ec0, ['unsigned long long']],
    'TaggedCyclesStart' : [ 0x7ec8, ['unsigned long long']],
    'TaggedCycles' : [ 0x7ed0, ['array', 3, ['unsigned long long']]],
    'AffinitizedCycles' : [ 0x7ee8, ['unsigned long long']],
    'ImportantCycles' : [ 0x7ef0, ['unsigned long long']],
    'UnimportantCycles' : [ 0x7ef8, ['unsigned long long']],
    'DpcWatchdogProfileSingleDpcThreshold' : [ 0x7f00, ['unsigned long']],
    'MmSpinLockOrdering' : [ 0x7f04, ['long']],
    'CachedStack' : [ 0x7f08, ['pointer64', ['void']]],
    'PageColor' : [ 0x7f10, ['unsigned long']],
    'NodeColor' : [ 0x7f14, ['unsigned long']],
    'NodeShiftedColor' : [ 0x7f18, ['unsigned long']],
    'SecondaryColorMask' : [ 0x7f1c, ['unsigned long']],
    'PrcbPad81' : [ 0x7f20, ['array', 6, ['unsigned char']]],
    'ExceptionStackActive' : [ 0x7f26, ['unsigned char']],
    'TbFlushListActive' : [ 0x7f27, ['unsigned char']],
    'ExceptionStack' : [ 0x7f28, ['pointer64', ['void']]],
    'PrcbPad82' : [ 0x7f30, ['array', 1, ['unsigned long long']]],
    'CycleTime' : [ 0x7f38, ['unsigned long long']],
    'Cycles' : [ 0x7f40, ['array', 4, ['array', 2, ['unsigned long long']]]],
    'CcFastMdlReadNoWait' : [ 0x7f80, ['unsigned long']],
    'CcFastMdlReadWait' : [ 0x7f84, ['unsigned long']],
    'CcFastMdlReadNotPossible' : [ 0x7f88, ['unsigned long']],
    'CcMapDataNoWait' : [ 0x7f8c, ['unsigned long']],
    'CcMapDataWait' : [ 0x7f90, ['unsigned long']],
    'CcPinMappedDataCount' : [ 0x7f94, ['unsigned long']],
    'CcPinReadNoWait' : [ 0x7f98, ['unsigned long']],
    'CcPinReadWait' : [ 0x7f9c, ['unsigned long']],
    'CcMdlReadNoWait' : [ 0x7fa0, ['unsigned long']],
    'CcMdlReadWait' : [ 0x7fa4, ['unsigned long']],
    'CcLazyWriteHotSpots' : [ 0x7fa8, ['unsigned long']],
    'CcLazyWriteIos' : [ 0x7fac, ['unsigned long']],
    'CcLazyWritePages' : [ 0x7fb0, ['unsigned long']],
    'CcDataFlushes' : [ 0x7fb4, ['unsigned long']],
    'CcDataPages' : [ 0x7fb8, ['unsigned long']],
    'CcLostDelayedWrites' : [ 0x7fbc, ['unsigned long']],
    'CcFastReadResourceMiss' : [ 0x7fc0, ['unsigned long']],
    'CcCopyReadWaitMiss' : [ 0x7fc4, ['unsigned long']],
    'CcFastMdlReadResourceMiss' : [ 0x7fc8, ['unsigned long']],
    'CcMapDataNoWaitMiss' : [ 0x7fcc, ['unsigned long']],
    'CcMapDataWaitMiss' : [ 0x7fd0, ['unsigned long']],
    'CcPinReadNoWaitMiss' : [ 0x7fd4, ['unsigned long']],
    'CcPinReadWaitMiss' : [ 0x7fd8, ['unsigned long']],
    'CcMdlReadNoWaitMiss' : [ 0x7fdc, ['unsigned long']],
    'CcMdlReadWaitMiss' : [ 0x7fe0, ['unsigned long']],
    'CcReadAheadIos' : [ 0x7fe4, ['unsigned long']],
    'MmCacheTransitionCount' : [ 0x7fe8, ['long']],
    'MmCacheReadCount' : [ 0x7fec, ['long']],
    'MmCacheIoCount' : [ 0x7ff0, ['long']],
    'PrcbPad91' : [ 0x7ff4, ['unsigned long']],
    'MmInternal' : [ 0x7ff8, ['pointer64', ['void']]],
    'PowerState' : [ 0x8000, ['_PROCESSOR_POWER_STATE']],
    'HyperPte' : [ 0x8200, ['pointer64', ['void']]],
    'ScbList' : [ 0x8208, ['_LIST_ENTRY']],
    'ForceIdleDpc' : [ 0x8218, ['_KDPC']],
    'DpcWatchdogDpc' : [ 0x8258, ['_KDPC']],
    'DpcWatchdogTimer' : [ 0x8298, ['_KTIMER']],
    'Cache' : [ 0x82d8, ['array', 5, ['_CACHE_DESCRIPTOR']]],
    'CacheCount' : [ 0x8314, ['unsigned long']],
    'CachedCommit' : [ 0x8318, ['unsigned long']],
    'CachedResidentAvailable' : [ 0x831c, ['unsigned long']],
    'WheaInfo' : [ 0x8320, ['pointer64', ['void']]],
    'EtwSupport' : [ 0x8328, ['pointer64', ['void']]],
    'ExSaPageArray' : [ 0x8330, ['pointer64', ['void']]],
    'KeAlignmentFixupCount' : [ 0x8338, ['unsigned long']],
    'PrcbPad95' : [ 0x833c, ['unsigned long']],
    'HypercallPageList' : [ 0x8340, ['_SLIST_HEADER']],
    'StatisticsPage' : [ 0x8350, ['pointer64', ['unsigned long long']]],
    'GenerationTarget' : [ 0x8358, ['unsigned long long']],
    'PrcbPad85' : [ 0x8360, ['array', 4, ['unsigned long long']]],
    'HypercallCachedPages' : [ 0x8380, ['pointer64', ['void']]],
    'VirtualApicAssist' : [ 0x8388, ['pointer64', ['void']]],
    'PackageProcessorSet' : [ 0x8390, ['_KAFFINITY_EX']],
    'PackageId' : [ 0x8438, ['unsigned long']],
    'PrcbPad86' : [ 0x843c, ['unsigned long']],
    'SharedReadyQueueMask' : [ 0x8440, ['unsigned long long']],
    'SharedReadyQueue' : [ 0x8448, ['pointer64', ['_KSHARED_READY_QUEUE']]],
    'SharedQueueScanOwner' : [ 0x8450, ['unsigned long']],
    'ScanSiblingIndex' : [ 0x8454, ['unsigned long']],
    'CoreProcessorSet' : [ 0x8458, ['unsigned long long']],
    'ScanSiblingMask' : [ 0x8460, ['unsigned long long']],
    'LLCMask' : [ 0x8468, ['unsigned long long']],
    'CacheProcessorMask' : [ 0x8470, ['array', 5, ['unsigned long long']]],
    'ProcessorProfileControlArea' : [ 0x8498, ['pointer64', ['_PROCESSOR_PROFILE_CONTROL_AREA']]],
    'ProfileEventIndexAddress' : [ 0x84a0, ['pointer64', ['void']]],
    'DpcWatchdogProfile' : [ 0x84a8, ['pointer64', ['pointer64', ['void']]]],
    'DpcWatchdogProfileCurrentEmptyCapture' : [ 0x84b0, ['pointer64', ['pointer64', ['void']]]],
    'SchedulerAssist' : [ 0x84b8, ['pointer64', ['void']]],
    'SynchCounters' : [ 0x84c0, ['_SYNCH_COUNTERS']],
    'PrcbPad94' : [ 0x8578, ['unsigned long long']],
    'FsCounters' : [ 0x8580, ['_FILESYSTEM_DISK_COUNTERS']],
    'VendorString' : [ 0x8590, ['array', 13, ['unsigned char']]],
    'PrcbPad100' : [ 0x859d, ['array', 3, ['unsigned char']]],
    'FeatureBits' : [ 0x85a0, ['unsigned long long']],
    'UpdateSignature' : [ 0x85a8, ['_LARGE_INTEGER']],
    'PteBitCache' : [ 0x85b0, ['unsigned long long']],
    'PteBitOffset' : [ 0x85b8, ['unsigned long']],
    'PrcbPad105' : [ 0x85bc, ['unsigned long']],
    'Context' : [ 0x85c0, ['pointer64', ['_CONTEXT']]],
    'ContextFlagsInit' : [ 0x85c8, ['unsigned long']],
    'PrcbPad115' : [ 0x85cc, ['unsigned long']],
    'ExtendedState' : [ 0x85d0, ['pointer64', ['_XSAVE_AREA']]],
    'IsrStack' : [ 0x85d8, ['pointer64', ['void']]],
    'EntropyTimingState' : [ 0x85e0, ['_KENTROPY_TIMING_STATE']],
    'PrcbPad110' : [ 0x8730, ['unsigned long long']],
    'StibpPairingTrace' : [ 0x8738, ['__unnamed_1845']],
    'AbSelfIoBoostsList' : [ 0x8770, ['_SINGLE_LIST_ENTRY']],
    'AbPropagateBoostsList' : [ 0x8778, ['_SINGLE_LIST_ENTRY']],
    'AbDpc' : [ 0x8780, ['_KDPC']],
    'IoIrpStackProfilerCurrent' : [ 0x87c0, ['_IOP_IRP_STACK_PROFILER']],
    'IoIrpStackProfilerPrevious' : [ 0x8814, ['_IOP_IRP_STACK_PROFILER']],
    'SecureFault' : [ 0x8868, ['_KSECURE_FAULT_INFORMATION']],
    'PrcbPad120' : [ 0x8878, ['unsigned long long']],
    'LocalSharedReadyQueue' : [ 0x8880, ['_KSHARED_READY_QUEUE']],
    'PrcbPad125' : [ 0x8af0, ['array', 2, ['unsigned long long']]],
    'TimerExpirationTraceCount' : [ 0x8b00, ['unsigned long']],
    'PrcbPad127' : [ 0x8b04, ['unsigned long']],
    'TimerExpirationTrace' : [ 0x8b08, ['array', 16, ['_KTIMER_EXPIRATION_TRACE']]],
    'PrcbPad128' : [ 0x8c08, ['array', 7, ['unsigned long long']]],
    'Mailbox' : [ 0x8c40, ['pointer64', ['_REQUEST_MAILBOX']]],
    'PrcbPad130' : [ 0x8c48, ['array', 7, ['unsigned long long']]],
    'McheckContext' : [ 0x8c80, ['array', 2, ['_MACHINE_CHECK_CONTEXT']]],
    'PrcbPad134' : [ 0x8d20, ['array', 4, ['unsigned long long']]],
    'SelfmapLockHandle' : [ 0x8d40, ['array', 4, ['_KLOCK_QUEUE_HANDLE']]],
    'PrcbPad134a' : [ 0x8da0, ['array', 4, ['unsigned long long']]],
    'PrcbPad138' : [ 0x8dc0, ['array', 128, ['unsigned char']]],
    'PrcbPad138a' : [ 0x8e40, ['array', 64, ['unsigned char']]],
    'KernelDirectoryTableBase' : [ 0x8e80, ['unsigned long long']],
    'RspBaseShadow' : [ 0x8e88, ['unsigned long long']],
    'UserRspShadow' : [ 0x8e90, ['unsigned long long']],
    'ShadowFlags' : [ 0x8e98, ['unsigned long']],
    'PrcbPad138b' : [ 0x8e9c, ['unsigned long']],
    'PrcbPad138c' : [ 0x8ea0, ['unsigned long long']],
    'PrcbPad138d' : [ 0x8ea8, ['unsigned short']],
    'VerwSelector' : [ 0x8eaa, ['unsigned short']],
    'DbgMceNestingLevel' : [ 0x8eac, ['unsigned long']],
    'DbgMceFlags' : [ 0x8eb0, ['unsigned long']],
    'PrcbPad139b' : [ 0x8eb4, ['unsigned long']],
    'PrcbPad140' : [ 0x8eb8, ['array', 505, ['unsigned long long']]],
    'PrcbPad140a' : [ 0x9e80, ['array', 8, ['unsigned long long']]],
    'PrcbPad141' : [ 0x9ec0, ['array', 504, ['unsigned long long']]],
    'PrcbPad141a' : [ 0xae80, ['array', 64, ['unsigned char']]],
    'RequestMailbox' : [ 0xaec0, ['array', 1, ['_REQUEST_MAILBOX']]],
} ],
  '__unnamed_185a' : [ 0x10, {
    'Pcid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 12, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 64, native_type='unsigned long long')]],
    'EntirePcid' : [ 0x0, ['unsigned long long']],
    'Virtual' : [ 0x8, ['unsigned long long']],
} ],
  '__unnamed_185c' : [ 0x10, {
    'Pcid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 12, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 64, native_type='unsigned long long')]],
    'EntirePcid' : [ 0x0, ['unsigned long long']],
    'Reserved2' : [ 0x8, ['unsigned long long']],
} ],
  '__unnamed_185e' : [ 0x10, {
    'Reserved' : [ 0x0, ['array', 2, ['unsigned long long']]],
} ],
  '_INVPCID_DESCRIPTOR' : [ 0x10, {
    'IndividualAddress' : [ 0x0, ['__unnamed_185a']],
    'SingleContext' : [ 0x0, ['__unnamed_185c']],
    'AllContextAndGlobals' : [ 0x0, ['__unnamed_185e']],
    'AllContext' : [ 0x0, ['__unnamed_185e']],
} ],
  '_SINGLE_LIST_ENTRY32' : [ 0x4, {
    'Next' : [ 0x0, ['unsigned long']],
} ],
  '_PS_TRUSTLET_CREATE_ATTRIBUTES' : [ 0x18, {
    'TrustletIdentity' : [ 0x0, ['unsigned long long']],
    'Attributes' : [ 0x8, ['array', 1, ['_PS_TRUSTLET_ATTRIBUTE_DATA']]],
} ],
  '_PS_TRUSTLET_ATTRIBUTE_DATA' : [ 0x10, {
    'Header' : [ 0x0, ['_PS_TRUSTLET_ATTRIBUTE_HEADER']],
    'Data' : [ 0x8, ['array', 1, ['unsigned long long']]],
} ],
  '_PS_TRUSTLET_ATTRIBUTE_HEADER' : [ 0x8, {
    'AttributeType' : [ 0x0, ['_PS_TRUSTLET_ATTRIBUTE_TYPE']],
    'InstanceNumber' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
    'Reserved' : [ 0x4, ['BitField', dict(start_bit = 8, end_bit = 32, native_type='unsigned long')]],
} ],
  '_PS_TRUSTLET_ATTRIBUTE_TYPE' : [ 0x4, {
    'Version' : [ 0x0, ['unsigned char']],
    'DataCount' : [ 0x1, ['unsigned char']],
    'SemanticType' : [ 0x2, ['unsigned char']],
    'AccessRights' : [ 0x3, ['_PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS']],
    'AttributeType' : [ 0x0, ['unsigned long']],
} ],
  '_TRUSTLET_MAILBOX_KEY' : [ 0x10, {
    'SecretValue' : [ 0x0, ['array', 2, ['unsigned long long']]],
} ],
  '_TRUSTLET_COLLABORATION_ID' : [ 0x10, {
    'Value' : [ 0x0, ['array', 2, ['unsigned long long']]],
} ],
  '__unnamed_18ab' : [ 0x8, {
    'SecureProcess' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Unused' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
} ],
  '__unnamed_18ad' : [ 0x8, {
    'SecureHandle' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x0, ['__unnamed_18ab']],
} ],
  '_KPROCESS' : [ 0x438, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'ProfileListHead' : [ 0x18, ['_LIST_ENTRY']],
    'DirectoryTableBase' : [ 0x28, ['unsigned long long']],
    'ThreadListHead' : [ 0x30, ['_LIST_ENTRY']],
    'ProcessLock' : [ 0x40, ['unsigned long']],
    'ProcessTimerDelay' : [ 0x44, ['unsigned long']],
    'DeepFreezeStartTime' : [ 0x48, ['unsigned long long']],
    'Affinity' : [ 0x50, ['_KAFFINITY_EX']],
    'AffinityPadding' : [ 0xf8, ['array', 12, ['unsigned long long']]],
    'ReadyListHead' : [ 0x158, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0x168, ['_SINGLE_LIST_ENTRY']],
    'ActiveProcessors' : [ 0x170, ['_KAFFINITY_EX']],
    'ActiveProcessorsPadding' : [ 0x218, ['array', 12, ['unsigned long long']]],
    'AutoAlignment' : [ 0x278, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DisableBoost' : [ 0x278, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DisableQuantum' : [ 0x278, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DeepFreeze' : [ 0x278, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'TimerVirtualization' : [ 0x278, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'CheckStackExtents' : [ 0x278, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'CacheIsolationEnabled' : [ 0x278, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'PpmPolicy' : [ 0x278, ['BitField', dict(start_bit = 7, end_bit = 10, native_type='unsigned long')]],
    'VaSpaceDeleted' : [ 0x278, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ReservedFlags' : [ 0x278, ['BitField', dict(start_bit = 11, end_bit = 32, native_type='unsigned long')]],
    'ProcessFlags' : [ 0x278, ['long']],
    'ActiveGroupsMask' : [ 0x27c, ['unsigned long']],
    'BasePriority' : [ 0x280, ['unsigned char']],
    'QuantumReset' : [ 0x281, ['unsigned char']],
    'Visited' : [ 0x282, ['unsigned char']],
    'Flags' : [ 0x283, ['_KEXECUTE_OPTIONS']],
    'ThreadSeed' : [ 0x284, ['array', 20, ['unsigned short']]],
    'ThreadSeedPadding' : [ 0x2ac, ['array', 12, ['unsigned short']]],
    'IdealProcessor' : [ 0x2c4, ['array', 20, ['unsigned short']]],
    'IdealProcessorPadding' : [ 0x2ec, ['array', 12, ['unsigned short']]],
    'IdealNode' : [ 0x304, ['array', 20, ['unsigned short']]],
    'IdealNodePadding' : [ 0x32c, ['array', 12, ['unsigned short']]],
    'IdealGlobalNode' : [ 0x344, ['unsigned short']],
    'Spare1' : [ 0x346, ['unsigned short']],
    'StackCount' : [ 0x348, ['_KSTACK_COUNT']],
    'ProcessListEntry' : [ 0x350, ['_LIST_ENTRY']],
    'CycleTime' : [ 0x360, ['unsigned long long']],
    'ContextSwitches' : [ 0x368, ['unsigned long long']],
    'SchedulingGroup' : [ 0x370, ['pointer64', ['_KSCHEDULING_GROUP']]],
    'FreezeCount' : [ 0x378, ['unsigned long']],
    'KernelTime' : [ 0x37c, ['unsigned long']],
    'UserTime' : [ 0x380, ['unsigned long']],
    'ReadyTime' : [ 0x384, ['unsigned long']],
    'UserDirectoryTableBase' : [ 0x388, ['unsigned long long']],
    'AddressPolicy' : [ 0x390, ['unsigned char']],
    'Spare2' : [ 0x391, ['array', 71, ['unsigned char']]],
    'InstrumentationCallback' : [ 0x3d8, ['pointer64', ['void']]],
    'SecureState' : [ 0x3e0, ['__unnamed_18ad']],
    'KernelWaitTime' : [ 0x3e8, ['unsigned long long']],
    'UserWaitTime' : [ 0x3f0, ['unsigned long long']],
    'EndPadding' : [ 0x3f8, ['array', 8, ['unsigned long long']]],
} ],
  '_KTHREAD' : [ 0x430, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'SListFaultAddress' : [ 0x18, ['pointer64', ['void']]],
    'QuantumTarget' : [ 0x20, ['unsigned long long']],
    'InitialStack' : [ 0x28, ['pointer64', ['void']]],
    'StackLimit' : [ 0x30, ['pointer64', ['void']]],
    'StackBase' : [ 0x38, ['pointer64', ['void']]],
    'ThreadLock' : [ 0x40, ['unsigned long long']],
    'CycleTime' : [ 0x48, ['unsigned long long']],
    'CurrentRunTime' : [ 0x50, ['unsigned long']],
    'ExpectedRunTime' : [ 0x54, ['unsigned long']],
    'KernelStack' : [ 0x58, ['pointer64', ['void']]],
    'StateSaveArea' : [ 0x60, ['pointer64', ['_XSAVE_FORMAT']]],
    'SchedulingGroup' : [ 0x68, ['pointer64', ['_KSCHEDULING_GROUP']]],
    'WaitRegister' : [ 0x70, ['_KWAIT_STATUS_REGISTER']],
    'Running' : [ 0x71, ['unsigned char']],
    'Alerted' : [ 0x72, ['array', 2, ['unsigned char']]],
    'AutoBoostActive' : [ 0x74, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReadyTransition' : [ 0x74, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'WaitNext' : [ 0x74, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'SystemAffinityActive' : [ 0x74, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Alertable' : [ 0x74, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'UserStackWalkActive' : [ 0x74, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ApcInterruptRequest' : [ 0x74, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'QuantumEndMigrate' : [ 0x74, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'UmsDirectedSwitchEnable' : [ 0x74, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'TimerActive' : [ 0x74, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'SystemThread' : [ 0x74, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ProcessDetachActive' : [ 0x74, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'CalloutActive' : [ 0x74, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'ScbReadyQueue' : [ 0x74, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'ApcQueueable' : [ 0x74, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'ReservedStackInUse' : [ 0x74, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'UmsPerformingSyscall' : [ 0x74, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'TimerSuspended' : [ 0x74, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'SuspendedWaitMode' : [ 0x74, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'SuspendSchedulerApcWait' : [ 0x74, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'CetUserShadowStack' : [ 0x74, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'BypassProcessFreeze' : [ 0x74, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'Reserved' : [ 0x74, ['BitField', dict(start_bit = 22, end_bit = 32, native_type='unsigned long')]],
    'MiscFlags' : [ 0x74, ['long']],
    'ThreadFlagsSpare' : [ 0x78, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned long')]],
    'AutoAlignment' : [ 0x78, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DisableBoost' : [ 0x78, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'AlertedByThreadId' : [ 0x78, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'QuantumDonation' : [ 0x78, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'EnableStackSwap' : [ 0x78, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'GuiThread' : [ 0x78, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'DisableQuantum' : [ 0x78, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'ChargeOnlySchedulingGroup' : [ 0x78, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DeferPreemption' : [ 0x78, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'QueueDeferPreemption' : [ 0x78, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'ForceDeferSchedule' : [ 0x78, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'SharedReadyQueueAffinity' : [ 0x78, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'FreezeCount' : [ 0x78, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'TerminationApcRequest' : [ 0x78, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'AutoBoostEntriesExhausted' : [ 0x78, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'KernelStackResident' : [ 0x78, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'TerminateRequestReason' : [ 0x78, ['BitField', dict(start_bit = 18, end_bit = 20, native_type='unsigned long')]],
    'ProcessStackCountDecremented' : [ 0x78, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'RestrictedGuiThread' : [ 0x78, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'VpBackingThread' : [ 0x78, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'ThreadFlagsSpare2' : [ 0x78, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'EtwStackTraceApcInserted' : [ 0x78, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'ThreadFlags' : [ 0x78, ['long']],
    'Tag' : [ 0x7c, ['unsigned char']],
    'SystemHeteroCpuPolicy' : [ 0x7d, ['unsigned char']],
    'UserHeteroCpuPolicy' : [ 0x7e, ['BitField', dict(start_bit = 0, end_bit = 7, native_type='unsigned char')]],
    'ExplicitSystemHeteroCpuPolicy' : [ 0x7e, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'RunningNonRetpolineCode' : [ 0x7f, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'SpecCtrlSpare' : [ 0x7f, ['BitField', dict(start_bit = 1, end_bit = 8, native_type='unsigned char')]],
    'SpecCtrl' : [ 0x7f, ['unsigned char']],
    'SystemCallNumber' : [ 0x80, ['unsigned long']],
    'ReadyTime' : [ 0x84, ['unsigned long']],
    'FirstArgument' : [ 0x88, ['pointer64', ['void']]],
    'TrapFrame' : [ 0x90, ['pointer64', ['_KTRAP_FRAME']]],
    'ApcState' : [ 0x98, ['_KAPC_STATE']],
    'ApcStateFill' : [ 0x98, ['array', 43, ['unsigned char']]],
    'Priority' : [ 0xc3, ['unsigned char']],
    'UserIdealProcessor' : [ 0xc4, ['unsigned long']],
    'WaitStatus' : [ 0xc8, ['long long']],
    'WaitBlockList' : [ 0xd0, ['pointer64', ['_KWAIT_BLOCK']]],
    'WaitListEntry' : [ 0xd8, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0xd8, ['_SINGLE_LIST_ENTRY']],
    'Queue' : [ 0xe8, ['pointer64', ['_DISPATCHER_HEADER']]],
    'Teb' : [ 0xf0, ['pointer64', ['void']]],
    'RelativeTimerBias' : [ 0xf8, ['unsigned long long']],
    'Timer' : [ 0x100, ['_KTIMER']],
    'WaitBlock' : [ 0x140, ['array', 4, ['_KWAIT_BLOCK']]],
    'WaitBlockFill4' : [ 0x140, ['array', 20, ['unsigned char']]],
    'ContextSwitches' : [ 0x154, ['unsigned long']],
    'WaitBlockFill5' : [ 0x140, ['array', 68, ['unsigned char']]],
    'State' : [ 0x184, ['unsigned char']],
    'Spare13' : [ 0x185, ['unsigned char']],
    'WaitIrql' : [ 0x186, ['unsigned char']],
    'WaitMode' : [ 0x187, ['unsigned char']],
    'WaitBlockFill6' : [ 0x140, ['array', 116, ['unsigned char']]],
    'WaitTime' : [ 0x1b4, ['unsigned long']],
    'WaitBlockFill7' : [ 0x140, ['array', 164, ['unsigned char']]],
    'KernelApcDisable' : [ 0x1e4, ['short']],
    'SpecialApcDisable' : [ 0x1e6, ['short']],
    'CombinedApcDisable' : [ 0x1e4, ['unsigned long']],
    'WaitBlockFill8' : [ 0x140, ['array', 40, ['unsigned char']]],
    'ThreadCounters' : [ 0x168, ['pointer64', ['_KTHREAD_COUNTERS']]],
    'WaitBlockFill9' : [ 0x140, ['array', 88, ['unsigned char']]],
    'XStateSave' : [ 0x198, ['pointer64', ['_XSTATE_SAVE']]],
    'WaitBlockFill10' : [ 0x140, ['array', 136, ['unsigned char']]],
    'Win32Thread' : [ 0x1c8, ['pointer64', ['void']]],
    'WaitBlockFill11' : [ 0x140, ['array', 176, ['unsigned char']]],
    'Ucb' : [ 0x1f0, ['pointer64', ['_UMS_CONTROL_BLOCK']]],
    'Uch' : [ 0x1f8, ['pointer64', ['_KUMS_CONTEXT_HEADER']]],
    'ThreadFlags2' : [ 0x200, ['long']],
    'BamQosLevel' : [ 0x200, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
    'ThreadFlags2Reserved' : [ 0x200, ['BitField', dict(start_bit = 8, end_bit = 32, native_type='unsigned long')]],
    'Spare21' : [ 0x204, ['unsigned long']],
    'QueueListEntry' : [ 0x208, ['_LIST_ENTRY']],
    'NextProcessor' : [ 0x218, ['unsigned long']],
    'NextProcessorNumber' : [ 0x218, ['BitField', dict(start_bit = 0, end_bit = 31, native_type='unsigned long')]],
    'SharedReadyQueue' : [ 0x218, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'QueuePriority' : [ 0x21c, ['long']],
    'Process' : [ 0x220, ['pointer64', ['_KPROCESS']]],
    'UserAffinity' : [ 0x228, ['_GROUP_AFFINITY']],
    'UserAffinityFill' : [ 0x228, ['array', 10, ['unsigned char']]],
    'PreviousMode' : [ 0x232, ['unsigned char']],
    'BasePriority' : [ 0x233, ['unsigned char']],
    'PriorityDecrement' : [ 0x234, ['unsigned char']],
    'ForegroundBoost' : [ 0x234, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'UnusualBoost' : [ 0x234, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Preempted' : [ 0x235, ['unsigned char']],
    'AdjustReason' : [ 0x236, ['unsigned char']],
    'AdjustIncrement' : [ 0x237, ['unsigned char']],
    'AffinityVersion' : [ 0x238, ['unsigned long long']],
    'Affinity' : [ 0x240, ['_GROUP_AFFINITY']],
    'AffinityFill' : [ 0x240, ['array', 10, ['unsigned char']]],
    'ApcStateIndex' : [ 0x24a, ['unsigned char']],
    'WaitBlockCount' : [ 0x24b, ['unsigned char']],
    'IdealProcessor' : [ 0x24c, ['unsigned long']],
    'NpxState' : [ 0x250, ['unsigned long long']],
    'SavedApcState' : [ 0x258, ['_KAPC_STATE']],
    'SavedApcStateFill' : [ 0x258, ['array', 43, ['unsigned char']]],
    'WaitReason' : [ 0x283, ['unsigned char']],
    'SuspendCount' : [ 0x284, ['unsigned char']],
    'Saturation' : [ 0x285, ['unsigned char']],
    'SListFaultCount' : [ 0x286, ['unsigned short']],
    'SchedulerApc' : [ 0x288, ['_KAPC']],
    'SchedulerApcFill0' : [ 0x288, ['array', 1, ['unsigned char']]],
    'ResourceIndex' : [ 0x289, ['unsigned char']],
    'SchedulerApcFill1' : [ 0x288, ['array', 3, ['unsigned char']]],
    'QuantumReset' : [ 0x28b, ['unsigned char']],
    'SchedulerApcFill2' : [ 0x288, ['array', 4, ['unsigned char']]],
    'KernelTime' : [ 0x28c, ['unsigned long']],
    'SchedulerApcFill3' : [ 0x288, ['array', 64, ['unsigned char']]],
    'WaitPrcb' : [ 0x2c8, ['pointer64', ['_KPRCB']]],
    'SchedulerApcFill4' : [ 0x288, ['array', 72, ['unsigned char']]],
    'LegoData' : [ 0x2d0, ['pointer64', ['void']]],
    'SchedulerApcFill5' : [ 0x288, ['array', 83, ['unsigned char']]],
    'CallbackNestingLevel' : [ 0x2db, ['unsigned char']],
    'UserTime' : [ 0x2dc, ['unsigned long']],
    'SuspendEvent' : [ 0x2e0, ['_KEVENT']],
    'ThreadListEntry' : [ 0x2f8, ['_LIST_ENTRY']],
    'MutantListHead' : [ 0x308, ['_LIST_ENTRY']],
    'AbEntrySummary' : [ 0x318, ['unsigned char']],
    'AbWaitEntryCount' : [ 0x319, ['unsigned char']],
    'AbAllocationRegionCount' : [ 0x31a, ['unsigned char']],
    'SystemPriority' : [ 0x31b, ['unsigned char']],
    'SecureThreadCookie' : [ 0x31c, ['unsigned long']],
    'LockEntries' : [ 0x320, ['pointer64', ['_KLOCK_ENTRY']]],
    'PropagateBoostsEntry' : [ 0x328, ['_SINGLE_LIST_ENTRY']],
    'IoSelfBoostsEntry' : [ 0x330, ['_SINGLE_LIST_ENTRY']],
    'PriorityFloorCounts' : [ 0x338, ['array', 16, ['unsigned char']]],
    'PriorityFloorCountsReserved' : [ 0x348, ['array', 16, ['unsigned char']]],
    'PriorityFloorSummary' : [ 0x358, ['unsigned long']],
    'AbCompletedIoBoostCount' : [ 0x35c, ['long']],
    'AbCompletedIoQoSBoostCount' : [ 0x360, ['long']],
    'KeReferenceCount' : [ 0x364, ['short']],
    'AbOrphanedEntrySummary' : [ 0x366, ['unsigned char']],
    'AbOwnedEntryCount' : [ 0x367, ['unsigned char']],
    'ForegroundLossTime' : [ 0x368, ['unsigned long']],
    'GlobalForegroundListEntry' : [ 0x370, ['_LIST_ENTRY']],
    'ForegroundDpcStackListEntry' : [ 0x370, ['_SINGLE_LIST_ENTRY']],
    'InGlobalForegroundList' : [ 0x378, ['unsigned long long']],
    'ReadOperationCount' : [ 0x380, ['long long']],
    'WriteOperationCount' : [ 0x388, ['long long']],
    'OtherOperationCount' : [ 0x390, ['long long']],
    'ReadTransferCount' : [ 0x398, ['long long']],
    'WriteTransferCount' : [ 0x3a0, ['long long']],
    'OtherTransferCount' : [ 0x3a8, ['long long']],
    'QueuedScb' : [ 0x3b0, ['pointer64', ['_KSCB']]],
    'ThreadTimerDelay' : [ 0x3b8, ['unsigned long']],
    'ThreadFlags3' : [ 0x3bc, ['long']],
    'ThreadFlags3Reserved' : [ 0x3bc, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
    'PpmPolicy' : [ 0x3bc, ['BitField', dict(start_bit = 8, end_bit = 10, native_type='unsigned long')]],
    'ThreadFlags3Reserved2' : [ 0x3bc, ['BitField', dict(start_bit = 10, end_bit = 32, native_type='unsigned long')]],
    'TracingPrivate' : [ 0x3c0, ['array', 1, ['unsigned long long']]],
    'SchedulerAssist' : [ 0x3c8, ['pointer64', ['void']]],
    'AbWaitObject' : [ 0x3d0, ['pointer64', ['void']]],
    'ReservedPreviousReadyTimeValue' : [ 0x3d8, ['unsigned long']],
    'KernelWaitTime' : [ 0x3e0, ['unsigned long long']],
    'UserWaitTime' : [ 0x3e8, ['unsigned long long']],
    'GlobalUpdateVpThreadPriorityListEntry' : [ 0x3f0, ['_LIST_ENTRY']],
    'UpdateVpThreadPriorityDpcStackListEntry' : [ 0x3f0, ['_SINGLE_LIST_ENTRY']],
    'InGlobalUpdateVpThreadPriorityList' : [ 0x3f8, ['unsigned long long']],
    'SchedulerAssistPriorityFloor' : [ 0x400, ['long']],
    'Spare28' : [ 0x404, ['unsigned long']],
    'EndPadding' : [ 0x408, ['array', 5, ['unsigned long long']]],
} ],
  '_KSTACK_CONTROL' : [ 0x30, {
    'StackBase' : [ 0x0, ['unsigned long long']],
    'ActualLimit' : [ 0x8, ['unsigned long long']],
    'StackExpansion' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Previous' : [ 0x10, ['_KERNEL_STACK_SEGMENT']],
} ],
  '_QUAD' : [ 0x8, {
    'UseThisFieldToCopy' : [ 0x0, ['long long']],
    'DoNotUseThisField' : [ 0x0, ['double']],
} ],
  '_PP_LOOKASIDE_LIST' : [ 0x10, {
    'P' : [ 0x0, ['pointer64', ['_GENERAL_LOOKASIDE']]],
    'L' : [ 0x8, ['pointer64', ['_GENERAL_LOOKASIDE']]],
} ],
  '_KNODE' : [ 0x180, {
    'IdleNonParkedCpuSet' : [ 0x0, ['unsigned long long']],
    'IdleSmtSet' : [ 0x8, ['unsigned long long']],
    'NonPairedSmtSet' : [ 0x10, ['unsigned long long']],
    'IdleCpuSet' : [ 0x18, ['unsigned long long']],
    'DeepIdleSet' : [ 0x40, ['unsigned long long']],
    'IdleConstrainedSet' : [ 0x48, ['unsigned long long']],
    'NonParkedSet' : [ 0x50, ['unsigned long long']],
    'SoftParkedSet' : [ 0x58, ['unsigned long long']],
    'NonIsrTargetedSet' : [ 0x60, ['unsigned long long']],
    'ParkLock' : [ 0x68, ['long']],
    'ThreadSeed' : [ 0x6c, ['unsigned short']],
    'ProcessSeed' : [ 0x6e, ['unsigned short']],
    'SiblingMask' : [ 0x80, ['unsigned long']],
    'Affinity' : [ 0x88, ['_GROUP_AFFINITY']],
    'AffinityFill' : [ 0x88, ['array', 10, ['unsigned char']]],
    'NodeNumber' : [ 0x92, ['unsigned short']],
    'PrimaryNodeNumber' : [ 0x94, ['unsigned short']],
    'Spare0' : [ 0x96, ['unsigned short']],
    'SharedReadyQueueMask' : [ 0x98, ['unsigned long long']],
    'StrideMask' : [ 0xa0, ['unsigned long long']],
    'ProximityId' : [ 0xa8, ['unsigned long']],
    'Lowest' : [ 0xac, ['unsigned long']],
    'Highest' : [ 0xb0, ['unsigned long']],
    'MaximumProcessors' : [ 0xb4, ['unsigned char']],
    'Flags' : [ 0xb5, ['_flags']],
    'Spare10' : [ 0xb6, ['unsigned char']],
    'HeteroSets' : [ 0xb8, ['array', 5, ['_KHETERO_PROCESSOR_SET']]],
    'PpmConfiguredQosSets' : [ 0x130, ['array', 5, ['unsigned long long']]],
    'Spare11' : [ 0x158, ['unsigned long long']],
    'QosGroupingSets' : [ 0x160, ['_KQOS_GROUPING_SETS']],
    'QosPreemptibleSet' : [ 0x170, ['unsigned long long']],
    'LLCLeaders' : [ 0x178, ['unsigned long long']],
} ],
  '_ENODE' : [ 0x1c0, {
    'Ncb' : [ 0x0, ['_KNODE']],
    'HotAddProcessorWorkItem' : [ 0x180, ['_WORK_QUEUE_ITEM']],
} ],
  '_HANDLE_TABLE' : [ 0x80, {
    'NextHandleNeedingPool' : [ 0x0, ['unsigned long']],
    'ExtraInfoPages' : [ 0x4, ['long']],
    'TableCode' : [ 0x8, ['unsigned long long']],
    'QuotaProcess' : [ 0x10, ['pointer64', ['_EPROCESS']]],
    'HandleTableList' : [ 0x18, ['_LIST_ENTRY']],
    'UniqueProcessId' : [ 0x28, ['unsigned long']],
    'Flags' : [ 0x2c, ['unsigned long']],
    'StrictFIFO' : [ 0x2c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'EnableHandleExceptions' : [ 0x2c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Rundown' : [ 0x2c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Duplicated' : [ 0x2c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'RaiseUMExceptionOnInvalidHandleClose' : [ 0x2c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'HandleContentionEvent' : [ 0x30, ['_EX_PUSH_LOCK']],
    'HandleTableLock' : [ 0x38, ['_EX_PUSH_LOCK']],
    'FreeLists' : [ 0x40, ['array', 1, ['_HANDLE_TABLE_FREE_LIST']]],
    'ActualEntry' : [ 0x40, ['array', 32, ['unsigned char']]],
    'DebugInfo' : [ 0x60, ['pointer64', ['_HANDLE_TRACE_DEBUG_INFO']]],
} ],
  '_HANDLE_TABLE_ENTRY_INFO' : [ 0x8, {
    'AuditMask' : [ 0x0, ['unsigned long']],
    'MaxRelativeAccessMask' : [ 0x4, ['unsigned long']],
} ],
  '_HANDLE_TABLE_ENTRY' : [ 0x10, {
    'VolatileLowValue' : [ 0x0, ['long long']],
    'LowValue' : [ 0x0, ['long long']],
    'InfoTable' : [ 0x0, ['pointer64', ['_HANDLE_TABLE_ENTRY_INFO']]],
    'HighValue' : [ 0x8, ['long long']],
    'NextFreeHandleEntry' : [ 0x8, ['pointer64', ['_HANDLE_TABLE_ENTRY']]],
    'LeafHandleValue' : [ 0x8, ['_EXHANDLE']],
    'RefCountField' : [ 0x0, ['long long']],
    'Unlocked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'RefCnt' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 17, native_type='unsigned long long')]],
    'Attributes' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 20, native_type='unsigned long long')]],
    'ObjectPointerBits' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 64, native_type='unsigned long long')]],
    'GrantedAccessBits' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 25, native_type='unsigned long')]],
    'NoRightsUpgrade' : [ 0x8, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'Spare1' : [ 0x8, ['BitField', dict(start_bit = 26, end_bit = 32, native_type='unsigned long')]],
    'Spare2' : [ 0xc, ['unsigned long']],
} ],
  '_EX_FAST_REF' : [ 0x8, {
    'Object' : [ 0x0, ['pointer64', ['void']]],
    'RefCnt' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long long')]],
    'Value' : [ 0x0, ['unsigned long long']],
} ],
  '_AUX_ACCESS_DATA' : [ 0xe0, {
    'PrivilegesUsed' : [ 0x0, ['pointer64', ['_PRIVILEGE_SET']]],
    'GenericMapping' : [ 0x8, ['_GENERIC_MAPPING']],
    'AccessesToAudit' : [ 0x18, ['unsigned long']],
    'MaximumAuditMask' : [ 0x1c, ['unsigned long']],
    'TransactionId' : [ 0x20, ['_GUID']],
    'NewSecurityDescriptor' : [ 0x30, ['pointer64', ['void']]],
    'ExistingSecurityDescriptor' : [ 0x38, ['pointer64', ['void']]],
    'ParentSecurityDescriptor' : [ 0x40, ['pointer64', ['void']]],
    'DeRefSecurityDescriptor' : [ 0x48, ['pointer64', ['void']]],
    'SDLock' : [ 0x50, ['pointer64', ['void']]],
    'AccessReasons' : [ 0x58, ['_ACCESS_REASONS']],
    'GenerateStagingEvents' : [ 0xd8, ['unsigned char']],
} ],
  '_OBJECT_HANDLE_INFORMATION' : [ 0x8, {
    'HandleAttributes' : [ 0x0, ['unsigned long']],
    'GrantedAccess' : [ 0x4, ['unsigned long']],
} ],
  '_ETHREAD' : [ 0x898, {
    'Tcb' : [ 0x0, ['_KTHREAD']],
    'CreateTime' : [ 0x430, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0x438, ['_LARGE_INTEGER']],
    'KeyedWaitChain' : [ 0x438, ['_LIST_ENTRY']],
    'PostBlockList' : [ 0x448, ['_LIST_ENTRY']],
    'ForwardLinkShadow' : [ 0x448, ['pointer64', ['void']]],
    'StartAddress' : [ 0x450, ['pointer64', ['void']]],
    'TerminationPort' : [ 0x458, ['pointer64', ['_TERMINATION_PORT']]],
    'ReaperLink' : [ 0x458, ['pointer64', ['_ETHREAD']]],
    'KeyedWaitValue' : [ 0x458, ['pointer64', ['void']]],
    'ActiveTimerListLock' : [ 0x460, ['unsigned long long']],
    'ActiveTimerListHead' : [ 0x468, ['_LIST_ENTRY']],
    'Cid' : [ 0x478, ['_CLIENT_ID']],
    'KeyedWaitSemaphore' : [ 0x488, ['_KSEMAPHORE']],
    'AlpcWaitSemaphore' : [ 0x488, ['_KSEMAPHORE']],
    'ClientSecurity' : [ 0x4a8, ['_PS_CLIENT_SECURITY_CONTEXT']],
    'IrpList' : [ 0x4b0, ['_LIST_ENTRY']],
    'TopLevelIrp' : [ 0x4c0, ['unsigned long long']],
    'DeviceToVerify' : [ 0x4c8, ['pointer64', ['_DEVICE_OBJECT']]],
    'Win32StartAddress' : [ 0x4d0, ['pointer64', ['void']]],
    'ChargeOnlySession' : [ 0x4d8, ['pointer64', ['void']]],
    'LegacyPowerObject' : [ 0x4e0, ['pointer64', ['void']]],
    'ThreadListEntry' : [ 0x4e8, ['_LIST_ENTRY']],
    'RundownProtect' : [ 0x4f8, ['_EX_RUNDOWN_REF']],
    'ThreadLock' : [ 0x500, ['_EX_PUSH_LOCK']],
    'ReadClusterSize' : [ 0x508, ['unsigned long']],
    'MmLockOrdering' : [ 0x50c, ['long']],
    'CrossThreadFlags' : [ 0x510, ['unsigned long']],
    'Terminated' : [ 0x510, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ThreadInserted' : [ 0x510, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'HideFromDebugger' : [ 0x510, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ActiveImpersonationInfo' : [ 0x510, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'HardErrorsAreDisabled' : [ 0x510, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0x510, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'SkipCreationMsg' : [ 0x510, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'SkipTerminationMsg' : [ 0x510, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'CopyTokenOnOpen' : [ 0x510, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'ThreadIoPriority' : [ 0x510, ['BitField', dict(start_bit = 9, end_bit = 12, native_type='unsigned long')]],
    'ThreadPagePriority' : [ 0x510, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
    'RundownFail' : [ 0x510, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'UmsForceQueueTermination' : [ 0x510, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'IndirectCpuSets' : [ 0x510, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'DisableDynamicCodeOptOut' : [ 0x510, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'ExplicitCaseSensitivity' : [ 0x510, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'PicoNotifyExit' : [ 0x510, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'DbgWerUserReportActive' : [ 0x510, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ForcedSelfTrimActive' : [ 0x510, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'SamplingCoverage' : [ 0x510, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'ReservedCrossThreadFlags' : [ 0x510, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'SameThreadPassiveFlags' : [ 0x514, ['unsigned long']],
    'ActiveExWorker' : [ 0x514, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MemoryMaker' : [ 0x514, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'StoreLockThread' : [ 0x514, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned long')]],
    'ClonedThread' : [ 0x514, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'KeyedEventInUse' : [ 0x514, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'SelfTerminate' : [ 0x514, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'RespectIoPriority' : [ 0x514, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ActivePageLists' : [ 0x514, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'SecureContext' : [ 0x514, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'ZeroPageThread' : [ 0x514, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'WorkloadClass' : [ 0x514, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'ReservedSameThreadPassiveFlags' : [ 0x514, ['BitField', dict(start_bit = 12, end_bit = 32, native_type='unsigned long')]],
    'SameThreadApcFlags' : [ 0x518, ['unsigned long']],
    'OwnsProcessAddressSpaceExclusive' : [ 0x518, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'OwnsProcessAddressSpaceShared' : [ 0x518, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'HardFaultBehavior' : [ 0x518, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'StartAddressInvalid' : [ 0x518, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'EtwCalloutActive' : [ 0x518, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'SuppressSymbolLoad' : [ 0x518, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'Prefetching' : [ 0x518, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'OwnsVadExclusive' : [ 0x518, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'SystemPagePriorityActive' : [ 0x519, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'SystemPagePriority' : [ 0x519, ['BitField', dict(start_bit = 1, end_bit = 4, native_type='unsigned char')]],
    'AllowUserWritesToExecutableMemory' : [ 0x519, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'AllowKernelWritesToExecutableMemory' : [ 0x519, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'OwnsVadShared' : [ 0x519, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'CacheManagerActive' : [ 0x51c, ['unsigned char']],
    'DisablePageFaultClustering' : [ 0x51d, ['unsigned char']],
    'ActiveFaultCount' : [ 0x51e, ['unsigned char']],
    'LockOrderState' : [ 0x51f, ['unsigned char']],
    'PerformanceCountLowReserved' : [ 0x520, ['unsigned long']],
    'PerformanceCountHighReserved' : [ 0x524, ['long']],
    'AlpcMessageId' : [ 0x528, ['unsigned long long']],
    'AlpcMessage' : [ 0x530, ['pointer64', ['void']]],
    'AlpcReceiveAttributeSet' : [ 0x530, ['unsigned long']],
    'AlpcWaitListEntry' : [ 0x538, ['_LIST_ENTRY']],
    'ExitStatus' : [ 0x548, ['long']],
    'CacheManagerCount' : [ 0x54c, ['unsigned long']],
    'IoBoostCount' : [ 0x550, ['unsigned long']],
    'IoQoSBoostCount' : [ 0x554, ['unsigned long']],
    'IoQoSThrottleCount' : [ 0x558, ['unsigned long']],
    'KernelStackReference' : [ 0x55c, ['unsigned long']],
    'BoostList' : [ 0x560, ['_LIST_ENTRY']],
    'DeboostList' : [ 0x570, ['_LIST_ENTRY']],
    'BoostListLock' : [ 0x580, ['unsigned long long']],
    'IrpListLock' : [ 0x588, ['unsigned long long']],
    'ReservedForSynchTracking' : [ 0x590, ['pointer64', ['void']]],
    'CmCallbackListHead' : [ 0x598, ['_SINGLE_LIST_ENTRY']],
    'ActivityId' : [ 0x5a0, ['pointer64', ['_GUID']]],
    'SeLearningModeListHead' : [ 0x5a8, ['_SINGLE_LIST_ENTRY']],
    'VerifierContext' : [ 0x5b0, ['pointer64', ['void']]],
    'AdjustedClientToken' : [ 0x5b8, ['pointer64', ['void']]],
    'WorkOnBehalfThread' : [ 0x5c0, ['pointer64', ['void']]],
    'PropertySet' : [ 0x5c8, ['_PS_PROPERTY_SET']],
    'PicoContext' : [ 0x5e0, ['pointer64', ['void']]],
    'UserFsBase' : [ 0x5e8, ['unsigned long long']],
    'UserGsBase' : [ 0x5f0, ['unsigned long long']],
    'EnergyValues' : [ 0x5f8, ['pointer64', ['_THREAD_ENERGY_VALUES']]],
    'SelectedCpuSets' : [ 0x600, ['unsigned long long']],
    'SelectedCpuSetsIndirect' : [ 0x600, ['pointer64', ['unsigned long long']]],
    'Silo' : [ 0x608, ['pointer64', ['_EJOB']]],
    'ThreadName' : [ 0x610, ['pointer64', ['_UNICODE_STRING']]],
    'SetContextState' : [ 0x618, ['pointer64', ['_CONTEXT']]],
    'LastExpectedRunTime' : [ 0x620, ['unsigned long']],
    'HeapData' : [ 0x624, ['unsigned long']],
    'OwnerEntryListHead' : [ 0x628, ['_LIST_ENTRY']],
    'DisownedOwnerEntryListLock' : [ 0x638, ['unsigned long long']],
    'DisownedOwnerEntryListHead' : [ 0x640, ['_LIST_ENTRY']],
    'LockEntries' : [ 0x650, ['array', 6, ['_KLOCK_ENTRY']]],
    'CmDbgInfo' : [ 0x890, ['pointer64', ['void']]],
} ],
  '__unnamed_19cb' : [ 0x4, {
    'ControlFlowGuardEnabled' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ControlFlowGuardExportSuppressionEnabled' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ControlFlowGuardStrict' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DisallowStrippedImages' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ForceRelocateImages' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'HighEntropyASLREnabled' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'StackRandomizationDisabled' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'ExtensionPointDisable' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'DisableDynamicCode' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'DisableDynamicCodeAllowOptOut' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DisableDynamicCodeAllowRemoteDowngrade' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'AuditDisableDynamicCode' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DisallowWin32kSystemCalls' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'AuditDisallowWin32kSystemCalls' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'EnableFilteredWin32kAPIs' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'AuditFilteredWin32kAPIs' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'DisableNonSystemFonts' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'AuditNonSystemFontLoading' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'PreferSystem32Images' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'ProhibitRemoteImageMap' : [ 0x0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'AuditProhibitRemoteImageMap' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'ProhibitLowILImageMap' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'AuditProhibitLowILImageMap' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'SignatureMitigationOptIn' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'AuditBlockNonMicrosoftBinaries' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'AuditBlockNonMicrosoftBinariesAllowStore' : [ 0x0, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'LoaderIntegrityContinuityEnabled' : [ 0x0, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'AuditLoaderIntegrityContinuity' : [ 0x0, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'EnableModuleTamperingProtection' : [ 0x0, ['BitField', dict(start_bit = 28, end_bit = 29, native_type='unsigned long')]],
    'EnableModuleTamperingProtectionNoInherit' : [ 0x0, ['BitField', dict(start_bit = 29, end_bit = 30, native_type='unsigned long')]],
    'RestrictIndirectBranchPrediction' : [ 0x0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'IsolateSecurityDomain' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_19cd' : [ 0x4, {
    'EnableExportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AuditExportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'EnableExportAddressFilterPlus' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'AuditExportAddressFilterPlus' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'EnableRopStackPivot' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'AuditRopStackPivot' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'EnableRopCallerCheck' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'AuditRopCallerCheck' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'EnableRopSimExec' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'AuditRopSimExec' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'EnableImportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'AuditImportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DisablePageCombine' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'SpeculativeStoreBypassDisable' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'CetUserShadowStacks' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'AuditCetUserShadowStacks' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'AuditCetUserShadowStacksLogged' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'UserCetSetContextIpValidation' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'AuditUserCetSetContextIpValidation' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'AuditUserCetSetContextIpValidationLogged' : [ 0x0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
} ],
  '_EPROCESS' : [ 0xa40, {
    'Pcb' : [ 0x0, ['_KPROCESS']],
    'ProcessLock' : [ 0x438, ['_EX_PUSH_LOCK']],
    'UniqueProcessId' : [ 0x440, ['pointer64', ['void']]],
    'ActiveProcessLinks' : [ 0x448, ['_LIST_ENTRY']],
    'RundownProtect' : [ 0x458, ['_EX_RUNDOWN_REF']],
    'Flags2' : [ 0x460, ['unsigned long']],
    'JobNotReallyActive' : [ 0x460, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AccountingFolded' : [ 0x460, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'NewProcessReported' : [ 0x460, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ExitProcessReported' : [ 0x460, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ReportCommitChanges' : [ 0x460, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'LastReportMemory' : [ 0x460, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ForceWakeCharge' : [ 0x460, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'CrossSessionCreate' : [ 0x460, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'NeedsHandleRundown' : [ 0x460, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'RefTraceEnabled' : [ 0x460, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'PicoCreated' : [ 0x460, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'EmptyJobEvaluated' : [ 0x460, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DefaultPagePriority' : [ 0x460, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
    'PrimaryTokenFrozen' : [ 0x460, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessVerifierTarget' : [ 0x460, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'RestrictSetThreadContext' : [ 0x460, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'AffinityPermanent' : [ 0x460, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'AffinityUpdateEnable' : [ 0x460, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'PropagateNode' : [ 0x460, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'ExplicitAffinity' : [ 0x460, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ProcessExecutionState' : [ 0x460, ['BitField', dict(start_bit = 22, end_bit = 24, native_type='unsigned long')]],
    'EnableReadVmLogging' : [ 0x460, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'EnableWriteVmLogging' : [ 0x460, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'FatalAccessTerminationRequested' : [ 0x460, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'DisableSystemAllowedCpuSet' : [ 0x460, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'ProcessStateChangeRequest' : [ 0x460, ['BitField', dict(start_bit = 28, end_bit = 30, native_type='unsigned long')]],
    'ProcessStateChangeInProgress' : [ 0x460, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'InPrivate' : [ 0x460, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'Flags' : [ 0x464, ['unsigned long']],
    'CreateReported' : [ 0x464, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'NoDebugInherit' : [ 0x464, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessExiting' : [ 0x464, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ProcessDelete' : [ 0x464, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ManageExecutableMemoryWrites' : [ 0x464, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'VmDeleted' : [ 0x464, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'OutswapEnabled' : [ 0x464, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Outswapped' : [ 0x464, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'FailFastOnCommitFail' : [ 0x464, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Wow64VaSpace4Gb' : [ 0x464, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'AddressSpaceInitialized' : [ 0x464, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
    'SetTimerResolution' : [ 0x464, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0x464, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'DeprioritizeViews' : [ 0x464, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'WriteWatch' : [ 0x464, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessInSession' : [ 0x464, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'OverrideAddressSpace' : [ 0x464, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HasAddressSpace' : [ 0x464, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'LaunchPrefetched' : [ 0x464, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'Background' : [ 0x464, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'VmTopDown' : [ 0x464, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ImageNotifyDone' : [ 0x464, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'PdeUpdateNeeded' : [ 0x464, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'VdmAllowed' : [ 0x464, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'ProcessRundown' : [ 0x464, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'ProcessInserted' : [ 0x464, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'DefaultIoPriority' : [ 0x464, ['BitField', dict(start_bit = 27, end_bit = 30, native_type='unsigned long')]],
    'ProcessSelfDelete' : [ 0x464, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'SetTimerResolutionLink' : [ 0x464, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'CreateTime' : [ 0x468, ['_LARGE_INTEGER']],
    'ProcessQuotaUsage' : [ 0x470, ['array', 2, ['unsigned long long']]],
    'ProcessQuotaPeak' : [ 0x480, ['array', 2, ['unsigned long long']]],
    'PeakVirtualSize' : [ 0x490, ['unsigned long long']],
    'VirtualSize' : [ 0x498, ['unsigned long long']],
    'SessionProcessLinks' : [ 0x4a0, ['_LIST_ENTRY']],
    'ExceptionPortData' : [ 0x4b0, ['pointer64', ['void']]],
    'ExceptionPortValue' : [ 0x4b0, ['unsigned long long']],
    'ExceptionPortState' : [ 0x4b0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long long')]],
    'Token' : [ 0x4b8, ['_EX_FAST_REF']],
    'MmReserved' : [ 0x4c0, ['unsigned long long']],
    'AddressCreationLock' : [ 0x4c8, ['_EX_PUSH_LOCK']],
    'PageTableCommitmentLock' : [ 0x4d0, ['_EX_PUSH_LOCK']],
    'RotateInProgress' : [ 0x4d8, ['pointer64', ['_ETHREAD']]],
    'ForkInProgress' : [ 0x4e0, ['pointer64', ['_ETHREAD']]],
    'CommitChargeJob' : [ 0x4e8, ['pointer64', ['_EJOB']]],
    'CloneRoot' : [ 0x4f0, ['_RTL_AVL_TREE']],
    'NumberOfPrivatePages' : [ 0x4f8, ['unsigned long long']],
    'NumberOfLockedPages' : [ 0x500, ['unsigned long long']],
    'Win32Process' : [ 0x508, ['pointer64', ['void']]],
    'Job' : [ 0x510, ['pointer64', ['_EJOB']]],
    'SectionObject' : [ 0x518, ['pointer64', ['void']]],
    'SectionBaseAddress' : [ 0x520, ['pointer64', ['void']]],
    'Cookie' : [ 0x528, ['unsigned long']],
    'WorkingSetWatch' : [ 0x530, ['pointer64', ['_PAGEFAULT_HISTORY']]],
    'Win32WindowStation' : [ 0x538, ['pointer64', ['void']]],
    'InheritedFromUniqueProcessId' : [ 0x540, ['pointer64', ['void']]],
    'OwnerProcessId' : [ 0x548, ['unsigned long long']],
    'Peb' : [ 0x550, ['pointer64', ['_PEB']]],
    'Session' : [ 0x558, ['pointer64', ['_MM_SESSION_SPACE']]],
    'Spare1' : [ 0x560, ['pointer64', ['void']]],
    'QuotaBlock' : [ 0x568, ['pointer64', ['_EPROCESS_QUOTA_BLOCK']]],
    'ObjectTable' : [ 0x570, ['pointer64', ['_HANDLE_TABLE']]],
    'DebugPort' : [ 0x578, ['pointer64', ['void']]],
    'WoW64Process' : [ 0x580, ['pointer64', ['_EWOW64PROCESS']]],
    'DeviceMap' : [ 0x588, ['pointer64', ['void']]],
    'EtwDataSource' : [ 0x590, ['pointer64', ['void']]],
    'PageDirectoryPte' : [ 0x598, ['unsigned long long']],
    'ImageFilePointer' : [ 0x5a0, ['pointer64', ['_FILE_OBJECT']]],
    'ImageFileName' : [ 0x5a8, ['array', 15, ['unsigned char']]],
    'PriorityClass' : [ 0x5b7, ['unsigned char']],
    'SecurityPort' : [ 0x5b8, ['pointer64', ['void']]],
    'SeAuditProcessCreationInfo' : [ 0x5c0, ['_SE_AUDIT_PROCESS_CREATION_INFO']],
    'JobLinks' : [ 0x5c8, ['_LIST_ENTRY']],
    'HighestUserAddress' : [ 0x5d8, ['pointer64', ['void']]],
    'ThreadListHead' : [ 0x5e0, ['_LIST_ENTRY']],
    'ActiveThreads' : [ 0x5f0, ['unsigned long']],
    'ImagePathHash' : [ 0x5f4, ['unsigned long']],
    'DefaultHardErrorProcessing' : [ 0x5f8, ['unsigned long']],
    'LastThreadExitStatus' : [ 0x5fc, ['long']],
    'PrefetchTrace' : [ 0x600, ['_EX_FAST_REF']],
    'LockedPagesList' : [ 0x608, ['pointer64', ['void']]],
    'ReadOperationCount' : [ 0x610, ['_LARGE_INTEGER']],
    'WriteOperationCount' : [ 0x618, ['_LARGE_INTEGER']],
    'OtherOperationCount' : [ 0x620, ['_LARGE_INTEGER']],
    'ReadTransferCount' : [ 0x628, ['_LARGE_INTEGER']],
    'WriteTransferCount' : [ 0x630, ['_LARGE_INTEGER']],
    'OtherTransferCount' : [ 0x638, ['_LARGE_INTEGER']],
    'CommitChargeLimit' : [ 0x640, ['unsigned long long']],
    'CommitCharge' : [ 0x648, ['unsigned long long']],
    'CommitChargePeak' : [ 0x650, ['unsigned long long']],
    'Vm' : [ 0x680, ['_MMSUPPORT_FULL']],
    'MmProcessLinks' : [ 0x7c0, ['_LIST_ENTRY']],
    'ModifiedPageCount' : [ 0x7d0, ['unsigned long']],
    'ExitStatus' : [ 0x7d4, ['long']],
    'VadRoot' : [ 0x7d8, ['_RTL_AVL_TREE']],
    'VadHint' : [ 0x7e0, ['pointer64', ['void']]],
    'VadCount' : [ 0x7e8, ['unsigned long long']],
    'VadPhysicalPages' : [ 0x7f0, ['unsigned long long']],
    'VadPhysicalPagesLimit' : [ 0x7f8, ['unsigned long long']],
    'AlpcContext' : [ 0x800, ['_ALPC_PROCESS_CONTEXT']],
    'TimerResolutionLink' : [ 0x820, ['_LIST_ENTRY']],
    'TimerResolutionStackRecord' : [ 0x830, ['pointer64', ['_PO_DIAG_STACK_RECORD']]],
    'RequestedTimerResolution' : [ 0x838, ['unsigned long']],
    'SmallestTimerResolution' : [ 0x83c, ['unsigned long']],
    'ExitTime' : [ 0x840, ['_LARGE_INTEGER']],
    'InvertedFunctionTable' : [ 0x848, ['pointer64', ['_INVERTED_FUNCTION_TABLE']]],
    'InvertedFunctionTableLock' : [ 0x850, ['_EX_PUSH_LOCK']],
    'ActiveThreadsHighWatermark' : [ 0x858, ['unsigned long']],
    'LargePrivateVadCount' : [ 0x85c, ['unsigned long']],
    'ThreadListLock' : [ 0x860, ['_EX_PUSH_LOCK']],
    'WnfContext' : [ 0x868, ['pointer64', ['void']]],
    'ServerSilo' : [ 0x870, ['pointer64', ['_EJOB']]],
    'SignatureLevel' : [ 0x878, ['unsigned char']],
    'SectionSignatureLevel' : [ 0x879, ['unsigned char']],
    'Protection' : [ 0x87a, ['_PS_PROTECTION']],
    'HangCount' : [ 0x87b, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned char')]],
    'GhostCount' : [ 0x87b, ['BitField', dict(start_bit = 3, end_bit = 6, native_type='unsigned char')]],
    'PrefilterException' : [ 0x87b, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'Flags3' : [ 0x87c, ['unsigned long']],
    'Minimal' : [ 0x87c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReplacingPageRoot' : [ 0x87c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Crashed' : [ 0x87c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'JobVadsAreTracked' : [ 0x87c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'VadTrackingDisabled' : [ 0x87c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'AuxiliaryProcess' : [ 0x87c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'SubsystemProcess' : [ 0x87c, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'IndirectCpuSets' : [ 0x87c, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'RelinquishedCommit' : [ 0x87c, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'HighGraphicsPriority' : [ 0x87c, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'CommitFailLogged' : [ 0x87c, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ReserveFailLogged' : [ 0x87c, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'SystemProcess' : [ 0x87c, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'HideImageBaseAddresses' : [ 0x87c, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'AddressPolicyFrozen' : [ 0x87c, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'ProcessFirstResume' : [ 0x87c, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ForegroundExternal' : [ 0x87c, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'ForegroundSystem' : [ 0x87c, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HighMemoryPriority' : [ 0x87c, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'EnableProcessSuspendResumeLogging' : [ 0x87c, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'EnableThreadSuspendResumeLogging' : [ 0x87c, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'SecurityDomainChanged' : [ 0x87c, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'SecurityFreezeComplete' : [ 0x87c, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'VmProcessorHost' : [ 0x87c, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'VmProcessorHostTransition' : [ 0x87c, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'AltSyscall' : [ 0x87c, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'TimerResolutionIgnore' : [ 0x87c, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'DeviceAsid' : [ 0x880, ['long']],
    'SvmData' : [ 0x888, ['pointer64', ['void']]],
    'SvmProcessLock' : [ 0x890, ['_EX_PUSH_LOCK']],
    'SvmLock' : [ 0x898, ['unsigned long long']],
    'SvmProcessDeviceListHead' : [ 0x8a0, ['_LIST_ENTRY']],
    'LastFreezeInterruptTime' : [ 0x8b0, ['unsigned long long']],
    'DiskCounters' : [ 0x8b8, ['pointer64', ['_PROCESS_DISK_COUNTERS']]],
    'PicoContext' : [ 0x8c0, ['pointer64', ['void']]],
    'EnclaveTable' : [ 0x8c8, ['pointer64', ['void']]],
    'EnclaveNumber' : [ 0x8d0, ['unsigned long long']],
    'EnclaveLock' : [ 0x8d8, ['_EX_PUSH_LOCK']],
    'HighPriorityFaultsAllowed' : [ 0x8e0, ['unsigned long']],
    'EnergyContext' : [ 0x8e8, ['pointer64', ['_PO_PROCESS_ENERGY_CONTEXT']]],
    'VmContext' : [ 0x8f0, ['pointer64', ['void']]],
    'SequenceNumber' : [ 0x8f8, ['unsigned long long']],
    'CreateInterruptTime' : [ 0x900, ['unsigned long long']],
    'CreateUnbiasedInterruptTime' : [ 0x908, ['unsigned long long']],
    'TotalUnbiasedFrozenTime' : [ 0x910, ['unsigned long long']],
    'LastAppStateUpdateTime' : [ 0x918, ['unsigned long long']],
    'LastAppStateUptime' : [ 0x920, ['BitField', dict(start_bit = 0, end_bit = 61, native_type='unsigned long long')]],
    'LastAppState' : [ 0x920, ['BitField', dict(start_bit = 61, end_bit = 64, native_type='unsigned long long')]],
    'SharedCommitCharge' : [ 0x928, ['unsigned long long']],
    'SharedCommitLock' : [ 0x930, ['_EX_PUSH_LOCK']],
    'SharedCommitLinks' : [ 0x938, ['_LIST_ENTRY']],
    'AllowedCpuSets' : [ 0x948, ['unsigned long long']],
    'DefaultCpuSets' : [ 0x950, ['unsigned long long']],
    'AllowedCpuSetsIndirect' : [ 0x948, ['pointer64', ['unsigned long long']]],
    'DefaultCpuSetsIndirect' : [ 0x950, ['pointer64', ['unsigned long long']]],
    'DiskIoAttribution' : [ 0x958, ['pointer64', ['void']]],
    'DxgProcess' : [ 0x960, ['pointer64', ['void']]],
    'Win32KFilterSet' : [ 0x968, ['unsigned long']],
    'ProcessTimerDelay' : [ 0x970, ['_PS_INTERLOCKED_TIMER_DELAY_VALUES']],
    'KTimerSets' : [ 0x978, ['unsigned long']],
    'KTimer2Sets' : [ 0x97c, ['unsigned long']],
    'ThreadTimerSets' : [ 0x980, ['unsigned long']],
    'VirtualTimerListLock' : [ 0x988, ['unsigned long long']],
    'VirtualTimerListHead' : [ 0x990, ['_LIST_ENTRY']],
    'WakeChannel' : [ 0x9a0, ['_WNF_STATE_NAME']],
    'WakeInfo' : [ 0x9a0, ['_PS_PROCESS_WAKE_INFORMATION']],
    'MitigationFlags' : [ 0x9d0, ['unsigned long']],
    'MitigationFlagsValues' : [ 0x9d0, ['__unnamed_19cb']],
    'MitigationFlags2' : [ 0x9d4, ['unsigned long']],
    'MitigationFlags2Values' : [ 0x9d4, ['__unnamed_19cd']],
    'PartitionObject' : [ 0x9d8, ['pointer64', ['void']]],
    'SecurityDomain' : [ 0x9e0, ['unsigned long long']],
    'ParentSecurityDomain' : [ 0x9e8, ['unsigned long long']],
    'CoverageSamplerContext' : [ 0x9f0, ['pointer64', ['void']]],
    'MmHotPatchContext' : [ 0x9f8, ['pointer64', ['void']]],
    'DynamicEHContinuationTargetsTree' : [ 0xa00, ['_RTL_AVL_TREE']],
    'DynamicEHContinuationTargetsLock' : [ 0xa08, ['_EX_PUSH_LOCK']],
} ],
  '_EWOW64PROCESS' : [ 0x10, {
    'Peb' : [ 0x0, ['pointer64', ['void']]],
    'Machine' : [ 0x8, ['unsigned short']],
    'NtdllType' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'PsNativeSystemDll', 1: u'PsWowX86SystemDll', 2: u'PsWowArm32SystemDll', 3: u'PsWowAmd64SystemDll', 4: u'PsWowChpeX86SystemDll', 5: u'PsVsmEnclaveRuntimeDll', 6: u'PsSystemDllTotalTypes'})]],
} ],
  '__unnamed_19e6' : [ 0x58, {
    'DeviceQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DriverContext' : [ 0x0, ['array', 4, ['pointer64', ['void']]]],
    'Thread' : [ 0x20, ['pointer64', ['_ETHREAD']]],
    'AuxiliaryBuffer' : [ 0x28, ['pointer64', ['unsigned char']]],
    'ListEntry' : [ 0x30, ['_LIST_ENTRY']],
    'CurrentStackLocation' : [ 0x40, ['pointer64', ['_IO_STACK_LOCATION']]],
    'PacketType' : [ 0x40, ['unsigned long']],
    'OriginalFileObject' : [ 0x48, ['pointer64', ['_FILE_OBJECT']]],
    'IrpExtension' : [ 0x50, ['pointer64', ['void']]],
} ],
  '__unnamed_19e8' : [ 0x58, {
    'Overlay' : [ 0x0, ['__unnamed_19e6']],
    'Apc' : [ 0x0, ['_KAPC']],
    'CompletionKey' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_IRP' : [ 0xd0, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'AllocationProcessorNumber' : [ 0x4, ['unsigned short']],
    'Reserved' : [ 0x6, ['unsigned short']],
    'MdlAddress' : [ 0x8, ['pointer64', ['_MDL']]],
    'Flags' : [ 0x10, ['unsigned long']],
    'AssociatedIrp' : [ 0x18, ['__unnamed_111b']],
    'ThreadListEntry' : [ 0x20, ['_LIST_ENTRY']],
    'IoStatus' : [ 0x30, ['_IO_STATUS_BLOCK']],
    'RequestorMode' : [ 0x40, ['unsigned char']],
    'PendingReturned' : [ 0x41, ['unsigned char']],
    'StackCount' : [ 0x42, ['unsigned char']],
    'CurrentLocation' : [ 0x43, ['unsigned char']],
    'Cancel' : [ 0x44, ['unsigned char']],
    'CancelIrql' : [ 0x45, ['unsigned char']],
    'ApcEnvironment' : [ 0x46, ['unsigned char']],
    'AllocationFlags' : [ 0x47, ['unsigned char']],
    'UserIosb' : [ 0x48, ['pointer64', ['_IO_STATUS_BLOCK']]],
    'UserEvent' : [ 0x50, ['pointer64', ['_KEVENT']]],
    'Overlay' : [ 0x58, ['__unnamed_1124']],
    'CancelRoutine' : [ 0x68, ['pointer64', ['void']]],
    'UserBuffer' : [ 0x70, ['pointer64', ['void']]],
    'Tail' : [ 0x78, ['__unnamed_19e8']],
} ],
  '_EJOB' : [ 0x640, {
    'Event' : [ 0x0, ['_KEVENT']],
    'JobLinks' : [ 0x18, ['_LIST_ENTRY']],
    'ProcessListHead' : [ 0x28, ['_LIST_ENTRY']],
    'JobLock' : [ 0x38, ['_ERESOURCE']],
    'TotalUserTime' : [ 0xa0, ['_LARGE_INTEGER']],
    'TotalKernelTime' : [ 0xa8, ['_LARGE_INTEGER']],
    'TotalCycleTime' : [ 0xb0, ['_LARGE_INTEGER']],
    'ThisPeriodTotalUserTime' : [ 0xb8, ['_LARGE_INTEGER']],
    'ThisPeriodTotalKernelTime' : [ 0xc0, ['_LARGE_INTEGER']],
    'TotalContextSwitches' : [ 0xc8, ['unsigned long long']],
    'TotalPageFaultCount' : [ 0xd0, ['unsigned long']],
    'TotalProcesses' : [ 0xd4, ['unsigned long']],
    'ActiveProcesses' : [ 0xd8, ['unsigned long']],
    'TotalTerminatedProcesses' : [ 0xdc, ['unsigned long']],
    'PerProcessUserTimeLimit' : [ 0xe0, ['_LARGE_INTEGER']],
    'PerJobUserTimeLimit' : [ 0xe8, ['_LARGE_INTEGER']],
    'MinimumWorkingSetSize' : [ 0xf0, ['unsigned long long']],
    'MaximumWorkingSetSize' : [ 0xf8, ['unsigned long long']],
    'LimitFlags' : [ 0x100, ['unsigned long']],
    'ActiveProcessLimit' : [ 0x104, ['unsigned long']],
    'Affinity' : [ 0x108, ['_KAFFINITY_EX']],
    'AccessState' : [ 0x1b0, ['pointer64', ['_JOB_ACCESS_STATE']]],
    'AccessStateQuotaReference' : [ 0x1b8, ['pointer64', ['void']]],
    'UIRestrictionsClass' : [ 0x1c0, ['unsigned long']],
    'EndOfJobTimeAction' : [ 0x1c4, ['unsigned long']],
    'CompletionPort' : [ 0x1c8, ['pointer64', ['void']]],
    'CompletionKey' : [ 0x1d0, ['pointer64', ['void']]],
    'CompletionCount' : [ 0x1d8, ['unsigned long long']],
    'SessionId' : [ 0x1e0, ['unsigned long']],
    'SchedulingClass' : [ 0x1e4, ['unsigned long']],
    'ReadOperationCount' : [ 0x1e8, ['unsigned long long']],
    'WriteOperationCount' : [ 0x1f0, ['unsigned long long']],
    'OtherOperationCount' : [ 0x1f8, ['unsigned long long']],
    'ReadTransferCount' : [ 0x200, ['unsigned long long']],
    'WriteTransferCount' : [ 0x208, ['unsigned long long']],
    'OtherTransferCount' : [ 0x210, ['unsigned long long']],
    'DiskIoInfo' : [ 0x218, ['_PROCESS_DISK_COUNTERS']],
    'ProcessMemoryLimit' : [ 0x240, ['unsigned long long']],
    'JobMemoryLimit' : [ 0x248, ['unsigned long long']],
    'JobTotalMemoryLimit' : [ 0x250, ['unsigned long long']],
    'PeakProcessMemoryUsed' : [ 0x258, ['unsigned long long']],
    'PeakJobMemoryUsed' : [ 0x260, ['unsigned long long']],
    'EffectiveAffinity' : [ 0x268, ['_KAFFINITY_EX']],
    'EffectivePerProcessUserTimeLimit' : [ 0x310, ['_LARGE_INTEGER']],
    'EffectiveMinimumWorkingSetSize' : [ 0x318, ['unsigned long long']],
    'EffectiveMaximumWorkingSetSize' : [ 0x320, ['unsigned long long']],
    'EffectiveProcessMemoryLimit' : [ 0x328, ['unsigned long long']],
    'EffectiveProcessMemoryLimitJob' : [ 0x330, ['pointer64', ['_EJOB']]],
    'EffectivePerProcessUserTimeLimitJob' : [ 0x338, ['pointer64', ['_EJOB']]],
    'EffectiveNetIoRateLimitJob' : [ 0x340, ['pointer64', ['_EJOB']]],
    'EffectiveHeapAttributionJob' : [ 0x348, ['pointer64', ['_EJOB']]],
    'EffectiveLimitFlags' : [ 0x350, ['unsigned long']],
    'EffectiveSchedulingClass' : [ 0x354, ['unsigned long']],
    'EffectiveFreezeCount' : [ 0x358, ['unsigned long']],
    'EffectiveBackgroundCount' : [ 0x35c, ['unsigned long']],
    'EffectiveSwapCount' : [ 0x360, ['unsigned long']],
    'EffectiveNotificationLimitCount' : [ 0x364, ['unsigned long']],
    'EffectivePriorityClass' : [ 0x368, ['unsigned char']],
    'PriorityClass' : [ 0x369, ['unsigned char']],
    'NestingDepth' : [ 0x36a, ['unsigned char']],
    'Reserved1' : [ 0x36b, ['array', 1, ['unsigned char']]],
    'CompletionFilter' : [ 0x36c, ['unsigned long']],
    'WakeChannel' : [ 0x370, ['_WNF_STATE_NAME']],
    'WakeInfo' : [ 0x370, ['_PS_JOB_WAKE_INFORMATION']],
    'WakeFilter' : [ 0x3b8, ['_JOBOBJECT_WAKE_FILTER']],
    'LowEdgeLatchFilter' : [ 0x3c0, ['unsigned long']],
    'NotificationLink' : [ 0x3c8, ['pointer64', ['_EJOB']]],
    'CurrentJobMemoryUsed' : [ 0x3d0, ['unsigned long long']],
    'NotificationInfo' : [ 0x3d8, ['pointer64', ['_JOB_NOTIFICATION_INFORMATION']]],
    'NotificationInfoQuotaReference' : [ 0x3e0, ['pointer64', ['void']]],
    'NotificationPacket' : [ 0x3e8, ['pointer64', ['_IO_MINI_COMPLETION_PACKET_USER']]],
    'CpuRateControl' : [ 0x3f0, ['pointer64', ['_JOB_CPU_RATE_CONTROL']]],
    'EffectiveSchedulingGroup' : [ 0x3f8, ['pointer64', ['void']]],
    'ReadyTime' : [ 0x400, ['unsigned long long']],
    'MemoryLimitsLock' : [ 0x408, ['_EX_PUSH_LOCK']],
    'SiblingJobLinks' : [ 0x410, ['_LIST_ENTRY']],
    'ChildJobListHead' : [ 0x420, ['_LIST_ENTRY']],
    'ParentJob' : [ 0x430, ['pointer64', ['_EJOB']]],
    'RootJob' : [ 0x438, ['pointer64', ['_EJOB']]],
    'IteratorListHead' : [ 0x440, ['_LIST_ENTRY']],
    'AncestorCount' : [ 0x450, ['unsigned long long']],
    'Ancestors' : [ 0x458, ['pointer64', ['pointer64', ['_EJOB']]]],
    'SessionObject' : [ 0x458, ['pointer64', ['void']]],
    'Accounting' : [ 0x460, ['_EPROCESS_VALUES']],
    'ShadowActiveProcessCount' : [ 0x4c8, ['unsigned long']],
    'ActiveAuxiliaryProcessCount' : [ 0x4cc, ['unsigned long']],
    'SequenceNumber' : [ 0x4d0, ['unsigned long']],
    'JobId' : [ 0x4d4, ['unsigned long']],
    'ContainerId' : [ 0x4d8, ['_GUID']],
    'ContainerTelemetryId' : [ 0x4e8, ['_GUID']],
    'ServerSiloGlobals' : [ 0x4f8, ['pointer64', ['_ESERVERSILO_GLOBALS']]],
    'PropertySet' : [ 0x500, ['_PS_PROPERTY_SET']],
    'Storage' : [ 0x518, ['pointer64', ['_PSP_STORAGE']]],
    'NetRateControl' : [ 0x520, ['pointer64', ['_JOB_NET_RATE_CONTROL']]],
    'JobFlags' : [ 0x528, ['unsigned long']],
    'CloseDone' : [ 0x528, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MultiGroup' : [ 0x528, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'OutstandingNotification' : [ 0x528, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'NotificationInProgress' : [ 0x528, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'UILimits' : [ 0x528, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'CpuRateControlActive' : [ 0x528, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'OwnCpuRateControl' : [ 0x528, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Terminating' : [ 0x528, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'WorkingSetLock' : [ 0x528, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'JobFrozen' : [ 0x528, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'Background' : [ 0x528, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'WakeNotificationAllocated' : [ 0x528, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'WakeNotificationEnabled' : [ 0x528, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'WakeNotificationPending' : [ 0x528, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'LimitNotificationRequired' : [ 0x528, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'ZeroCountNotificationRequired' : [ 0x528, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'CycleTimeNotificationRequired' : [ 0x528, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'CycleTimeNotificationPending' : [ 0x528, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'TimersVirtualized' : [ 0x528, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'JobSwapped' : [ 0x528, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'ViolationDetected' : [ 0x528, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'EmptyJobNotified' : [ 0x528, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'NoSystemCharge' : [ 0x528, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'DropNoWakeCharges' : [ 0x528, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'NoWakeChargePolicyDecided' : [ 0x528, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'NetRateControlActive' : [ 0x528, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'OwnNetRateControl' : [ 0x528, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'IoRateControlActive' : [ 0x528, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'OwnIoRateControl' : [ 0x528, ['BitField', dict(start_bit = 28, end_bit = 29, native_type='unsigned long')]],
    'DisallowNewProcesses' : [ 0x528, ['BitField', dict(start_bit = 29, end_bit = 30, native_type='unsigned long')]],
    'Silo' : [ 0x528, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'ContainerTelemetryIdSet' : [ 0x528, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'JobFlags2' : [ 0x52c, ['unsigned long']],
    'ParentLocked' : [ 0x52c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'EnableUsermodeSiloThreadImpersonation' : [ 0x52c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DisallowUsermodeSiloThreadImpersonation' : [ 0x52c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'EnergyValues' : [ 0x530, ['pointer64', ['_PROCESS_EXTENDED_ENERGY_VALUES']]],
    'SharedCommitCharge' : [ 0x538, ['unsigned long long']],
    'DiskIoAttributionUserRefCount' : [ 0x540, ['unsigned long']],
    'DiskIoAttributionRefCount' : [ 0x544, ['unsigned long']],
    'DiskIoAttributionContext' : [ 0x548, ['pointer64', ['void']]],
    'DiskIoAttributionOwnerJob' : [ 0x548, ['pointer64', ['_EJOB']]],
    'IoRateControlHeader' : [ 0x550, ['_JOB_RATE_CONTROL_HEADER']],
    'GlobalIoControl' : [ 0x578, ['_PS_IO_CONTROL_ENTRY']],
    'IoControlStateLock' : [ 0x5b0, ['long']],
    'VolumeIoControlTree' : [ 0x5b8, ['_RTL_RB_TREE']],
    'IoRateOverQuotaHistory' : [ 0x5c8, ['unsigned long long']],
    'IoRateCurrentGeneration' : [ 0x5d0, ['unsigned long']],
    'IoRateLastQueryGeneration' : [ 0x5d4, ['unsigned long']],
    'IoRateGenerationLength' : [ 0x5d8, ['unsigned long']],
    'IoRateOverQuotaNotifySequenceId' : [ 0x5dc, ['unsigned long']],
    'LastThrottledIoTime' : [ 0x5e0, ['unsigned long long']],
    'IoControlLock' : [ 0x5e8, ['_EX_PUSH_LOCK']],
    'SiloHardReferenceCount' : [ 0x5f0, ['long long']],
    'RundownWorkItem' : [ 0x5f8, ['_WORK_QUEUE_ITEM']],
    'PartitionObject' : [ 0x618, ['pointer64', ['void']]],
    'PartitionOwnerJob' : [ 0x620, ['pointer64', ['_EJOB']]],
    'EnergyTrackingState' : [ 0x628, ['_JOBOBJECT_ENERGY_TRACKING_STATE']],
    'KernelWaitTime' : [ 0x630, ['unsigned long long']],
    'UserWaitTime' : [ 0x638, ['unsigned long long']],
} ],
  '_IO_PRIORITY_INFO' : [ 0x10, {
    'Size' : [ 0x0, ['unsigned long']],
    'ThreadPriority' : [ 0x4, ['unsigned long']],
    'PagePriority' : [ 0x8, ['unsigned long']],
    'IoPriority' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'IoPriorityVeryLow', 1: u'IoPriorityLow', 2: u'IoPriorityNormal', 3: u'IoPriorityHigh', 4: u'IoPriorityCritical', 5: u'MaxIoPriorityTypes'})]],
} ],
  '_MDL' : [ 0x30, {
    'Next' : [ 0x0, ['pointer64', ['_MDL']]],
    'Size' : [ 0x8, ['short']],
    'MdlFlags' : [ 0xa, ['short']],
    'AllocationProcessorNumber' : [ 0xc, ['unsigned short']],
    'Reserved' : [ 0xe, ['unsigned short']],
    'Process' : [ 0x10, ['pointer64', ['_EPROCESS']]],
    'MappedSystemVa' : [ 0x18, ['pointer64', ['void']]],
    'StartVa' : [ 0x20, ['pointer64', ['void']]],
    'ByteCount' : [ 0x28, ['unsigned long']],
    'ByteOffset' : [ 0x2c, ['unsigned long']],
} ],
  '_EVENT_RECORD' : [ 0x70, {
    'EventHeader' : [ 0x0, ['_EVENT_HEADER']],
    'BufferContext' : [ 0x50, ['_ETW_BUFFER_CONTEXT']],
    'ExtendedDataCount' : [ 0x54, ['unsigned short']],
    'UserDataLength' : [ 0x56, ['unsigned short']],
    'ExtendedData' : [ 0x58, ['pointer64', ['_EVENT_HEADER_EXTENDED_DATA_ITEM']]],
    'UserData' : [ 0x60, ['pointer64', ['void']]],
    'UserContext' : [ 0x68, ['pointer64', ['void']]],
} ],
  '_PERFINFO_GROUPMASK' : [ 0x20, {
    'Masks' : [ 0x0, ['array', 8, ['unsigned long']]],
} ],
  '_EX_RUNDOWN_REF' : [ 0x8, {
    'Count' : [ 0x0, ['unsigned long long']],
    'Ptr' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_MM_PAGE_ACCESS_INFO_HEADER' : [ 0x48, {
    'Link' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'MmPteAccessType', 1: u'MmCcReadAheadType', 2: u'MmPfnRepurposeType', 3: u'MmMaximumPageAccessType'})]],
    'EmptySequenceNumber' : [ 0xc, ['unsigned long']],
    'CurrentFileIndex' : [ 0xc, ['unsigned long']],
    'CreateTime' : [ 0x10, ['unsigned long long']],
    'EmptyTime' : [ 0x18, ['unsigned long long']],
    'TempEntry' : [ 0x18, ['pointer64', ['_MM_PAGE_ACCESS_INFO']]],
    'PageEntry' : [ 0x20, ['pointer64', ['_MM_PAGE_ACCESS_INFO']]],
    'FileEntry' : [ 0x28, ['pointer64', ['unsigned long long']]],
    'FirstFileEntry' : [ 0x30, ['pointer64', ['unsigned long long']]],
    'Process' : [ 0x38, ['pointer64', ['_EPROCESS']]],
    'SessionId' : [ 0x40, ['unsigned long']],
    'PageFrameEntry' : [ 0x20, ['pointer64', ['unsigned long long']]],
    'LastPageFrameEntry' : [ 0x28, ['pointer64', ['unsigned long long']]],
} ],
  '_PROCESS_EXTENDED_ENERGY_VALUES' : [ 0x1b0, {
    'Base' : [ 0x0, ['_PROCESS_ENERGY_VALUES']],
    'Extension' : [ 0x110, ['_PROCESS_ENERGY_VALUES_EXTENSION']],
} ],
  '_FSRTL_ADVANCED_FCB_HEADER' : [ 0x68, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'Flags' : [ 0x4, ['unsigned char']],
    'IsFastIoPossible' : [ 0x5, ['unsigned char']],
    'Flags2' : [ 0x6, ['unsigned char']],
    'Reserved' : [ 0x7, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'Version' : [ 0x7, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Resource' : [ 0x8, ['pointer64', ['_ERESOURCE']]],
    'PagingIoResource' : [ 0x10, ['pointer64', ['_ERESOURCE']]],
    'AllocationSize' : [ 0x18, ['_LARGE_INTEGER']],
    'FileSize' : [ 0x20, ['_LARGE_INTEGER']],
    'ValidDataLength' : [ 0x28, ['_LARGE_INTEGER']],
    'FastMutex' : [ 0x30, ['pointer64', ['_FAST_MUTEX']]],
    'FilterContexts' : [ 0x38, ['_LIST_ENTRY']],
    'PushLock' : [ 0x48, ['_EX_PUSH_LOCK']],
    'FileContextSupportPointer' : [ 0x50, ['pointer64', ['pointer64', ['void']]]],
    'Oplock' : [ 0x58, ['pointer64', ['void']]],
    'ReservedForRemote' : [ 0x58, ['pointer64', ['void']]],
    'ReservedContext' : [ 0x60, ['pointer64', ['void']]],
} ],
  '_iobuf' : [ 0x30, {
    '_ptr' : [ 0x0, ['pointer64', ['unsigned char']]],
    '_cnt' : [ 0x8, ['long']],
    '_base' : [ 0x10, ['pointer64', ['unsigned char']]],
    '_flag' : [ 0x18, ['long']],
    '_file' : [ 0x1c, ['long']],
    '_charbuf' : [ 0x20, ['long']],
    '_bufsiz' : [ 0x24, ['long']],
    '_tmpfname' : [ 0x28, ['pointer64', ['unsigned char']]],
} ],
  '_RTL_HASH_TABLE' : [ 0x10, {
    'EntryCount' : [ 0x0, ['unsigned long']],
    'MaskBitCount' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 5, native_type='unsigned long')]],
    'BucketCount' : [ 0x4, ['BitField', dict(start_bit = 5, end_bit = 32, native_type='unsigned long')]],
    'Buckets' : [ 0x8, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_RTL_HASH_ENTRY' : [ 0x10, {
    'BucketLink' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Key' : [ 0x8, ['unsigned long long']],
} ],
  '_RTL_HASH_TABLE_ITERATOR' : [ 0x18, {
    'Hash' : [ 0x0, ['pointer64', ['_RTL_HASH_TABLE']]],
    'HashEntry' : [ 0x8, ['pointer64', ['_RTL_HASH_ENTRY']]],
    'Bucket' : [ 0x10, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_RTL_CHASH_TABLE' : [ 0x18, {
    'Table' : [ 0x0, ['pointer64', ['_RTL_CHASH_ENTRY']]],
    'EntrySizeShift' : [ 0x8, ['unsigned long']],
    'EntryMax' : [ 0xc, ['unsigned long']],
    'EntryCount' : [ 0x10, ['unsigned long']],
} ],
  '_RTL_CHASH_ENTRY' : [ 0x8, {
    'Key' : [ 0x0, ['unsigned long long']],
} ],
  '_tlgProvider_t' : [ 0x38, {
    'LevelPlus1' : [ 0x0, ['unsigned long']],
    'ProviderMetadataPtr' : [ 0x8, ['pointer64', ['unsigned short']]],
    'KeywordAny' : [ 0x10, ['unsigned long long']],
    'KeywordAll' : [ 0x18, ['unsigned long long']],
    'RegHandle' : [ 0x20, ['unsigned long long']],
    'EnableCallback' : [ 0x28, ['pointer64', ['void']]],
    'CallbackContext' : [ 0x30, ['pointer64', ['void']]],
} ],
  '_EVENT_FILTER_DESCRIPTOR' : [ 0x10, {
    'Ptr' : [ 0x0, ['unsigned long long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned long']],
} ],
  '_tlgProviderMetadata_t' : [ 0x13, {
    'Type' : [ 0x0, ['unsigned char']],
    'ProviderId' : [ 0x1, ['_GUID']],
    'RemainingSize' : [ 0x11, ['unsigned short']],
} ],
  '__m64' : [ 0x8, {
    'm64_u64' : [ 0x0, ['unsigned long long']],
    'm64_f32' : [ 0x0, ['array', 2, ['float']]],
    'm64_i8' : [ 0x0, ['array', 8, ['unsigned char']]],
    'm64_i16' : [ 0x0, ['array', 4, ['short']]],
    'm64_i32' : [ 0x0, ['array', 2, ['long']]],
    'm64_i64' : [ 0x0, ['long long']],
    'm64_u8' : [ 0x0, ['array', 8, ['unsigned char']]],
    'm64_u16' : [ 0x0, ['array', 4, ['unsigned short']]],
    'm64_u32' : [ 0x0, ['array', 2, ['unsigned long']]],
} ],
  '__m128' : [ 0x10, {
    'm128_f32' : [ 0x0, ['array', 4, ['float']]],
    'm128_u64' : [ 0x0, ['array', 2, ['unsigned long long']]],
    'm128_i8' : [ 0x0, ['array', 16, ['unsigned char']]],
    'm128_i16' : [ 0x0, ['array', 8, ['short']]],
    'm128_i32' : [ 0x0, ['array', 4, ['long']]],
    'm128_i64' : [ 0x0, ['array', 2, ['long long']]],
    'm128_u8' : [ 0x0, ['array', 16, ['unsigned char']]],
    'm128_u16' : [ 0x0, ['array', 8, ['unsigned short']]],
    'm128_u32' : [ 0x0, ['array', 4, ['unsigned long']]],
} ],
  'wil_details_FeatureReportingCache' : [ 0x8, {
    'reported' : [ 0x0, ['wil_details_ReportedState']],
    'recorded' : [ 0x4, ['wil_details_RecordedState']],
} ],
  'wil_details_RecordUsageResult' : [ 0x18, {
    'queueBackground' : [ 0x0, ['long']],
    'countImmediate' : [ 0x4, ['unsigned long']],
    'kindImmediate' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'wil_details_ServiceReportingKind_UniqueUsage', 1: u'wil_details_ServiceReportingKind_UniqueOpportunity', 2: u'wil_details_ServiceReportingKind_DeviceUsage', 3: u'wil_details_ServiceReportingKind_DeviceOpportunity', 4: u'wil_details_ServiceReportingKind_PotentialUniqueUsage', 5: u'wil_details_ServiceReportingKind_PotentialUniqueOpportunity', 6: u'wil_details_ServiceReportingKind_PotentialDeviceUsage', 7: u'wil_details_ServiceReportingKind_PotentialDeviceOpportunity', 8: u'wil_details_ServiceReportingKind_EnabledTotalDuration', 9: u'wil_details_ServiceReportingKind_EnabledPausedDuration', 10: u'wil_details_ServiceReportingKind_DisabledTotalDuration', 11: u'wil_details_ServiceReportingKind_DisabledPausedDuration', 256: u'wil_details_ServiceReportingKind_VariantDevicePotentialBase', 320: u'wil_details_ServiceReportingKind_VariantDeviceUsageBase', 384: u'wil_details_ServiceReportingKind_VariantUniquePotentialBase', 448: u'wil_details_ServiceReportingKind_VariantUniqueUsageBase', 150: u'wil_details_ServiceReportingKind_CustomDisabledBase', 100: u'wil_details_ServiceReportingKind_CustomEnabledBase', 254: u'wil_details_ServiceReportingKind_Store', 255: u'wil_details_ServiceReportingKind_None'})]],
    'payloadId' : [ 0xc, ['unsigned long']],
    'ignoredUse' : [ 0x10, ['long']],
    'isVariantConfiguration' : [ 0x14, ['long']],
} ],
  'wil_details_ReportedState' : [ 0x4, {
    'exchange' : [ 0x0, ['unsigned long']],
    'queuedForReporting' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'reportedDeviceUsage' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'reportedDevicePotential' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'reportedDeviceOpportunity' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'reportedDevicePotentialOpportunity' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'usageCount' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 14, native_type='unsigned long')]],
    'usageCountRepresentsPotential' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'opportunityCount' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 22, native_type='unsigned long')]],
    'opportunityCountRepresentsPotential' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'unused' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 32, native_type='unsigned long')]],
} ],
  'wil_details_RecordedState' : [ 0x4, {
    'exchange' : [ 0x0, ['unsigned long']],
    'recordedDeviceUsage' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'recordedDevicePotential' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'recordedDeviceOpportunity' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'recordedDevicePotentialOpportunity' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'recordedVariantDeviceUsage' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'recordedVariant' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 11, native_type='unsigned long')]],
    'unused' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 32, native_type='unsigned long')]],
} ],
  'FEATURE_ERROR' : [ 0x68, {
    'hr' : [ 0x0, ['unsigned long']],
    'lineNumber' : [ 0x4, ['unsigned short']],
    'file' : [ 0x8, ['pointer64', ['unsigned char']]],
    'process' : [ 0x10, ['pointer64', ['unsigned char']]],
    'modulePath' : [ 0x18, ['pointer64', ['unsigned char']]],
    'callerReturnAddressOffset' : [ 0x20, ['unsigned long']],
    'callerModule' : [ 0x28, ['pointer64', ['unsigned char']]],
    'message' : [ 0x30, ['pointer64', ['unsigned char']]],
    'originLineNumber' : [ 0x38, ['unsigned short']],
    'originFile' : [ 0x40, ['pointer64', ['unsigned char']]],
    'originModule' : [ 0x48, ['pointer64', ['unsigned char']]],
    'originCallerReturnAddressOffset' : [ 0x50, ['unsigned long']],
    'originCallerModule' : [ 0x58, ['pointer64', ['unsigned char']]],
    'originName' : [ 0x60, ['pointer64', ['unsigned char']]],
} ],
  'FEATURE_LOGGED_TRAITS' : [ 0x6, {
    'version' : [ 0x0, ['unsigned short']],
    'baseVersion' : [ 0x2, ['unsigned short']],
    'stage' : [ 0x4, ['unsigned char']],
} ],
  'wil_details_StagingConfigFeature' : [ 0xc, {
    'featureId' : [ 0x0, ['unsigned long']],
    'changedInSession' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'isVariantConfig' : [ 0x4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'unused1' : [ 0x4, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned long')]],
    'serviceState' : [ 0x4, ['BitField', dict(start_bit = 8, end_bit = 10, native_type='unsigned long')]],
    'userState' : [ 0x4, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
    'testState' : [ 0x4, ['BitField', dict(start_bit = 12, end_bit = 14, native_type='unsigned long')]],
    'unused2' : [ 0x4, ['BitField', dict(start_bit = 14, end_bit = 16, native_type='unsigned long')]],
