ntkrpamp_types = {
  'LIST_ENTRY64' : [ 0x10, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'Blink' : [ 0x8, ['unsigned long long']],
} ],
  'LIST_ENTRY32' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long']],
    'Blink' : [ 0x4, ['unsigned long']],
} ],
  '_PS_MITIGATION_OPTIONS_MAP' : [ 0x18, {
    'Map' : [ 0x0, ['array', 3, ['unsigned long long']]],
} ],
  '_PS_MITIGATION_AUDIT_OPTIONS_MAP' : [ 0x18, {
    'Map' : [ 0x0, ['array', 3, ['unsigned long long']]],
} ],
  '__unnamed_107f' : [ 0x4, {
    'AllFlags' : [ 0x0, ['unsigned long']],
    'Win32Process' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Sgx2Enclave' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'VbsBasicEnclave' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'SpareBits' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
} ],
  '_KUSER_SHARED_DATA' : [ 0x720, {
    'TickCountLowDeprecated' : [ 0x0, ['unsigned long']],
    'TickCountMultiplier' : [ 0x4, ['unsigned long']],
    'InterruptTime' : [ 0x8, ['_KSYSTEM_TIME']],
    'SystemTime' : [ 0x14, ['_KSYSTEM_TIME']],
    'TimeZoneBias' : [ 0x20, ['_KSYSTEM_TIME']],
    'ImageNumberLow' : [ 0x2c, ['unsigned short']],
    'ImageNumberHigh' : [ 0x2e, ['unsigned short']],
    'NtSystemRoot' : [ 0x30, ['array', 260, ['wchar']]],
    'MaxStackTraceDepth' : [ 0x238, ['unsigned long']],
    'CryptoExponent' : [ 0x23c, ['unsigned long']],
    'TimeZoneId' : [ 0x240, ['unsigned long']],
    'LargePageMinimum' : [ 0x244, ['unsigned long']],
    'AitSamplingValue' : [ 0x248, ['unsigned long']],
    'AppCompatFlag' : [ 0x24c, ['unsigned long']],
    'RNGSeedVersion' : [ 0x250, ['unsigned long long']],
    'GlobalValidationRunlevel' : [ 0x258, ['unsigned long']],
    'TimeZoneBiasStamp' : [ 0x25c, ['long']],
    'NtBuildNumber' : [ 0x260, ['unsigned long']],
    'NtProductType' : [ 0x264, ['Enumeration', dict(target = 'long', choices = {1: u'NtProductWinNt', 2: u'NtProductLanManNt', 3: u'NtProductServer'})]],
    'ProductTypeIsValid' : [ 0x268, ['unsigned char']],
    'Reserved0' : [ 0x269, ['array', 1, ['unsigned char']]],
    'NativeProcessorArchitecture' : [ 0x26a, ['unsigned short']],
    'NtMajorVersion' : [ 0x26c, ['unsigned long']],
    'NtMinorVersion' : [ 0x270, ['unsigned long']],
    'ProcessorFeatures' : [ 0x274, ['array', 64, ['unsigned char']]],
    'Reserved1' : [ 0x2b4, ['unsigned long']],
    'Reserved3' : [ 0x2b8, ['unsigned long']],
    'TimeSlip' : [ 0x2bc, ['unsigned long']],
    'AlternativeArchitecture' : [ 0x2c0, ['Enumeration', dict(target = 'long', choices = {0: u'StandardDesign', 1: u'NEC98x86', 2: u'EndAlternatives'})]],
    'BootId' : [ 0x2c4, ['unsigned long']],
    'SystemExpirationDate' : [ 0x2c8, ['_LARGE_INTEGER']],
    'SuiteMask' : [ 0x2d0, ['unsigned long']],
    'KdDebuggerEnabled' : [ 0x2d4, ['unsigned char']],
    'MitigationPolicies' : [ 0x2d5, ['unsigned char']],
    'NXSupportPolicy' : [ 0x2d5, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'SEHValidationPolicy' : [ 0x2d5, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned char')]],
    'CurDirDevicesSkippedForDlls' : [ 0x2d5, ['BitField', dict(start_bit = 4, end_bit = 6, native_type='unsigned char')]],
    'Reserved' : [ 0x2d5, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'CyclesPerYield' : [ 0x2d6, ['unsigned short']],
    'ActiveConsoleId' : [ 0x2d8, ['unsigned long']],
    'DismountCount' : [ 0x2dc, ['unsigned long']],
    'ComPlusPackage' : [ 0x2e0, ['unsigned long']],
    'LastSystemRITEventTickCount' : [ 0x2e4, ['unsigned long']],
    'NumberOfPhysicalPages' : [ 0x2e8, ['unsigned long']],
    'SafeBootMode' : [ 0x2ec, ['unsigned char']],
    'VirtualizationFlags' : [ 0x2ed, ['unsigned char']],
    'Reserved12' : [ 0x2ee, ['array', 2, ['unsigned char']]],
    'SharedDataFlags' : [ 0x2f0, ['unsigned long']],
    'DbgErrorPortPresent' : [ 0x2f0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DbgElevationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DbgVirtEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DbgInstallerDetectEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DbgLkgEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DbgDynProcessorEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DbgConsoleBrokerEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DbgSecureBootEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'DbgMultiSessionSku' : [ 0x2f0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'DbgMultiUsersInSessionSku' : [ 0x2f0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DbgStateSeparationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'SpareBits' : [ 0x2f0, ['BitField', dict(start_bit = 11, end_bit = 32, native_type='unsigned long')]],
    'DataFlagsPad' : [ 0x2f4, ['array', 1, ['unsigned long']]],
    'TestRetInstruction' : [ 0x2f8, ['unsigned long long']],
    'QpcFrequency' : [ 0x300, ['long long']],
    'SystemCall' : [ 0x308, ['unsigned long']],
    'UserCetAvailableEnvironments' : [ 0x30c, ['__unnamed_107f']],
    'SystemCallPad' : [ 0x310, ['array', 2, ['unsigned long long']]],
    'TickCount' : [ 0x320, ['_KSYSTEM_TIME']],
    'TickCountQuad' : [ 0x320, ['unsigned long long']],
    'ReservedTickCountOverlay' : [ 0x320, ['array', 3, ['unsigned long']]],
    'TickCountPad' : [ 0x32c, ['array', 1, ['unsigned long']]],
    'Cookie' : [ 0x330, ['unsigned long']],
    'CookiePad' : [ 0x334, ['array', 1, ['unsigned long']]],
    'ConsoleSessionForegroundProcessId' : [ 0x338, ['long long']],
    'TimeUpdateLock' : [ 0x340, ['unsigned long long']],
    'BaselineSystemTimeQpc' : [ 0x348, ['unsigned long long']],
    'BaselineInterruptTimeQpc' : [ 0x350, ['unsigned long long']],
    'QpcSystemTimeIncrement' : [ 0x358, ['unsigned long long']],
    'QpcInterruptTimeIncrement' : [ 0x360, ['unsigned long long']],
    'QpcSystemTimeIncrementShift' : [ 0x368, ['unsigned char']],
    'QpcInterruptTimeIncrementShift' : [ 0x369, ['unsigned char']],
    'UnparkedProcessorCount' : [ 0x36a, ['unsigned short']],
    'EnclaveFeatureMask' : [ 0x36c, ['array', 4, ['unsigned long']]],
    'TelemetryCoverageRound' : [ 0x37c, ['unsigned long']],
    'UserModeGlobalLogger' : [ 0x380, ['array', 16, ['unsigned short']]],
    'ImageFileExecutionOptions' : [ 0x3a0, ['unsigned long']],
    'LangGenerationCount' : [ 0x3a4, ['unsigned long']],
    'Reserved4' : [ 0x3a8, ['unsigned long long']],
    'InterruptTimeBias' : [ 0x3b0, ['unsigned long long']],
    'QpcBias' : [ 0x3b8, ['unsigned long long']],
    'ActiveProcessorCount' : [ 0x3c0, ['unsigned long']],
    'ActiveGroupCount' : [ 0x3c4, ['unsigned char']],
    'Reserved9' : [ 0x3c5, ['unsigned char']],
    'QpcData' : [ 0x3c6, ['unsigned short']],
    'QpcBypassEnabled' : [ 0x3c6, ['unsigned char']],
    'QpcShift' : [ 0x3c7, ['unsigned char']],
    'TimeZoneBiasEffectiveStart' : [ 0x3c8, ['_LARGE_INTEGER']],
    'TimeZoneBiasEffectiveEnd' : [ 0x3d0, ['_LARGE_INTEGER']],
    'XState' : [ 0x3d8, ['_XSTATE_CONFIGURATION']],
    'FeatureConfigurationChangeStamp' : [ 0x710, ['_KSYSTEM_TIME']],
    'Spare' : [ 0x71c, ['unsigned long']],
} ],
  '__unnamed_108c' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
} ],
  '_ULARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
    'u' : [ 0x0, ['__unnamed_108c']],
    'QuadPart' : [ 0x0, ['unsigned long long']],
} ],
  '__unnamed_1090' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_LARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
    'u' : [ 0x0, ['__unnamed_1090']],
    'QuadPart' : [ 0x0, ['long long']],
} ],
  '__unnamed_10ab' : [ 0x4, {
    'LongFunction' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Persistent' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Private' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_10ad' : [ 0x4, {
    'Flags' : [ 0x0, ['unsigned long']],
    's' : [ 0x0, ['__unnamed_10ab']],
} ],
  '_TP_CALLBACK_ENVIRON_V3' : [ 0x28, {
    'Version' : [ 0x0, ['unsigned long']],
    'Pool' : [ 0x4, ['pointer', ['_TP_POOL']]],
    'CleanupGroup' : [ 0x8, ['pointer', ['_TP_CLEANUP_GROUP']]],
    'CleanupGroupCancelCallback' : [ 0xc, ['pointer', ['void']]],
    'RaceDll' : [ 0x10, ['pointer', ['void']]],
    'ActivationContext' : [ 0x14, ['pointer', ['_ACTIVATION_CONTEXT']]],
    'FinalizationCallback' : [ 0x18, ['pointer', ['void']]],
    'u' : [ 0x1c, ['__unnamed_10ad']],
    'CallbackPriority' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {0: u'TP_CALLBACK_PRIORITY_HIGH', 1: u'TP_CALLBACK_PRIORITY_NORMAL', 2: u'TP_CALLBACK_PRIORITY_LOW', 3: u'TP_CALLBACK_PRIORITY_COUNT'})]],
    'Size' : [ 0x24, ['unsigned long']],
} ],
  '_TEB' : [ 0x1000, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'EnvironmentPointer' : [ 0x1c, ['pointer', ['void']]],
    'ClientId' : [ 0x20, ['_CLIENT_ID']],
    'ActiveRpcHandle' : [ 0x28, ['pointer', ['void']]],
    'ThreadLocalStoragePointer' : [ 0x2c, ['pointer', ['void']]],
    'ProcessEnvironmentBlock' : [ 0x30, ['pointer', ['_PEB']]],
    'LastErrorValue' : [ 0x34, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x38, ['unsigned long']],
    'CsrClientThread' : [ 0x3c, ['pointer', ['void']]],
    'Win32ThreadInfo' : [ 0x40, ['pointer', ['void']]],
    'User32Reserved' : [ 0x44, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xac, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0xc0, ['pointer', ['void']]],
    'CurrentLocale' : [ 0xc4, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0xc8, ['unsigned long']],
    'ReservedForDebuggerInstrumentation' : [ 0xcc, ['array', 16, ['pointer', ['void']]]],
    'SystemReserved1' : [ 0x10c, ['array', 26, ['pointer', ['void']]]],
    'PlaceholderCompatibilityMode' : [ 0x174, ['unsigned char']],
    'PlaceholderHydrationAlwaysExplicit' : [ 0x175, ['unsigned char']],
    'PlaceholderReserved' : [ 0x176, ['array', 10, ['unsigned char']]],
    'ProxiedProcessId' : [ 0x180, ['unsigned long']],
    '_ActivationStack' : [ 0x184, ['_ACTIVATION_CONTEXT_STACK']],
    'WorkingOnBehalfTicket' : [ 0x19c, ['array', 8, ['unsigned char']]],
    'ExceptionCode' : [ 0x1a4, ['long']],
    'ActivationContextStackPointer' : [ 0x1a8, ['pointer', ['_ACTIVATION_CONTEXT_STACK']]],
    'InstrumentationCallbackSp' : [ 0x1ac, ['unsigned long']],
    'InstrumentationCallbackPreviousPc' : [ 0x1b0, ['unsigned long']],
    'InstrumentationCallbackPreviousSp' : [ 0x1b4, ['unsigned long']],
    'InstrumentationCallbackDisabled' : [ 0x1b8, ['unsigned char']],
    'SpareBytes' : [ 0x1b9, ['array', 23, ['unsigned char']]],
    'TxFsContext' : [ 0x1d0, ['unsigned long']],
    'GdiTebBatch' : [ 0x1d4, ['_GDI_TEB_BATCH']],
    'RealClientId' : [ 0x6b4, ['_CLIENT_ID']],
    'GdiCachedProcessHandle' : [ 0x6bc, ['pointer', ['void']]],
    'GdiClientPID' : [ 0x6c0, ['unsigned long']],
    'GdiClientTID' : [ 0x6c4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x6c8, ['pointer', ['void']]],
    'Win32ClientInfo' : [ 0x6cc, ['array', 62, ['unsigned long']]],
    'glDispatchTable' : [ 0x7c4, ['array', 233, ['pointer', ['void']]]],
    'glReserved1' : [ 0xb68, ['array', 29, ['unsigned long']]],
    'glReserved2' : [ 0xbdc, ['pointer', ['void']]],
    'glSectionInfo' : [ 0xbe0, ['pointer', ['void']]],
    'glSection' : [ 0xbe4, ['pointer', ['void']]],
    'glTable' : [ 0xbe8, ['pointer', ['void']]],
    'glCurrentRC' : [ 0xbec, ['pointer', ['void']]],
    'glContext' : [ 0xbf0, ['pointer', ['void']]],
    'LastStatusValue' : [ 0xbf4, ['unsigned long']],
    'StaticUnicodeString' : [ 0xbf8, ['_UNICODE_STRING']],
    'StaticUnicodeBuffer' : [ 0xc00, ['array', 261, ['wchar']]],
    'DeallocationStack' : [ 0xe0c, ['pointer', ['void']]],
    'TlsSlots' : [ 0xe10, ['array', 64, ['pointer', ['void']]]],
    'TlsLinks' : [ 0xf10, ['_LIST_ENTRY']],
    'Vdm' : [ 0xf18, ['pointer', ['void']]],
    'ReservedForNtRpc' : [ 0xf1c, ['pointer', ['void']]],
    'DbgSsReserved' : [ 0xf20, ['array', 2, ['pointer', ['void']]]],
    'HardErrorMode' : [ 0xf28, ['unsigned long']],
    'Instrumentation' : [ 0xf2c, ['array', 9, ['pointer', ['void']]]],
    'ActivityId' : [ 0xf50, ['_GUID']],
    'SubProcessTag' : [ 0xf60, ['pointer', ['void']]],
    'PerflibData' : [ 0xf64, ['pointer', ['void']]],
    'EtwTraceData' : [ 0xf68, ['pointer', ['void']]],
    'WinSockData' : [ 0xf6c, ['pointer', ['void']]],
    'GdiBatchCount' : [ 0xf70, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0xf74, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0xf74, ['unsigned long']],
    'ReservedPad0' : [ 0xf74, ['unsigned char']],
    'ReservedPad1' : [ 0xf75, ['unsigned char']],
    'ReservedPad2' : [ 0xf76, ['unsigned char']],
    'IdealProcessor' : [ 0xf77, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0xf78, ['unsigned long']],
    'ReservedForPerf' : [ 0xf7c, ['pointer', ['void']]],
    'ReservedForOle' : [ 0xf80, ['pointer', ['void']]],
    'WaitingOnLoaderLock' : [ 0xf84, ['unsigned long']],
    'SavedPriorityState' : [ 0xf88, ['pointer', ['void']]],
    'ReservedForCodeCoverage' : [ 0xf8c, ['unsigned long']],
    'ThreadPoolData' : [ 0xf90, ['pointer', ['void']]],
    'TlsExpansionSlots' : [ 0xf94, ['pointer', ['pointer', ['void']]]],
    'MuiGeneration' : [ 0xf98, ['unsigned long']],
    'IsImpersonating' : [ 0xf9c, ['unsigned long']],
    'NlsCache' : [ 0xfa0, ['pointer', ['void']]],
    'pShimData' : [ 0xfa4, ['pointer', ['void']]],
    'HeapData' : [ 0xfa8, ['unsigned long']],
    'CurrentTransactionHandle' : [ 0xfac, ['pointer', ['void']]],
    'ActiveFrame' : [ 0xfb0, ['pointer', ['_TEB_ACTIVE_FRAME']]],
    'FlsData' : [ 0xfb4, ['pointer', ['void']]],
    'PreferredLanguages' : [ 0xfb8, ['pointer', ['void']]],
    'UserPrefLanguages' : [ 0xfbc, ['pointer', ['void']]],
    'MergedPrefLanguages' : [ 0xfc0, ['pointer', ['void']]],
    'MuiImpersonation' : [ 0xfc4, ['unsigned long']],
    'CrossTebFlags' : [ 0xfc8, ['unsigned short']],
    'SpareCrossTebBits' : [ 0xfc8, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0xfca, ['unsigned short']],
    'SafeThunkCall' : [ 0xfca, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0xfca, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0xfca, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0xfca, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0xfca, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0xfca, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0xfca, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0xfca, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0xfca, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0xfca, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0xfca, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SessionAware' : [ 0xfca, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
    'LoadOwner' : [ 0xfca, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
    'LoaderWorker' : [ 0xfca, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
    'SkipLoaderInit' : [ 0xfca, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0xfca, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0xfcc, ['pointer', ['void']]],
    'TxnScopeExitCallback' : [ 0xfd0, ['pointer', ['void']]],
    'TxnScopeContext' : [ 0xfd4, ['pointer', ['void']]],
    'LockCount' : [ 0xfd8, ['unsigned long']],
    'WowTebOffset' : [ 0xfdc, ['long']],
    'ResourceRetValue' : [ 0xfe0, ['pointer', ['void']]],
    'ReservedForWdf' : [ 0xfe4, ['pointer', ['void']]],
    'ReservedForCrt' : [ 0xfe8, ['unsigned long long']],
    'EffectiveContainerId' : [ 0xff0, ['_GUID']],
} ],
  '_LIST_ENTRY' : [ 0x8, {
    'Flink' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'Blink' : [ 0x4, ['pointer', ['_LIST_ENTRY']]],
} ],
  '_SINGLE_LIST_ENTRY' : [ 0x4, {
    'Next' : [ 0x0, ['pointer', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_RTL_SPLAY_LINKS' : [ 0xc, {
    'Parent' : [ 0x0, ['pointer', ['_RTL_SPLAY_LINKS']]],
    'LeftChild' : [ 0x4, ['pointer', ['_RTL_SPLAY_LINKS']]],
    'RightChild' : [ 0x8, ['pointer', ['_RTL_SPLAY_LINKS']]],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_CONTEXT' : [ 0xc, {
    'ChainHead' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'PrevLinkage' : [ 0x4, ['pointer', ['_LIST_ENTRY']]],
    'Signature' : [ 0x8, ['unsigned long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_ENUMERATOR' : [ 0x14, {
    'HashEntry' : [ 0x0, ['_RTL_DYNAMIC_HASH_TABLE_ENTRY']],
    'CurEntry' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'ChainHead' : [ 0xc, ['pointer', ['_LIST_ENTRY']]],
    'BucketIndex' : [ 0x10, ['unsigned long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE' : [ 0x24, {
    'Flags' : [ 0x0, ['unsigned long']],
    'Shift' : [ 0x4, ['unsigned long']],
    'TableSize' : [ 0x8, ['unsigned long']],
    'Pivot' : [ 0xc, ['unsigned long']],
    'DivisorMask' : [ 0x10, ['unsigned long']],
    'NumEntries' : [ 0x14, ['unsigned long']],
    'NonEmptyBuckets' : [ 0x18, ['unsigned long']],
    'NumEnumerators' : [ 0x1c, ['unsigned long']],
    'Directory' : [ 0x20, ['pointer', ['void']]],
} ],
  '_UNICODE_STRING' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x4, ['pointer', ['wchar']]],
} ],
  '_STRING' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x4, ['pointer', ['unsigned char']]],
} ],
  '_LUID' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG' : [ 0x8, {
    'Size' : [ 0x0, ['unsigned long']],
    'TriggerId' : [ 0x4, ['pointer', ['wchar']]],
} ],
  '_IMAGE_NT_HEADERS' : [ 0xf8, {
    'Signature' : [ 0x0, ['unsigned long']],
    'FileHeader' : [ 0x4, ['_IMAGE_FILE_HEADER']],
    'OptionalHeader' : [ 0x18, ['_IMAGE_OPTIONAL_HEADER']],
} ],
  '_IMAGE_DOS_HEADER' : [ 0x40, {
    'e_magic' : [ 0x0, ['unsigned short']],
    'e_cblp' : [ 0x2, ['unsigned short']],
    'e_cp' : [ 0x4, ['unsigned short']],
    'e_crlc' : [ 0x6, ['unsigned short']],
    'e_cparhdr' : [ 0x8, ['unsigned short']],
    'e_minalloc' : [ 0xa, ['unsigned short']],
    'e_maxalloc' : [ 0xc, ['unsigned short']],
    'e_ss' : [ 0xe, ['unsigned short']],
    'e_sp' : [ 0x10, ['unsigned short']],
    'e_csum' : [ 0x12, ['unsigned short']],
    'e_ip' : [ 0x14, ['unsigned short']],
    'e_cs' : [ 0x16, ['unsigned short']],
    'e_lfarlc' : [ 0x18, ['unsigned short']],
    'e_ovno' : [ 0x1a, ['unsigned short']],
    'e_res' : [ 0x1c, ['array', 4, ['unsigned short']]],
    'e_oemid' : [ 0x24, ['unsigned short']],
    'e_oeminfo' : [ 0x26, ['unsigned short']],
    'e_res2' : [ 0x28, ['array', 10, ['unsigned short']]],
    'e_lfanew' : [ 0x3c, ['long']],
} ],
  '_RTL_RB_TREE' : [ 0x8, {
    'Root' : [ 0x0, ['pointer', ['_RTL_BALANCED_NODE']]],
    'Encoded' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Min' : [ 0x4, ['pointer', ['_RTL_BALANCED_NODE']]],
} ],
  '_RTL_BALANCED_NODE' : [ 0xc, {
    'Children' : [ 0x0, ['array', 2, ['pointer', ['_RTL_BALANCED_NODE']]]],
    'Left' : [ 0x0, ['pointer', ['_RTL_BALANCED_NODE']]],
    'Right' : [ 0x4, ['pointer', ['_RTL_BALANCED_NODE']]],
    'Red' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Balance' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'ParentValue' : [ 0x8, ['unsigned long']],
} ],
  '_RTL_AVL_TREE' : [ 0x4, {
    'Root' : [ 0x0, ['pointer', ['_RTL_BALANCED_NODE']]],
} ],
  '_GUID' : [ 0x10, {
    'Data1' : [ 0x0, ['unsigned long']],
    'Data2' : [ 0x4, ['unsigned short']],
    'Data3' : [ 0x6, ['unsigned short']],
    'Data4' : [ 0x8, ['array', 8, ['unsigned char']]],
} ],
  '_KPCR' : [ 0x6020, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'Used_ExceptionList' : [ 0x0, ['pointer', ['_EXCEPTION_REGISTRATION_RECORD']]],
    'Used_StackBase' : [ 0x4, ['pointer', ['void']]],
    'MxCsr' : [ 0x8, ['unsigned long']],
    'TssCopy' : [ 0xc, ['pointer', ['void']]],
    'ContextSwitches' : [ 0x10, ['unsigned long']],
    'SetMemberCopy' : [ 0x14, ['unsigned long']],
    'Used_Self' : [ 0x18, ['pointer', ['void']]],
    'SelfPcr' : [ 0x1c, ['pointer', ['_KPCR']]],
    'Prcb' : [ 0x20, ['pointer', ['_KPRCB']]],
    'Irql' : [ 0x24, ['unsigned char']],
    'IRR' : [ 0x28, ['unsigned long']],
    'IrrActive' : [ 0x2c, ['unsigned long']],
    'IDR' : [ 0x30, ['unsigned long']],
    'KdVersionBlock' : [ 0x34, ['pointer', ['void']]],
    'IDT' : [ 0x38, ['pointer', ['_KIDTENTRY']]],
    'GDT' : [ 0x3c, ['pointer', ['_KGDTENTRY']]],
    'TSS' : [ 0x40, ['pointer', ['_KTSS']]],
    'MajorVersion' : [ 0x44, ['unsigned short']],
    'MinorVersion' : [ 0x46, ['unsigned short']],
    'SetMember' : [ 0x48, ['unsigned long']],
    'StallScaleFactor' : [ 0x4c, ['unsigned long']],
    'SpareUnused' : [ 0x50, ['unsigned char']],
    'Number' : [ 0x51, ['unsigned char']],
    'Spare0' : [ 0x52, ['unsigned char']],
    'SecondLevelCacheAssociativity' : [ 0x53, ['unsigned char']],
    'VdmAlert' : [ 0x54, ['unsigned long']],
    'KernelReserved' : [ 0x58, ['array', 14, ['unsigned long']]],
    'SecondLevelCacheSize' : [ 0x90, ['unsigned long']],
    'HalReserved' : [ 0x94, ['array', 16, ['unsigned long']]],
    'InterruptMode' : [ 0xd4, ['unsigned long']],
    'Spare1' : [ 0xd8, ['unsigned char']],
    'KernelReserved2' : [ 0xdc, ['array', 17, ['unsigned long']]],
    'PrcbData' : [ 0x120, ['_KPRCB']],
} ],
  '_KPRCB' : [ 0x5f00, {
    'MinorVersion' : [ 0x0, ['unsigned short']],
    'MajorVersion' : [ 0x2, ['unsigned short']],
    'CurrentThread' : [ 0x4, ['pointer', ['_KTHREAD']]],
    'NextThread' : [ 0x8, ['pointer', ['_KTHREAD']]],
    'IdleThread' : [ 0xc, ['pointer', ['_KTHREAD']]],
    'LegacyNumber' : [ 0x10, ['unsigned char']],
    'NestingLevel' : [ 0x11, ['unsigned char']],
    'BuildType' : [ 0x12, ['unsigned short']],
    'CpuType' : [ 0x14, ['unsigned char']],
    'CpuID' : [ 0x15, ['unsigned char']],
    'CpuStep' : [ 0x16, ['unsigned short']],
    'CpuStepping' : [ 0x16, ['unsigned char']],
    'CpuModel' : [ 0x17, ['unsigned char']],
    'ProcessorState' : [ 0x18, ['_KPROCESSOR_STATE']],
    'ParentNode' : [ 0x338, ['pointer', ['_KNODE']]],
    'PriorityState' : [ 0x33c, ['pointer', ['unsigned char']]],
    'KernelReserved' : [ 0x340, ['array', 14, ['unsigned long']]],
    'HalReserved' : [ 0x378, ['array', 16, ['unsigned long']]],
    'CFlushSize' : [ 0x3b8, ['unsigned long']],
    'CoresPerPhysicalProcessor' : [ 0x3bc, ['unsigned char']],
    'LogicalProcessorsPerCore' : [ 0x3bd, ['unsigned char']],
    'CpuVendor' : [ 0x3be, ['unsigned char']],
    'PrcbPad0' : [ 0x3bf, ['array', 1, ['unsigned char']]],
    'MHz' : [ 0x3c0, ['unsigned long']],
    'GroupIndex' : [ 0x3c4, ['unsigned char']],
    'Group' : [ 0x3c5, ['unsigned char']],
    'PrcbPad05' : [ 0x3c6, ['array', 2, ['unsigned char']]],
    'GroupSetMember' : [ 0x3c8, ['unsigned long']],
    'Number' : [ 0x3cc, ['unsigned long']],
    'ClockOwner' : [ 0x3d0, ['unsigned char']],
    'PendingTickFlags' : [ 0x3d1, ['unsigned char']],
    'PendingTick' : [ 0x3d1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'PendingBackupTick' : [ 0x3d1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'PrcbPad10' : [ 0x3d2, ['array', 70, ['unsigned char']]],
    'LockQueue' : [ 0x418, ['array', 17, ['_KSPIN_LOCK_QUEUE']]],
    'InterruptCount' : [ 0x4a0, ['unsigned long']],
    'KernelTime' : [ 0x4a4, ['unsigned long']],
    'UserTime' : [ 0x4a8, ['unsigned long']],
    'DpcTime' : [ 0x4ac, ['unsigned long']],
    'DpcTimeCount' : [ 0x4b0, ['unsigned long']],
    'InterruptTime' : [ 0x4b4, ['unsigned long']],
    'AdjustDpcThreshold' : [ 0x4b8, ['unsigned long']],
    'PageColor' : [ 0x4bc, ['unsigned long']],
    'DebuggerSavedIRQL' : [ 0x4c0, ['unsigned char']],
    'NodeColor' : [ 0x4c1, ['unsigned char']],
    'DeepSleep' : [ 0x4c2, ['unsigned char']],
    'TbFlushListActive' : [ 0x4c3, ['unsigned char']],
    'CachedStack' : [ 0x4c4, ['pointer', ['void']]],
    'NodeShiftedColor' : [ 0x4c8, ['unsigned long']],
    'SecondaryColorMask' : [ 0x4cc, ['unsigned long']],
    'DpcTimeLimit' : [ 0x4d0, ['unsigned long']],
    'MmInternal' : [ 0x4d4, ['pointer', ['void']]],
    'PrcbFlags' : [ 0x4d8, ['_KPRCBFLAG']],
    'SchedulerAssist' : [ 0x4dc, ['pointer', ['void']]],
    'CcFastReadNoWait' : [ 0x4e0, ['unsigned long']],
    'CcFastReadWait' : [ 0x4e4, ['unsigned long']],
    'CcFastReadNotPossible' : [ 0x4e8, ['unsigned long']],
    'CcCopyReadNoWait' : [ 0x4ec, ['unsigned long']],
    'CcCopyReadWait' : [ 0x4f0, ['unsigned long']],
    'CcCopyReadNoWaitMiss' : [ 0x4f4, ['unsigned long']],
    'MmSpinLockOrdering' : [ 0x4f8, ['long']],
    'IoReadOperationCount' : [ 0x4fc, ['long']],
    'IoWriteOperationCount' : [ 0x500, ['long']],
    'IoOtherOperationCount' : [ 0x504, ['long']],
    'IoReadTransferCount' : [ 0x508, ['_LARGE_INTEGER']],
    'IoWriteTransferCount' : [ 0x510, ['_LARGE_INTEGER']],
    'IoOtherTransferCount' : [ 0x518, ['_LARGE_INTEGER']],
    'CcFastMdlReadNoWait' : [ 0x520, ['unsigned long']],
    'CcFastMdlReadWait' : [ 0x524, ['unsigned long']],
    'CcFastMdlReadNotPossible' : [ 0x528, ['unsigned long']],
    'CcMapDataNoWait' : [ 0x52c, ['unsigned long']],
    'CcMapDataWait' : [ 0x530, ['unsigned long']],
    'CcPinMappedDataCount' : [ 0x534, ['unsigned long']],
    'CcPinReadNoWait' : [ 0x538, ['unsigned long']],
    'CcPinReadWait' : [ 0x53c, ['unsigned long']],
    'CcMdlReadNoWait' : [ 0x540, ['unsigned long']],
    'CcMdlReadWait' : [ 0x544, ['unsigned long']],
    'CcLazyWriteHotSpots' : [ 0x548, ['unsigned long']],
    'CcLazyWriteIos' : [ 0x54c, ['unsigned long']],
    'CcLazyWritePages' : [ 0x550, ['unsigned long']],
    'CcDataFlushes' : [ 0x554, ['unsigned long']],
    'CcDataPages' : [ 0x558, ['unsigned long']],
    'CcLostDelayedWrites' : [ 0x55c, ['unsigned long']],
    'CcFastReadResourceMiss' : [ 0x560, ['unsigned long']],
    'CcCopyReadWaitMiss' : [ 0x564, ['unsigned long']],
    'CcFastMdlReadResourceMiss' : [ 0x568, ['unsigned long']],
    'CcMapDataNoWaitMiss' : [ 0x56c, ['unsigned long']],
    'CcMapDataWaitMiss' : [ 0x570, ['unsigned long']],
    'CcPinReadNoWaitMiss' : [ 0x574, ['unsigned long']],
    'CcPinReadWaitMiss' : [ 0x578, ['unsigned long']],
    'CcMdlReadNoWaitMiss' : [ 0x57c, ['unsigned long']],
    'CcMdlReadWaitMiss' : [ 0x580, ['unsigned long']],
    'CcReadAheadIos' : [ 0x584, ['unsigned long']],
    'KeAlignmentFixupCount' : [ 0x588, ['unsigned long']],
    'KeExceptionDispatchCount' : [ 0x58c, ['unsigned long']],
    'KeSystemCalls' : [ 0x590, ['unsigned long']],
    'AvailableTime' : [ 0x594, ['unsigned long']],
    'PrcbPad22' : [ 0x598, ['array', 2, ['unsigned long']]],
    'PPLookasideList' : [ 0x5a0, ['array', 16, ['_PP_LOOKASIDE_LIST']]],
    'PPNxPagedLookasideList' : [ 0x620, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PPNPagedLookasideList' : [ 0xf20, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PPPagedLookasideList' : [ 0x1820, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PacketBarrier' : [ 0x2120, ['long']],
    'ReverseStall' : [ 0x2124, ['long']],
    'IpiFrame' : [ 0x2128, ['pointer', ['void']]],
    'PrcbPad3' : [ 0x212c, ['array', 52, ['unsigned char']]],
    'CurrentPacket' : [ 0x2160, ['array', 3, ['pointer', ['void']]]],
    'TargetSet' : [ 0x216c, ['unsigned long']],
    'WorkerRoutine' : [ 0x2170, ['pointer', ['void']]],
    'IpiFrozen' : [ 0x2174, ['unsigned long']],
    'PrcbPad4' : [ 0x2178, ['array', 40, ['unsigned char']]],
    'RequestSummary' : [ 0x21a0, ['unsigned long']],
    'TargetCount' : [ 0x21a4, ['long']],
    'PrcbPad94' : [ 0x21a8, ['array', 1, ['unsigned long long']]],
    'TrappedSecurityDomain' : [ 0x21b0, ['unsigned long long']],
    'BpbState' : [ 0x21b8, ['unsigned char']],
    'BpbCpuIdle' : [ 0x21b8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'BpbFlushRsbOnTrap' : [ 0x21b8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'BpbIbpbOnReturn' : [ 0x21b8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'BpbIbpbOnTrap' : [ 0x21b8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'BpbReserved' : [ 0x21b8, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'BpbFeatures' : [ 0x21b9, ['unsigned char']],
    'BpbClearOnIdle' : [ 0x21b9, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'BpbEnabled' : [ 0x21b9, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'BpbSmep' : [ 0x21b9, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'BpbFeaturesReserved' : [ 0x21b9, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned char')]],
    'BpbCurrentSpecCtrl' : [ 0x21ba, ['unsigned char']],
    'BpbKernelSpecCtrl' : [ 0x21bb, ['unsigned char']],
    'BpbNmiSpecCtrl' : [ 0x21bc, ['unsigned char']],
    'BpbUserSpecCtrl' : [ 0x21bd, ['unsigned char']],
    'PrcbPad49' : [ 0x21be, ['array', 2, ['unsigned char']]],
    'ProcessorSignature' : [ 0x21c0, ['unsigned long']],
    'ProcessorFlags' : [ 0x21c4, ['unsigned long']],
    'PrcbPad50' : [ 0x21c8, ['array', 8, ['unsigned char']]],
    'InterruptLastCount' : [ 0x21d0, ['unsigned long']],
    'InterruptRate' : [ 0x21d4, ['unsigned long']],
    'DeviceInterrupts' : [ 0x21d8, ['unsigned long']],
    'IsrDpcStats' : [ 0x21dc, ['pointer', ['void']]],
    'DpcData' : [ 0x21e0, ['array', 2, ['_KDPC_DATA']]],
    'DpcStack' : [ 0x2210, ['pointer', ['void']]],
    'MaximumDpcQueueDepth' : [ 0x2214, ['long']],
    'DpcRequestRate' : [ 0x2218, ['unsigned long']],
    'MinimumDpcRate' : [ 0x221c, ['unsigned long']],
    'DpcLastCount' : [ 0x2220, ['unsigned long']],
    'PrcbLock' : [ 0x2224, ['unsigned long']],
    'DpcGate' : [ 0x2228, ['_KGATE']],
    'IdleState' : [ 0x2238, ['unsigned char']],
    'QuantumEnd' : [ 0x2239, ['unsigned char']],
    'DpcRoutineActive' : [ 0x223a, ['unsigned char']],
    'IdleSchedule' : [ 0x223b, ['unsigned char']],
    'DpcRequestSummary' : [ 0x223c, ['long']],
    'DpcRequestSlot' : [ 0x223c, ['array', 2, ['short']]],
    'NormalDpcState' : [ 0x223c, ['short']],
    'ThreadDpcState' : [ 0x223e, ['short']],
    'DpcNormalProcessingActive' : [ 0x223c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DpcNormalProcessingRequested' : [ 0x223c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DpcNormalThreadSignal' : [ 0x223c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DpcNormalTimerExpiration' : [ 0x223c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DpcNormalDpcPresent' : [ 0x223c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DpcNormalLocalInterrupt' : [ 0x223c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DpcNormalSpare' : [ 0x223c, ['BitField', dict(start_bit = 6, end_bit = 16, native_type='unsigned long')]],
    'DpcThreadActive' : [ 0x223c, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'DpcThreadRequested' : [ 0x223c, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'DpcThreadSpare' : [ 0x223c, ['BitField', dict(start_bit = 18, end_bit = 32, native_type='unsigned long')]],
    'LastTick' : [ 0x2240, ['unsigned long']],
    'PeriodicCount' : [ 0x2244, ['unsigned long']],
    'PeriodicBias' : [ 0x2248, ['unsigned long']],
    'ClockInterrupts' : [ 0x224c, ['unsigned long']],
    'ReadyScanTick' : [ 0x2250, ['unsigned long']],
    'GroupSchedulingOverQuota' : [ 0x2254, ['unsigned char']],
    'ThreadDpcEnable' : [ 0x2255, ['unsigned char']],
    'PrcbPad41' : [ 0x2256, ['array', 6, ['unsigned char']]],
    'TimerTable' : [ 0x2260, ['_KTIMER_TABLE']],
    'PrcbPad92' : [ 0x3ab0, ['array', 12, ['unsigned long']]],
    'CallDpc' : [ 0x3ae0, ['_KDPC']],
    'ClockKeepAlive' : [ 0x3b00, ['long']],
    'PrcbPad6' : [ 0x3b04, ['array', 4, ['unsigned char']]],
    'DpcWatchdogPeriod' : [ 0x3b08, ['long']],
    'DpcWatchdogCount' : [ 0x3b0c, ['long']],
    'KeSpinLockOrdering' : [ 0x3b10, ['long']],
    'DpcWatchdogProfileCumulativeDpcThreshold' : [ 0x3b14, ['unsigned long']],
    'QueueIndex' : [ 0x3b18, ['unsigned long']],
    'DeferredReadyListHead' : [ 0x3b1c, ['_SINGLE_LIST_ENTRY']],
    'ReadySummary' : [ 0x3b20, ['unsigned long']],
    'AffinitizedSelectionMask' : [ 0x3b24, ['long']],
    'WaitLock' : [ 0x3b28, ['unsigned long']],
    'WaitListHead' : [ 0x3b2c, ['_LIST_ENTRY']],
    'ScbOffset' : [ 0x3b34, ['unsigned long']],
    'ReadyThreadCount' : [ 0x3b38, ['unsigned long']],
    'StartCycles' : [ 0x3b40, ['unsigned long long']],
    'TaggedCyclesStart' : [ 0x3b48, ['unsigned long long']],
    'TaggedCycles' : [ 0x3b50, ['array', 3, ['unsigned long long']]],
    'CycleTime' : [ 0x3b68, ['unsigned long long']],
    'AffinitizedCycles' : [ 0x3b70, ['unsigned long long']],
    'ImportantCycles' : [ 0x3b78, ['unsigned long long']],
    'UnimportantCycles' : [ 0x3b80, ['unsigned long long']],
    'ReadyQueueExpectedRunTime' : [ 0x3b88, ['unsigned long long']],
    'HighCycleTime' : [ 0x3b90, ['unsigned long']],
    'Cycles' : [ 0x3b98, ['array', 4, ['array', 2, ['unsigned long long']]]],
    'PrcbPad71' : [ 0x3bd8, ['unsigned long']],
    'DpcWatchdogSequenceNumber' : [ 0x3bdc, ['unsigned long']],
    'DispatcherReadyListHead' : [ 0x3be0, ['array', 32, ['_LIST_ENTRY']]],
    'ChainedInterruptList' : [ 0x3ce0, ['pointer', ['void']]],
    'LookasideIrpFloat' : [ 0x3ce4, ['long']],
    'ScbQueue' : [ 0x3ce8, ['_RTL_RB_TREE']],
    'ScbList' : [ 0x3cf0, ['_LIST_ENTRY']],
    'MmPageFaultCount' : [ 0x3cf8, ['long']],
    'MmCopyOnWriteCount' : [ 0x3cfc, ['long']],
    'MmTransitionCount' : [ 0x3d00, ['long']],
    'MmCacheTransitionCount' : [ 0x3d04, ['long']],
    'MmDemandZeroCount' : [ 0x3d08, ['long']],
    'MmPageReadCount' : [ 0x3d0c, ['long']],
    'MmPageReadIoCount' : [ 0x3d10, ['long']],
    'MmCacheReadCount' : [ 0x3d14, ['long']],
    'MmCacheIoCount' : [ 0x3d18, ['long']],
    'MmDirtyPagesWriteCount' : [ 0x3d1c, ['long']],
    'MmDirtyWriteIoCount' : [ 0x3d20, ['long']],
    'MmMappedPagesWriteCount' : [ 0x3d24, ['long']],
    'MmMappedWriteIoCount' : [ 0x3d28, ['long']],
    'CachedCommit' : [ 0x3d2c, ['unsigned long']],
    'CachedResidentAvailable' : [ 0x3d30, ['unsigned long']],
    'HyperPte' : [ 0x3d34, ['pointer', ['void']]],
    'PrcbPad8' : [ 0x3d38, ['array', 4, ['unsigned char']]],
    'VendorString' : [ 0x3d3c, ['array', 13, ['unsigned char']]],
    'InitialApicId' : [ 0x3d49, ['unsigned char']],
    'LogicalProcessorsPerPhysicalProcessor' : [ 0x3d4a, ['unsigned char']],
    'PrcbPad9' : [ 0x3d4b, ['array', 1, ['unsigned char']]],
    'FeatureBits' : [ 0x3d50, ['unsigned long long']],
    'UpdateSignature' : [ 0x3d58, ['_LARGE_INTEGER']],
    'IsrTime' : [ 0x3d60, ['unsigned long long']],
    'GenerationTarget' : [ 0x3d68, ['unsigned long long']],
    'PowerState' : [ 0x3d70, ['_PROCESSOR_POWER_STATE']],
    'ForceIdleDpc' : [ 0x3f18, ['_KDPC']],
    'MsrIa32TsxCtrl' : [ 0x3f38, ['unsigned long long']],
    'PrcbPad91' : [ 0x3f40, ['array', 6, ['unsigned long']]],
    'DpcRuntimeHistoryHashTable' : [ 0x3f58, ['pointer', ['_RTL_HASH_TABLE']]],
    'DpcRuntimeHistoryHashTableCleanupDpc' : [ 0x3f5c, ['pointer', ['_KDPC']]],
    'CurrentDpcRuntimeHistoryCached' : [ 0x3f60, ['unsigned long long']],
    'CurrentDpcStartTime' : [ 0x3f68, ['unsigned long long']],
    'CurrentDpcRoutine' : [ 0x3f70, ['pointer', ['void']]],
    'DpcWatchdogProfileSingleDpcThreshold' : [ 0x3f74, ['unsigned long']],
    'DpcWatchdogDpc' : [ 0x3f78, ['_KDPC']],
    'DpcWatchdogTimer' : [ 0x3f98, ['_KTIMER']],
    'HypercallPageList' : [ 0x3fc0, ['_SLIST_HEADER']],
    'HypercallCachedPages' : [ 0x3fc8, ['pointer', ['void']]],
    'VirtualApicAssist' : [ 0x3fcc, ['pointer', ['void']]],
    'StatisticsPage' : [ 0x3fd0, ['pointer', ['unsigned long long']]],
    'Cache' : [ 0x3fd4, ['array', 5, ['_CACHE_DESCRIPTOR']]],
    'CacheCount' : [ 0x4010, ['unsigned long']],
    'PackageProcessorSet' : [ 0x4014, ['_KAFFINITY_EX']],
    'SharedReadyQueueMask' : [ 0x4020, ['unsigned long']],
    'SharedReadyQueue' : [ 0x4024, ['pointer', ['_KSHARED_READY_QUEUE']]],
    'SharedQueueScanOwner' : [ 0x4028, ['unsigned long']],
    'CoreProcessorSet' : [ 0x402c, ['unsigned long']],
    'ScanSiblingMask' : [ 0x4030, ['unsigned long']],
    'LLCMask' : [ 0x4034, ['unsigned long']],
    'CacheProcessorMask' : [ 0x4038, ['array', 5, ['unsigned long']]],
    'ScanSiblingIndex' : [ 0x404c, ['unsigned long']],
    'WheaInfo' : [ 0x4050, ['pointer', ['void']]],
    'EtwSupport' : [ 0x4054, ['pointer', ['void']]],
    'InterruptObjectPool' : [ 0x4058, ['_SLIST_HEADER']],
    'DpcWatchdogProfile' : [ 0x4060, ['pointer', ['pointer', ['void']]]],
    'DpcWatchdogProfileCurrentEmptyCapture' : [ 0x4064, ['pointer', ['pointer', ['void']]]],
    'PackageId' : [ 0x4068, ['unsigned long']],
    'PteBitCache' : [ 0x406c, ['unsigned long']],
    'PteBitOffset' : [ 0x4070, ['unsigned long']],
    'PrcbPad93' : [ 0x4074, ['unsigned long']],
    'ProcessorProfileControlArea' : [ 0x4078, ['pointer', ['_PROCESSOR_PROFILE_CONTROL_AREA']]],
    'ProfileEventIndexAddress' : [ 0x407c, ['pointer', ['void']]],
    'TimerExpirationDpc' : [ 0x4080, ['_KDPC']],
    'SynchCounters' : [ 0x40a0, ['_SYNCH_COUNTERS']],
    'FsCounters' : [ 0x4158, ['_FILESYSTEM_DISK_COUNTERS']],
    'Context' : [ 0x4168, ['pointer', ['_CONTEXT']]],
    'ContextFlagsInit' : [ 0x416c, ['unsigned long']],
    'ExtendedState' : [ 0x4170, ['pointer', ['_XSAVE_AREA']]],
    'EntropyTimingState' : [ 0x4174, ['_KENTROPY_TIMING_STATE']],
    'IsrStack' : [ 0x429c, ['pointer', ['void']]],
    'VectorToInterruptObject' : [ 0x42a0, ['array', 208, ['pointer', ['_KINTERRUPT']]]],
    'AbSelfIoBoostsList' : [ 0x45e0, ['_SINGLE_LIST_ENTRY']],
    'AbPropagateBoostsList' : [ 0x45e4, ['_SINGLE_LIST_ENTRY']],
    'AbDpc' : [ 0x45e8, ['_KDPC']],
    'IoIrpStackProfilerCurrent' : [ 0x4608, ['_IOP_IRP_STACK_PROFILER']],
    'IoIrpStackProfilerPrevious' : [ 0x465c, ['_IOP_IRP_STACK_PROFILER']],
    'TimerExpirationTrace' : [ 0x46b0, ['array', 16, ['_KTIMER_EXPIRATION_TRACE']]],
    'TimerExpirationTraceCount' : [ 0x47b0, ['unsigned long']],
    'ExSaPageArray' : [ 0x47b4, ['pointer', ['void']]],
    'ExtendedSupervisorState' : [ 0x47b8, ['pointer', ['_XSAVE_AREA_HEADER']]],
    'PrcbPad100' : [ 0x47bc, ['array', 9, ['unsigned long']]],
    'LocalSharedReadyQueue' : [ 0x47e0, ['_KSHARED_READY_QUEUE']],
    'Mailbox' : [ 0x4920, ['pointer', ['_REQUEST_MAILBOX']]],
    'PrcbPad' : [ 0x4924, ['array', 1468, ['unsigned char']]],
    'KernelDirectoryTableBase' : [ 0x4ee0, ['unsigned long']],
    'EspBaseShadow' : [ 0x4ee4, ['unsigned long']],
    'UserEspShadow' : [ 0x4ee8, ['unsigned long']],
    'ShadowFlags' : [ 0x4eec, ['unsigned long']],
    'UserDS' : [ 0x4ef0, ['unsigned long']],
    'UserES' : [ 0x4ef4, ['unsigned long']],
    'UserFS' : [ 0x4ef8, ['unsigned long']],
    'EspIretd' : [ 0x4efc, ['pointer', ['void']]],
    'RestoreSegOption' : [ 0x4f00, ['unsigned long']],
    'SavedEsi' : [ 0x4f04, ['unsigned long']],
    'VerwSelector' : [ 0x4f08, ['unsigned short']],
    'PrcbShadowPad' : [ 0x4f0a, ['unsigned short']],
    'TaskSwitchCount' : [ 0x4f0c, ['unsigned long']],
    'DbgLogs' : [ 0x4f10, ['array', 512, ['unsigned long']]],
    'DbgCount' : [ 0x5710, ['unsigned long']],
    'PrcbPadRemainingPage' : [ 0x5714, ['array', 499, ['unsigned long']]],
    'RequestMailbox' : [ 0x5ee0, ['array', 1, ['_REQUEST_MAILBOX']]],
} ],
  '_KAPC' : [ 0x30, {
    'Type' : [ 0x0, ['unsigned char']],
    'SpareByte0' : [ 0x1, ['unsigned char']],
    'Size' : [ 0x2, ['unsigned char']],
    'SpareByte1' : [ 0x3, ['unsigned char']],
    'SpareLong0' : [ 0x4, ['unsigned long']],
    'Thread' : [ 0x8, ['pointer', ['_KTHREAD']]],
    'ApcListEntry' : [ 0xc, ['_LIST_ENTRY']],
    'KernelRoutine' : [ 0x14, ['pointer', ['void']]],
    'RundownRoutine' : [ 0x18, ['pointer', ['void']]],
    'NormalRoutine' : [ 0x1c, ['pointer', ['void']]],
    'Reserved' : [ 0x14, ['array', 3, ['pointer', ['void']]]],
    'NormalContext' : [ 0x20, ['pointer', ['void']]],
    'SystemArgument1' : [ 0x24, ['pointer', ['void']]],
    'SystemArgument2' : [ 0x28, ['pointer', ['void']]],
    'ApcStateIndex' : [ 0x2c, ['unsigned char']],
    'ApcMode' : [ 0x2d, ['unsigned char']],
    'Inserted' : [ 0x2e, ['unsigned char']],
} ],
  '_CPU_INFO' : [ 0x10, {
    'AsUINT32' : [ 0x0, ['array', 4, ['unsigned long']]],
    'Eax' : [ 0x0, ['unsigned long']],
    'Ebx' : [ 0x4, ['unsigned long']],
    'Ecx' : [ 0x8, ['unsigned long']],
    'Edx' : [ 0xc, ['unsigned long']],
} ],
  '_EXT_SET_PARAMETERS_V0' : [ 0x10, {
    'Version' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'NoWakeTolerance' : [ 0x8, ['long long']],
} ],
  '_PS_TRUSTLET_CREATE_ATTRIBUTES' : [ 0x18, {
    'TrustletIdentity' : [ 0x0, ['unsigned long long']],
    'Attributes' : [ 0x8, ['array', 1, ['_PS_TRUSTLET_ATTRIBUTE_DATA']]],
} ],
  '_PS_TRUSTLET_ATTRIBUTE_DATA' : [ 0x10, {
    'Header' : [ 0x0, ['_PS_TRUSTLET_ATTRIBUTE_HEADER']],
    'Data' : [ 0x8, ['array', 1, ['unsigned long long']]],
} ],
  '_PS_TRUSTLET_ATTRIBUTE_HEADER' : [ 0x8, {
    'AttributeType' : [ 0x0, ['_PS_TRUSTLET_ATTRIBUTE_TYPE']],
    'InstanceNumber' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
    'Reserved' : [ 0x4, ['BitField', dict(start_bit = 8, end_bit = 32, native_type='unsigned long')]],
} ],
  '_PS_TRUSTLET_ATTRIBUTE_TYPE' : [ 0x4, {
    'Version' : [ 0x0, ['unsigned char']],
    'DataCount' : [ 0x1, ['unsigned char']],
    'SemanticType' : [ 0x2, ['unsigned char']],
    'AccessRights' : [ 0x3, ['_PS_TRUSTLET_ATTRIBUTE_ACCESSRIGHTS']],
    'AttributeType' : [ 0x0, ['unsigned long']],
} ],
  '_TRUSTLET_MAILBOX_KEY' : [ 0x10, {
    'SecretValue' : [ 0x0, ['array', 2, ['unsigned long long']]],
} ],
  '_TRUSTLET_COLLABORATION_ID' : [ 0x10, {
    'Value' : [ 0x0, ['array', 2, ['unsigned long long']]],
} ],
  '_KPROCESS' : [ 0xe0, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'ProfileListHead' : [ 0x10, ['_LIST_ENTRY']],
    'DirectoryTableBase' : [ 0x18, ['unsigned long']],
    'LdtDescriptor' : [ 0x1c, ['_KGDTENTRY']],
    'Int21Descriptor' : [ 0x24, ['_KIDTENTRY']],
    'ThreadListHead' : [ 0x2c, ['_LIST_ENTRY']],
    'ProcessLock' : [ 0x34, ['unsigned long']],
    'DeepFreezeStartTime' : [ 0x38, ['unsigned long long']],
    'Affinity' : [ 0x40, ['_KAFFINITY_EX']],
    'ReadyListHead' : [ 0x4c, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0x54, ['_SINGLE_LIST_ENTRY']],
    'ActiveProcessors' : [ 0x58, ['_KAFFINITY_EX']],
    'AutoAlignment' : [ 0x64, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DisableBoost' : [ 0x64, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DisableQuantum' : [ 0x64, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DeepFreeze' : [ 0x64, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'TimerVirtualization' : [ 0x64, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'CheckStackExtents' : [ 0x64, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'CacheIsolationEnabled' : [ 0x64, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'PpmPolicy' : [ 0x64, ['BitField', dict(start_bit = 7, end_bit = 10, native_type='unsigned long')]],
    'VaSpaceDeleted' : [ 0x64, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ReservedFlags' : [ 0x64, ['BitField', dict(start_bit = 11, end_bit = 32, native_type='unsigned long')]],
    'ProcessFlags' : [ 0x64, ['long']],
    'BasePriority' : [ 0x68, ['unsigned char']],
    'QuantumReset' : [ 0x69, ['unsigned char']],
    'Visited' : [ 0x6a, ['unsigned char']],
    'Flags' : [ 0x6b, ['_KEXECUTE_OPTIONS']],
    'ThreadSeed' : [ 0x6c, ['array', 1, ['unsigned short']]],
    'IdealProcessor' : [ 0x6e, ['array', 1, ['unsigned short']]],
    'IdealNode' : [ 0x70, ['array', 1, ['unsigned short']]],
    'IdealGlobalNode' : [ 0x72, ['unsigned short']],
    'Spare1' : [ 0x74, ['unsigned short']],
    'IopmOffset' : [ 0x76, ['unsigned short']],
    'SchedulingGroup' : [ 0x78, ['pointer', ['_KSCHEDULING_GROUP']]],
    'StackCount' : [ 0x7c, ['_KSTACK_COUNT']],
    'ProcessListEntry' : [ 0x80, ['_LIST_ENTRY']],
    'CycleTime' : [ 0x88, ['unsigned long long']],
    'ContextSwitches' : [ 0x90, ['unsigned long long']],
    'FreezeCount' : [ 0x98, ['unsigned long']],
    'KernelTime' : [ 0x9c, ['unsigned long']],
    'UserTime' : [ 0xa0, ['unsigned long']],
    'ReadyTime' : [ 0xa4, ['unsigned long']],
    'VdmTrapcHandler' : [ 0xa8, ['pointer', ['void']]],
    'ProcessTimerDelay' : [ 0xac, ['unsigned long']],
    'KernelWaitTime' : [ 0xb0, ['unsigned long long']],
    'UserWaitTime' : [ 0xb8, ['unsigned long long']],
    'EndPadding' : [ 0xc0, ['array', 8, ['unsigned long']]],
} ],
  '_KTHREAD' : [ 0x280, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'SListFaultAddress' : [ 0x10, ['pointer', ['void']]],
    'QuantumTarget' : [ 0x18, ['unsigned long long']],
    'InitialStack' : [ 0x20, ['pointer', ['void']]],
    'StackLimit' : [ 0x24, ['pointer', ['void']]],
    'StackBase' : [ 0x28, ['pointer', ['void']]],
    'ThreadLock' : [ 0x2c, ['unsigned long']],
    'CycleTime' : [ 0x30, ['unsigned long long']],
    'HighCycleTime' : [ 0x38, ['unsigned long']],
    'ServiceTable' : [ 0x3c, ['pointer', ['void']]],
    'CurrentRunTime' : [ 0x40, ['unsigned long']],
    'ExpectedRunTime' : [ 0x44, ['unsigned long']],
    'KernelStack' : [ 0x48, ['pointer', ['void']]],
    'StateSaveArea' : [ 0x4c, ['pointer', ['_XSAVE_FORMAT']]],
    'SchedulingGroup' : [ 0x50, ['pointer', ['_KSCHEDULING_GROUP']]],
    'WaitRegister' : [ 0x54, ['_KWAIT_STATUS_REGISTER']],
    'Running' : [ 0x55, ['unsigned char']],
    'Alerted' : [ 0x56, ['array', 2, ['unsigned char']]],
    'AutoBoostActive' : [ 0x58, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReadyTransition' : [ 0x58, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'WaitNext' : [ 0x58, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'SystemAffinityActive' : [ 0x58, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Alertable' : [ 0x58, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'UserStackWalkActive' : [ 0x58, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ApcInterruptRequest' : [ 0x58, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'QuantumEndMigrate' : [ 0x58, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'UmsDirectedSwitchEnable' : [ 0x58, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'TimerActive' : [ 0x58, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'SystemThread' : [ 0x58, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ProcessDetachActive' : [ 0x58, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'CalloutActive' : [ 0x58, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'ScbReadyQueue' : [ 0x58, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'ApcQueueable' : [ 0x58, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'ReservedStackInUse' : [ 0x58, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'UmsPerformingSyscall' : [ 0x58, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'TimerSuspended' : [ 0x58, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'SuspendedWaitMode' : [ 0x58, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'SuspendSchedulerApcWait' : [ 0x58, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'CetUserShadowStack' : [ 0x58, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'BypassProcessFreeze' : [ 0x58, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'Reserved' : [ 0x58, ['BitField', dict(start_bit = 22, end_bit = 32, native_type='unsigned long')]],
    'MiscFlags' : [ 0x58, ['long']],
    'ThreadFlagsSpare' : [ 0x5c, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned long')]],
    'AutoAlignment' : [ 0x5c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DisableBoost' : [ 0x5c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'AlertedByThreadId' : [ 0x5c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'QuantumDonation' : [ 0x5c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'EnableStackSwap' : [ 0x5c, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'GuiThread' : [ 0x5c, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'DisableQuantum' : [ 0x5c, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'ChargeOnlySchedulingGroup' : [ 0x5c, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DeferPreemption' : [ 0x5c, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'QueueDeferPreemption' : [ 0x5c, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'ForceDeferSchedule' : [ 0x5c, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'SharedReadyQueueAffinity' : [ 0x5c, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'FreezeCount' : [ 0x5c, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'TerminationApcRequest' : [ 0x5c, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'AutoBoostEntriesExhausted' : [ 0x5c, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'KernelStackResident' : [ 0x5c, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'TerminateRequestReason' : [ 0x5c, ['BitField', dict(start_bit = 18, end_bit = 20, native_type='unsigned long')]],
    'ProcessStackCountDecremented' : [ 0x5c, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'RestrictedGuiThread' : [ 0x5c, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'VpBackingThread' : [ 0x5c, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'ThreadFlagsSpare2' : [ 0x5c, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'EtwStackTraceApcInserted' : [ 0x5c, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'ThreadFlags' : [ 0x5c, ['long']],
    'Tag' : [ 0x60, ['unsigned char']],
    'SystemHeteroCpuPolicy' : [ 0x61, ['unsigned char']],
    'UserHeteroCpuPolicy' : [ 0x62, ['BitField', dict(start_bit = 0, end_bit = 7, native_type='unsigned char')]],
    'ExplicitSystemHeteroCpuPolicy' : [ 0x62, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'Spare0' : [ 0x63, ['unsigned char']],
    'SystemCallNumber' : [ 0x64, ['unsigned long']],
    'FirstArgument' : [ 0x68, ['pointer', ['void']]],
    'TrapFrame' : [ 0x6c, ['pointer', ['_KTRAP_FRAME']]],
    'ApcState' : [ 0x70, ['_KAPC_STATE']],
    'ApcStateFill' : [ 0x70, ['array', 23, ['unsigned char']]],
    'Priority' : [ 0x87, ['unsigned char']],
    'UserIdealProcessor' : [ 0x88, ['unsigned long']],
    'ContextSwitches' : [ 0x8c, ['unsigned long']],
    'State' : [ 0x90, ['unsigned char']],
    'Spare12' : [ 0x91, ['unsigned char']],
    'WaitIrql' : [ 0x92, ['unsigned char']],
    'WaitMode' : [ 0x93, ['unsigned char']],
    'WaitStatus' : [ 0x94, ['long']],
    'WaitBlockList' : [ 0x98, ['pointer', ['_KWAIT_BLOCK']]],
    'WaitListEntry' : [ 0x9c, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0x9c, ['_SINGLE_LIST_ENTRY']],
    'Queue' : [ 0xa4, ['pointer', ['_DISPATCHER_HEADER']]],
    'Teb' : [ 0xa8, ['pointer', ['void']]],
    'RelativeTimerBias' : [ 0xb0, ['unsigned long long']],
    'Timer' : [ 0xb8, ['_KTIMER']],
    'WaitBlock' : [ 0xe0, ['array', 4, ['_KWAIT_BLOCK']]],
    'WaitBlockFill8' : [ 0xe0, ['array', 20, ['unsigned char']]],
    'ThreadCounters' : [ 0xf4, ['pointer', ['_KTHREAD_COUNTERS']]],
    'WaitBlockFill9' : [ 0xe0, ['array', 44, ['unsigned char']]],
    'XStateSave' : [ 0x10c, ['pointer', ['_XSTATE_SAVE']]],
    'WaitBlockFill10' : [ 0xe0, ['array', 68, ['unsigned char']]],
    'Win32Thread' : [ 0x124, ['pointer', ['void']]],
    'WaitBlockFill11' : [ 0xe0, ['array', 88, ['unsigned char']]],
    'WaitTime' : [ 0x138, ['unsigned long']],
    'KernelApcDisable' : [ 0x13c, ['short']],
    'SpecialApcDisable' : [ 0x13e, ['short']],
    'CombinedApcDisable' : [ 0x13c, ['unsigned long']],
    'QueueListEntry' : [ 0x140, ['_LIST_ENTRY']],
    'NextProcessor' : [ 0x148, ['unsigned long']],
    'NextProcessorNumber' : [ 0x148, ['BitField', dict(start_bit = 0, end_bit = 31, native_type='unsigned long')]],
    'SharedReadyQueue' : [ 0x148, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'QueuePriority' : [ 0x14c, ['long']],
    'Process' : [ 0x150, ['pointer', ['_KPROCESS']]],
    'UserAffinity' : [ 0x154, ['_GROUP_AFFINITY']],
    'UserAffinityFill' : [ 0x154, ['array', 6, ['unsigned char']]],
    'PreviousMode' : [ 0x15a, ['unsigned char']],
    'BasePriority' : [ 0x15b, ['unsigned char']],
    'PriorityDecrement' : [ 0x15c, ['unsigned char']],
    'ForegroundBoost' : [ 0x15c, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'UnusualBoost' : [ 0x15c, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Preempted' : [ 0x15d, ['unsigned char']],
    'AdjustReason' : [ 0x15e, ['unsigned char']],
    'AdjustIncrement' : [ 0x15f, ['unsigned char']],
    'AffinityVersion' : [ 0x160, ['unsigned long']],
    'Affinity' : [ 0x164, ['_GROUP_AFFINITY']],
    'AffinityFill' : [ 0x164, ['array', 6, ['unsigned char']]],
    'ApcStateIndex' : [ 0x16a, ['unsigned char']],
    'WaitBlockCount' : [ 0x16b, ['unsigned char']],
    'IdealProcessor' : [ 0x16c, ['unsigned long']],
    'ReadyTime' : [ 0x170, ['unsigned long']],
    'SavedApcState' : [ 0x174, ['_KAPC_STATE']],
    'SavedApcStateFill' : [ 0x174, ['array', 23, ['unsigned char']]],
    'WaitReason' : [ 0x18b, ['unsigned char']],
    'SuspendCount' : [ 0x18c, ['unsigned char']],
    'Saturation' : [ 0x18d, ['unsigned char']],
    'SListFaultCount' : [ 0x18e, ['unsigned short']],
    'SchedulerApc' : [ 0x190, ['_KAPC']],
    'SchedulerApcFill0' : [ 0x190, ['array', 1, ['unsigned char']]],
    'ResourceIndex' : [ 0x191, ['unsigned char']],
    'SchedulerApcFill1' : [ 0x190, ['array', 3, ['unsigned char']]],
    'QuantumReset' : [ 0x193, ['unsigned char']],
    'SchedulerApcFill2' : [ 0x190, ['array', 4, ['unsigned char']]],
    'KernelTime' : [ 0x194, ['unsigned long']],
    'SchedulerApcFill3' : [ 0x190, ['array', 36, ['unsigned char']]],
    'WaitPrcb' : [ 0x1b4, ['pointer', ['_KPRCB']]],
    'SchedulerApcFill4' : [ 0x190, ['array', 40, ['unsigned char']]],
    'LegoData' : [ 0x1b8, ['pointer', ['void']]],
    'SchedulerApcFill5' : [ 0x190, ['array', 47, ['unsigned char']]],
    'CallbackNestingLevel' : [ 0x1bf, ['unsigned char']],
    'UserTime' : [ 0x1c0, ['unsigned long']],
    'SuspendEvent' : [ 0x1c4, ['_KEVENT']],
    'ThreadListEntry' : [ 0x1d4, ['_LIST_ENTRY']],
    'MutantListHead' : [ 0x1dc, ['_LIST_ENTRY']],
    'AbEntrySummary' : [ 0x1e4, ['unsigned char']],
    'AbWaitEntryCount' : [ 0x1e5, ['unsigned char']],
    'AbAllocationRegionCount' : [ 0x1e6, ['unsigned char']],
    'SystemPriority' : [ 0x1e7, ['unsigned char']],
    'LockEntries' : [ 0x1e8, ['pointer', ['_KLOCK_ENTRY']]],
    'PropagateBoostsEntry' : [ 0x1ec, ['_SINGLE_LIST_ENTRY']],
    'IoSelfBoostsEntry' : [ 0x1f0, ['_SINGLE_LIST_ENTRY']],
    'PriorityFloorCounts' : [ 0x1f4, ['array', 16, ['unsigned char']]],
    'PriorityFloorCountsReserved' : [ 0x204, ['array', 16, ['unsigned char']]],
    'PriorityFloorSummary' : [ 0x214, ['unsigned long']],
    'AbCompletedIoBoostCount' : [ 0x218, ['long']],
    'AbCompletedIoQoSBoostCount' : [ 0x21c, ['long']],
    'KeReferenceCount' : [ 0x220, ['short']],
    'AbOrphanedEntrySummary' : [ 0x222, ['unsigned char']],
    'AbOwnedEntryCount' : [ 0x223, ['unsigned char']],
    'ForegroundLossTime' : [ 0x224, ['unsigned long']],
    'GlobalForegroundListEntry' : [ 0x228, ['_LIST_ENTRY']],
    'ForegroundDpcStackListEntry' : [ 0x228, ['_SINGLE_LIST_ENTRY']],
    'InGlobalForegroundList' : [ 0x22c, ['unsigned long']],
    'QueuedScb' : [ 0x230, ['pointer', ['_KSCB']]],
    'NpxState' : [ 0x238, ['unsigned long long']],
    'ThreadTimerDelay' : [ 0x240, ['unsigned long']],
    'ThreadFlags3' : [ 0x244, ['long']],
    'BamQosLevel' : [ 0x244, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
    'PpmPolicy' : [ 0x244, ['BitField', dict(start_bit = 8, end_bit = 10, native_type='unsigned long')]],
    'ThreadFlags3Reserved2' : [ 0x244, ['BitField', dict(start_bit = 10, end_bit = 32, native_type='unsigned long')]],
    'AbWaitObject' : [ 0x248, ['pointer', ['void']]],
    'ReservedPreviousReadyTimeValue' : [ 0x24c, ['unsigned long']],
    'KernelWaitTime' : [ 0x250, ['unsigned long long']],
    'UserWaitTime' : [ 0x258, ['unsigned long long']],
    'Spare29' : [ 0x260, ['array', 3, ['unsigned long']]],
    'EndPadding' : [ 0x26c, ['array', 5, ['unsigned long']]],
} ],
  '_KSTACK_CONTROL' : [ 0x20, {
    'StackBase' : [ 0x0, ['unsigned long']],
    'ActualLimit' : [ 0x4, ['unsigned long']],
    'StackExpansion' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PreviousTrapFrame' : [ 0x8, ['pointer', ['_KTRAP_FRAME']]],
    'PreviousExceptionList' : [ 0xc, ['pointer', ['void']]],
    'Previous' : [ 0x10, ['_KERNEL_STACK_SEGMENT']],
} ],
  '_KSPIN_LOCK_QUEUE' : [ 0x8, {
    'Next' : [ 0x0, ['pointer', ['_KSPIN_LOCK_QUEUE']]],
    'Lock' : [ 0x4, ['pointer', ['unsigned long']]],
} ],
  '_FAST_MUTEX' : [ 0x20, {
    'Count' : [ 0x0, ['long']],
    'Owner' : [ 0x4, ['pointer', ['void']]],
    'Contention' : [ 0x8, ['unsigned long']],
    'Event' : [ 0xc, ['_KEVENT']],
    'OldIrql' : [ 0x1c, ['unsigned long']],
} ],
  '_KEVENT' : [ 0x10, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
} ],
  '_SLIST_HEADER' : [ 0x8, {
    'Alignment' : [ 0x0, ['unsigned long long']],
    'Next' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x4, ['unsigned short']],
    'CpuId' : [ 0x6, ['unsigned short']],
} ],
  '_LOOKASIDE_LIST_EX' : [ 0x48, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE_POOL']],
} ],
  '_NPAGED_LOOKASIDE_LIST' : [ 0xc0, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
    'Lock__ObsoleteButDoNotDelete' : [ 0x80, ['unsigned long']],
} ],
  '_PAGED_LOOKASIDE_LIST' : [ 0xc0, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
    'Lock__ObsoleteButDoNotDelete' : [ 0x80, ['_FAST_MUTEX']],
} ],
  '_IO_STATUS_BLOCK' : [ 0x8, {
    'Status' : [ 0x0, ['long']],
    'Pointer' : [ 0x0, ['pointer', ['void']]],
    'Information' : [ 0x4, ['unsigned long']],
} ],
  '_QUAD' : [ 0x8, {
    'UseThisFieldToCopy' : [ 0x0, ['long long']],
    'DoNotUseThisField' : [ 0x0, ['double']],
} ],
  '_WORK_QUEUE_ITEM' : [ 0x10, {
    'List' : [ 0x0, ['_LIST_ENTRY']],
    'WorkerRoutine' : [ 0x8, ['pointer', ['void']]],
    'Parameter' : [ 0xc, ['pointer', ['void']]],
} ],
  '_EXT_DELETE_PARAMETERS' : [ 0x10, {
    'Version' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'DeleteCallback' : [ 0x8, ['pointer', ['void']]],
    'DeleteContext' : [ 0xc, ['pointer', ['void']]],
} ],
  '_EX_PUSH_LOCK' : [ 0x4, {
    'Locked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Waiting' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Waking' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'MultipleShared' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Shared' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
    'Value' : [ 0x0, ['unsigned long']],
    'Ptr' : [ 0x0, ['pointer', ['void']]],
} ],
  '_PP_LOOKASIDE_LIST' : [ 0x8, {
    'P' : [ 0x0, ['pointer', ['_GENERAL_LOOKASIDE']]],
    'L' : [ 0x4, ['pointer', ['_GENERAL_LOOKASIDE']]],
} ],
  '_GENERAL_LOOKASIDE' : [ 0x80, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'SingleListHead' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x8, ['unsigned short']],
    'MaximumDepth' : [ 0xa, ['unsigned short']],
    'TotalAllocates' : [ 0xc, ['unsigned long']],
    'AllocateMisses' : [ 0x10, ['unsigned long']],
    'AllocateHits' : [ 0x10, ['unsigned long']],
    'TotalFrees' : [ 0x14, ['unsigned long']],
    'FreeMisses' : [ 0x18, ['unsigned long']],
    'FreeHits' : [ 0x18, ['unsigned long']],
    'Type' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: u'NonPagedPoolBase', 1: u'PagedPool', 2: u'NonPagedPoolBaseMustSucceed', 3: u'DontUseThisType', 4: u'NonPagedPoolBaseCacheAligned', 5: u'PagedPoolCacheAligned', 6: u'NonPagedPoolBaseCacheAlignedMustS', 7: u'MaxPoolType', 34: u'NonPagedPoolMustSucceedSession', 516: u'NonPagedPoolNxCacheAligned', 35: u'DontUseThisTypeSession', 32: u'NonPagedPoolSession', 512: u'NonPagedPoolNx', 544: u'NonPagedPoolSessionNx', 36: u'NonPagedPoolCacheAlignedSession', 33: u'PagedPoolSession', 38: u'NonPagedPoolCacheAlignedMustSSession', 37: u'PagedPoolCacheAlignedSession'})]],
    'Tag' : [ 0x20, ['unsigned long']],
    'Size' : [ 0x24, ['unsigned long']],
    'AllocateEx' : [ 0x28, ['pointer', ['void']]],
    'Allocate' : [ 0x28, ['pointer', ['void']]],
    'FreeEx' : [ 0x2c, ['pointer', ['void']]],
    'Free' : [ 0x2c, ['pointer', ['void']]],
    'ListEntry' : [ 0x30, ['_LIST_ENTRY']],
    'LastTotalAllocates' : [ 0x38, ['unsigned long']],
    'LastAllocateMisses' : [ 0x3c, ['unsigned long']],
    'LastAllocateHits' : [ 0x3c, ['unsigned long']],
    'Future' : [ 0x40, ['array', 2, ['unsigned long']]],
} ],
  '_KNODE' : [ 0x140, {
    'IdleNonParkedCpuSet' : [ 0x0, ['unsigned long']],
    'IdleSmtSet' : [ 0x4, ['unsigned long']],
    'NonPairedSmtSet' : [ 0x8, ['unsigned long']],
    'IdleCpuSet' : [ 0xc, ['unsigned long']],
    'DeepIdleSet' : [ 0x40, ['unsigned long']],
    'IdleConstrainedSet' : [ 0x44, ['unsigned long']],
    'NonParkedSet' : [ 0x48, ['unsigned long']],
    'SoftParkedSet' : [ 0x4c, ['unsigned long']],
    'NonIsrTargetedSet' : [ 0x50, ['unsigned long']],
    'ParkLock' : [ 0x54, ['long']],
    'ThreadSeed' : [ 0x58, ['unsigned short']],
    'ProcessSeed' : [ 0x5a, ['unsigned short']],
    'SiblingMask' : [ 0x80, ['unsigned long']],
    'Affinity' : [ 0x84, ['_GROUP_AFFINITY']],
    'AffinityFill' : [ 0x84, ['array', 6, ['unsigned char']]],
    'NodeNumber' : [ 0x8a, ['unsigned short']],
    'PrimaryNodeNumber' : [ 0x8c, ['unsigned short']],
    'Spare0' : [ 0x8e, ['unsigned short']],
    'SharedReadyQueueMask' : [ 0x90, ['unsigned long']],
    'StrideMask' : [ 0x94, ['unsigned long']],
    'ProximityId' : [ 0x98, ['unsigned long']],
    'Lowest' : [ 0x9c, ['unsigned long']],
    'Highest' : [ 0xa0, ['unsigned long']],
    'MaximumProcessors' : [ 0xa4, ['unsigned char']],
    'Flags' : [ 0xa5, ['_flags']],
    'Spare10' : [ 0xa6, ['unsigned char']],
    'HeteroSets' : [ 0xa8, ['array', 5, ['_KHETERO_PROCESSOR_SET']]],
    'PpmConfiguredQosSets' : [ 0xe4, ['array', 5, ['unsigned long']]],
    'Spare11' : [ 0xf8, ['unsigned long']],
    'QosGroupingSets' : [ 0x100, ['_KQOS_GROUPING_SETS']],
    'QosPreemptibleSet' : [ 0x108, ['unsigned long']],
    'LLCLeaders' : [ 0x10c, ['unsigned long']],
} ],
  '_ENODE' : [ 0x180, {
    'Ncb' : [ 0x0, ['_KNODE']],
    'HotAddProcessorWorkItem' : [ 0x140, ['_WORK_QUEUE_ITEM']],
} ],
  '_HANDLE_TABLE' : [ 0x80, {
    'NextHandleNeedingPool' : [ 0x0, ['unsigned long']],
    'ExtraInfoPages' : [ 0x4, ['long']],
    'TableCode' : [ 0x8, ['unsigned long']],
    'QuotaProcess' : [ 0xc, ['pointer', ['_EPROCESS']]],
    'HandleTableList' : [ 0x10, ['_LIST_ENTRY']],
    'UniqueProcessId' : [ 0x18, ['unsigned long']],
    'Flags' : [ 0x1c, ['unsigned long']],
    'StrictFIFO' : [ 0x1c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'EnableHandleExceptions' : [ 0x1c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Rundown' : [ 0x1c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Duplicated' : [ 0x1c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'RaiseUMExceptionOnInvalidHandleClose' : [ 0x1c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'HandleContentionEvent' : [ 0x20, ['_EX_PUSH_LOCK']],
    'HandleTableLock' : [ 0x24, ['_EX_PUSH_LOCK']],
    'FreeLists' : [ 0x40, ['array', 1, ['_HANDLE_TABLE_FREE_LIST']]],
    'ActualEntry' : [ 0x40, ['array', 20, ['unsigned char']]],
    'DebugInfo' : [ 0x54, ['pointer', ['_HANDLE_TRACE_DEBUG_INFO']]],
} ],
  '_HANDLE_TABLE_ENTRY_INFO' : [ 0x8, {
    'AuditMask' : [ 0x0, ['unsigned long']],
    'MaxRelativeAccessMask' : [ 0x4, ['unsigned long']],
} ],
  '_HANDLE_TABLE_ENTRY' : [ 0x8, {
    'VolatileLowValue' : [ 0x0, ['long']],
    'LowValue' : [ 0x0, ['long']],
    'InfoTable' : [ 0x0, ['pointer', ['_HANDLE_TABLE_ENTRY_INFO']]],
    'HighValue' : [ 0x4, ['long']],
    'NextFreeHandleEntry' : [ 0x4, ['pointer', ['_HANDLE_TABLE_ENTRY']]],
    'LeafHandleValue' : [ 0x4, ['_EXHANDLE']],
    'Unlocked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Attributes' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 3, native_type='unsigned long')]],
    'ObjectPointerBits' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'RefCountField' : [ 0x4, ['long']],
    'GrantedAccessBits' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 25, native_type='unsigned long')]],
    'ProtectFromClose' : [ 0x4, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'NoRightsUpgrade' : [ 0x4, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'RefCnt' : [ 0x4, ['BitField', dict(start_bit = 27, end_bit = 32, native_type='unsigned long')]],
} ],
  '_EX_FAST_REF' : [ 0x4, {
    'Object' : [ 0x0, ['pointer', ['void']]],
    'RefCnt' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'Value' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_1383' : [ 0x2c, {
    'InitialPrivilegeSet' : [ 0x0, ['_INITIAL_PRIVILEGE_SET']],
    'PrivilegeSet' : [ 0x0, ['_PRIVILEGE_SET']],
} ],
  '_ACCESS_STATE' : [ 0x74, {
    'OperationID' : [ 0x0, ['_LUID']],
    'SecurityEvaluated' : [ 0x8, ['unsigned char']],
    'GenerateAudit' : [ 0x9, ['unsigned char']],
    'GenerateOnClose' : [ 0xa, ['unsigned char']],
    'PrivilegesAllocated' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['unsigned long']],
    'RemainingDesiredAccess' : [ 0x10, ['unsigned long']],
    'PreviouslyGrantedAccess' : [ 0x14, ['unsigned long']],
    'OriginalDesiredAccess' : [ 0x18, ['unsigned long']],
    'SubjectSecurityContext' : [ 0x1c, ['_SECURITY_SUBJECT_CONTEXT']],
    'SecurityDescriptor' : [ 0x2c, ['pointer', ['void']]],
    'AuxData' : [ 0x30, ['pointer', ['void']]],
    'Privileges' : [ 0x34, ['__unnamed_1383']],
    'AuditPrivileges' : [ 0x60, ['unsigned char']],
    'ObjectName' : [ 0x64, ['_UNICODE_STRING']],
    'ObjectTypeName' : [ 0x6c, ['_UNICODE_STRING']],
} ],
  '_AUX_ACCESS_DATA' : [ 0xc4, {
    'PrivilegesUsed' : [ 0x0, ['pointer', ['_PRIVILEGE_SET']]],
    'GenericMapping' : [ 0x4, ['_GENERIC_MAPPING']],
    'AccessesToAudit' : [ 0x14, ['unsigned long']],
    'MaximumAuditMask' : [ 0x18, ['unsigned long']],
    'TransactionId' : [ 0x1c, ['_GUID']],
    'NewSecurityDescriptor' : [ 0x2c, ['pointer', ['void']]],
    'ExistingSecurityDescriptor' : [ 0x30, ['pointer', ['void']]],
    'ParentSecurityDescriptor' : [ 0x34, ['pointer', ['void']]],
    'DeRefSecurityDescriptor' : [ 0x38, ['pointer', ['void']]],
    'SDLock' : [ 0x3c, ['pointer', ['void']]],
    'AccessReasons' : [ 0x40, ['_ACCESS_REASONS']],
    'GenerateStagingEvents' : [ 0xc0, ['unsigned char']],
} ],
  '_OBJECT_HANDLE_INFORMATION' : [ 0x8, {
    'HandleAttributes' : [ 0x0, ['unsigned long']],
    'GrantedAccess' : [ 0x4, ['unsigned long']],
} ],
  '_ETHREAD' : [ 0x4e0, {
    'Tcb' : [ 0x0, ['_KTHREAD']],
    'CreateTime' : [ 0x280, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0x288, ['_LARGE_INTEGER']],
    'KeyedWaitChain' : [ 0x288, ['_LIST_ENTRY']],
    'ChargeOnlySession' : [ 0x290, ['pointer', ['void']]],
    'PostBlockList' : [ 0x294, ['_LIST_ENTRY']],
    'ForwardLinkShadow' : [ 0x294, ['pointer', ['void']]],
    'StartAddress' : [ 0x298, ['pointer', ['void']]],
    'TerminationPort' : [ 0x29c, ['pointer', ['_TERMINATION_PORT']]],
    'ReaperLink' : [ 0x29c, ['pointer', ['_ETHREAD']]],
    'KeyedWaitValue' : [ 0x29c, ['pointer', ['void']]],
    'ActiveTimerListLock' : [ 0x2a0, ['unsigned long']],
    'ActiveTimerListHead' : [ 0x2a4, ['_LIST_ENTRY']],
    'Cid' : [ 0x2ac, ['_CLIENT_ID']],
    'KeyedWaitSemaphore' : [ 0x2b4, ['_KSEMAPHORE']],
    'AlpcWaitSemaphore' : [ 0x2b4, ['_KSEMAPHORE']],
    'ClientSecurity' : [ 0x2c8, ['_PS_CLIENT_SECURITY_CONTEXT']],
    'IrpList' : [ 0x2cc, ['_LIST_ENTRY']],
    'TopLevelIrp' : [ 0x2d4, ['unsigned long']],
    'DeviceToVerify' : [ 0x2d8, ['pointer', ['_DEVICE_OBJECT']]],
    'Win32StartAddress' : [ 0x2dc, ['pointer', ['void']]],
    'LegacyPowerObject' : [ 0x2e0, ['pointer', ['void']]],
    'ThreadListEntry' : [ 0x2e4, ['_LIST_ENTRY']],
    'RundownProtect' : [ 0x2ec, ['_EX_RUNDOWN_REF']],
    'ThreadLock' : [ 0x2f0, ['_EX_PUSH_LOCK']],
    'ReadClusterSize' : [ 0x2f4, ['unsigned long']],
    'MmLockOrdering' : [ 0x2f8, ['long']],
    'CrossThreadFlags' : [ 0x2fc, ['unsigned long']],
    'Terminated' : [ 0x2fc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ThreadInserted' : [ 0x2fc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'HideFromDebugger' : [ 0x2fc, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ActiveImpersonationInfo' : [ 0x2fc, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'HardErrorsAreDisabled' : [ 0x2fc, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0x2fc, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'SkipCreationMsg' : [ 0x2fc, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'SkipTerminationMsg' : [ 0x2fc, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'CopyTokenOnOpen' : [ 0x2fc, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'ThreadIoPriority' : [ 0x2fc, ['BitField', dict(start_bit = 9, end_bit = 12, native_type='unsigned long')]],
    'ThreadPagePriority' : [ 0x2fc, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
    'RundownFail' : [ 0x2fc, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'UmsForceQueueTermination' : [ 0x2fc, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'IndirectCpuSets' : [ 0x2fc, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'DisableDynamicCodeOptOut' : [ 0x2fc, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'ExplicitCaseSensitivity' : [ 0x2fc, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'PicoNotifyExit' : [ 0x2fc, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'DbgWerUserReportActive' : [ 0x2fc, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ForcedSelfTrimActive' : [ 0x2fc, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'SamplingCoverage' : [ 0x2fc, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'ReservedCrossThreadFlags' : [ 0x2fc, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'SameThreadPassiveFlags' : [ 0x300, ['unsigned long']],
    'ActiveExWorker' : [ 0x300, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MemoryMaker' : [ 0x300, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'StoreLockThread' : [ 0x300, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned long')]],
    'ClonedThread' : [ 0x300, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'KeyedEventInUse' : [ 0x300, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'SelfTerminate' : [ 0x300, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'RespectIoPriority' : [ 0x300, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ActivePageLists' : [ 0x300, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'SecureContext' : [ 0x300, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'ZeroPageThread' : [ 0x300, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'WorkloadClass' : [ 0x300, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'ReservedSameThreadPassiveFlags' : [ 0x300, ['BitField', dict(start_bit = 12, end_bit = 32, native_type='unsigned long')]],
    'SameThreadApcFlags' : [ 0x304, ['unsigned long']],
    'OwnsProcessAddressSpaceExclusive' : [ 0x304, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'OwnsProcessAddressSpaceShared' : [ 0x304, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'HardFaultBehavior' : [ 0x304, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'StartAddressInvalid' : [ 0x304, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'EtwCalloutActive' : [ 0x304, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'SuppressSymbolLoad' : [ 0x304, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'Prefetching' : [ 0x304, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'OwnsVadExclusive' : [ 0x304, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'SystemPagePriorityActive' : [ 0x305, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'SystemPagePriority' : [ 0x305, ['BitField', dict(start_bit = 1, end_bit = 4, native_type='unsigned char')]],
    'AllowUserWritesToExecutableMemory' : [ 0x305, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'AllowKernelWritesToExecutableMemory' : [ 0x305, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'OwnsVadShared' : [ 0x305, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'CacheManagerActive' : [ 0x308, ['unsigned char']],
    'DisablePageFaultClustering' : [ 0x309, ['unsigned char']],
    'ActiveFaultCount' : [ 0x30a, ['unsigned char']],
    'LockOrderState' : [ 0x30b, ['unsigned char']],
    'PerformanceCountLowReserved' : [ 0x30c, ['unsigned long']],
    'PerformanceCountHighReserved' : [ 0x310, ['long']],
    'AlpcMessageId' : [ 0x314, ['unsigned long']],
    'AlpcMessage' : [ 0x318, ['pointer', ['void']]],
    'AlpcReceiveAttributeSet' : [ 0x318, ['unsigned long']],
    'AlpcWaitListEntry' : [ 0x31c, ['_LIST_ENTRY']],
    'ExitStatus' : [ 0x324, ['long']],
    'CacheManagerCount' : [ 0x328, ['unsigned long']],
    'IoBoostCount' : [ 0x32c, ['unsigned long']],
    'IoQoSBoostCount' : [ 0x330, ['unsigned long']],
    'IoQoSThrottleCount' : [ 0x334, ['unsigned long']],
    'KernelStackReference' : [ 0x338, ['unsigned long']],
    'BoostList' : [ 0x33c, ['_LIST_ENTRY']],
    'DeboostList' : [ 0x344, ['_LIST_ENTRY']],
    'BoostListLock' : [ 0x34c, ['unsigned long']],
    'IrpListLock' : [ 0x350, ['unsigned long']],
    'ReservedForSynchTracking' : [ 0x354, ['pointer', ['void']]],
    'CmCallbackListHead' : [ 0x358, ['_SINGLE_LIST_ENTRY']],
    'ActivityId' : [ 0x35c, ['pointer', ['_GUID']]],
    'SeLearningModeListHead' : [ 0x360, ['_SINGLE_LIST_ENTRY']],
    'VerifierContext' : [ 0x364, ['pointer', ['void']]],
    'AdjustedClientToken' : [ 0x368, ['pointer', ['void']]],
    'WorkOnBehalfThread' : [ 0x36c, ['pointer', ['void']]],
    'PropertySet' : [ 0x370, ['_PS_PROPERTY_SET']],
    'PicoContext' : [ 0x37c, ['pointer', ['void']]],
    'UserFsBase' : [ 0x380, ['unsigned long']],
    'UserGsBase' : [ 0x384, ['unsigned long']],
    'EnergyValues' : [ 0x388, ['pointer', ['_THREAD_ENERGY_VALUES']]],
    'SelectedCpuSets' : [ 0x38c, ['unsigned long']],
    'SelectedCpuSetsIndirect' : [ 0x38c, ['pointer', ['unsigned long']]],
    'Silo' : [ 0x390, ['pointer', ['_EJOB']]],
    'ThreadName' : [ 0x394, ['pointer', ['_UNICODE_STRING']]],
    'SparePointer' : [ 0x398, ['pointer', ['void']]],
    'LastExpectedRunTime' : [ 0x39c, ['unsigned long']],
    'HeapData' : [ 0x3a0, ['unsigned long']],
    'OwnerEntryListHead' : [ 0x3a4, ['_LIST_ENTRY']],
    'DisownedOwnerEntryListLock' : [ 0x3ac, ['unsigned long']],
    'DisownedOwnerEntryListHead' : [ 0x3b0, ['_LIST_ENTRY']],
    'LockEntries' : [ 0x3b8, ['array', 6, ['_KLOCK_ENTRY']]],
    'CmDbgInfo' : [ 0x4d8, ['pointer', ['void']]],
} ],
  '__unnamed_13db' : [ 0x4, {
    'ControlFlowGuardEnabled' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ControlFlowGuardExportSuppressionEnabled' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ControlFlowGuardStrict' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DisallowStrippedImages' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ForceRelocateImages' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'HighEntropyASLREnabled' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'StackRandomizationDisabled' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'ExtensionPointDisable' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'DisableDynamicCode' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'DisableDynamicCodeAllowOptOut' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DisableDynamicCodeAllowRemoteDowngrade' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'AuditDisableDynamicCode' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DisallowWin32kSystemCalls' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'AuditDisallowWin32kSystemCalls' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'EnableFilteredWin32kAPIs' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'AuditFilteredWin32kAPIs' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'DisableNonSystemFonts' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'AuditNonSystemFontLoading' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'PreferSystem32Images' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'ProhibitRemoteImageMap' : [ 0x0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'AuditProhibitRemoteImageMap' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'ProhibitLowILImageMap' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'AuditProhibitLowILImageMap' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'SignatureMitigationOptIn' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'AuditBlockNonMicrosoftBinaries' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'AuditBlockNonMicrosoftBinariesAllowStore' : [ 0x0, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'LoaderIntegrityContinuityEnabled' : [ 0x0, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'AuditLoaderIntegrityContinuity' : [ 0x0, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'EnableModuleTamperingProtection' : [ 0x0, ['BitField', dict(start_bit = 28, end_bit = 29, native_type='unsigned long')]],
    'EnableModuleTamperingProtectionNoInherit' : [ 0x0, ['BitField', dict(start_bit = 29, end_bit = 30, native_type='unsigned long')]],
    'RestrictIndirectBranchPrediction' : [ 0x0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'IsolateSecurityDomain' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_13dd' : [ 0x4, {
    'EnableExportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AuditExportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'EnableExportAddressFilterPlus' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'AuditExportAddressFilterPlus' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'EnableRopStackPivot' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'AuditRopStackPivot' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'EnableRopCallerCheck' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'AuditRopCallerCheck' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'EnableRopSimExec' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'AuditRopSimExec' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'EnableImportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'AuditImportAddressFilter' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DisablePageCombine' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'SpeculativeStoreBypassDisable' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'CetUserShadowStacks' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'AuditCetUserShadowStacks' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'AuditCetUserShadowStacksLogged' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'UserCetSetContextIpValidation' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'AuditUserCetSetContextIpValidation' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'AuditUserCetSetContextIpValidationLogged' : [ 0x0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
} ],
  '_EPROCESS' : [ 0x4c0, {
    'Pcb' : [ 0x0, ['_KPROCESS']],
    'ProcessLock' : [ 0xe0, ['_EX_PUSH_LOCK']],
    'UniqueProcessId' : [ 0xe4, ['pointer', ['void']]],
    'ActiveProcessLinks' : [ 0xe8, ['_LIST_ENTRY']],
    'RundownProtect' : [ 0xf0, ['_EX_RUNDOWN_REF']],
    'VdmObjects' : [ 0xf4, ['pointer', ['void']]],
    'Flags2' : [ 0xf8, ['unsigned long']],
    'JobNotReallyActive' : [ 0xf8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AccountingFolded' : [ 0xf8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'NewProcessReported' : [ 0xf8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ExitProcessReported' : [ 0xf8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ReportCommitChanges' : [ 0xf8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'LastReportMemory' : [ 0xf8, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ForceWakeCharge' : [ 0xf8, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'CrossSessionCreate' : [ 0xf8, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'NeedsHandleRundown' : [ 0xf8, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'RefTraceEnabled' : [ 0xf8, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'PicoCreated' : [ 0xf8, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'EmptyJobEvaluated' : [ 0xf8, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DefaultPagePriority' : [ 0xf8, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
    'PrimaryTokenFrozen' : [ 0xf8, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessVerifierTarget' : [ 0xf8, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'RestrictSetThreadContext' : [ 0xf8, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'AffinityPermanent' : [ 0xf8, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'AffinityUpdateEnable' : [ 0xf8, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'PropagateNode' : [ 0xf8, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'ExplicitAffinity' : [ 0xf8, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ProcessExecutionState' : [ 0xf8, ['BitField', dict(start_bit = 22, end_bit = 24, native_type='unsigned long')]],
    'EnableReadVmLogging' : [ 0xf8, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'EnableWriteVmLogging' : [ 0xf8, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'FatalAccessTerminationRequested' : [ 0xf8, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'DisableSystemAllowedCpuSet' : [ 0xf8, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'ProcessStateChangeRequest' : [ 0xf8, ['BitField', dict(start_bit = 28, end_bit = 30, native_type='unsigned long')]],
    'ProcessStateChangeInProgress' : [ 0xf8, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'InPrivate' : [ 0xf8, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'Flags' : [ 0xfc, ['unsigned long']],
    'CreateReported' : [ 0xfc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'NoDebugInherit' : [ 0xfc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessExiting' : [ 0xfc, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ProcessDelete' : [ 0xfc, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ManageExecutableMemoryWrites' : [ 0xfc, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'VmDeleted' : [ 0xfc, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'OutswapEnabled' : [ 0xfc, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Outswapped' : [ 0xfc, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'FailFastOnCommitFail' : [ 0xfc, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Wow64VaSpace4Gb' : [ 0xfc, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'AddressSpaceInitialized' : [ 0xfc, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
    'SetTimerResolution' : [ 0xfc, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0xfc, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'DeprioritizeViews' : [ 0xfc, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'WriteWatch' : [ 0xfc, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessInSession' : [ 0xfc, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'OverrideAddressSpace' : [ 0xfc, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HasAddressSpace' : [ 0xfc, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'LaunchPrefetched' : [ 0xfc, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'Background' : [ 0xfc, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'VmTopDown' : [ 0xfc, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ImageNotifyDone' : [ 0xfc, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'PdeUpdateNeeded' : [ 0xfc, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'VdmAllowed' : [ 0xfc, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'ProcessRundown' : [ 0xfc, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'ProcessInserted' : [ 0xfc, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'DefaultIoPriority' : [ 0xfc, ['BitField', dict(start_bit = 27, end_bit = 30, native_type='unsigned long')]],
    'ProcessSelfDelete' : [ 0xfc, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'SetTimerResolutionLink' : [ 0xfc, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'CreateTime' : [ 0x100, ['_LARGE_INTEGER']],
    'ProcessQuotaUsage' : [ 0x108, ['array', 2, ['unsigned long']]],
    'ProcessQuotaPeak' : [ 0x110, ['array', 2, ['unsigned long']]],
    'PeakVirtualSize' : [ 0x118, ['unsigned long']],
    'VirtualSize' : [ 0x11c, ['unsigned long']],
    'SessionProcessLinks' : [ 0x120, ['_LIST_ENTRY']],
    'ExceptionPortData' : [ 0x128, ['pointer', ['void']]],
    'ExceptionPortValue' : [ 0x128, ['unsigned long']],
    'ExceptionPortState' : [ 0x128, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'Token' : [ 0x12c, ['_EX_FAST_REF']],
    'MmReserved' : [ 0x130, ['unsigned long']],
    'AddressCreationLock' : [ 0x134, ['_EX_PUSH_LOCK']],
    'PageTableCommitmentLock' : [ 0x138, ['_EX_PUSH_LOCK']],
    'RotateInProgress' : [ 0x13c, ['pointer', ['_ETHREAD']]],
    'ForkInProgress' : [ 0x140, ['pointer', ['_ETHREAD']]],
    'CommitChargeJob' : [ 0x144, ['pointer', ['_EJOB']]],
    'CloneRoot' : [ 0x148, ['_RTL_AVL_TREE']],
    'NumberOfPrivatePages' : [ 0x14c, ['unsigned long']],
    'NumberOfLockedPages' : [ 0x150, ['unsigned long']],
    'Win32Process' : [ 0x154, ['pointer', ['void']]],
    'Job' : [ 0x158, ['pointer', ['_EJOB']]],
    'SectionObject' : [ 0x15c, ['pointer', ['void']]],
    'SectionBaseAddress' : [ 0x160, ['pointer', ['void']]],
    'Cookie' : [ 0x164, ['unsigned long']],
    'WorkingSetWatch' : [ 0x168, ['pointer', ['_PAGEFAULT_HISTORY']]],
    'Win32WindowStation' : [ 0x16c, ['pointer', ['void']]],
    'InheritedFromUniqueProcessId' : [ 0x170, ['pointer', ['void']]],
    'LdtInformation' : [ 0x174, ['pointer', ['void']]],
    'OwnerProcessId' : [ 0x178, ['unsigned long']],
    'Peb' : [ 0x17c, ['pointer', ['_PEB']]],
    'Session' : [ 0x180, ['pointer', ['_MM_SESSION_SPACE']]],
    'Spare1' : [ 0x184, ['pointer', ['void']]],
    'QuotaBlock' : [ 0x188, ['pointer', ['_EPROCESS_QUOTA_BLOCK']]],
    'ObjectTable' : [ 0x18c, ['pointer', ['_HANDLE_TABLE']]],
    'DebugPort' : [ 0x190, ['pointer', ['void']]],
    'PaeTop' : [ 0x194, ['pointer', ['void']]],
    'DeviceMap' : [ 0x198, ['pointer', ['void']]],
    'EtwDataSource' : [ 0x19c, ['pointer', ['void']]],
    'PageDirectoryPte' : [ 0x1a0, ['unsigned long long']],
    'ImageFilePointer' : [ 0x1a8, ['pointer', ['_FILE_OBJECT']]],
    'ImageFileName' : [ 0x1ac, ['array', 15, ['unsigned char']]],
    'PriorityClass' : [ 0x1bb, ['unsigned char']],
    'SecurityPort' : [ 0x1bc, ['pointer', ['void']]],
    'SeAuditProcessCreationInfo' : [ 0x1c0, ['_SE_AUDIT_PROCESS_CREATION_INFO']],
    'JobLinks' : [ 0x1c4, ['_LIST_ENTRY']],
    'HighestUserAddress' : [ 0x1cc, ['pointer', ['void']]],
    'ThreadListHead' : [ 0x1d0, ['_LIST_ENTRY']],
    'ActiveThreads' : [ 0x1d8, ['unsigned long']],
    'ImagePathHash' : [ 0x1dc, ['unsigned long']],
    'DefaultHardErrorProcessing' : [ 0x1e0, ['unsigned long']],
    'LastThreadExitStatus' : [ 0x1e4, ['long']],
    'PrefetchTrace' : [ 0x1e8, ['_EX_FAST_REF']],
    'LockedPagesList' : [ 0x1ec, ['pointer', ['void']]],
    'ReadOperationCount' : [ 0x1f0, ['_LARGE_INTEGER']],
    'WriteOperationCount' : [ 0x1f8, ['_LARGE_INTEGER']],
    'OtherOperationCount' : [ 0x200, ['_LARGE_INTEGER']],
    'ReadTransferCount' : [ 0x208, ['_LARGE_INTEGER']],
    'WriteTransferCount' : [ 0x210, ['_LARGE_INTEGER']],
    'OtherTransferCount' : [ 0x218, ['_LARGE_INTEGER']],
    'CommitChargeLimit' : [ 0x220, ['unsigned long']],
    'CommitCharge' : [ 0x224, ['unsigned long']],
    'CommitChargePeak' : [ 0x228, ['unsigned long']],
    'Vm' : [ 0x240, ['_MMSUPPORT_FULL']],
    'MmProcessLinks' : [ 0x340, ['_LIST_ENTRY']],
    'ModifiedPageCount' : [ 0x348, ['unsigned long']],
    'ExitStatus' : [ 0x34c, ['long']],
    'VadRoot' : [ 0x350, ['_RTL_AVL_TREE']],
    'VadHint' : [ 0x354, ['pointer', ['void']]],
    'VadCount' : [ 0x358, ['unsigned long']],
    'VadPhysicalPages' : [ 0x35c, ['unsigned long']],
    'VadPhysicalPagesLimit' : [ 0x360, ['unsigned long']],
    'AlpcContext' : [ 0x364, ['_ALPC_PROCESS_CONTEXT']],
    'TimerResolutionLink' : [ 0x374, ['_LIST_ENTRY']],
    'TimerResolutionStackRecord' : [ 0x37c, ['pointer', ['_PO_DIAG_STACK_RECORD']]],
    'RequestedTimerResolution' : [ 0x380, ['unsigned long']],
    'SmallestTimerResolution' : [ 0x384, ['unsigned long']],
    'ExitTime' : [ 0x388, ['_LARGE_INTEGER']],
    'ActiveThreadsHighWatermark' : [ 0x390, ['unsigned long']],
    'LargePrivateVadCount' : [ 0x394, ['unsigned long']],
    'ThreadListLock' : [ 0x398, ['_EX_PUSH_LOCK']],
    'WnfContext' : [ 0x39c, ['pointer', ['void']]],
    'ServerSilo' : [ 0x3a0, ['pointer', ['_EJOB']]],
    'SignatureLevel' : [ 0x3a4, ['unsigned char']],
    'SectionSignatureLevel' : [ 0x3a5, ['unsigned char']],
    'Protection' : [ 0x3a6, ['_PS_PROTECTION']],
    'HangCount' : [ 0x3a7, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned char')]],
    'GhostCount' : [ 0x3a7, ['BitField', dict(start_bit = 3, end_bit = 6, native_type='unsigned char')]],
    'PrefilterException' : [ 0x3a7, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'Flags3' : [ 0x3a8, ['unsigned long']],
    'Minimal' : [ 0x3a8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReplacingPageRoot' : [ 0x3a8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Crashed' : [ 0x3a8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'JobVadsAreTracked' : [ 0x3a8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'VadTrackingDisabled' : [ 0x3a8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'AuxiliaryProcess' : [ 0x3a8, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'SubsystemProcess' : [ 0x3a8, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'IndirectCpuSets' : [ 0x3a8, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'RelinquishedCommit' : [ 0x3a8, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'HighGraphicsPriority' : [ 0x3a8, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'CommitFailLogged' : [ 0x3a8, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ReserveFailLogged' : [ 0x3a8, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'SystemProcess' : [ 0x3a8, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'HideImageBaseAddresses' : [ 0x3a8, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'AddressPolicyFrozen' : [ 0x3a8, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'ProcessFirstResume' : [ 0x3a8, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ForegroundExternal' : [ 0x3a8, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'ForegroundSystem' : [ 0x3a8, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HighMemoryPriority' : [ 0x3a8, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'EnableProcessSuspendResumeLogging' : [ 0x3a8, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'EnableThreadSuspendResumeLogging' : [ 0x3a8, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'SecurityDomainChanged' : [ 0x3a8, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'SecurityFreezeComplete' : [ 0x3a8, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'VmProcessorHost' : [ 0x3a8, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'VmProcessorHostTransition' : [ 0x3a8, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'AltSyscall' : [ 0x3a8, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'TimerResolutionIgnore' : [ 0x3a8, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'DeviceAsid' : [ 0x3ac, ['long']],
    'SvmData' : [ 0x3b0, ['pointer', ['void']]],
    'SvmProcessLock' : [ 0x3b4, ['_EX_PUSH_LOCK']],
    'SvmLock' : [ 0x3b8, ['unsigned long']],
    'SvmProcessDeviceListHead' : [ 0x3bc, ['_LIST_ENTRY']],
    'LastFreezeInterruptTime' : [ 0x3c8, ['unsigned long long']],
    'DiskCounters' : [ 0x3d0, ['pointer', ['_PROCESS_DISK_COUNTERS']]],
    'PicoContext' : [ 0x3d4, ['pointer', ['void']]],
    'HighPriorityFaultsAllowed' : [ 0x3d8, ['unsigned long']],
    'InstrumentationCallback' : [ 0x3dc, ['pointer', ['void']]],
    'EnergyContext' : [ 0x3e0, ['pointer', ['_PO_PROCESS_ENERGY_CONTEXT']]],
    'VmContext' : [ 0x3e4, ['pointer', ['void']]],
    'SequenceNumber' : [ 0x3e8, ['unsigned long long']],
    'CreateInterruptTime' : [ 0x3f0, ['unsigned long long']],
    'CreateUnbiasedInterruptTime' : [ 0x3f8, ['unsigned long long']],
    'TotalUnbiasedFrozenTime' : [ 0x400, ['unsigned long long']],
    'LastAppStateUpdateTime' : [ 0x408, ['unsigned long long']],
    'LastAppStateUptime' : [ 0x410, ['BitField', dict(start_bit = 0, end_bit = 61, native_type='unsigned long long')]],
    'LastAppState' : [ 0x410, ['BitField', dict(start_bit = 61, end_bit = 64, native_type='unsigned long long')]],
    'SharedCommitCharge' : [ 0x418, ['unsigned long']],
    'SharedCommitLock' : [ 0x41c, ['_EX_PUSH_LOCK']],
    'SharedCommitLinks' : [ 0x420, ['_LIST_ENTRY']],
    'AllowedCpuSets' : [ 0x428, ['unsigned long']],
    'DefaultCpuSets' : [ 0x42c, ['unsigned long']],
    'AllowedCpuSetsIndirect' : [ 0x428, ['pointer', ['unsigned long']]],
    'DefaultCpuSetsIndirect' : [ 0x42c, ['pointer', ['unsigned long']]],
    'DiskIoAttribution' : [ 0x430, ['pointer', ['void']]],
    'DxgProcess' : [ 0x434, ['pointer', ['void']]],
    'Win32KFilterSet' : [ 0x438, ['unsigned long']],
    'ProcessTimerDelay' : [ 0x440, ['_PS_INTERLOCKED_TIMER_DELAY_VALUES']],
    'KTimerSets' : [ 0x448, ['unsigned long']],
    'KTimer2Sets' : [ 0x44c, ['unsigned long']],
    'ThreadTimerSets' : [ 0x450, ['unsigned long']],
    'VirtualTimerListLock' : [ 0x454, ['unsigned long']],
    'VirtualTimerListHead' : [ 0x458, ['_LIST_ENTRY']],
    'WakeChannel' : [ 0x460, ['_WNF_STATE_NAME']],
    'WakeInfo' : [ 0x460, ['_PS_PROCESS_WAKE_INFORMATION']],
    'MitigationFlags' : [ 0x490, ['unsigned long']],
    'MitigationFlagsValues' : [ 0x490, ['__unnamed_13db']],
    'MitigationFlags2' : [ 0x494, ['unsigned long']],
    'MitigationFlags2Values' : [ 0x494, ['__unnamed_13dd']],
    'PartitionObject' : [ 0x498, ['pointer', ['void']]],
    'SecurityDomain' : [ 0x4a0, ['unsigned long long']],
    'ParentSecurityDomain' : [ 0x4a8, ['unsigned long long']],
    'CoverageSamplerContext' : [ 0x4b0, ['pointer', ['void']]],
    'MmHotPatchContext' : [ 0x4b4, ['pointer', ['void']]],
    'DynamicEHContinuationTargetsTree' : [ 0x4b8, ['_RTL_AVL_TREE']],
    'DynamicEHContinuationTargetsLock' : [ 0x4bc, ['_EX_PUSH_LOCK']],
} ],
  '__unnamed_13f0' : [ 0x4, {
    'MasterIrp' : [ 0x0, ['pointer', ['_IRP']]],
    'IrpCount' : [ 0x0, ['long']],
    'SystemBuffer' : [ 0x0, ['pointer', ['void']]],
} ],
  '__unnamed_13f6' : [ 0x8, {
    'UserApcRoutine' : [ 0x0, ['pointer', ['void']]],
    'IssuingProcess' : [ 0x0, ['pointer', ['void']]],
    'UserApcContext' : [ 0x4, ['pointer', ['void']]],
} ],
  '__unnamed_13f8' : [ 0x8, {
    'AsynchronousParameters' : [ 0x0, ['__unnamed_13f6']],
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1401' : [ 0x2c, {
    'DeviceQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DriverContext' : [ 0x0, ['array', 4, ['pointer', ['void']]]],
    'Thread' : [ 0x10, ['pointer', ['_ETHREAD']]],
    'AuxiliaryBuffer' : [ 0x14, ['pointer', ['unsigned char']]],
    'ListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'CurrentStackLocation' : [ 0x20, ['pointer', ['_IO_STACK_LOCATION']]],
    'PacketType' : [ 0x20, ['unsigned long']],
    'OriginalFileObject' : [ 0x24, ['pointer', ['_FILE_OBJECT']]],
    'IrpExtension' : [ 0x28, ['pointer', ['void']]],
} ],
  '__unnamed_1403' : [ 0x30, {
    'Overlay' : [ 0x0, ['__unnamed_1401']],
    'Apc' : [ 0x0, ['_KAPC']],
    'CompletionKey' : [ 0x0, ['pointer', ['void']]],
} ],
  '_IRP' : [ 0x70, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'MdlAddress' : [ 0x4, ['pointer', ['_MDL']]],
    'Flags' : [ 0x8, ['unsigned long']],
    'AssociatedIrp' : [ 0xc, ['__unnamed_13f0']],
    'ThreadListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'IoStatus' : [ 0x18, ['_IO_STATUS_BLOCK']],
    'RequestorMode' : [ 0x20, ['unsigned char']],
    'PendingReturned' : [ 0x21, ['unsigned char']],
    'StackCount' : [ 0x22, ['unsigned char']],
    'CurrentLocation' : [ 0x23, ['unsigned char']],
    'Cancel' : [ 0x24, ['unsigned char']],
    'CancelIrql' : [ 0x25, ['unsigned char']],
    'ApcEnvironment' : [ 0x26, ['unsigned char']],
    'AllocationFlags' : [ 0x27, ['unsigned char']],
    'UserIosb' : [ 0x28, ['pointer', ['_IO_STATUS_BLOCK']]],
    'UserEvent' : [ 0x2c, ['pointer', ['_KEVENT']]],
    'Overlay' : [ 0x30, ['__unnamed_13f8']],
    'CancelRoutine' : [ 0x38, ['pointer', ['void']]],
    'UserBuffer' : [ 0x3c, ['pointer', ['void']]],
    'Tail' : [ 0x40, ['__unnamed_1403']],
} ],
  '__unnamed_140a' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['pointer', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x4, ['unsigned long']],
    'FileAttributes' : [ 0x8, ['unsigned short']],
    'ShareAccess' : [ 0xa, ['unsigned short']],
    'EaLength' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_140e' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['pointer', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned short']],
    'ShareAccess' : [ 0xa, ['unsigned short']],
    'Parameters' : [ 0xc, ['pointer', ['_NAMED_PIPE_CREATE_PARAMETERS']]],
} ],
  '__unnamed_1412' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['pointer', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned short']],
    'ShareAccess' : [ 0xa, ['unsigned short']],
    'Parameters' : [ 0xc, ['pointer', ['_MAILSLOT_CREATE_PARAMETERS']]],
} ],
  '__unnamed_1414' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'Key' : [ 0x4, ['unsigned long']],
    'ByteOffset' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1418' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileName' : [ 0x4, ['pointer', ['_UNICODE_STRING']]],
    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileDispositionInformationEx', 65: u'FileRenameInformationEx', 66: u'FileRenameInformationExBypassAccessCheck', 67: u'FileDesiredStorageClassInformation', 68: u'FileStatInformation', 69: u'FileMemoryPartitionInformation', 70: u'FileStatLxInformation', 71: u'FileCaseSensitiveInformation', 72: u'FileLinkInformationEx', 73: u'FileLinkInformationExBypassAccessCheck', 74: u'FileStorageReserveIdInformation', 75: u'FileCaseSensitiveInformationForceAccessCheck', 76: u'FileMaximumInformation'})]],
    'FileIndex' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_141a' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
    'CompletionFilter' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_141e' : [ 0xc, {
    'Length' : [ 0x0, ['unsigned long']],
    'CompletionFilter' : [ 0x4, ['unsigned long']],
    'DirectoryNotifyInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: u'DirectoryNotifyInformation', 2: u'DirectoryNotifyExtendedInformation'})]],
} ],
  '__unnamed_1420' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileDispositionInformationEx', 65: u'FileRenameInformationEx', 66: u'FileRenameInformationExBypassAccessCheck', 67: u'FileDesiredStorageClassInformation', 68: u'FileStatInformation', 69: u'FileMemoryPartitionInformation', 70: u'FileStatLxInformation', 71: u'FileCaseSensitiveInformation', 72: u'FileLinkInformationEx', 73: u'FileLinkInformationExBypassAccessCheck', 74: u'FileStorageReserveIdInformation', 75: u'FileCaseSensitiveInformationForceAccessCheck', 76: u'FileMaximumInformation'})]],
} ],
  '__unnamed_1422' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileDispositionInformationEx', 65: u'FileRenameInformationEx', 66: u'FileRenameInformationExBypassAccessCheck', 67: u'FileDesiredStorageClassInformation', 68: u'FileStatInformation', 69: u'FileMemoryPartitionInformation', 70: u'FileStatLxInformation', 71: u'FileCaseSensitiveInformation', 72: u'FileLinkInformationEx', 73: u'FileLinkInformationExBypassAccessCheck', 74: u'FileStorageReserveIdInformation', 75: u'FileCaseSensitiveInformationForceAccessCheck', 76: u'FileMaximumInformation'})]],
    'FileObject' : [ 0x8, ['pointer', ['_FILE_OBJECT']]],
    'ReplaceIfExists' : [ 0xc, ['unsigned char']],
    'AdvanceOnly' : [ 0xd, ['unsigned char']],
    'ClusterCount' : [ 0xc, ['unsigned long']],
    'DeleteHandle' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_1424' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'EaList' : [ 0x4, ['pointer', ['void']]],
    'EaListLength' : [ 0x8, ['unsigned long']],
    'EaIndex' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_1426' : [ 0x4, {
    'Length' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_142a' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
    'FsInformationClass' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {1: u'FileFsVolumeInformation', 2: u'FileFsLabelInformation', 3: u'FileFsSizeInformation', 4: u'FileFsDeviceInformation', 5: u'FileFsAttributeInformation', 6: u'FileFsControlInformation', 7: u'FileFsFullSizeInformation', 8: u'FileFsObjectIdInformation', 9: u'FileFsDriverPathInformation', 10: u'FileFsVolumeFlagsInformation', 11: u'FileFsSectorSizeInformation', 12: u'FileFsDataCopyInformation', 13: u'FileFsMetadataSizeInformation', 14: u'FileFsFullSizeInformationEx', 15: u'FileFsMaximumInformation'})]],
} ],
  '__unnamed_142c' : [ 0x10, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x4, ['unsigned long']],
    'FsControlCode' : [ 0x8, ['unsigned long']],
    'Type3InputBuffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_142f' : [ 0x10, {
    'Length' : [ 0x0, ['pointer', ['_LARGE_INTEGER']]],
    'Key' : [ 0x4, ['unsigned long']],
    'ByteOffset' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1431' : [ 0x10, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x4, ['unsigned long']],
    'IoControlCode' : [ 0x8, ['unsigned long']],
    'Type3InputBuffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_1433' : [ 0x8, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_1435' : [ 0x8, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'SecurityDescriptor' : [ 0x4, ['pointer', ['void']]],
} ],
  '__unnamed_1439' : [ 0x8, {
    'Vpb' : [ 0x0, ['pointer', ['_VPB']]],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
} ],
  '__unnamed_143d' : [ 0x4, {
    'Srb' : [ 0x0, ['pointer', ['_SCSI_REQUEST_BLOCK']]],
} ],
  '__unnamed_1441' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'StartSid' : [ 0x4, ['pointer', ['void']]],
    'SidList' : [ 0x8, ['pointer', ['_FILE_GET_QUOTA_INFORMATION']]],
    'SidListLength' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_1445' : [ 0x4, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'BusRelations', 1: u'EjectionRelations', 2: u'PowerRelations', 3: u'RemovalRelations', 4: u'TargetDeviceRelation', 5: u'SingleBusRelations', 6: u'TransportRelations'})]],
} ],
  '__unnamed_1449' : [ 0x10, {
    'InterfaceType' : [ 0x0, ['pointer', ['_GUID']]],
    'Size' : [ 0x4, ['unsigned short']],
    'Version' : [ 0x6, ['unsigned short']],
    'Interface' : [ 0x8, ['pointer', ['_INTERFACE']]],
    'InterfaceSpecificData' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_144d' : [ 0x4, {
    'Capabilities' : [ 0x0, ['pointer', ['_DEVICE_CAPABILITIES']]],
} ],
  '__unnamed_1451' : [ 0x4, {
    'IoResourceRequirementList' : [ 0x0, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
} ],
  '__unnamed_1453' : [ 0x10, {
    'WhichSpace' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x4, ['pointer', ['void']]],
    'Offset' : [ 0x8, ['unsigned long']],
    'Length' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_1455' : [ 0x1, {
    'Lock' : [ 0x0, ['unsigned char']],
} ],
  '__unnamed_1459' : [ 0x4, {
    'IdType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'BusQueryDeviceID', 1: u'BusQueryHardwareIDs', 2: u'BusQueryCompatibleIDs', 3: u'BusQueryInstanceID', 4: u'BusQueryDeviceSerialNumber', 5: u'BusQueryContainerID'})]],
} ],
  '__unnamed_145d' : [ 0x8, {
    'DeviceTextType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'DeviceTextDescription', 1: u'DeviceTextLocationInformation'})]],
    'LocaleId' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_1461' : [ 0x8, {
    'InPath' : [ 0x0, ['unsigned char']],
    'Reserved' : [ 0x1, ['array', 3, ['unsigned char']]],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'DeviceUsageTypeUndefined', 1: u'DeviceUsageTypePaging', 2: u'DeviceUsageTypeHibernation', 3: u'DeviceUsageTypeDumpFile', 4: u'DeviceUsageTypeBoot', 5: u'DeviceUsageTypePostDisplay', 6: u'DeviceUsageTypeGuestAssigned'})]],
} ],
  '__unnamed_1465' : [ 0x4, {
    'PowerState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PowerSystemUnspecified', 1: u'PowerSystemWorking', 2: u'PowerSystemSleeping1', 3: u'PowerSystemSleeping2', 4: u'PowerSystemSleeping3', 5: u'PowerSystemHibernate', 6: u'PowerSystemShutdown', 7: u'PowerSystemMaximum'})]],
} ],
  '__unnamed_1469' : [ 0x4, {
    'PowerSequence' : [ 0x0, ['pointer', ['_POWER_SEQUENCE']]],
} ],
  '__unnamed_1471' : [ 0x10, {
    'SystemContext' : [ 0x0, ['unsigned long']],
    'SystemPowerStateContext' : [ 0x0, ['_SYSTEM_POWER_STATE_CONTEXT']],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'SystemPowerState', 1: u'DevicePowerState'})]],
    'State' : [ 0x8, ['_POWER_STATE']],
    'ShutdownType' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'PowerActionNone', 1: u'PowerActionReserved', 2: u'PowerActionSleep', 3: u'PowerActionHibernate', 4: u'PowerActionShutdown', 5: u'PowerActionShutdownReset', 6: u'PowerActionShutdownOff', 7: u'PowerActionWarmEject', 8: u'PowerActionDisplayOff'})]],
} ],
  '__unnamed_1475' : [ 0x8, {
    'AllocatedResources' : [ 0x0, ['pointer', ['_CM_RESOURCE_LIST']]],
    'AllocatedResourcesTranslated' : [ 0x4, ['pointer', ['_CM_RESOURCE_LIST']]],
} ],
  '__unnamed_1477' : [ 0x10, {
    'ProviderId' : [ 0x0, ['unsigned long']],
    'DataPath' : [ 0x4, ['pointer', ['void']]],
    'BufferSize' : [ 0x8, ['unsigned long']],
    'Buffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_1479' : [ 0x10, {
    'Argument1' : [ 0x0, ['pointer', ['void']]],
    'Argument2' : [ 0x4, ['pointer', ['void']]],
    'Argument3' : [ 0x8, ['pointer', ['void']]],
    'Argument4' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_147b' : [ 0x10, {
    'Create' : [ 0x0, ['__unnamed_140a']],
    'CreatePipe' : [ 0x0, ['__unnamed_140e']],
    'CreateMailslot' : [ 0x0, ['__unnamed_1412']],
    'Read' : [ 0x0, ['__unnamed_1414']],
    'Write' : [ 0x0, ['__unnamed_1414']],
    'QueryDirectory' : [ 0x0, ['__unnamed_1418']],
    'NotifyDirectory' : [ 0x0, ['__unnamed_141a']],
    'NotifyDirectoryEx' : [ 0x0, ['__unnamed_141e']],
    'QueryFile' : [ 0x0, ['__unnamed_1420']],
    'SetFile' : [ 0x0, ['__unnamed_1422']],
    'QueryEa' : [ 0x0, ['__unnamed_1424']],
    'SetEa' : [ 0x0, ['__unnamed_1426']],
    'QueryVolume' : [ 0x0, ['__unnamed_142a']],
    'SetVolume' : [ 0x0, ['__unnamed_142a']],
    'FileSystemControl' : [ 0x0, ['__unnamed_142c']],
    'LockControl' : [ 0x0, ['__unnamed_142f']],
    'DeviceIoControl' : [ 0x0, ['__unnamed_1431']],
    'QuerySecurity' : [ 0x0, ['__unnamed_1433']],
    'SetSecurity' : [ 0x0, ['__unnamed_1435']],
    'MountVolume' : [ 0x0, ['__unnamed_1439']],
    'VerifyVolume' : [ 0x0, ['__unnamed_1439']],
    'Scsi' : [ 0x0, ['__unnamed_143d']],
    'QueryQuota' : [ 0x0, ['__unnamed_1441']],
    'SetQuota' : [ 0x0, ['__unnamed_1426']],
    'QueryDeviceRelations' : [ 0x0, ['__unnamed_1445']],
    'QueryInterface' : [ 0x0, ['__unnamed_1449']],
    'DeviceCapabilities' : [ 0x0, ['__unnamed_144d']],
    'FilterResourceRequirements' : [ 0x0, ['__unnamed_1451']],
    'ReadWriteConfig' : [ 0x0, ['__unnamed_1453']],
    'SetLock' : [ 0x0, ['__unnamed_1455']],
    'QueryId' : [ 0x0, ['__unnamed_1459']],
    'QueryDeviceText' : [ 0x0, ['__unnamed_145d']],
    'UsageNotification' : [ 0x0, ['__unnamed_1461']],
    'WaitWake' : [ 0x0, ['__unnamed_1465']],
    'PowerSequence' : [ 0x0, ['__unnamed_1469']],
    'Power' : [ 0x0, ['__unnamed_1471']],
    'StartDevice' : [ 0x0, ['__unnamed_1475']],
    'WMI' : [ 0x0, ['__unnamed_1477']],
    'Others' : [ 0x0, ['__unnamed_1479']],
} ],
  '_IO_STACK_LOCATION' : [ 0x24, {
    'MajorFunction' : [ 0x0, ['unsigned char']],
    'MinorFunction' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned char']],
    'Control' : [ 0x3, ['unsigned char']],
    'Parameters' : [ 0x4, ['__unnamed_147b']],
    'DeviceObject' : [ 0x14, ['pointer', ['_DEVICE_OBJECT']]],
    'FileObject' : [ 0x18, ['pointer', ['_FILE_OBJECT']]],
    'CompletionRoutine' : [ 0x1c, ['pointer', ['void']]],
    'Context' : [ 0x20, ['pointer', ['void']]],
} ],
  '__unnamed_148d' : [ 0x28, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Wcb' : [ 0x0, ['_WAIT_CONTEXT_BLOCK']],
} ],
  '_DEVICE_OBJECT' : [ 0xb8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'ReferenceCount' : [ 0x4, ['long']],
    'DriverObject' : [ 0x8, ['pointer', ['_DRIVER_OBJECT']]],
    'NextDevice' : [ 0xc, ['pointer', ['_DEVICE_OBJECT']]],
    'AttachedDevice' : [ 0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'CurrentIrp' : [ 0x14, ['pointer', ['_IRP']]],
    'Timer' : [ 0x18, ['pointer', ['_IO_TIMER']]],
    'Flags' : [ 0x1c, ['unsigned long']],
    'Characteristics' : [ 0x20, ['unsigned long']],
    'Vpb' : [ 0x24, ['pointer', ['_VPB']]],
    'DeviceExtension' : [ 0x28, ['pointer', ['void']]],
    'DeviceType' : [ 0x2c, ['unsigned long']],
    'StackSize' : [ 0x30, ['unsigned char']],
    'Queue' : [ 0x34, ['__unnamed_148d']],
    'AlignmentRequirement' : [ 0x5c, ['unsigned long']],
    'DeviceQueue' : [ 0x60, ['_KDEVICE_QUEUE']],
    'Dpc' : [ 0x74, ['_KDPC']],
    'ActiveThreadCount' : [ 0x94, ['unsigned long']],
    'SecurityDescriptor' : [ 0x98, ['pointer', ['void']]],
    'DeviceLock' : [ 0x9c, ['_KEVENT']],
    'SectorSize' : [ 0xac, ['unsigned short']],
    'Spare1' : [ 0xae, ['unsigned short']],
    'DeviceObjectExtension' : [ 0xb0, ['pointer', ['_DEVOBJ_EXTENSION']]],
    'Reserved' : [ 0xb4, ['pointer', ['void']]],
} ],
  '_KDPC' : [ 0x20, {
    'TargetInfoAsUlong' : [ 0x0, ['unsigned long']],
    'Type' : [ 0x0, ['unsigned char']],
    'Importance' : [ 0x1, ['unsigned char']],
    'Number' : [ 0x2, ['unsigned short']],
    'DpcListEntry' : [ 0x4, ['_SINGLE_LIST_ENTRY']],
    'ProcessorHistory' : [ 0x8, ['unsigned long']],
    'DeferredRoutine' : [ 0xc, ['pointer', ['void']]],
    'DeferredContext' : [ 0x10, ['pointer', ['void']]],
    'SystemArgument1' : [ 0x14, ['pointer', ['void']]],
    'SystemArgument2' : [ 0x18, ['pointer', ['void']]],
    'DpcData' : [ 0x1c, ['pointer', ['void']]],
} ],
  '_IO_DRIVER_CREATE_CONTEXT' : [ 0x14, {
    'Size' : [ 0x0, ['short']],
    'ExtraCreateParameter' : [ 0x4, ['pointer', ['_ECP_LIST']]],
    'DeviceObjectHint' : [ 0x8, ['pointer', ['void']]],
    'TxnParameters' : [ 0xc, ['pointer', ['_TXN_PARAMETER_BLOCK']]],
    'SiloContext' : [ 0x10, ['pointer', ['_EJOB']]],
} ],
  '_EJOB' : [ 0x3c0, {
    'Event' : [ 0x0, ['_KEVENT']],
    'JobLinks' : [ 0x10, ['_LIST_ENTRY']],
    'ProcessListHead' : [ 0x18, ['_LIST_ENTRY']],
    'JobLock' : [ 0x20, ['_ERESOURCE']],
    'TotalUserTime' : [ 0x58, ['_LARGE_INTEGER']],
    'TotalKernelTime' : [ 0x60, ['_LARGE_INTEGER']],
    'TotalCycleTime' : [ 0x68, ['_LARGE_INTEGER']],
    'ThisPeriodTotalUserTime' : [ 0x70, ['_LARGE_INTEGER']],
    'ThisPeriodTotalKernelTime' : [ 0x78, ['_LARGE_INTEGER']],
    'TotalContextSwitches' : [ 0x80, ['unsigned long long']],
    'TotalPageFaultCount' : [ 0x88, ['unsigned long']],
    'TotalProcesses' : [ 0x8c, ['unsigned long']],
    'ActiveProcesses' : [ 0x90, ['unsigned long']],
    'TotalTerminatedProcesses' : [ 0x94, ['unsigned long']],
    'PerProcessUserTimeLimit' : [ 0x98, ['_LARGE_INTEGER']],
    'PerJobUserTimeLimit' : [ 0xa0, ['_LARGE_INTEGER']],
    'MinimumWorkingSetSize' : [ 0xa8, ['unsigned long']],
    'MaximumWorkingSetSize' : [ 0xac, ['unsigned long']],
    'LimitFlags' : [ 0xb0, ['unsigned long']],
    'ActiveProcessLimit' : [ 0xb4, ['unsigned long']],
    'Affinity' : [ 0xb8, ['_KAFFINITY_EX']],
    'AccessState' : [ 0xc4, ['pointer', ['_JOB_ACCESS_STATE']]],
    'AccessStateQuotaReference' : [ 0xc8, ['pointer', ['void']]],
    'UIRestrictionsClass' : [ 0xcc, ['unsigned long']],
    'EndOfJobTimeAction' : [ 0xd0, ['unsigned long']],
    'CompletionPort' : [ 0xd4, ['pointer', ['void']]],
    'CompletionKey' : [ 0xd8, ['pointer', ['void']]],
    'CompletionCount' : [ 0xe0, ['unsigned long long']],
    'SessionId' : [ 0xe8, ['unsigned long']],
    'SchedulingClass' : [ 0xec, ['unsigned long']],
    'ReadOperationCount' : [ 0xf0, ['unsigned long long']],
    'WriteOperationCount' : [ 0xf8, ['unsigned long long']],
    'OtherOperationCount' : [ 0x100, ['unsigned long long']],
    'ReadTransferCount' : [ 0x108, ['unsigned long long']],
    'WriteTransferCount' : [ 0x110, ['unsigned long long']],
    'OtherTransferCount' : [ 0x118, ['unsigned long long']],
    'DiskIoInfo' : [ 0x120, ['_PROCESS_DISK_COUNTERS']],
    'ProcessMemoryLimit' : [ 0x148, ['unsigned long']],
    'JobMemoryLimit' : [ 0x14c, ['unsigned long']],
    'JobTotalMemoryLimit' : [ 0x150, ['unsigned long']],
    'PeakProcessMemoryUsed' : [ 0x154, ['unsigned long']],
    'PeakJobMemoryUsed' : [ 0x158, ['unsigned long']],
    'EffectiveAffinity' : [ 0x15c, ['_KAFFINITY_EX']],
    'EffectivePerProcessUserTimeLimit' : [ 0x168, ['_LARGE_INTEGER']],
    'EffectiveMinimumWorkingSetSize' : [ 0x170, ['unsigned long']],
    'EffectiveMaximumWorkingSetSize' : [ 0x174, ['unsigned long']],
    'EffectiveProcessMemoryLimit' : [ 0x178, ['unsigned long']],
    'EffectiveProcessMemoryLimitJob' : [ 0x17c, ['pointer', ['_EJOB']]],
    'EffectivePerProcessUserTimeLimitJob' : [ 0x180, ['pointer', ['_EJOB']]],
    'EffectiveNetIoRateLimitJob' : [ 0x184, ['pointer', ['_EJOB']]],
    'EffectiveHeapAttributionJob' : [ 0x188, ['pointer', ['_EJOB']]],
    'EffectiveLimitFlags' : [ 0x18c, ['unsigned long']],
    'EffectiveSchedulingClass' : [ 0x190, ['unsigned long']],
    'EffectiveFreezeCount' : [ 0x194, ['unsigned long']],
    'EffectiveBackgroundCount' : [ 0x198, ['unsigned long']],
    'EffectiveSwapCount' : [ 0x19c, ['unsigned long']],
    'EffectiveNotificationLimitCount' : [ 0x1a0, ['unsigned long']],
    'EffectivePriorityClass' : [ 0x1a4, ['unsigned char']],
    'PriorityClass' : [ 0x1a5, ['unsigned char']],
    'NestingDepth' : [ 0x1a6, ['unsigned char']],
    'Reserved1' : [ 0x1a7, ['array', 1, ['unsigned char']]],
    'CompletionFilter' : [ 0x1a8, ['unsigned long']],
    'WakeChannel' : [ 0x1b0, ['_WNF_STATE_NAME']],
    'WakeInfo' : [ 0x1b0, ['_PS_JOB_WAKE_INFORMATION']],
    'WakeFilter' : [ 0x1f8, ['_JOBOBJECT_WAKE_FILTER']],
    'LowEdgeLatchFilter' : [ 0x200, ['unsigned long']],
    'NotificationLink' : [ 0x204, ['pointer', ['_EJOB']]],
    'CurrentJobMemoryUsed' : [ 0x208, ['unsigned long long']],
    'NotificationInfo' : [ 0x210, ['pointer', ['_JOB_NOTIFICATION_INFORMATION']]],
    'NotificationInfoQuotaReference' : [ 0x214, ['pointer', ['void']]],
    'NotificationPacket' : [ 0x218, ['pointer', ['_IO_MINI_COMPLETION_PACKET_USER']]],
    'CpuRateControl' : [ 0x21c, ['pointer', ['_JOB_CPU_RATE_CONTROL']]],
    'EffectiveSchedulingGroup' : [ 0x220, ['pointer', ['void']]],
    'ReadyTime' : [ 0x228, ['unsigned long long']],
    'MemoryLimitsLock' : [ 0x230, ['_EX_PUSH_LOCK']],
    'SiblingJobLinks' : [ 0x234, ['_LIST_ENTRY']],
    'ChildJobListHead' : [ 0x23c, ['_LIST_ENTRY']],
    'ParentJob' : [ 0x244, ['pointer', ['_EJOB']]],
    'RootJob' : [ 0x248, ['pointer', ['_EJOB']]],
    'IteratorListHead' : [ 0x24c, ['_LIST_ENTRY']],
    'AncestorCount' : [ 0x254, ['unsigned long']],
    'Ancestors' : [ 0x258, ['pointer', ['pointer', ['_EJOB']]]],
    'SessionObject' : [ 0x258, ['pointer', ['void']]],
    'Accounting' : [ 0x260, ['_EPROCESS_VALUES']],
    'ShadowActiveProcessCount' : [ 0x2c8, ['unsigned long']],
    'ActiveAuxiliaryProcessCount' : [ 0x2cc, ['unsigned long']],
    'SequenceNumber' : [ 0x2d0, ['unsigned long']],
    'JobId' : [ 0x2d4, ['unsigned long']],
    'ContainerId' : [ 0x2d8, ['_GUID']],
    'ContainerTelemetryId' : [ 0x2e8, ['_GUID']],
    'ServerSiloGlobals' : [ 0x2f8, ['pointer', ['_ESERVERSILO_GLOBALS']]],
    'PropertySet' : [ 0x2fc, ['_PS_PROPERTY_SET']],
    'Storage' : [ 0x308, ['pointer', ['_PSP_STORAGE']]],
    'NetRateControl' : [ 0x30c, ['pointer', ['_JOB_NET_RATE_CONTROL']]],
    'JobFlags' : [ 0x310, ['unsigned long']],
    'CloseDone' : [ 0x310, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MultiGroup' : [ 0x310, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'OutstandingNotification' : [ 0x310, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'NotificationInProgress' : [ 0x310, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'UILimits' : [ 0x310, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'CpuRateControlActive' : [ 0x310, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'OwnCpuRateControl' : [ 0x310, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Terminating' : [ 0x310, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'WorkingSetLock' : [ 0x310, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'JobFrozen' : [ 0x310, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'Background' : [ 0x310, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'WakeNotificationAllocated' : [ 0x310, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'WakeNotificationEnabled' : [ 0x310, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'WakeNotificationPending' : [ 0x310, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'LimitNotificationRequired' : [ 0x310, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'ZeroCountNotificationRequired' : [ 0x310, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'CycleTimeNotificationRequired' : [ 0x310, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'CycleTimeNotificationPending' : [ 0x310, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'TimersVirtualized' : [ 0x310, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'JobSwapped' : [ 0x310, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'ViolationDetected' : [ 0x310, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'EmptyJobNotified' : [ 0x310, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'NoSystemCharge' : [ 0x310, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'DropNoWakeCharges' : [ 0x310, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'NoWakeChargePolicyDecided' : [ 0x310, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'NetRateControlActive' : [ 0x310, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'OwnNetRateControl' : [ 0x310, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'IoRateControlActive' : [ 0x310, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'OwnIoRateControl' : [ 0x310, ['BitField', dict(start_bit = 28, end_bit = 29, native_type='unsigned long')]],
    'DisallowNewProcesses' : [ 0x310, ['BitField', dict(start_bit = 29, end_bit = 30, native_type='unsigned long')]],
    'Silo' : [ 0x310, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'ContainerTelemetryIdSet' : [ 0x310, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'JobFlags2' : [ 0x314, ['unsigned long']],
    'ParentLocked' : [ 0x314, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'EnableUsermodeSiloThreadImpersonation' : [ 0x314, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DisallowUsermodeSiloThreadImpersonation' : [ 0x314, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'EnergyValues' : [ 0x318, ['pointer', ['_PROCESS_EXTENDED_ENERGY_VALUES']]],
    'SharedCommitCharge' : [ 0x31c, ['unsigned long']],
    'DiskIoAttributionUserRefCount' : [ 0x320, ['unsigned long']],
    'DiskIoAttributionRefCount' : [ 0x324, ['unsigned long']],
    'DiskIoAttributionContext' : [ 0x328, ['pointer', ['void']]],
    'DiskIoAttributionOwnerJob' : [ 0x328, ['pointer', ['_EJOB']]],
    'IoRateControlHeader' : [ 0x32c, ['_JOB_RATE_CONTROL_HEADER']],
    'GlobalIoControl' : [ 0x340, ['_PS_IO_CONTROL_ENTRY']],
    'IoControlStateLock' : [ 0x35c, ['long']],
    'VolumeIoControlTree' : [ 0x360, ['_RTL_RB_TREE']],
    'IoRateOverQuotaHistory' : [ 0x368, ['unsigned long long']],
    'IoRateCurrentGeneration' : [ 0x370, ['unsigned long']],
    'IoRateLastQueryGeneration' : [ 0x374, ['unsigned long']],
    'IoRateGenerationLength' : [ 0x378, ['unsigned long']],
    'IoRateOverQuotaNotifySequenceId' : [ 0x37c, ['unsigned long']],
    'LastThrottledIoTime' : [ 0x380, ['unsigned long long']],
    'IoControlLock' : [ 0x388, ['_EX_PUSH_LOCK']],
    'SiloHardReferenceCount' : [ 0x38c, ['long']],
    'RundownWorkItem' : [ 0x390, ['_WORK_QUEUE_ITEM']],
    'PartitionObject' : [ 0x3a0, ['pointer', ['void']]],
    'PartitionOwnerJob' : [ 0x3a4, ['pointer', ['_EJOB']]],
    'EnergyTrackingState' : [ 0x3a8, ['_JOBOBJECT_ENERGY_TRACKING_STATE']],
    'KernelWaitTime' : [ 0x3b0, ['unsigned long long']],
    'UserWaitTime' : [ 0x3b8, ['unsigned long long']],
} ],
  '_IO_PRIORITY_INFO' : [ 0x10, {
    'Size' : [ 0x0, ['unsigned long']],
    'ThreadPriority' : [ 0x4, ['unsigned long']],
    'PagePriority' : [ 0x8, ['unsigned long']],
    'IoPriority' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'IoPriorityVeryLow', 1: u'IoPriorityLow', 2: u'IoPriorityNormal', 3: u'IoPriorityHigh', 4: u'IoPriorityCritical', 5: u'MaxIoPriorityTypes'})]],
} ],
  '_MDL' : [ 0x1c, {
    'Next' : [ 0x0, ['pointer', ['_MDL']]],
    'Size' : [ 0x4, ['short']],
    'MdlFlags' : [ 0x6, ['short']],
    'Process' : [ 0x8, ['pointer', ['_EPROCESS']]],
    'MappedSystemVa' : [ 0xc, ['pointer', ['void']]],
    'StartVa' : [ 0x10, ['pointer', ['void']]],
    'ByteCount' : [ 0x14, ['unsigned long']],
    'ByteOffset' : [ 0x18, ['unsigned long']],
} ],
  '_EVENT_DATA_DESCRIPTOR' : [ 0x10, {
    'Ptr' : [ 0x0, ['unsigned long long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned char']],
    'Reserved1' : [ 0xd, ['unsigned char']],
    'Reserved2' : [ 0xe, ['unsigned short']],
} ],
  '_EVENT_DESCRIPTOR' : [ 0x10, {
    'Id' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned char']],
    'Channel' : [ 0x3, ['unsigned char']],
    'Level' : [ 0x4, ['unsigned char']],
    'Opcode' : [ 0x5, ['unsigned char']],
    'Task' : [ 0x6, ['unsigned short']],
    'Keyword' : [ 0x8, ['unsigned long long']],
} ],
  '_EVENT_RECORD' : [ 0x68, {
    'EventHeader' : [ 0x0, ['_EVENT_HEADER']],
    'BufferContext' : [ 0x50, ['_ETW_BUFFER_CONTEXT']],
    'ExtendedDataCount' : [ 0x54, ['unsigned short']],
    'UserDataLength' : [ 0x56, ['unsigned short']],
    'ExtendedData' : [ 0x58, ['pointer', ['_EVENT_HEADER_EXTENDED_DATA_ITEM']]],
    'UserData' : [ 0x5c, ['pointer', ['void']]],
    'UserContext' : [ 0x60, ['pointer', ['void']]],
} ],
  '_PERFINFO_GROUPMASK' : [ 0x20, {
    'Masks' : [ 0x0, ['array', 8, ['unsigned long']]],
} ],
  '_FILE_OBJECT' : [ 0x80, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
    'Vpb' : [ 0x8, ['pointer', ['_VPB']]],
    'FsContext' : [ 0xc, ['pointer', ['void']]],
    'FsContext2' : [ 0x10, ['pointer', ['void']]],
    'SectionObjectPointer' : [ 0x14, ['pointer', ['_SECTION_OBJECT_POINTERS']]],
    'PrivateCacheMap' : [ 0x18, ['pointer', ['void']]],
    'FinalStatus' : [ 0x1c, ['long']],
    'RelatedFileObject' : [ 0x20, ['pointer', ['_FILE_OBJECT']]],
    'LockOperation' : [ 0x24, ['unsigned char']],
    'DeletePending' : [ 0x25, ['unsigned char']],
    'ReadAccess' : [ 0x26, ['unsigned char']],
    'WriteAccess' : [ 0x27, ['unsigned char']],
    'DeleteAccess' : [ 0x28, ['unsigned char']],
    'SharedRead' : [ 0x29, ['unsigned char']],
    'SharedWrite' : [ 0x2a, ['unsigned char']],
    'SharedDelete' : [ 0x2b, ['unsigned char']],
    'Flags' : [ 0x2c, ['unsigned long']],
    'FileName' : [ 0x30, ['_UNICODE_STRING']],
    'CurrentByteOffset' : [ 0x38, ['_LARGE_INTEGER']],
    'Waiters' : [ 0x40, ['unsigned long']],
    'Busy' : [ 0x44, ['unsigned long']],
    'LastLock' : [ 0x48, ['pointer', ['void']]],
    'Lock' : [ 0x4c, ['_KEVENT']],
    'Event' : [ 0x5c, ['_KEVENT']],
    'CompletionContext' : [ 0x6c, ['pointer', ['_IO_COMPLETION_CONTEXT']]],
    'IrpListLock' : [ 0x70, ['unsigned long']],
    'IrpList' : [ 0x74, ['_LIST_ENTRY']],
    'FileObjectExtension' : [ 0x7c, ['pointer', ['void']]],
} ],
  '_EX_RUNDOWN_REF' : [ 0x4, {
    'Count' : [ 0x0, ['unsigned long']],
    'Ptr' : [ 0x0, ['pointer', ['void']]],
} ],
  '_MM_PAGE_ACCESS_INFO_HEADER' : [ 0x38, {
    'Link' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'MmPteAccessType', 1: u'MmCcReadAheadType', 2: u'MmPfnRepurposeType', 3: u'MmMaximumPageAccessType'})]],
    'EmptySequenceNumber' : [ 0x8, ['unsigned long']],
    'CurrentFileIndex' : [ 0x8, ['unsigned long']],
    'CreateTime' : [ 0x10, ['unsigned long long']],
    'EmptyTime' : [ 0x18, ['unsigned long long']],
    'TempEntry' : [ 0x18, ['pointer', ['_MM_PAGE_ACCESS_INFO']]],
    'PageEntry' : [ 0x20, ['pointer', ['_MM_PAGE_ACCESS_INFO']]],
    'FileEntry' : [ 0x24, ['pointer', ['unsigned long']]],
    'FirstFileEntry' : [ 0x28, ['pointer', ['unsigned long']]],
    'Process' : [ 0x2c, ['pointer', ['_EPROCESS']]],
    'SessionId' : [ 0x30, ['unsigned long']],
    'PageFrameEntry' : [ 0x20, ['pointer', ['unsigned long']]],
    'LastPageFrameEntry' : [ 0x24, ['pointer', ['unsigned long']]],
} ],
  '_MCUPDATE_INFO' : [ 0x28, {
    'List' : [ 0x0, ['_LIST_ENTRY']],
    'Status' : [ 0x8, ['unsigned long']],
    'Id' : [ 0x10, ['unsigned long long']],
    'VendorScratch' : [ 0x18, ['array', 2, ['unsigned long long']]],
} ],
  '_PROCESS_EXTENDED_ENERGY_VALUES' : [ 0x1b0, {
    'Base' : [ 0x0, ['_PROCESS_ENERGY_VALUES']],
    'Extension' : [ 0x110, ['_PROCESS_ENERGY_VALUES_EXTENSION']],
} ],
  '__unnamed_1555' : [ 0x3a4, {
    'XpfMceDescriptor' : [ 0x0, ['_WHEA_XPF_MCE_DESCRIPTOR']],
    'XpfCmcDescriptor' : [ 0x0, ['_WHEA_XPF_CMC_DESCRIPTOR']],
    'XpfNmiDescriptor' : [ 0x0, ['_WHEA_XPF_NMI_DESCRIPTOR']],
    'IpfMcaDescriptor' : [ 0x0, ['_WHEA_IPF_MCA_DESCRIPTOR']],
    'IpfCmcDescriptor' : [ 0x0, ['_WHEA_IPF_CMC_DESCRIPTOR']],
    'IpfCpeDescriptor' : [ 0x0, ['_WHEA_IPF_CPE_DESCRIPTOR']],
    'AerRootportDescriptor' : [ 0x0, ['_WHEA_AER_ROOTPORT_DESCRIPTOR']],
    'AerEndpointDescriptor' : [ 0x0, ['_WHEA_AER_ENDPOINT_DESCRIPTOR']],
    'AerBridgeDescriptor' : [ 0x0, ['_WHEA_AER_BRIDGE_DESCRIPTOR']],
    'GenErrDescriptor' : [ 0x0, ['_WHEA_GENERIC_ERROR_DESCRIPTOR']],
    'GenErrDescriptorV2' : [ 0x0, ['_WHEA_GENERIC_ERROR_DESCRIPTOR_V2']],
    'DeviceDriverDescriptor' : [ 0x0, ['_WHEA_DEVICE_DRIVER_DESCRIPTOR']],
} ],
  '_WHEA_ERROR_SOURCE_DESCRIPTOR' : [ 0x3cc, {
    'Length' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSrcTypeMCE', 1: u'WheaErrSrcTypeCMC', 2: u'WheaErrSrcTypeCPE', 3: u'WheaErrSrcTypeNMI', 4: u'WheaErrSrcTypePCIe', 5: u'WheaErrSrcTypeGeneric', 6: u'WheaErrSrcTypeINIT', 7: u'WheaErrSrcTypeBOOT', 8: u'WheaErrSrcTypeSCIGeneric', 9: u'WheaErrSrcTypeIPFMCA', 10: u'WheaErrSrcTypeIPFCMC', 11: u'WheaErrSrcTypeIPFCPE', 12: u'WheaErrSrcTypeGenericV2', 13: u'WheaErrSrcTypeSCIGenericV2', 14: u'WheaErrSrcTypeBMC', 15: u'WheaErrSrcTypePMEM', 16: u'WheaErrSrcTypeDeviceDriver', 17: u'WheaErrSrcTypeMax'})]],
    'State' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {1: u'WheaErrSrcStateStopped', 2: u'WheaErrSrcStateStarted', 3: u'WheaErrSrcStateRemoved', 4: u'WheaErrSrcStateRemovePending'})]],
    'MaxRawDataLength' : [ 0x10, ['unsigned long']],
    'NumRecordsToPreallocate' : [ 0x14, ['unsigned long']],
    'MaxSectionsPerRecord' : [ 0x18, ['unsigned long']],
    'ErrorSourceId' : [ 0x1c, ['unsigned long']],
    'PlatformErrorSourceId' : [ 0x20, ['unsigned long']],
    'Flags' : [ 0x24, ['unsigned long']],
    'Info' : [ 0x28, ['__unnamed_1555']],
} ],
  '_WHEA_EVENT_LOG_ENTRY' : [ 0x20, {
    'Header' : [ 0x0, ['_WHEA_EVENT_LOG_ENTRY_HEADER']],
} ],
  '_WHEA_EVENT_LOG_ENTRY_FLAGS' : [ 0x4, {
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'LogInternalEtw' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'LogBlackbox' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'LogSel' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'RawSel' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'NoFormat' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Driver' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_WHEA_ERROR_PACKET_V2' : [ 0x50, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'Length' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_PACKET_FLAGS']],
    'ErrorType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrTypeProcessor', 1: u'WheaErrTypeMemory', 2: u'WheaErrTypePCIExpress', 3: u'WheaErrTypeNMI', 4: u'WheaErrTypePCIXBus', 5: u'WheaErrTypePCIXDevice', 6: u'WheaErrTypeGeneric', 7: u'WheaErrTypePmem'})]],
    'ErrorSeverity' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSevRecoverable', 1: u'WheaErrSevFatal', 2: u'WheaErrSevCorrected', 3: u'WheaErrSevInformational'})]],
    'ErrorSourceId' : [ 0x18, ['unsigned long']],
    'ErrorSourceType' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSrcTypeMCE', 1: u'WheaErrSrcTypeCMC', 2: u'WheaErrSrcTypeCPE', 3: u'WheaErrSrcTypeNMI', 4: u'WheaErrSrcTypePCIe', 5: u'WheaErrSrcTypeGeneric', 6: u'WheaErrSrcTypeINIT', 7: u'WheaErrSrcTypeBOOT', 8: u'WheaErrSrcTypeSCIGeneric', 9: u'WheaErrSrcTypeIPFMCA', 10: u'WheaErrSrcTypeIPFCMC', 11: u'WheaErrSrcTypeIPFCPE', 12: u'WheaErrSrcTypeGenericV2', 13: u'WheaErrSrcTypeSCIGenericV2', 14: u'WheaErrSrcTypeBMC', 15: u'WheaErrSrcTypePMEM', 16: u'WheaErrSrcTypeDeviceDriver', 17: u'WheaErrSrcTypeMax'})]],
    'NotifyType' : [ 0x20, ['_GUID']],
    'Context' : [ 0x30, ['unsigned long long']],
    'DataFormat' : [ 0x38, ['Enumeration', dict(target = 'long', choices = {0: u'WheaDataFormatIPFSalRecord', 1: u'WheaDataFormatXPFMCA', 2: u'WheaDataFormatMemory', 3: u'WheaDataFormatPCIExpress', 4: u'WheaDataFormatNMIPort', 5: u'WheaDataFormatPCIXBus', 6: u'WheaDataFormatPCIXDevice', 7: u'WheaDataFormatGeneric', 8: u'WheaDataFormatMax'})]],
    'Reserved1' : [ 0x3c, ['unsigned long']],
    'DataOffset' : [ 0x40, ['unsigned long']],
    'DataLength' : [ 0x44, ['unsigned long']],
    'PshedDataOffset' : [ 0x48, ['unsigned long']],
    'PshedDataLength' : [ 0x4c, ['unsigned long']],
} ],
  '_WHEA_ERROR_RECORD' : [ 0xc8, {
    'Header' : [ 0x0, ['_WHEA_ERROR_RECORD_HEADER']],
    'SectionDescriptor' : [ 0x80, ['array', 1, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR']]],
} ],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR' : [ 0x48, {
    'SectionOffset' : [ 0x0, ['unsigned long']],
    'SectionLength' : [ 0x4, ['unsigned long']],
    'Revision' : [ 0x8, ['_WHEA_REVISION']],
    'ValidBits' : [ 0xa, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS']],
    'Reserved' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS']],
    'SectionType' : [ 0x10, ['_GUID']],
    'FRUId' : [ 0x20, ['_GUID']],
    'SectionSeverity' : [ 0x30, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSevRecoverable', 1: u'WheaErrSevFatal', 2: u'WheaErrSevCorrected', 3: u'WheaErrSevInformational'})]],
    'FRUText' : [ 0x34, ['array', 20, ['unsigned char']]],
} ],
  '_FSRTL_ADVANCED_FCB_HEADER' : [ 0x48, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'Flags' : [ 0x4, ['unsigned char']],
    'IsFastIoPossible' : [ 0x5, ['unsigned char']],
    'Flags2' : [ 0x6, ['unsigned char']],
    'Reserved' : [ 0x7, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'Version' : [ 0x7, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Resource' : [ 0x8, ['pointer', ['_ERESOURCE']]],
    'PagingIoResource' : [ 0xc, ['pointer', ['_ERESOURCE']]],
    'AllocationSize' : [ 0x10, ['_LARGE_INTEGER']],
    'FileSize' : [ 0x18, ['_LARGE_INTEGER']],
    'ValidDataLength' : [ 0x20, ['_LARGE_INTEGER']],
    'FastMutex' : [ 0x28, ['pointer', ['_FAST_MUTEX']]],
    'FilterContexts' : [ 0x2c, ['_LIST_ENTRY']],
    'PushLock' : [ 0x34, ['_EX_PUSH_LOCK']],
    'FileContextSupportPointer' : [ 0x38, ['pointer', ['pointer', ['void']]]],
    'Oplock' : [ 0x3c, ['pointer', ['void']]],
    'ReservedForRemote' : [ 0x3c, ['pointer', ['void']]],
    'ReservedContext' : [ 0x40, ['pointer', ['void']]],
} ],
  '_iobuf' : [ 0x20, {
    '_ptr' : [ 0x0, ['pointer', ['unsigned char']]],
    '_cnt' : [ 0x4, ['long']],
    '_base' : [ 0x8, ['pointer', ['unsigned char']]],
    '_flag' : [ 0xc, ['long']],
    '_file' : [ 0x10, ['long']],
    '_charbuf' : [ 0x14, ['long']],
    '_bufsiz' : [ 0x18, ['long']],
    '_tmpfname' : [ 0x1c, ['pointer', ['unsigned char']]],
} ],
  '_RTL_HASH_TABLE' : [ 0xc, {
    'EntryCount' : [ 0x0, ['unsigned long']],
    'MaskBitCount' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 5, native_type='unsigned long')]],
    'BucketCount' : [ 0x4, ['BitField', dict(start_bit = 5, end_bit = 32, native_type='unsigned long')]],
    'Buckets' : [ 0x8, ['pointer', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_RTL_HASH_ENTRY' : [ 0x8, {
    'BucketLink' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Key' : [ 0x4, ['unsigned long']],
} ],
  '_RTL_HASH_TABLE_ITERATOR' : [ 0xc, {
    'Hash' : [ 0x0, ['pointer', ['_RTL_HASH_TABLE']]],
    'HashEntry' : [ 0x4, ['pointer', ['_RTL_HASH_ENTRY']]],
    'Bucket' : [ 0x8, ['pointer', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_RTL_CHASH_TABLE' : [ 0x10, {
    'Table' : [ 0x0, ['pointer', ['_RTL_CHASH_ENTRY']]],
    'EntrySizeShift' : [ 0x4, ['unsigned long']],
    'EntryMax' : [ 0x8, ['unsigned long']],
    'EntryCount' : [ 0xc, ['unsigned long']],
} ],
  '_RTL_CHASH_ENTRY' : [ 0x4, {
    'Key' : [ 0x0, ['unsigned long']],
} ],
  '_tlgProvider_t' : [ 0x28, {
    'LevelPlus1' : [ 0x0, ['unsigned long']],
    'ProviderMetadataPtr' : [ 0x4, ['pointer', ['unsigned short']]],
    'KeywordAny' : [ 0x8, ['unsigned long long']],
    'KeywordAll' : [ 0x10, ['unsigned long long']],
    'RegHandle' : [ 0x18, ['unsigned long long']],
    'EnableCallback' : [ 0x20, ['pointer', ['void']]],
    'CallbackContext' : [ 0x24, ['pointer', ['void']]],
} ],
  '_EVENT_FILTER_DESCRIPTOR' : [ 0x10, {
    'Ptr' : [ 0x0, ['unsigned long long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned long']],
} ],
  '_tlgProviderMetadata_t' : [ 0x13, {
    'Type' : [ 0x0, ['unsigned char']],
    'ProviderId' : [ 0x1, ['_GUID']],
    'RemainingSize' : [ 0x11, ['unsigned short']],
} ],
  '__m64' : [ 0x8, {
    'm64_u64' : [ 0x0, ['unsigned long long']],
    'm64_f32' : [ 0x0, ['array', 2, ['float']]],
    'm64_i8' : [ 0x0, ['array', 8, ['unsigned char']]],
    'm64_i16' : [ 0x0, ['array', 4, ['short']]],
    'm64_i32' : [ 0x0, ['array', 2, ['long']]],
    'm64_i64' : [ 0x0, ['long long']],
    'm64_u8' : [ 0x0, ['array', 8, ['unsigned char']]],
    'm64_u16' : [ 0x0, ['array', 4, ['unsigned short']]],
    'm64_u32' : [ 0x0, ['array', 2, ['unsigned long']]],
} ],
  '__m128' : [ 0x10, {
    'm128_f32' : [ 0x0, ['array', 4, ['float']]],
    'm128_u64' : [ 0x0, ['array', 2, ['unsigned long long']]],
    'm128_i8' : [ 0x0, ['array', 16, ['unsigned char']]],
    'm128_i16' : [ 0x0, ['array', 8, ['short']]],
    'm128_i32' : [ 0x0, ['array', 4, ['long']]],
    'm128_i64' : [ 0x0, ['array', 2, ['long long']]],
    'm128_u8' : [ 0x0, ['array', 16, ['unsigned char']]],
    'm128_u16' : [ 0x0, ['array', 8, ['unsigned short']]],
    'm128_u32' : [ 0x0, ['array', 4, ['unsigned long']]],
} ],
  'wil_details_FeatureReportingCache' : [ 0x8, {
    'reported' : [ 0x0, ['wil_details_ReportedState']],
    'recorded' : [ 0x4, ['wil_details_RecordedState']],
} ],
  'wil_details_RecordUsageResult' : [ 0x18, {
    'queueBackground' : [ 0x0, ['long']],
    'countImmediate' : [ 0x4, ['unsigned long']],
    'kindImmediate' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'wil_details_ServiceReportingKind_UniqueUsage', 1: u'wil_details_ServiceReportingKind_UniqueOpportunity', 2: u'wil_details_ServiceReportingKind_DeviceUsage', 3: u'wil_details_ServiceReportingKind_DeviceOpportunity', 4: u'wil_details_ServiceReportingKind_PotentialUniqueUsage', 5: u'wil_details_ServiceReportingKind_PotentialUniqueOpportunity', 6: u'wil_details_ServiceReportingKind_PotentialDeviceUsage', 7: u'wil_details_ServiceReportingKind_PotentialDeviceOpportunity', 8: u'wil_details_ServiceReportingKind_EnabledTotalDuration', 9: u'wil_details_ServiceReportingKind_EnabledPausedDuration', 10: u'wil_details_ServiceReportingKind_DisabledTotalDuration', 11: u'wil_details_ServiceReportingKind_DisabledPausedDuration', 256: u'wil_details_ServiceReportingKind_VariantDevicePotentialBase', 320: u'wil_details_ServiceReportingKind_VariantDeviceUsageBase', 384: u'wil_details_ServiceReportingKind_VariantUniquePotentialBase', 448: u'wil_details_ServiceReportingKind_VariantUniqueUsageBase', 150: u'wil_details_ServiceReportingKind_CustomDisabledBase', 100: u'wil_details_ServiceReportingKind_CustomEnabledBase', 254: u'wil_details_ServiceReportingKind_Store', 255: u'wil_details_ServiceReportingKind_None'})]],
    'payloadId' : [ 0xc, ['unsigned long']],
    'ignoredUse' : [ 0x10, ['long']],
    'isVariantConfiguration' : [ 0x14, ['long']],
} ],
  'wil_details_ReportedState' : [ 0x4, {
    'exchange' : [ 0x0, ['unsigned long']],
    'queuedForReporting' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'reportedDeviceUsage' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'reportedDevicePotential' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'reportedDeviceOpportunity' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'reportedDevicePotentialOpportunity' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'usageCount' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 14, native_type='unsigned long')]],
    'usageCountRepresentsPotential' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'opportunityCount' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 22, native_type='unsigned long')]],
    'opportunityCountRepresentsPotential' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'unused' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 32, native_type='unsigned long')]],
} ],
  'wil_details_RecordedState' : [ 0x4, {
    'exchange' : [ 0x0, ['unsigned long']],
    'recordedDeviceUsage' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'recordedDevicePotential' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'recordedDeviceOpportunity' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'recordedDevicePotentialOpportunity' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'recordedVariantDeviceUsage' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'recordedVariant' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 11, native_type='unsigned long')]],
    'unused' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 32, native_type='unsigned long')]],
} ],
  'FEATURE_ERROR' : [ 0x38, {
    'hr' : [ 0x0, ['unsigned long']],
    'lineNumber' : [ 0x4, ['unsigned short']],
    'file' : [ 0x8, ['pointer', ['unsigned char']]],
    'process' : [ 0xc, ['pointer', ['unsigned char']]],
    'modulePath' : [ 0x10, ['pointer', ['unsigned char']]],
    'callerReturnAddressOffset' : [ 0x14, ['unsigned long']],
    'callerModule' : [ 0x18, ['pointer', ['unsigned char']]],
    'message' : [ 0x1c, ['pointer', ['unsigned char']]],
    'originLineNumber' : [ 0x20, ['unsigned short']],
    'originFile' : [ 0x24, ['pointer', ['unsigned char']]],
    'originModule' : [ 0x28, ['pointer', ['unsigned char']]],
    'originCallerReturnAddressOffset' : [ 0x2c, ['unsigned long']],
    'originCallerModule' : [ 0x30, ['pointer', ['unsigned char']]],
    'originName' : [ 0x34, ['pointer', ['unsigned char']]],
} ],
  'FEATURE_LOGGED_TRAITS' : [ 0x6, {
    'version' : [ 0x0, ['unsigned short']],
    'baseVersion' : [ 0x2, ['unsigned short']],
    'stage' : [ 0x4, ['unsigned char']],
} ],
  'wil_details_StagingConfigFeature' : [ 0xc, {
    'featureId' : [ 0x0, ['unsigned long']],
    'changedInSession' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'isVariantConfig' : [ 0x4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'unused1' : [ 0x4, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned long')]],
    'serviceState' : [ 0x4, ['BitField', dict(start_bit = 8, end_bit = 10, native_type='unsigned long')]],
    'userState' : [ 0x4, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
    'testState' : [ 0x4, ['BitField', dict(start_bit = 12, end_bit = 14, native_type='unsigned long')]],
    'unused2' : [ 0x4, ['BitField', dict(start_bit = 14, end_bit = 16, native_type='unsigned long')]],
    'unused3' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 24, native_type='unsigned long')]],
    'variant' : [ 0x4, ['BitField', dict(start_bit = 24, end_bit = 30, native_type='unsigned long')]],
    'payloadKind' : [ 0x4, ['BitField', dict(start_bit = 30, end_bit = 32, native_type='unsigned long')]],
    'payload' : [ 0x8, ['unsigned long']],
} ],
  'wil_details_StagingConfig' : [ 0x34, {
    'store' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'wil_FeatureStore_Machine', 1: u'wil_FeatureStore_User', 2: u'wil_FeatureStore_All'})]],
    'forUpdate' : [ 0x4, ['long']],
    'readChangeStamp' : [ 0x8, ['unsigned long']],
    'readVersion' : [ 0xc, ['unsigned char']],
    'modified' : [ 0x10, ['long']],
    'header' : [ 0x14, ['pointer', ['wil_details_StagingConfigHeader']]],
    'features' : [ 0x18, ['pointer', ['wil_details_StagingConfigFeature']]],
    'triggers' : [ 0x1c, ['pointer', ['wil_details_StagingConfigUsageTrigger']]],
    'changedInSession' : [ 0x20, ['long']],
    'buffer' : [ 0x24, ['pointer', ['void']]],
    'bufferSize' : [ 0x28, ['unsigned long']],
    'bufferAlloc' : [ 0x2c, ['unsigned long']],
    'bufferOwned' : [ 0x30, ['long']],
} ],
  'wil_details_StagingConfigHeader' : [ 0x10, {
    'version' : [ 0x0, ['unsigned char']],
    'versionMinor' : [ 0x1, ['unsigned char']],
    'headerSizeBytes' : [ 0x2, ['unsigned short']],
    'featureCount' : [ 0x4, ['unsigned short']],
    'featureUsageTriggerCount' : [ 0x6, ['unsigned short']],
    'sessionProperties' : [ 0x8, ['wil_details_StagingConfigHeaderProperties']],
    'properties' : [ 0xc, ['wil_details_StagingConfigHeaderProperties']],
} ],
  'wil_details_StagingConfigUsageTrigger' : [ 0x10, {
    'featureId' : [ 0x0, ['unsigned long']],
    'trigger' : [ 0x4, ['wil_details_StagingConfigWnfStateName']],
    'serviceReportingKind' : [ 0xc, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'isVariantConfig' : [ 0xc, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'unused' : [ 0xc, ['BitField', dict(start_bit = 17, end_bit = 32, native_type='unsigned long')]],
} ],
  'wil_details_StagingConfigHeaderProperties' : [ 0x4, {
    'ignoreServiceState' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ignoreUserState' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ignoreTestState' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ignoreVariants' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'unused' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
} ],
  'wil_FeatureState' : [ 0x18, {
    'enabledState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'wil_FeatureEnabledState_Default', 1: u'wil_FeatureEnabledState_Disabled', 2: u'wil_FeatureEnabledState_Enabled'})]],
    'variant' : [ 0x4, ['unsigned char']],
    'payloadKind' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'wil_FeatureVariantPayloadKind_None', 1: u'wil_FeatureVariantPayloadKind_Resident', 2: u'wil_FeatureVariantPayloadKind_External'})]],
    'payload' : [ 0xc, ['unsigned long']],
    'hasNotification' : [ 0x10, ['long']],
    'isVariantConfiguration' : [ 0x14, ['long']],
} ],
  'wil_details_FeatureStateCache' : [ 0x8, {
    'exchange' : [ 0x0, ['unsigned long']],
    'stateCached' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'hasNotificationCached' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'variantCached' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'effectiveState' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'desiredState' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'reservedForKernelModeSupport' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 7, native_type='unsigned long')]],
    'hasNotification' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'isVariant' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'variant' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 15, native_type='unsigned long')]],
    'unused' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 32, native_type='unsigned long')]],
    'payloadId' : [ 0x4, ['unsigned long']],
    'exchange64' : [ 0x0, ['unsigned long long']],
} ],
  '__WIL__WNF_STATE_NAME' : [ 0x8, {
    'Data' : [ 0x0, ['array', 2, ['unsigned long']]],
} ],
  '_WNF_TYPE_ID' : [ 0x10, {
    'TypeId' : [ 0x0, ['_GUID']],
} ],
  '_WNF_STATE_NAME' : [ 0x8, {
    'Data' : [ 0x0, ['array', 2, ['unsigned long']]],
} ],
  '_wil_details_UsageSubscriptionData' : [ 0x8, {
    'featureId' : [ 0x0, ['unsigned long']],
    'serviceReportingKind' : [ 0x4, ['unsigned short']],
} ],
  '_RTL_FEATURE_CONFIGURATION' : [ 0xc, {
    'FeatureId' : [ 0x0, ['unsigned long']],
    'Priority' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long')]],
    'EnabledState' : [ 0x4, ['BitField', dict(start_bit = 4, end_bit = 6, native_type='unsigned long')]],
    'IsWexpConfiguration' : [ 0x4, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'HasSubscriptions' : [ 0x4, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'Variant' : [ 0x4, ['BitField', dict(start_bit = 8, end_bit = 14, native_type='unsigned long')]],
    'VariantPayloadKind' : [ 0x4, ['BitField', dict(start_bit = 14, end_bit = 16, native_type='unsigned long')]],
    'VariantPayload' : [ 0x8, ['unsigned long']],
} ],
  '_RTL_FEATURE_USAGE_REPORT' : [ 0x8, {
    'FeatureId' : [ 0x0, ['unsigned long']],
    'ReportingKind' : [ 0x4, ['unsigned short']],
    'ReportingOptions' : [ 0x6, ['unsigned short']],
} ],
  'wil_details_FeatureTestState' : [ 0x1c, {
    'kind' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'wil_details_FeatureTestStateKind_EnabledState', 1: u'wil_details_FeatureTestStateKind_Variant'})]],
    'featureId' : [ 0x4, ['unsigned long']],
    'state' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'wil_FeatureEnabledState_Default', 1: u'wil_FeatureEnabledState_Disabled', 2: u'wil_FeatureEnabledState_Enabled'})]],
    'variant' : [ 0xc, ['unsigned char']],
    'payload' : [ 0x10, ['unsigned long']],
    'payloadKind' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: u'wil_FeatureVariantPayloadKind_None', 1: u'wil_FeatureVariantPayloadKind_Resident', 2: u'wil_FeatureVariantPayloadKind_External'})]],
    'next' : [ 0x18, ['pointer', ['wil_details_FeatureTestState']]],
} ],
  '__unnamed_1851' : [ 0x8, {
    'Long' : [ 0x0, ['unsigned long long']],
    'VolatileLong' : [ 0x0, ['unsigned long long']],
    'HighLow' : [ 0x0, ['_MMPTE_HIGHLOW']],
    'Hard' : [ 0x0, ['_MMPTE_HARDWARE']],
    'Proto' : [ 0x0, ['_MMPTE_PROTOTYPE']],
    'Soft' : [ 0x0, ['_MMPTE_SOFTWARE']],
    'TimeStamp' : [ 0x0, ['_MMPTE_TIMESTAMP']],
    'Trans' : [ 0x0, ['_MMPTE_TRANSITION']],
    'Subsect' : [ 0x0, ['_MMPTE_SUBSECTION']],
    'List' : [ 0x0, ['_MMPTE_LIST']],
} ],
  '_MMPTE' : [ 0x8, {
    'u' : [ 0x0, ['__unnamed_1851']],
} ],
  '_EX_PUSH_LOCK_AUTO_EXPAND' : [ 0xc, {
    'LocalLock' : [ 0x0, ['_EX_PUSH_LOCK']],
    'State' : [ 0x4, ['_EX_PUSH_LOCK_AUTO_EXPAND_STATE']],
    'Stats' : [ 0x8, ['unsigned long']],
} ],
  '_ERESOURCE' : [ 0x38, {
    'SystemResourcesList' : [ 0x0, ['_LIST_ENTRY']],
    'OwnerTable' : [ 0x8, ['pointer', ['_OWNER_ENTRY']]],
    'ActiveCount' : [ 0xc, ['short']],
    'Flag' : [ 0xe, ['unsigned short']],
    'ReservedLowFlags' : [ 0xe, ['unsigned char']],
    'WaiterPriority' : [ 0xf, ['unsigned char']],
    'SharedWaiters' : [ 0x10, ['pointer', ['void']]],
    'ExclusiveWaiters' : [ 0x14, ['pointer', ['void']]],
    'OwnerEntry' : [ 0x18, ['_OWNER_ENTRY']],
    'ActiveEntries' : [ 0x20, ['unsigned long']],
    'ContentionCount' : [ 0x24, ['unsigned long']],
    'NumberOfSharedWaiters' : [ 0x28, ['unsigned long']],
    'NumberOfExclusiveWaiters' : [ 0x2c, ['unsigned long']],
    'Address' : [ 0x30, ['pointer', ['void']]],
    'CreatorBackTraceIndex' : [ 0x30, ['unsigned long']],
    'SpinLock' : [ 0x34, ['unsigned long']],
} ],
  '_MI_CACHED_PTE' : [ 0x8, {
    'GlobalTimeStamp' : [ 0x0, ['unsigned long']],
    'PteIndex' : [ 0x4, ['unsigned long']],
    'Long' : [ 0x0, ['long long']],
} ],
  '_KLOCK_QUEUE_HANDLE' : [ 0xc, {
    'LockQueue' : [ 0x0, ['_KSPIN_LOCK_QUEUE']],
    'OldIrql' : [ 0x8, ['unsigned char']],
} ],
  '_MMPFNLIST' : [ 0x14, {
    'Total' : [ 0x0, ['unsigned long']],
    'ListName' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'ZeroedPageList', 1: u'FreePageList', 2: u'StandbyPageList', 3: u'ModifiedPageList', 4: u'ModifiedNoWritePageList', 5: u'BadPageList', 6: u'ActiveAndValid', 7: u'TransitionPage'})]],
    'Flink' : [ 0x8, ['unsigned long']],
    'Blink' : [ 0xc, ['unsigned long']],
    'Lock' : [ 0x10, ['unsigned long']],
} ],
  '_MMCLONE_DESCRIPTOR' : [ 0x30, {
    'CloneNode' : [ 0x0, ['_RTL_BALANCED_NODE']],
    'Next' : [ 0x0, ['pointer', ['_MMCLONE_DESCRIPTOR']]],
    'StartingCloneBlock' : [ 0xc, ['pointer', ['_MMCLONE_BLOCK']]],
    'EndingCloneBlock' : [ 0x10, ['pointer', ['_MMCLONE_BLOCK']]],
    'NumberOfPtes' : [ 0x14, ['unsigned long']],
    'NumberOfReferences' : [ 0x18, ['unsigned long']],
    'CloneHeader' : [ 0x1c, ['pointer', ['_MMCLONE_HEADER']]],
    'NonPagedPoolQuotaCharge' : [ 0x20, ['unsigned long']],
    'DeleteList' : [ 0x24, ['_SINGLE_LIST_ENTRY']],
    'NestingLevel' : [ 0x28, ['unsigned long long']],
} ],
  '__unnamed_189b' : [ 0x4, {
    'NextSlistPfn' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Next' : [ 0x0, ['pointer', ['void']]],
    'Flink' : [ 0x0, ['unsigned long']],
    'Active' : [ 0x0, ['_MI_ACTIVE_PFN']],
} ],
  '__unnamed_18a0' : [ 0x2, {
    'ReferenceCount' : [ 0x0, ['unsigned short']],
} ],
  '__unnamed_18a2' : [ 0x4, {
    'EntireField' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_18a4' : [ 0x4, {
    'ReferenceCount' : [ 0x0, ['unsigned short']],
    'e1' : [ 0x2, ['_MMPFNENTRY1']],
    'e3' : [ 0x3, ['_MMPFNENTRY3']],
    'e2' : [ 0x0, ['__unnamed_18a0']],
    'e4' : [ 0x0, ['__unnamed_18a2']],
} ],
  '__unnamed_18aa' : [ 0x4, {
    'PteFrame' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 24, native_type='unsigned long')]],
    'LargePageSize' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 26, native_type='unsigned long')]],
    'ModifiedListBucketIndex' : [ 0x0, ['BitField', dict(start_bit = 26, end_bit = 28, native_type='unsigned long')]],
    'PageIdentity' : [ 0x0, ['BitField', dict(start_bit = 28, end_bit = 31, native_type='unsigned long')]],
    'PrototypePte' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'EntireField' : [ 0x0, ['unsigned long']],
} ],
  '_MMPFN' : [ 0x1c, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'TreeNode' : [ 0x0, ['_RTL_BALANCED_NODE']],
    'u1' : [ 0x0, ['__unnamed_189b']],
    'PteAddress' : [ 0x4, ['pointer', ['_MMPTE']]],
    'PteLong' : [ 0x4, ['unsigned long']],
    'OriginalPte' : [ 0x8, ['_MMPTE']],
    'u2' : [ 0x10, ['_MIPFNBLINK']],
    'u3' : [ 0x14, ['__unnamed_18a4']],
    'u4' : [ 0x18, ['__unnamed_18aa']],
} ],
  '__unnamed_18b5' : [ 0x4, {
    'ImageCommitment' : [ 0x0, ['unsigned long']],
    'CreatingProcessId' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_18b9' : [ 0x4, {
    'ImageInformation' : [ 0x0, ['pointer', ['_MI_SECTION_IMAGE_INFORMATION']]],
    'FirstMappedVa' : [ 0x0, ['pointer', ['void']]],
} ],
  '_SEGMENT' : [ 0x30, {
    'ControlArea' : [ 0x0, ['pointer', ['_CONTROL_AREA']]],
    'TotalNumberOfPtes' : [ 0x4, ['unsigned long']],
    'SegmentFlags' : [ 0x8, ['_SEGMENT_FLAGS']],
    'NumberOfCommittedPages' : [ 0xc, ['unsigned long']],
    'SizeOfSegment' : [ 0x10, ['unsigned long long']],
    'ExtendInfo' : [ 0x18, ['pointer', ['_MMEXTEND_INFO']]],
    'BasedAddress' : [ 0x18, ['pointer', ['void']]],
    'SegmentLock' : [ 0x1c, ['_EX_PUSH_LOCK']],
    'u1' : [ 0x20, ['__unnamed_18b5']],
    'u2' : [ 0x24, ['__unnamed_18b9']],
    'PrototypePte' : [ 0x28, ['pointer', ['_MMPTE']]],
} ],
  '__unnamed_18be' : [ 0x4, {
    'LongFlags' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x0, ['_MMSECTION_FLAGS']],
} ],
  '__unnamed_18c6' : [ 0xc, {
    'NumberOfSystemCacheViews' : [ 0x0, ['unsigned long']],
    'ImageRelocationStartBit' : [ 0x0, ['unsigned long']],
    'WritableUserReferences' : [ 0x4, ['long']],
    'ImageRelocationSizeIn64k' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'SystemImage' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'CantMove' : [ 0x4, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'StrongCode' : [ 0x4, ['BitField', dict(start_bit = 18, end_bit = 20, native_type='unsigned long')]],
    'BitMap' : [ 0x4, ['BitField', dict(start_bit = 20, end_bit = 22, native_type='unsigned long')]],
    'ImageActive' : [ 0x4, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'ImageBaseOkToReuse' : [ 0x4, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'FlushInProgressCount' : [ 0x8, ['unsigned long']],
    'NumberOfSubsections' : [ 0x8, ['unsigned long']],
    'SeImageStub' : [ 0x8, ['pointer', ['_MI_IMAGE_SECURITY_REFERENCE']]],
} ],
  '__unnamed_18c8' : [ 0xc, {
    'e2' : [ 0x0, ['__unnamed_18c6']],
} ],
  '__unnamed_18cd' : [ 0x4, {
    'IoAttributionContext' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 29, native_type='unsigned long')]],
    'Spare' : [ 0x0, ['BitField', dict(start_bit = 29, end_bit = 32, native_type='unsigned long')]],
    'ImageCrossPartitionCharge' : [ 0x0, ['unsigned long']],
    'CommittedPageCount' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 20, native_type='unsigned long')]],
} ],
  '_CONTROL_AREA' : [ 0x50, {
    'Segment' : [ 0x0, ['pointer', ['_SEGMENT']]],
    'ListHead' : [ 0x4, ['_LIST_ENTRY']],
    'AweContext' : [ 0x4, ['pointer', ['void']]],
    'NumberOfSectionReferences' : [ 0xc, ['unsigned long']],
    'NumberOfPfnReferences' : [ 0x10, ['unsigned long']],
    'NumberOfMappedViews' : [ 0x14, ['unsigned long']],
    'NumberOfUserReferences' : [ 0x18, ['unsigned long']],
    'u' : [ 0x1c, ['__unnamed_18be']],
    'FilePointer' : [ 0x20, ['_EX_FAST_REF']],
    'ControlAreaLock' : [ 0x24, ['long']],
    'ModifiedWriteCount' : [ 0x28, ['unsigned long']],
    'WaitList' : [ 0x2c, ['pointer', ['_MI_CONTROL_AREA_WAIT_BLOCK']]],
    'u2' : [ 0x30, ['__unnamed_18c8']],
    'FileObjectLock' : [ 0x3c, ['_EX_PUSH_LOCK']],
    'LockedPages' : [ 0x40, ['unsigned long long']],
    'u3' : [ 0x48, ['__unnamed_18cd']],
} ],
  '_MI_SYSTEM_PTE_TYPE' : [ 0x34, {
    'Bitmap' : [ 0x0, ['_RTL_BITMAP']],
    'BasePte' : [ 0x8, ['pointer', ['_MMPTE']]],
    'Flags' : [ 0xc, ['unsigned long']],
    'VaType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: u'MiVaUnused', 1: u'MiVaSessionSpace', 2: u'MiVaProcessSpace', 3: u'MiVaBootLoaded', 4: u'MiVaPfnDatabase', 5: u'MiVaNonPagedPool', 6: u'MiVaPagedPool', 7: u'MiVaSpecialPoolPaged', 8: u'MiVaSystemCache', 9: u'MiVaSystemPtes', 10: u'MiVaHal', 11: u'MiVaSessionGlobalSpace', 12: u'MiVaDriverImages', 13: u'MiVaSystemPtesLarge', 14: u'MiVaKernelStacks', 15: u'MiVaSecureNonPagedPool', 16: u'MiVaMaximumType'})]],
    'FailureCount' : [ 0x14, ['pointer', ['unsigned long']]],
    'PteFailures' : [ 0x18, ['unsigned long']],
    'SpinLock' : [ 0x1c, ['unsigned long']],
    'GlobalPushLock' : [ 0x1c, ['pointer', ['_EX_PUSH_LOCK']]],
    'TotalSystemPtes' : [ 0x20, ['unsigned long']],
    'Hint' : [ 0x24, ['unsigned long']],
    'LowestBitEverAllocated' : [ 0x28, ['unsigned long']],
    'CachedPtes' : [ 0x2c, ['pointer', ['_MI_CACHED_PTES']]],
    'TotalFreeSystemPtes' : [ 0x30, ['unsigned long']],
} ],
  '__unnamed_18ef' : [ 0x4, {
    'LongFlags' : [ 0x0, ['unsigned long']],
    'VadFlags' : [ 0x0, ['_MMVAD_FLAGS']],
    'PrivateVadFlags' : [ 0x0, ['_MM_PRIVATE_VAD_FLAGS']],
    'GraphicsVadFlags' : [ 0x0, ['_MM_GRAPHICS_VAD_FLAGS']],
    'SharedVadFlags' : [ 0x0, ['_MM_SHARED_VAD_FLAGS']],
    'VolatileVadLong' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_18f2' : [ 0x4, {
    'LongFlags1' : [ 0x0, ['unsigned long']],
    'VadFlags1' : [ 0x0, ['_MMVAD_FLAGS1']],
} ],
  '_MMVAD_SHORT' : [ 0x28, {
    'NextVad' : [ 0x0, ['pointer', ['_MMVAD_SHORT']]],
    'ExtraCreateInfo' : [ 0x4, ['pointer', ['void']]],
    'VadNode' : [ 0x0, ['_RTL_BALANCED_NODE']],
    'StartingVpn' : [ 0xc, ['unsigned long']],
    'EndingVpn' : [ 0x10, ['unsigned long']],
    'ReferenceCount' : [ 0x14, ['long']],
    'PushLock' : [ 0x18, ['_EX_PUSH_LOCK']],
    'u' : [ 0x1c, ['__unnamed_18ef']],
    'u1' : [ 0x20, ['__unnamed_18f2']],
    'EventList' : [ 0x24, ['pointer', ['_MI_VAD_EVENT_BLOCK']]],
} ],
  '_MM_STORE_KEY' : [ 0x4, {
    'KeyLow' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 28, native_type='unsigned long')]],
    'KeyHigh' : [ 0x0, ['BitField', dict(start_bit = 28, end_bit = 32, native_type='unsigned long')]],
    'EntireKey' : [ 0x0, ['unsigned long']],
} ],
  '_MI_PARTITION' : [ 0x1b40, {
    'Core' : [ 0x0, ['_MI_PARTITION_CORE']],
    'Modwriter' : [ 0xe8, ['_MI_PARTITION_MODWRITES']],
    'Store' : [ 0x2b8, ['_MI_PARTITION_STORES']],
    'Segments' : [ 0x340, ['_MI_PARTITION_SEGMENTS']],
    'PageLists' : [ 0x540, ['_MI_PARTITION_PAGE_LISTS']],
    'Commit' : [ 0xd80, ['_MI_PARTITION_COMMIT']],
    'Zeroing' : [ 0xda4, ['_MI_PARTITION_ZEROING']],
    'PageCombine' : [ 0xe18, ['_MI_PAGE_COMBINING_SUPPORT']],
    'WorkingSetControl' : [ 0xef8, ['pointer', ['void']]],
    'WorkingSetExpansionHead' : [ 0xefc, ['_MMWORKING_SET_EXPANSION_HEAD']],
    'SessionDetachTimeStamp' : [ 0xf04, ['unsigned long']],
    'Vp' : [ 0xf40, ['_MI_VISIBLE_PARTITION']],
} ],
  '_EPARTITION' : [ 0x40, {
    'MmPartition' : [ 0x0, ['pointer', ['void']]],
    'CcPartition' : [ 0x4, ['pointer', ['void']]],
    'ExPartition' : [ 0x8, ['pointer', ['void']]],
    'HardReferenceCount' : [ 0xc, ['long']],
    'OpenHandleCount' : [ 0x10, ['long']],
    'ActivePartitionLinks' : [ 0x14, ['_LIST_ENTRY']],
    'ParentPartition' : [ 0x1c, ['pointer', ['_EPARTITION']]],
    'TeardownWorkItem' : [ 0x20, ['_WORK_QUEUE_ITEM']],
    'TeardownLock' : [ 0x30, ['_EX_PUSH_LOCK']],
    'SystemProcess' : [ 0x34, ['pointer', ['_EPROCESS']]],
    'SystemProcessHandle' : [ 0x38, ['pointer', ['void']]],
    'PartitionFlags' : [ 0x3c, ['unsigned long']],
    'PairedWithJob' : [ 0x3c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
} ],
  '_MI_IMAGE_LOAD_CONFIG' : [ 0x14, {
    'Flags' : [ 0x0, ['unsigned long']],
    'CfgAlignmentBias' : [ 0x4, ['unsigned long']],
    'MachineType' : [ 0x8, ['unsigned short']],
    'RvaList' : [ 0xc, ['pointer', ['_RTL_RVA_LIST']]],
    'RetpolineRelocations' : [ 0x10, ['pointer', ['_MI_RETPOLINE_RELOCATION_INFORMATION']]],
} ],
  '__unnamed_1922' : [ 0x4, {
    'LongFlags2' : [ 0x0, ['unsigned long']],
    'VadFlags2' : [ 0x0, ['_MMVAD_FLAGS2']],
} ],
  '__unnamed_1927' : [ 0x4, {
    'SequentialVa' : [ 0x0, ['_MI_VAD_SEQUENTIAL_INFO']],
    'ExtendedInfo' : [ 0x0, ['pointer', ['_MMEXTEND_INFO']]],
} ],
  '_MMVAD' : [ 0x4c, {
    'Core' : [ 0x0, ['_MMVAD_SHORT']],
    'u2' : [ 0x28, ['__unnamed_1922']],
    'Subsection' : [ 0x2c, ['pointer', ['_SUBSECTION']]],
    'FirstPrototypePte' : [ 0x30, ['pointer', ['_MMPTE']]],
    'LastContiguousPte' : [ 0x34, ['pointer', ['_MMPTE']]],
    'ViewLinks' : [ 0x38, ['_LIST_ENTRY']],
    'VadsProcess' : [ 0x40, ['pointer', ['_EPROCESS']]],
    'u4' : [ 0x44, ['__unnamed_1927']],
    'FileObject' : [ 0x48, ['pointer', ['_FILE_OBJECT']]],
} ],
  '_MI_VAD_EVENT_BLOCK' : [ 0x28, {
    'Next' : [ 0x0, ['pointer', ['_MI_VAD_EVENT_BLOCK']]],
    'Gate' : [ 0x4, ['_KGATE']],
    'SecureInfo' : [ 0x4, ['_MMADDRESS_LIST']],
    'BitMap' : [ 0x4, ['_RTL_BITMAP']],
    'InPageSupport' : [ 0x4, ['pointer', ['_MMINPAGE_SUPPORT']]],
    'LargePage' : [ 0x4, ['_MI_LARGEPAGE_VAD_INFO']],
    'AweView' : [ 0x4, ['_MI_PHYSICAL_VIEW']],
    'CreatingThread' : [ 0x4, ['pointer', ['_ETHREAD']]],
    'PebTeb' : [ 0x4, ['_MI_SUB64K_FREE_RANGES']],
    'PlaceholderVad' : [ 0x4, ['pointer', ['_MMVAD_SHORT']]],
    'WaitReason' : [ 0x24, ['unsigned long']],
} ],
  '_HHIVE' : [ 0x400, {
    'Signature' : [ 0x0, ['unsigned long']],
    'GetCellRoutine' : [ 0x4, ['pointer', ['void']]],
    'ReleaseCellRoutine' : [ 0x8, ['pointer', ['void']]],
    'Allocate' : [ 0xc, ['pointer', ['void']]],
    'Free' : [ 0x10, ['pointer', ['void']]],
    'FileWrite' : [ 0x14, ['pointer', ['void']]],
    'FileRead' : [ 0x18, ['pointer', ['void']]],
    'HiveLoadFailure' : [ 0x1c, ['pointer', ['void']]],
    'BaseBlock' : [ 0x20, ['pointer', ['_HBASE_BLOCK']]],
    'FlusherLock' : [ 0x24, ['_CMSI_RW_LOCK']],
    'WriterLock' : [ 0x28, ['_CMSI_RW_LOCK']],
    'DirtyVector' : [ 0x2c, ['_RTL_BITMAP']],
    'DirtyCount' : [ 0x34, ['unsigned long']],
    'DirtyAlloc' : [ 0x38, ['unsigned long']],
    'UnreconciledVector' : [ 0x3c, ['_RTL_BITMAP']],
    'UnreconciledCount' : [ 0x44, ['unsigned long']],
    'BaseBlockAlloc' : [ 0x48, ['unsigned long']],
    'Cluster' : [ 0x4c, ['unsigned long']],
    'Flat' : [ 0x50, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'ReadOnly' : [ 0x50, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Reserved' : [ 0x50, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'DirtyFlag' : [ 0x51, ['unsigned char']],
    'HvBinHeadersUse' : [ 0x54, ['unsigned long']],
    'HvFreeCellsUse' : [ 0x58, ['unsigned long']],
    'HvUsedCellsUse' : [ 0x5c, ['unsigned long']],
    'CmUsedCellsUse' : [ 0x60, ['unsigned long']],
    'HiveFlags' : [ 0x64, ['unsigned long']],
    'CurrentLog' : [ 0x68, ['unsigned long']],
    'CurrentLogSequence' : [ 0x6c, ['unsigned long']],
    'CurrentLogMinimumSequence' : [ 0x70, ['unsigned long']],
    'CurrentLogOffset' : [ 0x74, ['unsigned long']],
    'MinimumLogSequence' : [ 0x78, ['unsigned long']],
    'LogFileSizeCap' : [ 0x7c, ['unsigned long']],
    'LogDataPresent' : [ 0x80, ['array', 2, ['unsigned char']]],
    'PrimaryFileValid' : [ 0x82, ['unsigned char']],
    'BaseBlockDirty' : [ 0x83, ['unsigned char']],
    'LastLogSwapTime' : [ 0x88, ['_LARGE_INTEGER']],
    'FirstLogFile' : [ 0x90, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned short')]],
    'SecondLogFile' : [ 0x90, ['BitField', dict(start_bit = 3, end_bit = 6, native_type='unsigned short')]],
    'HeaderRecovered' : [ 0x90, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'LegacyRecoveryIndicated' : [ 0x90, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'RecoveryInformationReserved' : [ 0x90, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned short')]],
    'RecoveryInformation' : [ 0x90, ['unsigned short']],
    'LogEntriesRecovered' : [ 0x92, ['array', 2, ['unsigned char']]],
    'RefreshCount' : [ 0x94, ['unsigned long']],
    'StorageTypeCount' : [ 0x98, ['unsigned long']],
    'Version' : [ 0x9c, ['unsigned long']],
    'ViewMap' : [ 0xa0, ['_HVP_VIEW_MAP']],
    'Storage' : [ 0xc8, ['array', 2, ['_DUAL']]],
} ],
  '_HV_GET_CELL_CONTEXT' : [ 0x8, {
    'Cell' : [ 0x0, ['unsigned long']],
    'BinContext' : [ 0x4, ['_HV_GET_BIN_CONTEXT']],
} ],
  '_CM_KEY_CONTROL_BLOCK' : [ 0xb0, {
    'RefCount' : [ 0x0, ['unsigned long']],
    'ExtFlags' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'Freed' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'Discarded' : [ 0x4, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HiveUnloaded' : [ 0x4, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'Decommissioned' : [ 0x4, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'SpareExtFlag' : [ 0x4, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'TotalLevels' : [ 0x4, ['BitField', dict(start_bit = 21, end_bit = 31, native_type='unsigned long')]],
    'KeyHash' : [ 0x8, ['_CM_KEY_HASH']],
    'ConvKey' : [ 0x8, ['_CM_PATH_HASH']],
    'NextHash' : [ 0xc, ['pointer', ['_CM_KEY_HASH']]],
    'KeyHive' : [ 0x10, ['pointer', ['_HHIVE']]],
    'KeyCell' : [ 0x14, ['unsigned long']],
    'KcbPushlock' : [ 0x18, ['_EX_PUSH_LOCK']],
    'Owner' : [ 0x1c, ['pointer', ['_KTHREAD']]],
    'SharedCount' : [ 0x1c, ['long']],
    'DelayedDeref' : [ 0x20, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'DelayedClose' : [ 0x20, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Parking' : [ 0x20, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'LayerSemantics' : [ 0x21, ['unsigned char']],
    'LayerHeight' : [ 0x22, ['short']],
    'ParentKcb' : [ 0x24, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'NameBlock' : [ 0x28, ['pointer', ['_CM_NAME_CONTROL_BLOCK']]],
    'CachedSecurity' : [ 0x2c, ['pointer', ['_CM_KEY_SECURITY_CACHE']]],
    'ValueList' : [ 0x30, ['_CHILD_LIST']],
    'LinkTarget' : [ 0x38, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'IndexHint' : [ 0x3c, ['pointer', ['_CM_INDEX_HINT_BLOCK']]],
    'HashKey' : [ 0x3c, ['unsigned long']],
    'SubKeyCount' : [ 0x3c, ['unsigned long']],
    'KeyBodyListHead' : [ 0x40, ['_LIST_ENTRY']],
    'ClonedListEntry' : [ 0x40, ['_LIST_ENTRY']],
    'KeyBodyArray' : [ 0x48, ['array', 4, ['pointer', ['_CM_KEY_BODY']]]],
    'KcbLastWriteTime' : [ 0x58, ['_LARGE_INTEGER']],
    'KcbMaxNameLen' : [ 0x60, ['unsigned short']],
    'KcbMaxValueNameLen' : [ 0x62, ['unsigned short']],
    'KcbMaxValueDataLen' : [ 0x64, ['unsigned long']],
    'KcbUserFlags' : [ 0x68, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long')]],
    'KcbVirtControlFlags' : [ 0x68, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned long')]],
    'KcbDebug' : [ 0x68, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned long')]],
    'Flags' : [ 0x68, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
    'LayerInfo' : [ 0x6c, ['pointer', ['_CM_KCB_LAYER_INFO']]],
    'KCBUoWListHead' : [ 0x70, ['_LIST_ENTRY']],
    'DelayQueueEntry' : [ 0x78, ['_LIST_ENTRY']],
    'Stolen' : [ 0x78, ['pointer', ['unsigned char']]],
    'TransKCBOwner' : [ 0x80, ['pointer', ['_CM_TRANS']]],
    'KCBLock' : [ 0x84, ['_CM_INTENT_LOCK']],
    'KeyLock' : [ 0x8c, ['_CM_INTENT_LOCK']],
    'TransValueCache' : [ 0x94, ['_CHILD_LIST']],
    'TransValueListOwner' : [ 0x9c, ['pointer', ['_CM_TRANS']]],
    'FullKCBName' : [ 0xa0, ['pointer', ['_UNICODE_STRING']]],
    'FullKCBNameStale' : [ 0xa0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Reserved' : [ 0xa0, ['BitField', dict(start_bit = 1, end_bit = 32, native_type='unsigned long')]],
    'SequenceNumber' : [ 0xa8, ['unsigned long long']],
} ],
  'tagSWITCH_CONTEXT' : [ 0x358, {
    'Attribute' : [ 0x0, ['tagSWITCH_CONTEXT_ATTRIBUTE']],
    'Data' : [ 0x18, ['tagSWITCH_CONTEXT_DATA']],
} ],
  '_CM_KEY_BODY' : [ 0x34, {
    'Type' : [ 0x0, ['unsigned long']],
    'KeyControlBlock' : [ 0x4, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'NotifyBlock' : [ 0x8, ['pointer', ['_CM_NOTIFY_BLOCK']]],
    'ProcessID' : [ 0xc, ['pointer', ['void']]],
    'KeyBodyList' : [ 0x10, ['_LIST_ENTRY']],
    'Flags' : [ 0x18, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'HandleTags' : [ 0x18, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
    'Trans' : [ 0x1c, ['_CM_TRANS_PTR']],
    'KtmUow' : [ 0x20, ['pointer', ['_GUID']]],
    'ContextListHead' : [ 0x24, ['_LIST_ENTRY']],
    'EnumerationResumeContext' : [ 0x2c, ['pointer', ['void']]],
    'RestrictedAccessMask' : [ 0x30, ['unsigned long']],
} ],
  '_CM_KEY_NODE' : [ 0x50, {
    'Signature' : [ 0x0, ['unsigned short']],
    'Flags' : [ 0x2, ['unsigned short']],
    'LastWriteTime' : [ 0x4, ['_LARGE_INTEGER']],
    'AccessBits' : [ 0xc, ['unsigned char']],
    'LayerSemantics' : [ 0xd, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'Spare1' : [ 0xd, ['BitField', dict(start_bit = 2, end_bit = 7, native_type='unsigned char')]],
    'InheritClass' : [ 0xd, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'Spare2' : [ 0xe, ['unsigned short']],
    'Parent' : [ 0x10, ['unsigned long']],
    'SubKeyCounts' : [ 0x14, ['array', 2, ['unsigned long']]],
    'SubKeyLists' : [ 0x1c, ['array', 2, ['unsigned long']]],
    'ValueList' : [ 0x24, ['_CHILD_LIST']],
    'ChildHiveReference' : [ 0x1c, ['_CM_KEY_REFERENCE']],
    'Security' : [ 0x2c, ['unsigned long']],
    'Class' : [ 0x30, ['unsigned long']],
    'MaxNameLen' : [ 0x34, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'UserFlags' : [ 0x34, ['BitField', dict(start_bit = 16, end_bit = 20, native_type='unsigned long')]],
    'VirtControlFlags' : [ 0x34, ['BitField', dict(start_bit = 20, end_bit = 24, native_type='unsigned long')]],
    'Debug' : [ 0x34, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'MaxClassLen' : [ 0x38, ['unsigned long']],
    'MaxValueNameLen' : [ 0x3c, ['unsigned long']],
    'MaxValueDataLen' : [ 0x40, ['unsigned long']],
    'WorkVar' : [ 0x44, ['unsigned long']],
    'NameLength' : [ 0x48, ['unsigned short']],
    'ClassLength' : [ 0x4a, ['unsigned short']],
    'Name' : [ 0x4c, ['array', 1, ['wchar']]],
} ],
  '_CM_NAME_CONTROL_BLOCK' : [ 0x10, {
    'Compressed' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'RefCount' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 32, native_type='unsigned long')]],
    'NameHash' : [ 0x4, ['_CM_NAME_HASH']],
    'ConvKey' : [ 0x4, ['_CM_COMPONENT_HASH']],
    'NextHash' : [ 0x8, ['pointer', ['_CM_KEY_HASH']]],
    'NameLength' : [ 0xc, ['unsigned short']],
    'Name' : [ 0xe, ['array', 1, ['wchar']]],
} ],
  '_CM_KEY_VALUE' : [ 0x18, {
    'Signature' : [ 0x0, ['unsigned short']],
    'NameLength' : [ 0x2, ['unsigned short']],
    'DataLength' : [ 0x4, ['unsigned long']],
    'Data' : [ 0x8, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned long']],
    'Flags' : [ 0x10, ['unsigned short']],
    'Spare' : [ 0x12, ['unsigned short']],
    'Name' : [ 0x14, ['array', 1, ['wchar']]],
} ],
  '_SECURITY_SUBJECT_CONTEXT' : [ 0x10, {
    'ClientToken' : [ 0x0, ['pointer', ['void']]],
    'ImpersonationLevel' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'SecurityAnonymous', 1: u'SecurityIdentification', 2: u'SecurityImpersonation', 3: u'SecurityDelegation'})]],
    'PrimaryToken' : [ 0x8, ['pointer', ['void']]],
    'ProcessAuditId' : [ 0xc, ['pointer', ['void']]],
} ],
  '_CMHIVE' : [ 0xc00, {
    'Hive' : [ 0x0, ['_HHIVE']],
    'FileHandles' : [ 0x400, ['array', 6, ['pointer', ['void']]]],
    'NotifyList' : [ 0x418, ['_LIST_ENTRY']],
    'HiveList' : [ 0x420, ['_LIST_ENTRY']],
    'PreloadedHiveList' : [ 0x428, ['_LIST_ENTRY']],
    'HiveRundown' : [ 0x430, ['_EX_RUNDOWN_REF']],
    'KcbCacheTable' : [ 0x434, ['pointer', ['_CM_KEY_HASH_TABLE_ENTRY']]],
    'KcbCacheTableSize' : [ 0x438, ['unsigned long']],
    'DeletedKcbTable' : [ 0x43c, ['pointer', ['_CM_KEY_HASH_TABLE_ENTRY']]],
    'DeletedKcbTableSize' : [ 0x440, ['unsigned long']],
    'Identity' : [ 0x444, ['unsigned long']],
    'HiveLock' : [ 0x448, ['_CMSI_RW_LOCK']],
    'FlushDirtyVector' : [ 0x44c, ['_RTL_BITMAP']],
    'FlushDirtyVectorSize' : [ 0x454, ['unsigned long']],
    'FlushLogEntryOffsetArray' : [ 0x458, ['pointer', ['CMP_OFFSET_ARRAY']]],
    'FlushLogEntryOffsetArrayCount' : [ 0x45c, ['unsigned long']],
    'FlushLogEntrySize' : [ 0x460, ['unsigned long']],
    'FlushHiveTruncated' : [ 0x464, ['unsigned long']],
    'FlushBaseBlockDirty' : [ 0x468, ['unsigned char']],
    'CapturedUnreconciledVector' : [ 0x46c, ['_RTL_BITMAP']],
    'CapturedUnreconciledVectorSize' : [ 0x474, ['unsigned long']],
    'UnreconciledOffsetArray' : [ 0x478, ['pointer', ['CMP_OFFSET_ARRAY']]],
    'UnreconciledOffsetArrayCount' : [ 0x47c, ['unsigned long']],
    'UnreconciledBaseBlock' : [ 0x480, ['pointer', ['_HBASE_BLOCK']]],
    'SecurityLock' : [ 0x484, ['_EX_PUSH_LOCK']],
    'LastShrinkHiveSize' : [ 0x488, ['unsigned long']],
    'ActualFileSize' : [ 0x490, ['_LARGE_INTEGER']],
    'LogFileSizes' : [ 0x498, ['array', 2, ['_LARGE_INTEGER']]],
    'FileFullPath' : [ 0x4a8, ['_UNICODE_STRING']],
    'FileUserName' : [ 0x4b0, ['_UNICODE_STRING']],
    'HiveRootPath' : [ 0x4b8, ['_UNICODE_STRING']],
    'SecurityCount' : [ 0x4c0, ['unsigned long']],
    'SecurityCacheSize' : [ 0x4c4, ['unsigned long']],
    'SecurityHitHint' : [ 0x4c8, ['long']],
    'SecurityCache' : [ 0x4cc, ['pointer', ['_CM_KEY_SECURITY_CACHE_ENTRY']]],
    'SecurityHash' : [ 0x4d0, ['array', 64, ['_LIST_ENTRY']]],
    'UnloadEventCount' : [ 0x6d0, ['unsigned long']],
    'UnloadEventArray' : [ 0x6d4, ['pointer', ['pointer', ['_KEVENT']]]],
    'RootKcb' : [ 0x6d8, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'Frozen' : [ 0x6dc, ['unsigned char']],
    'UnloadWorkItem' : [ 0x6e0, ['pointer', ['_CM_WORKITEM']]],
    'UnloadWorkItemHolder' : [ 0x6e4, ['_CM_WORKITEM']],
    'DirtyVectorLog' : [ 0x6f8, ['_CM_DIRTY_VECTOR_LOG']],
    'Flags' : [ 0x980, ['unsigned long']],
    'TrustClassEntry' : [ 0x984, ['_LIST_ENTRY']],
    'DirtyTime' : [ 0x990, ['unsigned long long']],
    'UnreconciledTime' : [ 0x998, ['unsigned long long']],
    'CmRm' : [ 0x9a0, ['pointer', ['_CM_RM']]],
    'CmRmInitFailPoint' : [ 0x9a4, ['unsigned long']],
    'CmRmInitFailStatus' : [ 0x9a8, ['long']],
    'CreatorOwner' : [ 0x9ac, ['pointer', ['_KTHREAD']]],
    'RundownThread' : [ 0x9b0, ['pointer', ['_KTHREAD']]],
    'LastWriteTime' : [ 0x9b8, ['_LARGE_INTEGER']],
    'FlushQueue' : [ 0x9c0, ['_HIVE_WRITE_WAIT_QUEUE']],
    'ReconcileQueue' : [ 0x9c8, ['_HIVE_WRITE_WAIT_QUEUE']],
    'FlushFlags' : [ 0x9d0, ['unsigned long']],
    'PrimaryFilePurged' : [ 0x9d0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DiskFileBad' : [ 0x9d0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'PrimaryFileSizeBeforeLastFlush' : [ 0x9d4, ['unsigned long']],
    'ReferenceCount' : [ 0x9d8, ['long']],
    'UnloadHistoryIndex' : [ 0x9dc, ['long']],
    'UnloadHistory' : [ 0x9e0, ['array', 128, ['unsigned long']]],
    'BootStart' : [ 0xbe0, ['unsigned long']],
    'UnaccessedStart' : [ 0xbe4, ['unsigned long']],
    'UnaccessedEnd' : [ 0xbe8, ['unsigned long']],
    'LoadedKeyCount' : [ 0xbec, ['unsigned long']],
    'HandleClosePending' : [ 0xbf0, ['unsigned long']],
    'HandleClosePendingEvent' : [ 0xbf4, ['_EX_PUSH_LOCK']],
    'FinalFlushSucceeded' : [ 0xbf8, ['unsigned char']],
    'VolumeContext' : [ 0xbfc, ['pointer', ['_CMP_VOLUME_CONTEXT']]],
} ],
  '__unnamed_19c6' : [ 0xc, {
    'Failure' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'_None', 1: u'_CmpCreateHive', 3: u'_HvpBuildMap', 4: u'_HvpBuildMapForLoaderHive', 5: u'_HvpInitMap', 6: u'_HvLoadHive', 7: u'_HvpMapHiveImage', 8: u'_HvpRecoverData', 9: u'_CmpValidateHiveSecurityDescriptors', 10: u'_HvpEnlistBinInMap', 11: u'_CmCheckRegistry', 12: u'_CmRegistryIO', 13: u'_CmCheckRegistry2', 14: u'_CmpCheckKey', 15: u'_CmpCheckValueList', 16: u'_HvCheckHive', 17: u'_HvCheckBin', 18: u'_HvpGetLogEntryDirtyVector', 19: u'_HvpReadLogEntryHeader', 20: u'_HvpReadLogEntry', 21: u'_CmpMountPreloadedHives', 22: u'_CmpLoadHiveThread', 23: u'_CmpCheckLeaf', 24: u'_HvHiveStartFileBacked', 25: u'_HvStartHiveMemoryBacked', 26: u'_HvpEnlistFreeCells', 27: u'_HvpPerformLogFileRecovery', 28: u'_CmpInitHiveFromFile', 29: u'_CmpLoadKeyCommon', 30: u'_CmpLinkHiveToMaster', 31: u'_CmLoadKey', 32: u'_CmLoadAppKey', 33: u'_CmpResolveHiveLoadConflict'})]],
    'Status' : [ 0x4, ['long']],
    'Point' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_19c9' : [ 0xc, {
    'Action' : [ 0x0, ['unsigned long']],
    'Handle' : [ 0x4, ['pointer', ['void']]],
    'Status' : [ 0x8, ['long']],
} ],
  '__unnamed_19cb' : [ 0x4, {
    'CheckStack' : [ 0x0, ['pointer', ['void']]],
} ],
  '__unnamed_19cd' : [ 0x10, {
    'Cell' : [ 0x0, ['unsigned long']],
    'CellPoint' : [ 0x4, ['pointer', ['_CELL_DATA']]],
    'RootPoint' : [ 0x8, ['pointer', ['void']]],
    'Index' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_19cf' : [ 0x10, {
    'List' : [ 0x0, ['pointer', ['_CELL_DATA']]],
    'Index' : [ 0x4, ['unsigned long']],
    'Cell' : [ 0x8, ['unsigned long']],
    'CellPoint' : [ 0xc, ['pointer', ['_CELL_DATA']]],
} ],
  '__unnamed_19d3' : [ 0xc, {
    'Space' : [ 0x0, ['unsigned long']],
    'MapPoint' : [ 0x4, ['unsigned long']],
    'BinPoint' : [ 0x8, ['pointer', ['_HBIN']]],
} ],
  '__unnamed_19d7' : [ 0x8, {
    'Bin' : [ 0x0, ['pointer', ['_HBIN']]],
    'CellPoint' : [ 0x4, ['pointer', ['_HCELL']]],
} ],
  '__unnamed_19d9' : [ 0x4, {
    'FileOffset' : [ 0x0, ['unsigned long']],
} ],
  '_HIVE_LOAD_FAILURE' : [ 0x154, {
    'Hive' : [ 0x0, ['pointer', ['_HHIVE']]],
    'Index' : [ 0x4, ['unsigned short']],
    'RecoverableIndex' : [ 0x6, ['unsigned short']],
    'Locations' : [ 0x8, ['array', 8, ['__unnamed_19c6']]],
    'RecoverableLocations' : [ 0x68, ['array', 8, ['__unnamed_19c6']]],
    'RegistryIO' : [ 0xc8, ['__unnamed_19c9']],
    'CheckRegistry2' : [ 0xd4, ['__unnamed_19cb']],
    'CheckKey' : [ 0xd8, ['__unnamed_19cd']],
    'CheckValueList' : [ 0xe8, ['__unnamed_19cf']],
    'CheckHive' : [ 0xf8, ['__unnamed_19d3']],
    'CheckHive1' : [ 0x104, ['__unnamed_19d3']],
    'CheckBin' : [ 0x110, ['__unnamed_19d7']],
    'RecoverData' : [ 0x118, ['__unnamed_19d9']],
    'LinkDebug' : [ 0x11c, ['_CM_PARSE_DEBUG_INFO']],
} ],
  '_CM_KCB_UOW' : [ 0x40, {
    'TransactionListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'KCBLock' : [ 0x8, ['pointer', ['_CM_INTENT_LOCK']]],
    'KeyLock' : [ 0xc, ['pointer', ['_CM_INTENT_LOCK']]],
    'KCBListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'KeyControlBlock' : [ 0x18, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'Transaction' : [ 0x1c, ['pointer', ['_CM_TRANS']]],
    'UoWState' : [ 0x20, ['unsigned long']],
    'ActionType' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: u'UoWAddThisKey', 1: u'UoWAddChildKey', 2: u'UoWDeleteThisKey', 3: u'UoWDeleteChildKey', 4: u'UoWSetValueNew', 5: u'UoWSetValueExisting', 6: u'UoWDeleteValue', 7: u'UoWSetKeyUserFlags', 8: u'UoWSetLastWriteTime', 9: u'UoWSetSecurityDescriptor', 10: u'UoWRenameSubKey', 11: u'UoWRenameOldSubKey', 12: u'UoWRenameNewSubKey', 13: u'UoWIsolation', 14: u'UoWInvalid'})]],
    'StorageType' : [ 0x28, ['Enumeration', dict(target = 'long', choices = {0: u'Stable', 1: u'Volatile', 2: u'InvalidStorage'})]],
    'ParentUoW' : [ 0x2c, ['pointer', ['_CM_KCB_UOW']]],
    'ChildKCB' : [ 0x30, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'VolatileKeyCell' : [ 0x30, ['unsigned long']],
    'OldValueCell' : [ 0x30, ['unsigned long']],
    'NewValueCell' : [ 0x34, ['unsigned long']],
    'UserFlags' : [ 0x30, ['unsigned long']],
    'LastWriteTime' : [ 0x30, ['_LARGE_INTEGER']],
    'TxCachedSecurity' : [ 0x30, ['pointer', ['_CM_KEY_SECURITY_CACHE']]],
    'TxSecurityCell' : [ 0x34, ['unsigned long']],
    'OldChildKCB' : [ 0x30, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'NewChildKCB' : [ 0x34, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'OtherChildKCB' : [ 0x30, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'ThisVolatileKeyCell' : [ 0x34, ['unsigned long']],
    'PrepareDataPointer' : [ 0x38, ['pointer', ['void']]],
    'SecurityData' : [ 0x38, ['pointer', ['_CM_UOW_SET_SD_DATA']]],
    'ModifyKeysData' : [ 0x38, ['pointer', ['_CM_UOW_KEY_STATE_MODIFICATION']]],
    'SetValueData' : [ 0x38, ['pointer', ['_CM_UOW_SET_VALUE_LIST_DATA']]],
    'ValueData' : [ 0x3c, ['pointer', ['_CM_UOW_SET_VALUE_KEY_DATA']]],
    'DiscardReplaceContext' : [ 0x3c, ['pointer', ['_CMP_DISCARD_AND_REPLACE_KCB_CONTEXT']]],
} ],
  '_CM_TRANS' : [ 0x70, {
    'TransactionListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'KCBUoWListHead' : [ 0x8, ['_LIST_ENTRY']],
    'LazyCommitListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'Prepared' : [ 0x18, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Aborted' : [ 0x18, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Committed' : [ 0x18, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Initializing' : [ 0x18, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Invalid' : [ 0x18, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'UseReservation' : [ 0x18, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'TmCallbacksActive' : [ 0x18, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'LightWeight' : [ 0x18, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'Freed1' : [ 0x18, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Freed2' : [ 0x18, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'Spare1' : [ 0x18, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
    'Freed' : [ 0x18, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'Spare' : [ 0x18, ['BitField', dict(start_bit = 13, end_bit = 32, native_type='unsigned long')]],
    'TransState' : [ 0x18, ['unsigned long']],
    'Trans' : [ 0x1c, ['_CM_TRANS_PTR']],
    'CmRm' : [ 0x20, ['pointer', ['_CM_RM']]],
    'KtmEnlistmentObject' : [ 0x24, ['pointer', ['_KENLISTMENT']]],
    'KtmEnlistmentHandle' : [ 0x28, ['pointer', ['void']]],
    'KtmUow' : [ 0x2c, ['_GUID']],
    'StartLsn' : [ 0x40, ['unsigned long long']],
    'HiveCount' : [ 0x48, ['unsigned long']],
    'HiveArray' : [ 0x4c, ['array', 8, ['pointer', ['_CMHIVE']]]],
} ],
  '_PCW_COUNTER_DESCRIPTOR' : [ 0x8, {
    'Id' : [ 0x0, ['unsigned short']],
    'StructIndex' : [ 0x2, ['unsigned short']],
    'Offset' : [ 0x4, ['unsigned short']],
    'Size' : [ 0x6, ['unsigned short']],
} ],
  '_PCW_REGISTRATION_INFORMATION' : [ 0x18, {
    'Version' : [ 0x0, ['unsigned long']],
    'Name' : [ 0x4, ['pointer', ['_UNICODE_STRING']]],
    'CounterCount' : [ 0x8, ['unsigned long']],
    'Counters' : [ 0xc, ['pointer', ['_PCW_COUNTER_DESCRIPTOR']]],
    'Callback' : [ 0x10, ['pointer', ['void']]],
    'CallbackContext' : [ 0x14, ['pointer', ['void']]],
} ],
  '_PCW_PROCESSOR_INFO' : [ 0xc8, {
    'IdleTime' : [ 0x0, ['unsigned long long']],
    'AvailableTime' : [ 0x8, ['unsigned long long']],
    'UserTime' : [ 0x10, ['unsigned long long']],
    'KernelTime' : [ 0x18, ['unsigned long long']],
    'Interrupts' : [ 0x20, ['unsigned long']],
    'DpcTime' : [ 0x28, ['unsigned long long']],
    'InterruptTime' : [ 0x30, ['unsigned long long']],
    'ClockInterrupts' : [ 0x38, ['unsigned long']],
    'DpcCount' : [ 0x3c, ['unsigned long']],
    'DpcRate' : [ 0x40, ['unsigned long']],
    'C1Time' : [ 0x48, ['unsigned long long']],
    'C2Time' : [ 0x50, ['unsigned long long']],
    'C3Time' : [ 0x58, ['unsigned long long']],
    'C1Transitions' : [ 0x60, ['unsigned long long']],
    'C2Transitions' : [ 0x68, ['unsigned long long']],
    'C3Transitions' : [ 0x70, ['unsigned long long']],
    'StallTime' : [ 0x78, ['unsigned long long']],
    'ParkingStatus' : [ 0x80, ['unsigned long']],
    'CurrentFrequency' : [ 0x84, ['unsigned long']],
    'PercentMaxFrequency' : [ 0x88, ['unsigned long']],
    'StateFlags' : [ 0x8c, ['unsigned long']],
    'NominalThroughput' : [ 0x90, ['unsigned long']],
    'ActiveThroughput' : [ 0x94, ['unsigned long']],
    'ScaledThroughput' : [ 0x98, ['unsigned long long']],
    'ScaledKernelThroughput' : [ 0xa0, ['unsigned long long']],
    'AverageIdleTime' : [ 0xa8, ['unsigned long long']],
    'IdleBreakEvents' : [ 0xb0, ['unsigned long long']],
    'PerformanceLimit' : [ 0xb8, ['unsigned long']],
    'PerformanceLimitFlags' : [ 0xbc, ['unsigned long']],
    'ScaledFrequency' : [ 0xc0, ['unsigned long long']],
} ],
  '_PCW_DATA' : [ 0x8, {
    'Data' : [ 0x0, ['pointer', ['void']]],
    'Size' : [ 0x4, ['unsigned long']],
} ],
  '_SYNCH_COUNTERS' : [ 0xb8, {
    'SpinLockAcquireCount' : [ 0x0, ['unsigned long']],
    'SpinLockContentionCount' : [ 0x4, ['unsigned long']],
    'SpinLockSpinCount' : [ 0x8, ['unsigned long']],
    'IpiSendRequestBroadcastCount' : [ 0xc, ['unsigned long']],
    'IpiSendRequestRoutineCount' : [ 0x10, ['unsigned long']],
    'IpiSendSoftwareInterruptCount' : [ 0x14, ['unsigned long']],
    'ExInitializeResourceCount' : [ 0x18, ['unsigned long']],
    'ExReInitializeResourceCount' : [ 0x1c, ['unsigned long']],
    'ExDeleteResourceCount' : [ 0x20, ['unsigned long']],
    'ExecutiveResourceAcquiresCount' : [ 0x24, ['unsigned long']],
    'ExecutiveResourceContentionsCount' : [ 0x28, ['unsigned long']],
    'ExecutiveResourceReleaseExclusiveCount' : [ 0x2c, ['unsigned long']],
    'ExecutiveResourceReleaseSharedCount' : [ 0x30, ['unsigned long']],
    'ExecutiveResourceConvertsCount' : [ 0x34, ['unsigned long']],
    'ExAcqResExclusiveAttempts' : [ 0x38, ['unsigned long']],
    'ExAcqResExclusiveAcquiresExclusive' : [ 0x3c, ['unsigned long']],
    'ExAcqResExclusiveAcquiresExclusiveRecursive' : [ 0x40, ['unsigned long']],
    'ExAcqResExclusiveWaits' : [ 0x44, ['unsigned long']],
    'ExAcqResExclusiveNotAcquires' : [ 0x48, ['unsigned long']],
    'ExAcqResSharedAttempts' : [ 0x4c, ['unsigned long']],
    'ExAcqResSharedAcquiresExclusive' : [ 0x50, ['unsigned long']],
    'ExAcqResSharedAcquiresShared' : [ 0x54, ['unsigned long']],
    'ExAcqResSharedAcquiresSharedRecursive' : [ 0x58, ['unsigned long']],
    'ExAcqResSharedWaits' : [ 0x5c, ['unsigned long']],
    'ExAcqResSharedNotAcquires' : [ 0x60, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAttempts' : [ 0x64, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresExclusive' : [ 0x68, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresShared' : [ 0x6c, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresSharedRecursive' : [ 0x70, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveWaits' : [ 0x74, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveNotAcquires' : [ 0x78, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAttempts' : [ 0x7c, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresExclusive' : [ 0x80, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresShared' : [ 0x84, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresSharedRecursive' : [ 0x88, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveWaits' : [ 0x8c, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveNotAcquires' : [ 0x90, ['unsigned long']],
    'ExSetResOwnerPointerExclusive' : [ 0x94, ['unsigned long']],
    'ExSetResOwnerPointerSharedNew' : [ 0x98, ['unsigned long']],
    'ExSetResOwnerPointerSharedOld' : [ 0x9c, ['unsigned long']],
    'ExTryToAcqExclusiveAttempts' : [ 0xa0, ['unsigned long']],
    'ExTryToAcqExclusiveAcquires' : [ 0xa4, ['unsigned long']],
    'ExBoostExclusiveOwner' : [ 0xa8, ['unsigned long']],
    'ExBoostSharedOwners' : [ 0xac, ['unsigned long']],
    'ExEtwSynchTrackingNotificationsCount' : [ 0xb0, ['unsigned long']],
    'ExEtwSynchTrackingNotificationsAccountedCount' : [ 0xb4, ['unsigned long']],
} ],
  '_ETW_PERF_COUNTERS' : [ 0x18, {
    'TotalActiveSessions' : [ 0x0, ['long']],
    'TotalBufferMemoryNonPagedPool' : [ 0x4, ['long']],
    'TotalBufferMemoryPagedPool' : [ 0x8, ['long']],
    'TotalGuidsEnabled' : [ 0xc, ['long']],
    'TotalGuidsNotEnabled' : [ 0x10, ['long']],
    'TotalGuidsPreEnabled' : [ 0x14, ['long']],
} ],
  '_ETW_SESSION_PERF_COUNTERS' : [ 0x18, {
    'BufferMemoryPagedPool' : [ 0x0, ['long']],
    'BufferMemoryNonPagedPool' : [ 0x4, ['long']],
    'EventsLoggedCount' : [ 0x8, ['unsigned long long']],
    'EventsLost' : [ 0x10, ['long']],
    'NumConsumers' : [ 0x14, ['long']],
} ],
  '_FILESYSTEM_DISK_COUNTERS' : [ 0x10, {
    'FsBytesRead' : [ 0x0, ['unsigned long long']],
    'FsBytesWritten' : [ 0x8, ['unsigned long long']],
} ],
  '_THERMAL_ZONE_COUNTERS' : [ 0x10, {
    'Temperature' : [ 0x0, ['unsigned long']],
    'ThrottleLimit' : [ 0x4, ['unsigned long']],
    'ThrottleReasons' : [ 0x8, ['unsigned long']],
    'TemperatureHighPrecision' : [ 0xc, ['unsigned long']],
} ],
  '_TEB32' : [ 0x1000, {
    'NtTib' : [ 0x0, ['_NT_TIB32']],
    'EnvironmentPointer' : [ 0x1c, ['unsigned long']],
    'ClientId' : [ 0x20, ['_CLIENT_ID32']],
    'ActiveRpcHandle' : [ 0x28, ['unsigned long']],
    'ThreadLocalStoragePointer' : [ 0x2c, ['unsigned long']],
    'ProcessEnvironmentBlock' : [ 0x30, ['unsigned long']],
    'LastErrorValue' : [ 0x34, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x38, ['unsigned long']],
    'CsrClientThread' : [ 0x3c, ['unsigned long']],
    'Win32ThreadInfo' : [ 0x40, ['unsigned long']],
    'User32Reserved' : [ 0x44, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xac, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0xc0, ['unsigned long']],
    'CurrentLocale' : [ 0xc4, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0xc8, ['unsigned long']],
    'ReservedForDebuggerInstrumentation' : [ 0xcc, ['array', 16, ['unsigned long']]],
    'SystemReserved1' : [ 0x10c, ['array', 26, ['unsigned long']]],
    'PlaceholderCompatibilityMode' : [ 0x174, ['unsigned char']],
    'PlaceholderHydrationAlwaysExplicit' : [ 0x175, ['unsigned char']],
    'PlaceholderReserved' : [ 0x176, ['array', 10, ['unsigned char']]],
    'ProxiedProcessId' : [ 0x180, ['unsigned long']],
    '_ActivationStack' : [ 0x184, ['_ACTIVATION_CONTEXT_STACK32']],
    'WorkingOnBehalfTicket' : [ 0x19c, ['array', 8, ['unsigned char']]],
    'ExceptionCode' : [ 0x1a4, ['long']],
    'ActivationContextStackPointer' : [ 0x1a8, ['unsigned long']],
    'InstrumentationCallbackSp' : [ 0x1ac, ['unsigned long']],
    'InstrumentationCallbackPreviousPc' : [ 0x1b0, ['unsigned long']],
    'InstrumentationCallbackPreviousSp' : [ 0x1b4, ['unsigned long']],
    'InstrumentationCallbackDisabled' : [ 0x1b8, ['unsigned char']],
    'SpareBytes' : [ 0x1b9, ['array', 23, ['unsigned char']]],
    'TxFsContext' : [ 0x1d0, ['unsigned long']],
    'GdiTebBatch' : [ 0x1d4, ['_GDI_TEB_BATCH32']],
    'RealClientId' : [ 0x6b4, ['_CLIENT_ID32']],
    'GdiCachedProcessHandle' : [ 0x6bc, ['unsigned long']],
    'GdiClientPID' : [ 0x6c0, ['unsigned long']],
    'GdiClientTID' : [ 0x6c4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x6c8, ['unsigned long']],
    'Win32ClientInfo' : [ 0x6cc, ['array', 62, ['unsigned long']]],
    'glDispatchTable' : [ 0x7c4, ['array', 233, ['unsigned long']]],
    'glReserved1' : [ 0xb68, ['array', 29, ['unsigned long']]],
    'glReserved2' : [ 0xbdc, ['unsigned long']],
    'glSectionInfo' : [ 0xbe0, ['unsigned long']],
    'glSection' : [ 0xbe4, ['unsigned long']],
    'glTable' : [ 0xbe8, ['unsigned long']],
    'glCurrentRC' : [ 0xbec, ['unsigned long']],
    'glContext' : [ 0xbf0, ['unsigned long']],
    'LastStatusValue' : [ 0xbf4, ['unsigned long']],
    'StaticUnicodeString' : [ 0xbf8, ['_STRING32']],
    'StaticUnicodeBuffer' : [ 0xc00, ['array', 261, ['wchar']]],
    'DeallocationStack' : [ 0xe0c, ['unsigned long']],
    'TlsSlots' : [ 0xe10, ['array', 64, ['unsigned long']]],
    'TlsLinks' : [ 0xf10, ['LIST_ENTRY32']],
    'Vdm' : [ 0xf18, ['unsigned long']],
    'ReservedForNtRpc' : [ 0xf1c, ['unsigned long']],
    'DbgSsReserved' : [ 0xf20, ['array', 2, ['unsigned long']]],
    'HardErrorMode' : [ 0xf28, ['unsigned long']],
    'Instrumentation' : [ 0xf2c, ['array', 9, ['unsigned long']]],
    'ActivityId' : [ 0xf50, ['_GUID']],
    'SubProcessTag' : [ 0xf60, ['unsigned long']],
    'PerflibData' : [ 0xf64, ['unsigned long']],
    'EtwTraceData' : [ 0xf68, ['unsigned long']],
    'WinSockData' : [ 0xf6c, ['unsigned long']],
    'GdiBatchCount' : [ 0xf70, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0xf74, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0xf74, ['unsigned long']],
    'ReservedPad0' : [ 0xf74, ['unsigned char']],
    'ReservedPad1' : [ 0xf75, ['unsigned char']],
    'ReservedPad2' : [ 0xf76, ['unsigned char']],
    'IdealProcessor' : [ 0xf77, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0xf78, ['unsigned long']],
    'ReservedForPerf' : [ 0xf7c, ['unsigned long']],
    'ReservedForOle' : [ 0xf80, ['unsigned long']],
    'WaitingOnLoaderLock' : [ 0xf84, ['unsigned long']],
    'SavedPriorityState' : [ 0xf88, ['unsigned long']],
    'ReservedForCodeCoverage' : [ 0xf8c, ['unsigned long']],
    'ThreadPoolData' : [ 0xf90, ['unsigned long']],
    'TlsExpansionSlots' : [ 0xf94, ['unsigned long']],
    'MuiGeneration' : [ 0xf98, ['unsigned long']],
    'IsImpersonating' : [ 0xf9c, ['unsigned long']],
    'NlsCache' : [ 0xfa0, ['unsigned long']],
    'pShimData' : [ 0xfa4, ['unsigned long']],
    'HeapData' : [ 0xfa8, ['unsigned long']],
    'CurrentTransactionHandle' : [ 0xfac, ['unsigned long']],
    'ActiveFrame' : [ 0xfb0, ['unsigned long']],
    'FlsData' : [ 0xfb4, ['unsigned long']],
    'PreferredLanguages' : [ 0xfb8, ['unsigned long']],
    'UserPrefLanguages' : [ 0xfbc, ['unsigned long']],
    'MergedPrefLanguages' : [ 0xfc0, ['unsigned long']],
    'MuiImpersonation' : [ 0xfc4, ['unsigned long']],
    'CrossTebFlags' : [ 0xfc8, ['unsigned short']],
    'SpareCrossTebBits' : [ 0xfc8, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0xfca, ['unsigned short']],
    'SafeThunkCall' : [ 0xfca, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0xfca, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0xfca, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0xfca, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0xfca, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0xfca, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0xfca, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0xfca, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0xfca, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0xfca, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0xfca, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SessionAware' : [ 0xfca, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
    'LoadOwner' : [ 0xfca, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
    'LoaderWorker' : [ 0xfca, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
    'SkipLoaderInit' : [ 0xfca, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0xfca, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0xfcc, ['unsigned long']],
    'TxnScopeExitCallback' : [ 0xfd0, ['unsigned long']],
    'TxnScopeContext' : [ 0xfd4, ['unsigned long']],
    'LockCount' : [ 0xfd8, ['unsigned long']],
    'WowTebOffset' : [ 0xfdc, ['long']],
    'ResourceRetValue' : [ 0xfe0, ['unsigned long']],
    'ReservedForWdf' : [ 0xfe4, ['unsigned long']],
    'ReservedForCrt' : [ 0xfe8, ['unsigned long long']],
    'EffectiveContainerId' : [ 0xff0, ['_GUID']],
} ],
  '_TEB64' : [ 0x1838, {
    'NtTib' : [ 0x0, ['_NT_TIB64']],
    'EnvironmentPointer' : [ 0x38, ['unsigned long long']],
    'ClientId' : [ 0x40, ['_CLIENT_ID64']],
    'ActiveRpcHandle' : [ 0x50, ['unsigned long long']],
    'ThreadLocalStoragePointer' : [ 0x58, ['unsigned long long']],
    'ProcessEnvironmentBlock' : [ 0x60, ['unsigned long long']],
    'LastErrorValue' : [ 0x68, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x6c, ['unsigned long']],
    'CsrClientThread' : [ 0x70, ['unsigned long long']],
    'Win32ThreadInfo' : [ 0x78, ['unsigned long long']],
    'User32Reserved' : [ 0x80, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xe8, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0x100, ['unsigned long long']],
    'CurrentLocale' : [ 0x108, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0x10c, ['unsigned long']],
    'ReservedForDebuggerInstrumentation' : [ 0x110, ['array', 16, ['unsigned long long']]],
    'SystemReserved1' : [ 0x190, ['array', 30, ['unsigned long long']]],
    'PlaceholderCompatibilityMode' : [ 0x280, ['unsigned char']],
    'PlaceholderHydrationAlwaysExplicit' : [ 0x281, ['unsigned char']],
    'PlaceholderReserved' : [ 0x282, ['array', 10, ['unsigned char']]],
    'ProxiedProcessId' : [ 0x28c, ['unsigned long']],
    '_ActivationStack' : [ 0x290, ['_ACTIVATION_CONTEXT_STACK64']],
    'WorkingOnBehalfTicket' : [ 0x2b8, ['array', 8, ['unsigned char']]],
    'ExceptionCode' : [ 0x2c0, ['long']],
    'Padding0' : [ 0x2c4, ['array', 4, ['unsigned char']]],
    'ActivationContextStackPointer' : [ 0x2c8, ['unsigned long long']],
    'InstrumentationCallbackSp' : [ 0x2d0, ['unsigned long long']],
    'InstrumentationCallbackPreviousPc' : [ 0x2d8, ['unsigned long long']],
    'InstrumentationCallbackPreviousSp' : [ 0x2e0, ['unsigned long long']],
    'TxFsContext' : [ 0x2e8, ['unsigned long']],
    'InstrumentationCallbackDisabled' : [ 0x2ec, ['unsigned char']],
    'UnalignedLoadStoreExceptions' : [ 0x2ed, ['unsigned char']],
    'Padding1' : [ 0x2ee, ['array', 2, ['unsigned char']]],
    'GdiTebBatch' : [ 0x2f0, ['_GDI_TEB_BATCH64']],
    'RealClientId' : [ 0x7d8, ['_CLIENT_ID64']],
    'GdiCachedProcessHandle' : [ 0x7e8, ['unsigned long long']],
    'GdiClientPID' : [ 0x7f0, ['unsigned long']],
    'GdiClientTID' : [ 0x7f4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x7f8, ['unsigned long long']],
    'Win32ClientInfo' : [ 0x800, ['array', 62, ['unsigned long long']]],
    'glDispatchTable' : [ 0x9f0, ['array', 233, ['unsigned long long']]],
    'glReserved1' : [ 0x1138, ['array', 29, ['unsigned long long']]],
    'glReserved2' : [ 0x1220, ['unsigned long long']],
    'glSectionInfo' : [ 0x1228, ['unsigned long long']],
    'glSection' : [ 0x1230, ['unsigned long long']],
    'glTable' : [ 0x1238, ['unsigned long long']],
    'glCurrentRC' : [ 0x1240, ['unsigned long long']],
    'glContext' : [ 0x1248, ['unsigned long long']],
    'LastStatusValue' : [ 0x1250, ['unsigned long']],
    'Padding2' : [ 0x1254, ['array', 4, ['unsigned char']]],
    'StaticUnicodeString' : [ 0x1258, ['_STRING64']],
    'StaticUnicodeBuffer' : [ 0x1268, ['array', 261, ['wchar']]],
    'Padding3' : [ 0x1472, ['array', 6, ['unsigned char']]],
    'DeallocationStack' : [ 0x1478, ['unsigned long long']],
    'TlsSlots' : [ 0x1480, ['array', 64, ['unsigned long long']]],
    'TlsLinks' : [ 0x1680, ['LIST_ENTRY64']],
    'Vdm' : [ 0x1690, ['unsigned long long']],
    'ReservedForNtRpc' : [ 0x1698, ['unsigned long long']],
    'DbgSsReserved' : [ 0x16a0, ['array', 2, ['unsigned long long']]],
    'HardErrorMode' : [ 0x16b0, ['unsigned long']],
    'Padding4' : [ 0x16b4, ['array', 4, ['unsigned char']]],
    'Instrumentation' : [ 0x16b8, ['array', 11, ['unsigned long long']]],
    'ActivityId' : [ 0x1710, ['_GUID']],
    'SubProcessTag' : [ 0x1720, ['unsigned long long']],
    'PerflibData' : [ 0x1728, ['unsigned long long']],
    'EtwTraceData' : [ 0x1730, ['unsigned long long']],
    'WinSockData' : [ 0x1738, ['unsigned long long']],
    'GdiBatchCount' : [ 0x1740, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0x1744, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0x1744, ['unsigned long']],
    'ReservedPad0' : [ 0x1744, ['unsigned char']],
    'ReservedPad1' : [ 0x1745, ['unsigned char']],
    'ReservedPad2' : [ 0x1746, ['unsigned char']],
    'IdealProcessor' : [ 0x1747, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0x1748, ['unsigned long']],
    'Padding5' : [ 0x174c, ['array', 4, ['unsigned char']]],
    'ReservedForPerf' : [ 0x1750, ['unsigned long long']],
    'ReservedForOle' : [ 0x1758, ['unsigned long long']],
    'WaitingOnLoaderLock' : [ 0x1760, ['unsigned long']],
    'Padding6' : [ 0x1764, ['array', 4, ['unsigned char']]],
    'SavedPriorityState' : [ 0x1768, ['unsigned long long']],
    'ReservedForCodeCoverage' : [ 0x1770, ['unsigned long long']],
    'ThreadPoolData' : [ 0x1778, ['unsigned long long']],
    'TlsExpansionSlots' : [ 0x1780, ['unsigned long long']],
    'DeallocationBStore' : [ 0x1788, ['unsigned long long']],
    'BStoreLimit' : [ 0x1790, ['unsigned long long']],
    'MuiGeneration' : [ 0x1798, ['unsigned long']],
    'IsImpersonating' : [ 0x179c, ['unsigned long']],
    'NlsCache' : [ 0x17a0, ['unsigned long long']],
    'pShimData' : [ 0x17a8, ['unsigned long long']],
    'HeapData' : [ 0x17b0, ['unsigned long']],
    'Padding7' : [ 0x17b4, ['array', 4, ['unsigned char']]],
    'CurrentTransactionHandle' : [ 0x17b8, ['unsigned long long']],
    'ActiveFrame' : [ 0x17c0, ['unsigned long long']],
    'FlsData' : [ 0x17c8, ['unsigned long long']],
    'PreferredLanguages' : [ 0x17d0, ['unsigned long long']],
    'UserPrefLanguages' : [ 0x17d8, ['unsigned long long']],
    'MergedPrefLanguages' : [ 0x17e0, ['unsigned long long']],
    'MuiImpersonation' : [ 0x17e8, ['unsigned long']],
    'CrossTebFlags' : [ 0x17ec, ['unsigned short']],
    'SpareCrossTebBits' : [ 0x17ec, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0x17ee, ['unsigned short']],
    'SafeThunkCall' : [ 0x17ee, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0x17ee, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0x17ee, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0x17ee, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0x17ee, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0x17ee, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0x17ee, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0x17ee, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0x17ee, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0x17ee, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0x17ee, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SessionAware' : [ 0x17ee, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
    'LoadOwner' : [ 0x17ee, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
    'LoaderWorker' : [ 0x17ee, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
    'SkipLoaderInit' : [ 0x17ee, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0x17ee, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0x17f0, ['unsigned long long']],
    'TxnScopeExitCallback' : [ 0x17f8, ['unsigned long long']],
    'TxnScopeContext' : [ 0x1800, ['unsigned long long']],
    'LockCount' : [ 0x1808, ['unsigned long']],
    'WowTebOffset' : [ 0x180c, ['long']],
    'ResourceRetValue' : [ 0x1810, ['unsigned long long']],
    'ReservedForWdf' : [ 0x1818, ['unsigned long long']],
    'ReservedForCrt' : [ 0x1820, ['unsigned long long']],
    'EffectiveContainerId' : [ 0x1828, ['_GUID']],
} ],
  '_HV_X64_HYPERVISOR_FEATURES' : [ 0x10, {
    'PartitionPrivileges' : [ 0x0, ['_HV_PARTITION_PRIVILEGE_MASK']],
    'MaxSupportedCState' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long')]],
    'HpetNeededForC3PowerState_Deprecated' : [ 0x8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Reserved' : [ 0x8, ['BitField', dict(start_bit = 5, end_bit = 32, native_type='unsigned long')]],
    'MwaitAvailable_Deprecated' : [ 0xc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'GuestDebuggingAvailable' : [ 0xc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'PerformanceMonitorsAvailable' : [ 0xc, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'CpuDynamicPartitioningAvailable' : [ 0xc, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'XmmRegistersForFastHypercallAvailable' : [ 0xc, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'GuestIdleAvailable' : [ 0xc, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'HypervisorSleepStateSupportAvailable' : [ 0xc, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'NumaDistanceQueryAvailable' : [ 0xc, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'FrequencyRegsAvailable' : [ 0xc, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'SyntheticMachineCheckAvailable' : [ 0xc, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'GuestCrashRegsAvailable' : [ 0xc, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'DebugRegsAvailable' : [ 0xc, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'Npiep1Available' : [ 0xc, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'DisableHypervisorAvailable' : [ 0xc, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'ExtendedGvaRangesForFlushVirtualAddressListAvailable' : [ 0xc, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'FastHypercallOutputAvailable' : [ 0xc, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'SvmFeaturesAvailable' : [ 0xc, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'SintPollingModeAvailable' : [ 0xc, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HypercallMsrLockAvailable' : [ 0xc, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'DirectSyntheticTimers' : [ 0xc, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'RegisterPatAvailable' : [ 0xc, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'RegisterBndcfgsAvailable' : [ 0xc, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'WatchdogTimerAvailable' : [ 0xc, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'SyntheticTimeUnhaltedTimerAvailable' : [ 0xc, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'DeviceDomainsAvailable' : [ 0xc, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'S1DeviceDomainsAvailable' : [ 0xc, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'LbrAvailable' : [ 0xc, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'IptAvailable' : [ 0xc, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'CrossVtlFlushAvailable' : [ 0xc, ['BitField', dict(start_bit = 28, end_bit = 29, native_type='unsigned long')]],
    'IdleSpecCtrlAvailable' : [ 0xc, ['BitField', dict(start_bit = 29, end_bit = 30, native_type='unsigned long')]],
    'Reserved1' : [ 0xc, ['BitField', dict(start_bit = 30, end_bit = 32, native_type='unsigned long')]],
} ],
  '_HV_PARTITION_PRIVILEGE_MASK' : [ 0x8, {
    'AsUINT64' : [ 0x0, ['unsigned long long']],
    'AccessVpRunTimeReg' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'AccessPartitionReferenceCounter' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'AccessSynicRegs' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'AccessSyntheticTimerRegs' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'AccessIntrCtrlRegs' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'AccessHypercallMsrs' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
    'AccessVpIndex' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long long')]],
    'AccessResetReg' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long long')]],
    'AccessStatsReg' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'AccessPartitionReferenceTsc' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'AccessGuestIdleReg' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'AccessFrequencyRegs' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'AccessDebugRegs' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long long')]],
    'AccessReenlightenmentControls' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long long')]],
    'AccessRootSchedulerReg' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long long')]],
    'AccessTscInvariantControls' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long long')]],
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long long')]],
    'CreatePartitions' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 33, native_type='unsigned long long')]],
    'AccessPartitionId' : [ 0x0, ['BitField', dict(start_bit = 33, end_bit = 34, native_type='unsigned long long')]],
    'AccessMemoryPool' : [ 0x0, ['BitField', dict(start_bit = 34, end_bit = 35, native_type='unsigned long long')]],
    'AdjustMessageBuffers' : [ 0x0, ['BitField', dict(start_bit = 35, end_bit = 36, native_type='unsigned long long')]],
    'PostMessages' : [ 0x0, ['BitField', dict(start_bit = 36, end_bit = 37, native_type='unsigned long long')]],
    'SignalEvents' : [ 0x0, ['BitField', dict(start_bit = 37, end_bit = 38, native_type='unsigned long long')]],
    'CreatePort' : [ 0x0, ['BitField', dict(start_bit = 38, end_bit = 39, native_type='unsigned long long')]],
    'ConnectPort' : [ 0x0, ['BitField', dict(start_bit = 39, end_bit = 40, native_type='unsigned long long')]],
    'AccessStats' : [ 0x0, ['BitField', dict(start_bit = 40, end_bit = 41, native_type='unsigned long long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 41, end_bit = 43, native_type='unsigned long long')]],
    'Debugging' : [ 0x0, ['BitField', dict(start_bit = 43, end_bit = 44, native_type='unsigned long long')]],
    'CpuManagement' : [ 0x0, ['BitField', dict(start_bit = 44, end_bit = 45, native_type='unsigned long long')]],
    'ConfigureProfiler' : [ 0x0, ['BitField', dict(start_bit = 45, end_bit = 46, native_type='unsigned long long')]],
    'AccessVpExitTracing' : [ 0x0, ['BitField', dict(start_bit = 46, end_bit = 47, native_type='unsigned long long')]],
    'EnableExtendedGvaRangesForFlushVirtualAddressList' : [ 0x0, ['BitField', dict(start_bit = 47, end_bit = 48, native_type='unsigned long long')]],
    'AccessVsm' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 49, native_type='unsigned long long')]],
    'AccessVpRegisters' : [ 0x0, ['BitField', dict(start_bit = 49, end_bit = 50, native_type='unsigned long long')]],
    'UnusedBit' : [ 0x0, ['BitField', dict(start_bit = 50, end_bit = 51, native_type='unsigned long long')]],
    'FastHypercallOutput' : [ 0x0, ['BitField', dict(start_bit = 51, end_bit = 52, native_type='unsigned long long')]],
    'EnableExtendedHypercalls' : [ 0x0, ['BitField', dict(start_bit = 52, end_bit = 53, native_type='unsigned long long')]],
    'StartVirtualProcessor' : [ 0x0, ['BitField', dict(start_bit = 53, end_bit = 54, native_type='unsigned long long')]],
    'Isolation' : [ 0x0, ['BitField', dict(start_bit = 54, end_bit = 55, native_type='unsigned long long')]],
    'Reserved3' : [ 0x0, ['BitField', dict(start_bit = 55, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_KTIMER_TABLE' : [ 0x1850, {
    'TimerExpiry' : [ 0x0, ['array', 16, ['pointer', ['_KTIMER']]]],
    'TimerEntries' : [ 0x40, ['array', 1, ['array', 256, ['_KTIMER_TABLE_ENTRY']]]],
    'TableState' : [ 0x1840, ['_KTIMER_TABLE_STATE']],
} ],
  '_KTIMER_TABLE_ENTRY' : [ 0x18, {
    'Lock' : [ 0x0, ['unsigned long']],
    'Entry' : [ 0x4, ['_LIST_ENTRY']],
    'Time' : [ 0x10, ['_ULARGE_INTEGER']],
} ],
  '_XSTATE_SAVE' : [ 0x20, {
    'Reserved1' : [ 0x0, ['long long']],
    'Reserved2' : [ 0x8, ['unsigned long']],
    'Prev' : [ 0xc, ['pointer', ['_XSTATE_SAVE']]],
    'Reserved3' : [ 0x10, ['pointer', ['_XSAVE_AREA']]],
    'Thread' : [ 0x14, ['pointer', ['_KTHREAD']]],
    'Reserved4' : [ 0x18, ['pointer', ['void']]],
    'Level' : [ 0x1c, ['unsigned char']],
    'XStateContext' : [ 0x0, ['_XSTATE_CONTEXT']],
} ],
  '_XSAVE_AREA' : [ 0x240, {
    'LegacyState' : [ 0x0, ['_XSAVE_FORMAT']],
    'Header' : [ 0x200, ['_XSAVE_AREA_HEADER']],
} ],
  '_KAFFINITY_EX' : [ 0xc, {
    'Count' : [ 0x0, ['unsigned short']],
    'Size' : [ 0x2, ['unsigned short']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Bitmap' : [ 0x8, ['array', 1, ['unsigned long']]],
} ],
  '_KAFFINITY_ENUMERATION_CONTEXT' : [ 0xc, {
    'Affinity' : [ 0x0, ['pointer', ['_KAFFINITY_EX']]],
    'CurrentMask' : [ 0x4, ['unsigned long']],
    'CurrentIndex' : [ 0x8, ['unsigned short']],
} ],
  '__unnamed_1b0f' : [ 0x4, {
    'LegacyDeviceNode' : [ 0x0, ['pointer', ['_DEVICE_NODE']]],
    'PendingDeviceRelations' : [ 0x0, ['pointer', ['_DEVICE_RELATIONS']]],
    'Information' : [ 0x0, ['pointer', ['void']]],
} ],
  '__unnamed_1b11' : [ 0x4, {
    'NextResourceDeviceNode' : [ 0x0, ['pointer', ['_DEVICE_NODE']]],
} ],
  '__unnamed_1b15' : [ 0x10, {
    'DockStatus' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'DOCK_NOTDOCKDEVICE', 1: u'DOCK_QUIESCENT', 2: u'DOCK_ARRIVING', 3: u'DOCK_DEPARTING', 4: u'DOCK_EJECTIRP_COMPLETED'})]],
    'ListEntry' : [ 0x4, ['_LIST_ENTRY']],
    'SerialNumber' : [ 0xc, ['pointer', ['wchar']]],
} ],
  '_DEVICE_NODE' : [ 0x1f4, {
    'Sibling' : [ 0x0, ['pointer', ['_DEVICE_NODE']]],
    'Child' : [ 0x4, ['pointer', ['_DEVICE_NODE']]],
    'Parent' : [ 0x8, ['pointer', ['_DEVICE_NODE']]],
    'LastChild' : [ 0xc, ['pointer', ['_DEVICE_NODE']]],
    'PhysicalDeviceObject' : [ 0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'InstancePath' : [ 0x14, ['_UNICODE_STRING']],
    'ServiceName' : [ 0x1c, ['_UNICODE_STRING']],
    'PendingIrp' : [ 0x24, ['pointer', ['_IRP']]],
    'FxDevice' : [ 0x28, ['pointer', ['_POP_FX_DEVICE']]],
    'FxDeviceLock' : [ 0x2c, ['long']],
    'FxRemoveEvent' : [ 0x30, ['_KEVENT']],
    'FxActivationCount' : [ 0x40, ['long']],
    'FxSleepCount' : [ 0x44, ['long']],
    'UniqueId' : [ 0x48, ['_UNICODE_STRING']],
    'Plugin' : [ 0x50, ['pointer', ['_POP_FX_PLUGIN']]],
    'Level' : [ 0x54, ['unsigned long']],
    'CurrentPowerState' : [ 0x58, ['_POWER_STATE']],
    'Notify' : [ 0x5c, ['_PO_DEVICE_NOTIFY']],
    'PoIrpManager' : [ 0x98, ['_PO_IRP_MANAGER']],
    'PowerFlags' : [ 0xa8, ['long']],
    'State' : [ 0xac, ['Enumeration', dict(target = 'long', choices = {768: u'DeviceNodeUnspecified', 769: u'DeviceNodeUninitialized', 770: u'DeviceNodeInitialized', 771: u'DeviceNodeDriversAdded', 772: u'DeviceNodeResourcesAssigned', 773: u'DeviceNodeStartPending', 774: u'DeviceNodeStartCompletion', 775: u'DeviceNodeStartPostWork', 776: u'DeviceNodeStarted', 777: u'DeviceNodeQueryStopped', 778: u'DeviceNodeStopped', 779: u'DeviceNodeRestartCompletion', 780: u'DeviceNodeEnumeratePending', 781: u'DeviceNodeEnumerateCompletion', 782: u'DeviceNodeAwaitingQueuedDeletion', 783: u'DeviceNodeAwaitingQueuedRemoval', 784: u'DeviceNodeQueryRemoved', 785: u'DeviceNodeRemovePendingCloses', 786: u'DeviceNodeRemoved', 787: u'DeviceNodeDeletePendingCloses', 788: u'DeviceNodeDeleted', 789: u'MaxDeviceNodeState'})]],
    'PreviousState' : [ 0xb0, ['Enumeration', dict(target = 'long', choices = {768: u'DeviceNodeUnspecified', 769: u'DeviceNodeUninitialized', 770: u'DeviceNodeInitialized', 771: u'DeviceNodeDriversAdded', 772: u'DeviceNodeResourcesAssigned', 773: u'DeviceNodeStartPending', 774: u'DeviceNodeStartCompletion', 775: u'DeviceNodeStartPostWork', 776: u'DeviceNodeStarted', 777: u'DeviceNodeQueryStopped', 778: u'DeviceNodeStopped', 779: u'DeviceNodeRestartCompletion', 780: u'DeviceNodeEnumeratePending', 781: u'DeviceNodeEnumerateCompletion', 782: u'DeviceNodeAwaitingQueuedDeletion', 783: u'DeviceNodeAwaitingQueuedRemoval', 784: u'DeviceNodeQueryRemoved', 785: u'DeviceNodeRemovePendingCloses', 786: u'DeviceNodeRemoved', 787: u'DeviceNodeDeletePendingCloses', 788: u'DeviceNodeDeleted', 789: u'MaxDeviceNodeState'})]],
    'StateHistory' : [ 0xb4, ['array', 20, ['Enumeration', dict(target = 'long', choices = {768: u'DeviceNodeUnspecified', 769: u'DeviceNodeUninitialized', 770: u'DeviceNodeInitialized', 771: u'DeviceNodeDriversAdded', 772: u'DeviceNodeResourcesAssigned', 773: u'DeviceNodeStartPending', 774: u'DeviceNodeStartCompletion', 775: u'DeviceNodeStartPostWork', 776: u'DeviceNodeStarted', 777: u'DeviceNodeQueryStopped', 778: u'DeviceNodeStopped', 779: u'DeviceNodeRestartCompletion', 780: u'DeviceNodeEnumeratePending', 781: u'DeviceNodeEnumerateCompletion', 782: u'DeviceNodeAwaitingQueuedDeletion', 783: u'DeviceNodeAwaitingQueuedRemoval', 784: u'DeviceNodeQueryRemoved', 785: u'DeviceNodeRemovePendingCloses', 786: u'DeviceNodeRemoved', 787: u'DeviceNodeDeletePendingCloses', 788: u'DeviceNodeDeleted', 789: u'MaxDeviceNodeState'})]]],
    'StateHistoryEntry' : [ 0x104, ['unsigned long']],
    'CompletionStatus' : [ 0x108, ['long']],
    'Flags' : [ 0x10c, ['unsigned long']],
    'UserFlags' : [ 0x110, ['unsigned long']],
    'Problem' : [ 0x114, ['unsigned long']],
    'ProblemStatus' : [ 0x118, ['long']],
    'ResourceList' : [ 0x11c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'ResourceListTranslated' : [ 0x120, ['pointer', ['_CM_RESOURCE_LIST']]],
    'DuplicatePDO' : [ 0x124, ['pointer', ['_DEVICE_OBJECT']]],
    'ResourceRequirements' : [ 0x128, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'InterfaceType' : [ 0x12c, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x130, ['unsigned long']],
    'ChildInterfaceType' : [ 0x134, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
    'ChildBusNumber' : [ 0x138, ['unsigned long']],
    'ChildBusTypeIndex' : [ 0x13c, ['unsigned short']],
    'RemovalPolicy' : [ 0x13e, ['unsigned char']],
    'HardwareRemovalPolicy' : [ 0x13f, ['unsigned char']],
    'TargetDeviceNotify' : [ 0x140, ['_LIST_ENTRY']],
    'DeviceArbiterList' : [ 0x148, ['_LIST_ENTRY']],
    'DeviceTranslatorList' : [ 0x150, ['_LIST_ENTRY']],
    'NoTranslatorMask' : [ 0x158, ['unsigned short']],
    'QueryTranslatorMask' : [ 0x15a, ['unsigned short']],
    'NoArbiterMask' : [ 0x15c, ['unsigned short']],
    'QueryArbiterMask' : [ 0x15e, ['unsigned short']],
    'OverUsed1' : [ 0x160, ['__unnamed_1b0f']],
    'OverUsed2' : [ 0x164, ['__unnamed_1b11']],
    'BootResources' : [ 0x168, ['pointer', ['_CM_RESOURCE_LIST']]],
    'BootResourcesTranslated' : [ 0x16c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'CapabilityFlags' : [ 0x170, ['unsigned long']],
    'DockInfo' : [ 0x174, ['__unnamed_1b15']],
    'DisableableDepends' : [ 0x184, ['unsigned long']],
    'PendedSetInterfaceState' : [ 0x188, ['_LIST_ENTRY']],
    'LegacyBusListEntry' : [ 0x190, ['_LIST_ENTRY']],
    'DriverUnloadRetryCount' : [ 0x198, ['unsigned long']],
    'PreviousParent' : [ 0x19c, ['pointer', ['_DEVICE_NODE']]],
    'DeletedChildren' : [ 0x1a0, ['long']],
    'NumaNodeIndex' : [ 0x1a4, ['unsigned long']],
    'ContainerID' : [ 0x1a8, ['_GUID']],
    'OverrideFlags' : [ 0x1b8, ['unsigned char']],
    'DeviceIdsHash' : [ 0x1bc, ['unsigned long']],
    'RequiresUnloadedDriver' : [ 0x1c0, ['unsigned char']],
    'PendingEjectRelations' : [ 0x1c4, ['pointer', ['_PENDING_RELATIONS_LIST_ENTRY']]],
    'StateFlags' : [ 0x1c8, ['unsigned long']],
    'RebalanceContext' : [ 0x1cc, ['pointer', ['_PNP_REBALANCE_TRACE_CONTEXT']]],
    'IommuExtension' : [ 0x1d0, ['pointer', ['_DEVICE_NODE_IOMMU_EXTENSION']]],
    'DirectedDripsState' : [ 0x1d4, ['_PO_DIRECTED_DRIPS_STATE']],
} ],
  '_MCGEN_TRACE_CONTEXT' : [ 0x38, {
    'RegistrationHandle' : [ 0x0, ['unsigned long long']],
    'Logger' : [ 0x8, ['unsigned long long']],
    'MatchAnyKeyword' : [ 0x10, ['unsigned long long']],
    'MatchAllKeyword' : [ 0x18, ['unsigned long long']],
    'Flags' : [ 0x20, ['unsigned long']],
    'IsEnabled' : [ 0x24, ['unsigned long']],
    'Level' : [ 0x28, ['unsigned char']],
    'Reserve' : [ 0x29, ['unsigned char']],
    'EnableBitsCount' : [ 0x2a, ['unsigned short']],
    'EnableBitMask' : [ 0x2c, ['pointer', ['unsigned long']]],
    'EnableKeyWords' : [ 0x30, ['pointer', ['unsigned long long']]],
    'EnableLevel' : [ 0x34, ['pointer', ['unsigned char']]],
} ],
  '_SID' : [ 0xc, {
    'Revision' : [ 0x0, ['unsigned char']],
    'SubAuthorityCount' : [ 0x1, ['unsigned char']],
    'IdentifierAuthority' : [ 0x2, ['_SID_IDENTIFIER_AUTHORITY']],
    'SubAuthority' : [ 0x8, ['array', 1, ['unsigned long']]],
} ],
  '_PNP_DEVICE_COMPLETION_QUEUE' : [ 0x2c, {
    'DispatchedList' : [ 0x0, ['_LIST_ENTRY']],
    'DispatchedCount' : [ 0x8, ['unsigned long']],
    'CompletedList' : [ 0xc, ['_LIST_ENTRY']],
    'CompletedSemaphore' : [ 0x14, ['_KSEMAPHORE']],
    'SpinLock' : [ 0x28, ['unsigned long']],
} ],
  '_KSEMAPHORE' : [ 0x14, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'Limit' : [ 0x10, ['long']],
} ],
  '_DEVOBJ_EXTENSION' : [ 0x3c, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
    'PowerFlags' : [ 0x8, ['unsigned long']],
    'Dope' : [ 0xc, ['pointer', ['_DEVICE_OBJECT_POWER_EXTENSION']]],
    'ExtensionFlags' : [ 0x10, ['unsigned long']],
    'DeviceNode' : [ 0x14, ['pointer', ['void']]],
    'AttachedTo' : [ 0x18, ['pointer', ['_DEVICE_OBJECT']]],
    'StartIoCount' : [ 0x1c, ['long']],
    'StartIoKey' : [ 0x20, ['long']],
    'StartIoFlags' : [ 0x24, ['unsigned long']],
    'Vpb' : [ 0x28, ['pointer', ['_VPB']]],
    'DependencyNode' : [ 0x2c, ['pointer', ['void']]],
    'InterruptContext' : [ 0x30, ['pointer', ['void']]],
    'InterruptCount' : [ 0x34, ['long']],
    'VerifierContext' : [ 0x38, ['pointer', ['void']]],
} ],
  '_GROUP_AFFINITY' : [ 0xc, {
    'Mask' : [ 0x0, ['unsigned long']],
    'Group' : [ 0x4, ['unsigned short']],
    'Reserved' : [ 0x6, ['array', 3, ['unsigned short']]],
} ],
  '_PNP_ASSIGN_RESOURCES_CONTEXT' : [ 0xc, {
    'IncludeFailedDevices' : [ 0x0, ['unsigned long']],
    'DeviceCount' : [ 0x4, ['unsigned long']],
    'DeviceList' : [ 0x8, ['array', 1, ['pointer', ['_DEVICE_OBJECT']]]],
} ],
  '_PNP_RESOURCE_REQUEST' : [ 0x28, {
    'PhysicalDevice' : [ 0x0, ['pointer', ['_DEVICE_OBJECT']]],
    'Flags' : [ 0x4, ['unsigned long']],
    'AllocationType' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'ArbiterRequestLegacyReported', 1: u'ArbiterRequestHalReported', 2: u'ArbiterRequestLegacyAssigned', 3: u'ArbiterRequestPnpDetected', 4: u'ArbiterRequestPnpEnumerated', -1: u'ArbiterRequestUndefined'})]],
    'Priority' : [ 0xc, ['unsigned long']],
    'Position' : [ 0x10, ['unsigned long']],
    'ResourceRequirements' : [ 0x14, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'ReqList' : [ 0x18, ['pointer', ['void']]],
    'ResourceAssignment' : [ 0x1c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'TranslatedResourceAssignment' : [ 0x20, ['pointer', ['_CM_RESOURCE_LIST']]],
    'Status' : [ 0x24, ['long']],
} ],
  '_IO_RESOURCE_REQUIREMENTS_LIST' : [ 0x48, {
    'ListSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'SlotNumber' : [ 0xc, ['unsigned long']],
    'Reserved' : [ 0x10, ['array', 3, ['unsigned long']]],
    'AlternativeLists' : [ 0x1c, ['unsigned long']],
    'List' : [ 0x20, ['array', 1, ['_IO_RESOURCE_LIST']]],
} ],
  '_EXCEPTION_RECORD64' : [ 0x98, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['unsigned long long']],
    'ExceptionAddress' : [ 0x10, ['unsigned long long']],
    'NumberParameters' : [ 0x18, ['unsigned long']],
    '__unusedAlignment' : [ 0x1c, ['unsigned long']],
    'ExceptionInformation' : [ 0x20, ['array', 15, ['unsigned long long']]],
} ],
  '_EXCEPTION_RECORD32' : [ 0x50, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['unsigned long']],
    'ExceptionAddress' : [ 0xc, ['unsigned long']],
    'NumberParameters' : [ 0x10, ['unsigned long']],
    'ExceptionInformation' : [ 0x14, ['array', 15, ['unsigned long']]],
} ],
  '_DBGKM_EXCEPTION64' : [ 0xa0, {
    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD64']],
    'FirstChance' : [ 0x98, ['unsigned long']],
} ],
  '_DBGKM_EXCEPTION32' : [ 0x54, {
    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD32']],
    'FirstChance' : [ 0x50, ['unsigned long']],
} ],
  '_X86_KTRAP_FRAME' : [ 0x8c, {
    'DbgEbp' : [ 0x0, ['unsigned long']],
    'DbgEip' : [ 0x4, ['unsigned long']],
    'DbgArgMark' : [ 0x8, ['unsigned long']],
    'DbgArgPointer' : [ 0xc, ['unsigned long']],
    'TempSegCs' : [ 0x10, ['unsigned long']],
    'TempEsp' : [ 0x14, ['unsigned long']],
    'Dr0' : [ 0x18, ['unsigned long']],
    'Dr1' : [ 0x1c, ['unsigned long']],
    'Dr2' : [ 0x20, ['unsigned long']],
    'Dr3' : [ 0x24, ['unsigned long']],
    'Dr6' : [ 0x28, ['unsigned long']],
    'Dr7' : [ 0x2c, ['unsigned long']],
    'SegGs' : [ 0x30, ['unsigned long']],
    'SegEs' : [ 0x34, ['unsigned long']],
    'SegDs' : [ 0x38, ['unsigned long']],
    'Edx' : [ 0x3c, ['unsigned long']],
    'Ecx' : [ 0x40, ['unsigned long']],
    'Eax' : [ 0x44, ['unsigned long']],
    'PreviousPreviousMode' : [ 0x48, ['unsigned char']],
    'EntropyQueueDpc' : [ 0x49, ['unsigned char']],
    'Reserved' : [ 0x4a, ['array', 2, ['unsigned char']]],
    'ExceptionList' : [ 0x4c, ['unsigned long']],
    'SegFs' : [ 0x50, ['unsigned long']],
    'Edi' : [ 0x54, ['unsigned long']],
    'Esi' : [ 0x58, ['unsigned long']],
    'Ebx' : [ 0x5c, ['unsigned long']],
    'Ebp' : [ 0x60, ['unsigned long']],
    'ErrCode' : [ 0x64, ['unsigned long']],
    'Eip' : [ 0x68, ['unsigned long']],
    'SegCs' : [ 0x6c, ['unsigned long']],
    'EFlags' : [ 0x70, ['unsigned long']],
    'HardwareEsp' : [ 0x74, ['unsigned long']],
    'HardwareSegSs' : [ 0x78, ['unsigned long']],
    'V86Es' : [ 0x7c, ['unsigned long']],
    'V86Ds' : [ 0x80, ['unsigned long']],
    'V86Fs' : [ 0x84, ['unsigned long']],
    'V86Gs' : [ 0x88, ['unsigned long']],
} ],
  '_X86_KTRAP_FRAME_BLUE' : [ 0x8c, {
    'DbgEbp' : [ 0x0, ['unsigned long']],
    'DbgEip' : [ 0x4, ['unsigned long']],
    'DbgArgMark' : [ 0x8, ['unsigned long']],
    'TempSegCs' : [ 0xc, ['unsigned short']],
    'Logging' : [ 0xe, ['unsigned char']],
    'FrameType' : [ 0xf, ['unsigned char']],
    'TempEsp' : [ 0x10, ['unsigned long']],
    'Dr0' : [ 0x14, ['unsigned long']],
    'Dr1' : [ 0x18, ['unsigned long']],
    'Dr2' : [ 0x1c, ['unsigned long']],
    'Dr3' : [ 0x20, ['unsigned long']],
    'Dr6' : [ 0x24, ['unsigned long']],
    'Dr7' : [ 0x28, ['unsigned long']],
    'SegGs' : [ 0x2c, ['unsigned long']],
    'SegEs' : [ 0x30, ['unsigned long']],
    'SegDs' : [ 0x34, ['unsigned long']],
    'Edx' : [ 0x38, ['unsigned long']],
    'Ecx' : [ 0x3c, ['unsigned long']],
    'Eax' : [ 0x40, ['unsigned long']],
    'PreviousPreviousMode' : [ 0x44, ['unsigned char']],
    'EntropyQueueDpc' : [ 0x45, ['unsigned char']],
    'Reserved' : [ 0x46, ['array', 2, ['unsigned char']]],
    'MxCsr' : [ 0x48, ['unsigned long']],
    'ExceptionList' : [ 0x4c, ['unsigned long']],
    'SegFs' : [ 0x50, ['unsigned long']],
    'Edi' : [ 0x54, ['unsigned long']],
    'Esi' : [ 0x58, ['unsigned long']],
    'Ebx' : [ 0x5c, ['unsigned long']],
    'Ebp' : [ 0x60, ['unsigned long']],
    'ErrCode' : [ 0x64, ['unsigned long']],
    'Eip' : [ 0x68, ['unsigned long']],
    'SegCs' : [ 0x6c, ['unsigned long']],
    'EFlags' : [ 0x70, ['unsigned long']],
    'HardwareEsp' : [ 0x74, ['unsigned long']],
    'HardwareSegSs' : [ 0x78, ['unsigned long']],
    'V86Es' : [ 0x7c, ['unsigned long']],
    'V86Ds' : [ 0x80, ['unsigned long']],
    'V86Fs' : [ 0x84, ['unsigned long']],
    'V86Gs' : [ 0x88, ['unsigned long']],
} ],
  '_DBGKD_LOAD_SYMBOLS64' : [ 0x28, {
    'PathNameLength' : [ 0x0, ['unsigned long']],
    'BaseOfDll' : [ 0x8, ['unsigned long long']],
    'ProcessId' : [ 0x10, ['unsigned long long']],
    'CheckSum' : [ 0x18, ['unsigned long']],
    'SizeOfImage' : [ 0x1c, ['unsigned long']],
    'UnloadSymbols' : [ 0x20, ['unsigned char']],
} ],
  '_DBGKD_LOAD_SYMBOLS32' : [ 0x18, {
    'PathNameLength' : [ 0x0, ['unsigned long']],
    'BaseOfDll' : [ 0x4, ['unsigned long']],
    'ProcessId' : [ 0x8, ['unsigned long']],
    'CheckSum' : [ 0xc, ['unsigned long']],
    'SizeOfImage' : [ 0x10, ['unsigned long']],
    'UnloadSymbols' : [ 0x14, ['unsigned char']],
} ],
  '_DBGKD_READ_MEMORY64' : [ 0x10, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
    'TransferCount' : [ 0x8, ['unsigned long']],
    'ActualBytesRead' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_READ_MEMORY32' : [ 0xc, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
    'TransferCount' : [ 0x4, ['unsigned long']],
    'ActualBytesRead' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_MEMORY64' : [ 0x10, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
    'TransferCount' : [ 0x8, ['unsigned long']],
    'ActualBytesWritten' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_WRITE_MEMORY32' : [ 0xc, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
    'TransferCount' : [ 0x4, ['unsigned long']],
    'ActualBytesWritten' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_BREAKPOINT64' : [ 0x10, {
    'BreakPointAddress' : [ 0x0, ['unsigned long long']],
    'BreakPointHandle' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_BREAKPOINT32' : [ 0x8, {
    'BreakPointAddress' : [ 0x0, ['unsigned long']],
    'BreakPointHandle' : [ 0x4, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO64' : [ 0x10, {
    'IoAddress' : [ 0x0, ['unsigned long long']],
    'DataSize' : [ 0x8, ['unsigned long']],
    'DataValue' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO32' : [ 0xc, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'IoAddress' : [ 0x4, ['unsigned long']],
    'DataValue' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO_EXTENDED64' : [ 0x20, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['unsigned long']],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'AddressSpace' : [ 0xc, ['unsigned long']],
    'IoAddress' : [ 0x10, ['unsigned long long']],
    'DataValue' : [ 0x18, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO_EXTENDED32' : [ 0x18, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['unsigned long']],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'AddressSpace' : [ 0xc, ['unsigned long']],
    'IoAddress' : [ 0x10, ['unsigned long']],
    'DataValue' : [ 0x14, ['unsigned long']],
} ],
  '_DBGKD_SET_SPECIAL_CALL32' : [ 0x4, {
    'SpecialCall' : [ 0x0, ['unsigned long']],
} ],
  '_DBGKD_SET_SPECIAL_CALL64' : [ 0x8, {
    'SpecialCall' : [ 0x0, ['unsigned long long']],
} ],
  '_DBGKD_SET_INTERNAL_BREAKPOINT32' : [ 0x8, {
    'BreakpointAddress' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
} ],
  '_DBGKD_SET_INTERNAL_BREAKPOINT64' : [ 0x10, {
    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_GET_INTERNAL_BREAKPOINT64' : [ 0x20, {
    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x8, ['unsigned long']],
    'Calls' : [ 0xc, ['unsigned long']],
    'MaxCallsPerPeriod' : [ 0x10, ['unsigned long']],
    'MinInstructions' : [ 0x14, ['unsigned long']],
    'MaxInstructions' : [ 0x18, ['unsigned long']],
    'TotalInstructions' : [ 0x1c, ['unsigned long']],
} ],
  '_DBGKD_GET_INTERNAL_BREAKPOINT32' : [ 0x1c, {
    'BreakpointAddress' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'Calls' : [ 0x8, ['unsigned long']],
    'MaxCallsPerPeriod' : [ 0xc, ['unsigned long']],
    'MinInstructions' : [ 0x10, ['unsigned long']],
    'MaxInstructions' : [ 0x14, ['unsigned long']],
    'TotalInstructions' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1c0d' : [ 0x28, {
    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT64']],
    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
    'ReadWriteIo' : [ 0x0, ['_DBGKD_READ_WRITE_IO64']],
    'ReadWriteIoExtended' : [ 0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED64']],
    'QuerySpecialCalls' : [ 0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
    'SetSpecialCall' : [ 0x0, ['_DBGKD_SET_SPECIAL_CALL64']],
    'SetInternalBreakpoint' : [ 0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT64']],
    'GetInternalBreakpoint' : [ 0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT64']],
    'GetVersion64' : [ 0x0, ['_DBGKD_GET_VERSION64']],
    'BreakPointEx' : [ 0x0, ['_DBGKD_BREAKPOINTEX']],
    'ReadWriteMsr' : [ 0x0, ['_DBGKD_READ_WRITE_MSR']],
    'SearchMemory' : [ 0x0, ['_DBGKD_SEARCH_MEMORY']],
    'GetSetBusData' : [ 0x0, ['_DBGKD_GET_SET_BUS_DATA']],
    'FillMemory' : [ 0x0, ['_DBGKD_FILL_MEMORY']],
    'QueryMemory' : [ 0x0, ['_DBGKD_QUERY_MEMORY']],
    'SwitchPartition' : [ 0x0, ['_DBGKD_SWITCH_PARTITION']],
    'GetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
    'SetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
    'WriteCustomBreakPoint' : [ 0x0, ['_DBGKD_WRITE_CUSTOM_BREAKPOINT']],
} ],
  '_DBGKD_MANIPULATE_STATE64' : [ 0x38, {
    'ApiNumber' : [ 0x0, ['unsigned long']],
    'ProcessorLevel' : [ 0x4, ['unsigned short']],
    'Processor' : [ 0x6, ['unsigned short']],
    'ReturnStatus' : [ 0x8, ['long']],
    'u' : [ 0x10, ['__unnamed_1c0d']],
} ],
  '__unnamed_1c14' : [ 0x28, {
    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY32']],
    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY32']],
    'ReadMemory64' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
    'WriteMemory64' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT32']],
    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
    'ReadWriteIo' : [ 0x0, ['_DBGKD_READ_WRITE_IO32']],
    'ReadWriteIoExtended' : [ 0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED32']],
    'QuerySpecialCalls' : [ 0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
    'SetSpecialCall' : [ 0x0, ['_DBGKD_SET_SPECIAL_CALL32']],
    'SetInternalBreakpoint' : [ 0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT32']],
    'GetInternalBreakpoint' : [ 0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT32']],
    'GetVersion32' : [ 0x0, ['_DBGKD_GET_VERSION32']],
    'BreakPointEx' : [ 0x0, ['_DBGKD_BREAKPOINTEX']],
    'ReadWriteMsr' : [ 0x0, ['_DBGKD_READ_WRITE_MSR']],
    'SearchMemory' : [ 0x0, ['_DBGKD_SEARCH_MEMORY']],
    'GetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
    'SetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
} ],
  '_DBGKD_MANIPULATE_STATE32' : [ 0x34, {
    'ApiNumber' : [ 0x0, ['unsigned long']],
    'ProcessorLevel' : [ 0x4, ['unsigned short']],
    'Processor' : [ 0x6, ['unsigned short']],
    'ReturnStatus' : [ 0x8, ['long']],
    'u' : [ 0xc, ['__unnamed_1c14']],
} ],
  '_DBGKD_READ_WRITE_MSR' : [ 0xc, {
    'Msr' : [ 0x0, ['unsigned long']],
    'DataValueLow' : [ 0x4, ['unsigned long']],
    'DataValueHigh' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_BREAKPOINTEX' : [ 0x8, {
    'BreakPointCount' : [ 0x0, ['unsigned long']],
    'ContinueStatus' : [ 0x4, ['long']],
} ],
  '_DBGKD_SEARCH_MEMORY' : [ 0x18, {
    'SearchAddress' : [ 0x0, ['unsigned long long']],
    'FoundAddress' : [ 0x0, ['unsigned long long']],
    'SearchLength' : [ 0x8, ['unsigned long long']],
    'PatternLength' : [ 0x10, ['unsigned long']],
} ],
  '_DBGKD_RESTORE_BREAKPOINT' : [ 0x4, {
    'BreakPointHandle' : [ 0x0, ['unsigned long']],
} ],
  '_DBGKD_CONTINUE' : [ 0x4, {
    'ContinueStatus' : [ 0x0, ['long']],
} ],
  '_DBGKD_CONTINUE2' : [ 0x20, {
    'ContinueStatus' : [ 0x0, ['long']],
    'ControlSet' : [ 0x4, ['_X86_DBGKD_CONTROL_SET']],
    'AnyControlSet' : [ 0x4, ['_DBGKD_ANY_CONTROL_SET']],
} ],
  '_DEVICE_MANAGE_DATA_SET_ATTRIBUTES' : [ 0x1c, {
    'Size' : [ 0x0, ['unsigned long']],
    'Action' : [ 0x4, ['unsigned long']],
    'Flags' : [ 0x8, ['unsigned long']],
    'ParameterBlockOffset' : [ 0xc, ['unsigned long']],
    'ParameterBlockLength' : [ 0x10, ['unsigned long']],
    'DataSetRangesOffset' : [ 0x14, ['unsigned long']],
    'DataSetRangesLength' : [ 0x18, ['unsigned long']],
} ],
  '_DEVICE_DATA_SET_RANGE' : [ 0x10, {
    'StartingOffset' : [ 0x0, ['long long']],
    'LengthInBytes' : [ 0x8, ['unsigned long long']],
} ],
  '_DEVICE_DSM_DEFINITION' : [ 0x1c, {
    'Action' : [ 0x0, ['unsigned long']],
    'SingleRange' : [ 0x4, ['unsigned char']],
    'ParameterBlockAlignment' : [ 0x8, ['unsigned long']],
    'ParameterBlockLength' : [ 0xc, ['unsigned long']],
    'HasOutput' : [ 0x10, ['unsigned char']],
    'OutputBlockAlignment' : [ 0x14, ['unsigned long']],
    'OutputBlockLength' : [ 0x18, ['unsigned long']],
} ],
  '_DEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT' : [ 0x24, {
    'Size' : [ 0x0, ['unsigned long']],
    'Action' : [ 0x4, ['unsigned long']],
    'Flags' : [ 0x8, ['unsigned long']],
    'OperationStatus' : [ 0xc, ['unsigned long']],
    'ExtendedError' : [ 0x10, ['unsigned long']],
    'TargetDetailedError' : [ 0x14, ['unsigned long']],
    'ReservedStatus' : [ 0x18, ['unsigned long']],
    'OutputBlockOffset' : [ 0x1c, ['unsigned long']],
    'OutputBlockLength' : [ 0x20, ['unsigned long']],
} ],
  '_PEP_ACPI_RESOURCE' : [ 0x48, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'IoMemory' : [ 0x0, ['_PEP_ACPI_IO_MEMORY_RESOURCE']],
    'Interrupt' : [ 0x0, ['_PEP_ACPI_INTERRUPT_RESOURCE']],
    'Gpio' : [ 0x0, ['_PEP_ACPI_GPIO_RESOURCE']],
    'SpbI2c' : [ 0x0, ['_PEP_ACPI_SPB_I2C_RESOURCE']],
    'SpbSpi' : [ 0x0, ['_PEP_ACPI_SPB_SPI_RESOURCE']],
    'SpbUart' : [ 0x0, ['_PEP_ACPI_SPB_UART_RESOURCE']],
    'ExtendedAddress' : [ 0x0, ['_PEP_ACPI_EXTENDED_ADDRESS']],
} ],
  '_PEP_ACPI_IO_MEMORY_RESOURCE' : [ 0x20, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'Information' : [ 0x4, ['unsigned char']],
    'MinimumAddress' : [ 0x8, ['_LARGE_INTEGER']],
    'MaximumAddress' : [ 0x10, ['_LARGE_INTEGER']],
    'Alignment' : [ 0x18, ['unsigned long']],
    'Length' : [ 0x1c, ['unsigned long']],
} ],
  '_PEP_ACPI_INTERRUPT_RESOURCE' : [ 0x18, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'InterruptType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'LevelSensitive', 1: u'Latched'})]],
    'InterruptPolarity' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptPolarityUnknown', 1: u'InterruptRisingEdge', 2: u'InterruptFallingEdge', 3: u'InterruptActiveBothTriggerLow', 4: u'InterruptActiveBothTriggerHigh'})]],
    'Flags' : [ 0xc, ['_PEP_ACPI_RESOURCE_FLAGS']],
    'Count' : [ 0x10, ['unsigned char']],
    'Pins' : [ 0x14, ['pointer', ['unsigned long']]],
} ],
  '_PEP_ACPI_GPIO_RESOURCE' : [ 0x30, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'Flags' : [ 0x4, ['_PEP_ACPI_RESOURCE_FLAGS']],
    'InterruptType' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'LevelSensitive', 1: u'Latched'})]],
    'InterruptPolarity' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptPolarityUnknown', 1: u'InterruptRisingEdge', 2: u'InterruptFallingEdge', 3: u'InterruptActiveBothTriggerLow', 4: u'InterruptActiveBothTriggerHigh'})]],
    'PinConfig' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: u'PullDefault', 1: u'PullUp', 2: u'PullDown', 3: u'PullNone'})]],
    'IoRestrictionType' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: u'IoRestrictionNone', 1: u'IoRestrictionInputOnly', 2: u'IoRestrictionOutputOnly', 3: u'IoRestrictionNoneAndPreserve'})]],
    'DriveStrength' : [ 0x18, ['unsigned short']],
    'DebounceTimeout' : [ 0x1a, ['unsigned short']],
    'PinTable' : [ 0x1c, ['pointer', ['wchar']]],
    'PinCount' : [ 0x20, ['unsigned short']],
    'ResourceSourceIndex' : [ 0x22, ['unsigned char']],
    'ResourceSourceName' : [ 0x24, ['pointer', ['_UNICODE_STRING']]],
    'VendorData' : [ 0x28, ['pointer', ['unsigned char']]],
    'VendorDataLength' : [ 0x2c, ['unsigned short']],
} ],
  '_PEP_ACPI_SPB_I2C_RESOURCE' : [ 0x20, {
    'SpbCommon' : [ 0x0, ['_PEP_ACPI_SPB_RESOURCE']],
    'ConnectionSpeed' : [ 0x18, ['unsigned long']],
    'SlaveAddress' : [ 0x1c, ['unsigned short']],
} ],
  '_PEP_ACPI_SPB_UART_RESOURCE' : [ 0x24, {
    'SpbCommon' : [ 0x0, ['_PEP_ACPI_SPB_RESOURCE']],
    'BaudRate' : [ 0x18, ['unsigned long']],
    'RxBufferSize' : [ 0x1c, ['unsigned short']],
    'TxBufferSize' : [ 0x1e, ['unsigned short']],
    'Parity' : [ 0x20, ['unsigned char']],
    'LinesInUse' : [ 0x21, ['unsigned char']],
} ],
  '_PEP_ACPI_SPB_SPI_RESOURCE' : [ 0x24, {
    'SpbCommon' : [ 0x0, ['_PEP_ACPI_SPB_RESOURCE']],
    'ConnectionSpeed' : [ 0x18, ['unsigned long']],
    'DataBitLength' : [ 0x1c, ['unsigned char']],
    'Phase' : [ 0x1d, ['unsigned char']],
    'Polarity' : [ 0x1e, ['unsigned char']],
    'DeviceSelection' : [ 0x20, ['unsigned short']],
} ],
  '_PEP_ACPI_EXTENDED_ADDRESS' : [ 0x48, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'Flags' : [ 0x4, ['_PEP_ACPI_RESOURCE_FLAGS']],
    'ResourceFlags' : [ 0x8, ['unsigned char']],
    'GeneralFlags' : [ 0x9, ['unsigned char']],
    'TypeSpecificFlags' : [ 0xa, ['unsigned char']],
    'RevisionId' : [ 0xb, ['unsigned char']],
    'Reserved' : [ 0xc, ['unsigned char']],
    'Granularity' : [ 0x10, ['unsigned long long']],
    'MinimumAddress' : [ 0x18, ['unsigned long long']],
    'MaximumAddress' : [ 0x20, ['unsigned long long']],
    'TranslationAddress' : [ 0x28, ['unsigned long long']],
    'AddressLength' : [ 0x30, ['unsigned long long']],
    'TypeAttribute' : [ 0x38, ['unsigned long long']],
    'DescriptorName' : [ 0x40, ['pointer', ['_UNICODE_STRING']]],
} ],
  '_PPM_PLATFORM_STATES' : [ 0x100, {
    'StateCount' : [ 0x0, ['unsigned long']],
    'InterfaceVersion' : [ 0x4, ['unsigned long']],
    'ProcessorCount' : [ 0x8, ['unsigned long']],
    'CoordinatedInterface' : [ 0xc, ['unsigned char']],
    'IdleTest' : [ 0x10, ['pointer', ['void']]],
    'IdlePreExecute' : [ 0x14, ['pointer', ['void']]],
    'IdleComplete' : [ 0x18, ['pointer', ['void']]],
    'QueryPlatformStateResidency' : [ 0x1c, ['pointer', ['void']]],
    'Accounting' : [ 0x20, ['pointer', ['_PLATFORM_IDLE_ACCOUNTING']]],
    'DeepSleepEnabled' : [ 0x24, ['unsigned char']],
    'State' : [ 0x40, ['array', 1, ['_PPM_PLATFORM_STATE']]],
} ],
  '_POP_CPU_INFO' : [ 0x10, {
    'Eax' : [ 0x0, ['unsigned long']],
    'Ebx' : [ 0x4, ['unsigned long']],
    'Ecx' : [ 0x8, ['unsigned long']],
    'Edx' : [ 0xc, ['unsigned long']],
} ],
  '_POP_PPM_PROFILE' : [ 0x228, {
    'Name' : [ 0x0, ['pointer', ['wchar']]],
    'Id' : [ 0x4, ['unsigned char']],
    'Guid' : [ 0x8, ['_GUID']],
    'Flags' : [ 0x18, ['unsigned long']],
    'Priority' : [ 0x1c, ['unsigned char']],
    'Settings' : [ 0x20, ['array', 2, ['_PPM_ENGINE_SETTINGS']]],
    'StartTime' : [ 0x200, ['unsigned long long']],
    'Count' : [ 0x208, ['unsigned long long']],
    'MaxDuration' : [ 0x210, ['unsigned long long']],
    'MinDuration' : [ 0x218, ['unsigned long long']],
    'TotalDuration' : [ 0x220, ['unsigned long long']],
} ],
  '_PPM_ENGINE_SETTINGS' : [ 0xf0, {
    'ExplicitSetting' : [ 0x0, ['array', 2, ['_PPM_POLICY_SETTINGS_MASK']]],
    'ThrottlingPolicy' : [ 0x10, ['unsigned char']],
    'PerfTimeCheck' : [ 0x14, ['unsigned long']],
    'PerfHistoryCount' : [ 0x18, ['array', 2, ['unsigned char']]],
    'PerfMinPolicy' : [ 0x1a, ['array', 2, ['unsigned char']]],
    'PerfMaxPolicy' : [ 0x1c, ['array', 2, ['unsigned char']]],
    'PerfDecreaseTime' : [ 0x1e, ['array', 2, ['unsigned char']]],
    'PerfIncreaseTime' : [ 0x20, ['array', 2, ['unsigned char']]],
    'PerfDecreasePolicy' : [ 0x22, ['array', 2, ['unsigned char']]],
    'PerfIncreasePolicy' : [ 0x24, ['array', 2, ['unsigned char']]],
    'PerfDecreaseThreshold' : [ 0x26, ['array', 2, ['unsigned char']]],
    'PerfIncreaseThreshold' : [ 0x28, ['array', 2, ['unsigned char']]],
    'PerfFrequencyCap' : [ 0x2c, ['array', 2, ['unsigned long']]],
    'PerfBoostPolicy' : [ 0x34, ['unsigned long']],
    'PerfBoostMode' : [ 0x38, ['unsigned long']],
    'PerfReductionTolerance' : [ 0x3c, ['unsigned long']],
    'EnergyPerfPreference' : [ 0x40, ['array', 2, ['unsigned long']]],
    'AutonomousActivityWindow' : [ 0x48, ['unsigned long']],
    'AutonomousPreference' : [ 0x4c, ['unsigned char']],
    'LatencyHintPerf' : [ 0x4d, ['array', 2, ['unsigned char']]],
    'LatencyHintUnpark' : [ 0x4f, ['array', 2, ['unsigned char']]],
    'ResponsivenessDisableThreshold' : [ 0x54, ['array', 2, ['unsigned long']]],
    'ResponsivenessEnableThreshold' : [ 0x5c, ['array', 2, ['unsigned long']]],
    'ResponsivenessDisableTime' : [ 0x64, ['array', 2, ['unsigned char']]],
    'ResponsivenessEnableTime' : [ 0x66, ['array', 2, ['unsigned char']]],
    'ResponsivenessEppCeiling' : [ 0x68, ['array', 2, ['unsigned long']]],
    'ResponsivenessPerfFloor' : [ 0x70, ['array', 2, ['unsigned long']]],
    'DutyCycling' : [ 0x78, ['unsigned char']],
    'ParkingPerfState' : [ 0x79, ['array', 2, ['unsigned char']]],
    'DistributeUtility' : [ 0x7b, ['unsigned char']],
    'CoreParkingOverUtilizationThreshold' : [ 0x7c, ['unsigned char']],
    'CoreParkingConcurrencyThreshold' : [ 0x7d, ['unsigned char']],
    'CoreParkingHeadroomThreshold' : [ 0x7e, ['unsigned char']],
    'CoreParkingDistributionThreshold' : [ 0x7f, ['unsigned char']],
    'CoreParkingDecreasePolicy' : [ 0x80, ['unsigned char']],
    'CoreParkingIncreasePolicy' : [ 0x81, ['unsigned char']],
    'CoreParkingDecreaseTime' : [ 0x84, ['unsigned long']],
    'CoreParkingIncreaseTime' : [ 0x88, ['unsigned long']],
    'CoreParkingMinCores' : [ 0x8c, ['array', 2, ['unsigned char']]],
    'CoreParkingMaxCores' : [ 0x8e, ['array', 2, ['unsigned char']]],
    'SoftParkLatency' : [ 0x90, ['unsigned long']],
    'AllowScaling' : [ 0x94, ['unsigned char']],
    'IdleDisabled' : [ 0x95, ['unsigned char']],
    'IdleTimeCheck' : [ 0x98, ['unsigned long']],
    'IdleDemotePercent' : [ 0x9c, ['unsigned char']],
    'IdlePromotePercent' : [ 0x9d, ['unsigned char']],
    'IdleStateMax' : [ 0x9e, ['unsigned char']],
    'HeteroDecreaseTime' : [ 0x9f, ['unsigned char']],
    'HeteroIncreaseTime' : [ 0xa0, ['unsigned char']],
    'HeteroDecreaseThreshold' : [ 0xa1, ['array', 32, ['unsigned char']]],
    'HeteroIncreaseThreshold' : [ 0xc1, ['array', 32, ['unsigned char']]],
    'Class0FloorPerformance' : [ 0xe1, ['unsigned char']],
    'Class1InitialPerformance' : [ 0xe2, ['unsigned char']],
    'ThreadPolicies' : [ 0xe4, ['array', 2, ['Enumeration', dict(target = 'long', choices = {0: u'KHeteroCpuPolicyAll', 1: u'KHeteroCpuPolicyLarge', 2: u'KHeteroCpuPolicyLargeOrIdle', 3: u'KHeteroCpuPolicySmall', 4: u'KHeteroCpuPolicySmallOrIdle', 5: u'KHeteroCpuPolicyStaticMax', 6: u'KHeteroCpuPolicyBiasedSmall', 7: u'KHeteroCpuPolicyBiasedLarge', 8: u'KHeteroCpuPolicyDefault', 9: u'KHeteroCpuPolicyMax'})]]],
} ],
  '_ESERVERSILO_GLOBALS' : [ 0x2a0, {
    'ObSiloState' : [ 0x0, ['_OBP_SILODRIVERSTATE']],
    'SeSiloState' : [ 0x1a4, ['_SEP_SILOSTATE']],
    'SeRmSiloState' : [ 0x1c0, ['_SEP_RM_LSA_CONNECTION_STATE']],
    'EtwSiloState' : [ 0x1f0, ['pointer', ['_ETW_SILODRIVERSTATE']]],
    'MiSessionLeaderProcess' : [ 0x1f4, ['pointer', ['_EPROCESS']]],
    'ExpDefaultErrorPortProcess' : [ 0x1f8, ['pointer', ['_EPROCESS']]],
    'ExpDefaultErrorPort' : [ 0x1fc, ['pointer', ['void']]],
    'HardErrorState' : [ 0x200, ['unsigned long']],
    'ExpLicenseState' : [ 0x204, ['pointer', ['_EXP_LICENSE_STATE']]],
    'WnfSiloState' : [ 0x208, ['_WNF_SILODRIVERSTATE']],
    'DbgkSiloState' : [ 0x238, ['_DBGK_SILOSTATE']],
    'PsProtectedCurrentDirectory' : [ 0x248, ['_UNICODE_STRING']],
    'PsProtectedEnvironment' : [ 0x250, ['_UNICODE_STRING']],
    'ApiSetSection' : [ 0x258, ['pointer', ['void']]],
    'ApiSetSchema' : [ 0x25c, ['pointer', ['void']]],
    'OneCoreForwardersEnabled' : [ 0x260, ['unsigned char']],
    'NtSystemRoot' : [ 0x264, ['_UNICODE_STRING']],
    'SiloRootDirectoryName' : [ 0x26c, ['_UNICODE_STRING']],
    'Storage' : [ 0x274, ['pointer', ['_PSP_STORAGE']]],
    'State' : [ 0x278, ['Enumeration', dict(target = 'long', choices = {0: u'SERVERSILO_INITING', 1: u'SERVERSILO_STARTED', 2: u'SERVERSILO_SHUTTING_DOWN', 3: u'SERVERSILO_TERMINATING', 4: u'SERVERSILO_TERMINATED'})]],
    'ExitStatus' : [ 0x27c, ['long']],
    'DeleteEvent' : [ 0x280, ['pointer', ['_KEVENT']]],
    'UserSharedData' : [ 0x284, ['pointer', ['_SILO_USER_SHARED_DATA']]],
    'UserSharedSection' : [ 0x288, ['pointer', ['void']]],
    'TerminateWorkItem' : [ 0x28c, ['_WORK_QUEUE_ITEM']],
    'IsDownlevelContainer' : [ 0x29c, ['unsigned char']],
} ],
  '_SILO_USER_SHARED_DATA' : [ 0x248, {
    'ServiceSessionId' : [ 0x0, ['unsigned long']],
    'ActiveConsoleId' : [ 0x4, ['unsigned long']],
    'ConsoleSessionForegroundProcessId' : [ 0x8, ['long long']],
    'NtProductType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {1: u'NtProductWinNt', 2: u'NtProductLanManNt', 3: u'NtProductServer'})]],
    'SuiteMask' : [ 0x14, ['unsigned long']],
    'SharedUserSessionId' : [ 0x18, ['unsigned long']],
    'IsMultiSessionSku' : [ 0x1c, ['unsigned char']],
    'NtSystemRoot' : [ 0x1e, ['array', 260, ['wchar']]],
    'UserModeGlobalLogger' : [ 0x226, ['array', 16, ['unsigned short']]],
} ],
  '_POP_FX_COMPONENT_FLAGS' : [ 0x8, {
    'Value' : [ 0x0, ['long']],
    'Value2' : [ 0x4, ['long']],
    'RefCount' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 30, native_type='unsigned long')]],
    'Idling' : [ 0x0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'Active' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'CriticalIdleOverride' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ResidentOverride' : [ 0x4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Reserved' : [ 0x4, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
} ],
  '_POP_FX_PERF_FLAGS' : [ 0x4, {
    'Value' : [ 0x0, ['long']],
    'Progress' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 27, native_type='unsigned long')]],
    'Synchronicity' : [ 0x0, ['BitField', dict(start_bit = 27, end_bit = 29, native_type='unsigned long')]],
    'RequestPepCompleted' : [ 0x0, ['BitField', dict(start_bit = 29, end_bit = 30, native_type='unsigned long')]],
    'RequestSucceeded' : [ 0x0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'NestedCallback' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
} ],
  '_POP_FX_DEVICE_STATUS' : [ 0x4, {
    'Value' : [ 0x0, ['long']],
    'SystemTransition' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PepD0Notify' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'IdleTimerOn' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'IgnoreIdleTimeout' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'IrpInUse' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'IrpPending' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DPNRDeviceNotified' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DPNRReceivedFromPep' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'IrpFirstPendingIndex' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'IrpLastPendingIndex' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'SIrpBlocked' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'BlockFastResume' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DirectedPoweredDown' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'DirectedTransitionInProgress' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 32, native_type='unsigned long')]],
} ],
  '_POP_RW_LOCK' : [ 0x8, {
    'Lock' : [ 0x0, ['_EX_PUSH_LOCK']],
    'Thread' : [ 0x4, ['pointer', ['_KTHREAD']]],
} ],
  '_VOLUME_CACHE_MAP' : [ 0x90, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteCode' : [ 0x2, ['short']],
    'UseCount' : [ 0x4, ['unsigned long']],
    'DeviceObject' : [ 0x8, ['pointer', ['_DEVICE_OBJECT']]],
    'VolumeCacheMapLinks' : [ 0xc, ['_LIST_ENTRY']],
    'DirtyPages' : [ 0x14, ['unsigned long']],
    'LogHandleContext' : [ 0x18, ['_LOG_HANDLE_CONTEXT']],
    'Flags' : [ 0x80, ['unsigned long']],
    'PagesQueuedToDisk' : [ 0x84, ['unsigned long']],
    'LoggedPagesQueuedToDisk' : [ 0x88, ['unsigned long']],
} ],
  '_SHARED_CACHE_MAP' : [ 0x188, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'OpenCount' : [ 0x4, ['unsigned long']],
    'FileSize' : [ 0x8, ['_LARGE_INTEGER']],
    'BcbList' : [ 0x10, ['_LIST_ENTRY']],
    'SectionSize' : [ 0x18, ['_LARGE_INTEGER']],
    'ValidDataLength' : [ 0x20, ['_LARGE_INTEGER']],
    'ValidDataGoal' : [ 0x28, ['_LARGE_INTEGER']],
    'InitialVacbs' : [ 0x30, ['array', 4, ['pointer', ['_VACB']]]],
    'Vacbs' : [ 0x40, ['pointer', ['pointer', ['_VACB']]]],
    'FileObjectFastRef' : [ 0x44, ['_EX_FAST_REF']],
    'VacbLock' : [ 0x48, ['_EX_PUSH_LOCK']],
    'DirtyPages' : [ 0x4c, ['unsigned long']],
    'LoggedStreamLinks' : [ 0x50, ['_LIST_ENTRY']],
    'SharedCacheMapLinks' : [ 0x58, ['_LIST_ENTRY']],
    'Flags' : [ 0x60, ['unsigned long']],
    'Status' : [ 0x64, ['long']],
    'Mbcb' : [ 0x68, ['pointer', ['_MBCB']]],
    'Section' : [ 0x6c, ['pointer', ['void']]],
    'CreateEvent' : [ 0x70, ['pointer', ['_KEVENT']]],
    'WaitOnActiveCount' : [ 0x74, ['pointer', ['_KEVENT']]],
    'PagesToWrite' : [ 0x78, ['unsigned long']],
    'BeyondLastFlush' : [ 0x80, ['long long']],
    'Callbacks' : [ 0x88, ['pointer', ['_CACHE_MANAGER_CALLBACKS']]],
    'LazyWriteContext' : [ 0x8c, ['pointer', ['void']]],
    'PrivateList' : [ 0x90, ['_LIST_ENTRY']],
    'V1' : [ 0x98, ['_LOGGED_STREAM_CALLBACK_V1']],
    'V2' : [ 0x98, ['_LOGGED_STREAM_CALLBACK_V2']],
    'LargestLSN' : [ 0xa0, ['_LARGE_INTEGER']],
    'DirtyPageThreshold' : [ 0xa8, ['unsigned long']],
    'LazyWritePassCount' : [ 0xac, ['unsigned long']],
    'UninitializeEvent' : [ 0xb0, ['pointer', ['_CACHE_UNINITIALIZE_EVENT']]],
    'BcbLock' : [ 0xb4, ['_FAST_MUTEX']],
    'LastUnmapBehindOffset' : [ 0xd8, ['_LARGE_INTEGER']],
    'Event' : [ 0xe0, ['_KEVENT']],
    'HighWaterMappingOffset' : [ 0xf0, ['_LARGE_INTEGER']],
    'PrivateCacheMap' : [ 0xf8, ['_PRIVATE_CACHE_MAP']],
    'WriteBehindWorkQueueEntry' : [ 0x160, ['pointer', ['void']]],
    'VolumeCacheMap' : [ 0x164, ['pointer', ['_VOLUME_CACHE_MAP']]],
    'ProcImagePathHash' : [ 0x168, ['unsigned long']],
    'WritesInProgress' : [ 0x16c, ['unsigned long']],
    'AsyncReadRequestCount' : [ 0x170, ['unsigned long']],
    'Partition' : [ 0x174, ['pointer', ['_CC_PARTITION']]],
    'InternalRefCount' : [ 0x178, ['unsigned long']],
    'NumMappedVacb' : [ 0x17c, ['unsigned long']],
    'NumActiveVacb' : [ 0x180, ['unsigned long']],
} ],
  '__unnamed_1d34' : [ 0x8, {
    'FileOffset' : [ 0x0, ['_LARGE_INTEGER']],
    'ActiveCount' : [ 0x0, ['unsigned short']],
    'Links' : [ 0x0, ['_LIST_ENTRY']],
} ],
  '_VACB' : [ 0x18, {
    'BaseAddress' : [ 0x0, ['pointer', ['void']]],
    'SharedCacheMap' : [ 0x4, ['pointer', ['_SHARED_CACHE_MAP']]],
    'Overlay' : [ 0x8, ['__unnamed_1d34']],
    'ArrayHead' : [ 0x10, ['pointer', ['_VACB_ARRAY_HEADER']]],
} ],
  '_CC_PARTITION' : [ 0x2c0, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'PartitionObject' : [ 0x4, ['pointer', ['_EPARTITION']]],
    'CleanSharedCacheMapList' : [ 0x8, ['_LIST_ENTRY']],
    'CleanSharedCacheMapWithLogHandleList' : [ 0x10, ['_LIST_ENTRY']],
    'DirtySharedCacheMapList' : [ 0x18, ['_SHARED_CACHE_MAP_LIST_CURSOR']],
    'LazyWriteCursor' : [ 0x24, ['_SHARED_CACHE_MAP_LIST_CURSOR']],
    'DirtySharedCacheMapWithLogHandleList' : [ 0x30, ['_LIST_ENTRY']],
    'PrivateLock' : [ 0x40, ['unsigned long']],
    'ConsecutiveWorklessLazyScanCount' : [ 0x44, ['unsigned long']],
    'ForcedDisableLazywriteScan' : [ 0x48, ['unsigned char']],
    'WorkQueueLock' : [ 0x80, ['unsigned long']],
    'NumberWorkerThreads' : [ 0x84, ['unsigned long']],
    'NumberActiveWorkerThreads' : [ 0x88, ['unsigned long']],
    'IdleWorkerThreadList' : [ 0x8c, ['_LIST_ENTRY']],
    'FastTeardownWorkQueue' : [ 0x94, ['_LIST_ENTRY']],
    'ExpressWorkQueue' : [ 0x9c, ['_LIST_ENTRY']],
    'RegularWorkQueue' : [ 0xa4, ['_LIST_ENTRY']],
    'PostTickWorkQueue' : [ 0xac, ['_LIST_ENTRY']],
    'CleanCachemapUninitWorkQueue' : [ 0xb4, ['_LIST_ENTRY']],
    'IdleExtraWriteBehindThreadList' : [ 0xbc, ['_LIST_ENTRY']],
    'ActiveExtraWriteBehindThreads' : [ 0xc4, ['unsigned long']],
    'MaxExtraWriteBehindThreads' : [ 0xc8, ['unsigned long']],
    'IdleCacheMapUninitThreadList' : [ 0xcc, ['_LIST_ENTRY']],
    'ActiveCacheMapUninitThreads' : [ 0xd4, ['unsigned long']],
    'MaxCacheMapUninitThreads' : [ 0xd8, ['unsigned long']],
    'QueueThrottle' : [ 0xdc, ['unsigned char']],
    'PostTickWorkItemCount' : [ 0xe0, ['unsigned long']],
    'ThreadsActiveBeforeThrottle' : [ 0xe4, ['unsigned long']],
    'ExtraWBThreadsActiveBeforeThrottle' : [ 0xe8, ['unsigned long']],
    'ExecutingWriteBehindWorkItems' : [ 0xec, ['unsigned long']],
    'ExecutingHighPriorityWorkItem' : [ 0xf0, ['unsigned long']],
    'LowMemoryEvent' : [ 0xf4, ['_KEVENT']],
    'PowerEvent' : [ 0x104, ['_KEVENT']],
    'PeriodicEvent' : [ 0x114, ['_KEVENT']],
    'WaitingForTeardownEvent' : [ 0x124, ['_KEVENT']],
    'CoalescingFlushEvent' : [ 0x134, ['_KEVENT']],
    'PagesYetToWrite' : [ 0x144, ['unsigned long']],
    'LazyWriter' : [ 0x148, ['_LAZY_WRITER']],
    'DirtyPageStatistics' : [ 0x198, ['_DIRTY_PAGE_STATISTICS']],
    'DirtyPageThresholds' : [ 0x1a8, ['_DIRTY_PAGE_THRESHOLDS']],
    'ThroughputStats' : [ 0x1d0, ['pointer', ['_WRITE_BEHIND_THROUGHPUT']]],
    'ThroughputTrend' : [ 0x1d4, ['long']],
    'AverageAvailablePages' : [ 0x1d8, ['unsigned long long']],
    'AverageDirtyPages' : [ 0x1e0, ['unsigned long long']],
    'PagesSkippedDueToHotSpot' : [ 0x1e8, ['unsigned long long']],
    'PrevRegularQueueItemRunTime' : [ 0x1f0, ['_LARGE_INTEGER']],
    'PrevExtraWBThreadCheckTime' : [ 0x1f8, ['_LARGE_INTEGER']],
    'AddExtraWriteBehindThreads' : [ 0x200, ['unsigned char']],
    'RemoveExtraThreadPending' : [ 0x201, ['unsigned char']],
    'DeferredWrites' : [ 0x204, ['_LIST_ENTRY']],
    'DeferredWriteSpinLock' : [ 0x240, ['unsigned long']],
    'IdleAsyncReadWorkerThreadList' : [ 0x244, ['pointer', ['_LIST_ENTRY']]],
    'NumberActiveAsyncReadWorkerThreads' : [ 0x248, ['pointer', ['unsigned long']]],
    'NumberActiveCompleteAsyncReadWorkItems' : [ 0x24c, ['pointer', ['unsigned long']]],
    'AsyncReadWorkQueue' : [ 0x250, ['pointer', ['_LIST_ENTRY']]],
    'AsyncReadCompletionWorkQueue' : [ 0x254, ['pointer', ['_LIST_ENTRY']]],
    'NewAsyncReadRequestEvent' : [ 0x258, ['pointer', ['_KEVENT']]],
    'ReaderThreadsStats' : [ 0x25c, ['pointer', ['_ASYNC_READ_THREAD_STATS']]],
    'AsyncReadWorkQueueLock' : [ 0x260, ['_EX_PUSH_LOCK']],
    'VacbFreeHighPriorityList' : [ 0x264, ['_LIST_ENTRY']],
    'NumberOfFreeHighPriorityVacbs' : [ 0x26c, ['unsigned long']],
    'LowPriWorkerThread' : [ 0x270, ['pointer', ['_ETHREAD']]],
    'LowPriSharedCacheMap' : [ 0x274, ['pointer', ['_SHARED_CACHE_MAP']]],
    'LowPriOldCpuPriority' : [ 0x278, ['long']],
    'LowPriOldIoPriority' : [ 0x27c, ['Enumeration', dict(target = 'long', choices = {0: u'IoPriorityVeryLow', 1: u'IoPriorityLow', 2: u'IoPriorityNormal', 3: u'IoPriorityHigh', 4: u'IoPriorityCritical', 5: u'MaxIoPriorityTypes'})]],
    'LowPriorityWorkerThreadLock' : [ 0x280, ['_EX_PUSH_LOCK']],
    'MaxNumberOfWriteBehindThreads' : [ 0x284, ['unsigned long']],
    'CoalescingState' : [ 0x288, ['unsigned char']],
    'ActivePartition' : [ 0x289, ['unsigned char']],
    'RundownPhase' : [ 0x28a, ['unsigned char']],
    'RefCount' : [ 0x28c, ['long']],
    'ExitEvent' : [ 0x290, ['_KEVENT']],
    'FinalDereferenceEvent' : [ 0x2a0, ['_KEVENT']],
    'LazyWriteScanThreadHandle' : [ 0x2b0, ['pointer', ['void']]],
} ],
  '__unnamed_1d5a' : [ 0x8, {
    'FileObject' : [ 0x0, ['pointer', ['_FILE_OBJECT']]],
    'DiskIoAttribution' : [ 0x4, ['pointer', ['void']]],
} ],
  '__unnamed_1d5c' : [ 0x4, {
    'SharedCacheMap' : [ 0x0, ['pointer', ['_SHARED_CACHE_MAP']]],
} ],
  '__unnamed_1d5e' : [ 0x4, {
    'Event' : [ 0x0, ['pointer', ['_KEVENT']]],
} ],
  '__unnamed_1d60' : [ 0x4, {
    'Reason' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_1d62' : [ 0x1c, {
    'SharedCacheMap' : [ 0x0, ['pointer', ['_SHARED_CACHE_MAP']]],
    'IoStatus' : [ 0x4, ['pointer', ['_IO_STATUS_BLOCK']]],
    'CallerWaitEvent' : [ 0x8, ['_KEVENT']],
    'IsLowPriWriteBehind' : [ 0x18, ['unsigned char']],
} ],
  '__unnamed_1d66' : [ 0x40, {
    'SharedCacheMap' : [ 0x0, ['pointer', ['_SHARED_CACHE_MAP']]],
    'FileOffset' : [ 0x8, ['_LARGE_INTEGER']],
    'FileObject' : [ 0x10, ['pointer', ['_FILE_OBJECT']]],
    'Length' : [ 0x14, ['unsigned long']],
    'PrefetchList' : [ 0x18, ['pointer', ['_SINGLE_LIST_ENTRY']]],
    'PrefetchPagePriority' : [ 0x1c, ['unsigned long']],
    'Mdl' : [ 0x20, ['pointer', ['_MDL']]],
    'IoStatusBlock' : [ 0x24, ['pointer', ['_IO_STATUS_BLOCK']]],
    'CallbackContext' : [ 0x28, ['pointer', ['_CC_ASYNC_READ_CONTEXT']]],
    'OriginatingProcess' : [ 0x2c, ['pointer', ['_EPROCESS']]],
    'IoIssuerThread' : [ 0x30, ['pointer', ['_ETHREAD']]],
    'DiskIoAttribution' : [ 0x34, ['pointer', ['void']]],
    'RequestorMode' : [ 0x38, ['unsigned char']],
    'NestingLevel' : [ 0x3c, ['unsigned long']],
} ],
  '__unnamed_1d68' : [ 0x40, {
    'Read' : [ 0x0, ['__unnamed_1d5a']],
    'Write' : [ 0x0, ['__unnamed_1d5c']],
    'Event' : [ 0x0, ['__unnamed_1d5e']],
    'Notification' : [ 0x0, ['__unnamed_1d60']],
    'LowPriWrite' : [ 0x0, ['__unnamed_1d62']],
    'AsyncRead' : [ 0x0, ['__unnamed_1d66']],
} ],
  '_WORK_QUEUE_ENTRY' : [ 0x50, {
    'WorkQueueLinks' : [ 0x0, ['_LIST_ENTRY']],
    'Parameters' : [ 0x8, ['__unnamed_1d68']],
    'Function' : [ 0x48, ['unsigned char']],
    'Partition' : [ 0x4c, ['pointer', ['_CC_PARTITION']]],
} ],
  '_DEFERRED_WRITE' : [ 0x38, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'FileObject' : [ 0x4, ['pointer', ['_FILE_OBJECT']]],
    'BytesToWrite' : [ 0x8, ['unsigned long']],
    'DeferredWriteLinks' : [ 0xc, ['_LIST_ENTRY']],
    'Event' : [ 0x14, ['pointer', ['_KEVENT']]],
    'PostRoutine' : [ 0x18, ['pointer', ['void']]],
    'Context1' : [ 0x1c, ['pointer', ['void']]],
    'Context2' : [ 0x20, ['pointer', ['void']]],
    'Partition' : [ 0x24, ['pointer', ['_CC_PARTITION']]],
    'SoftThrottle' : [ 0x28, ['unsigned char']],
    'TimeAdded' : [ 0x30, ['_LARGE_INTEGER']],
} ],
  '_SECTION_OBJECT_POINTERS' : [ 0xc, {
    'DataSectionObject' : [ 0x0, ['pointer', ['void']]],
    'SharedCacheMap' : [ 0x4, ['pointer', ['void']]],
    'ImageSectionObject' : [ 0x8, ['pointer', ['void']]],
} ],
  '_CC_EXTERNAL_CACHE_INFO' : [ 0x18, {
    'Callback' : [ 0x0, ['pointer', ['void']]],
    'DirtyPageStatistics' : [ 0x4, ['_DIRTY_PAGE_STATISTICS']],
    'Links' : [ 0x10, ['_LIST_ENTRY']],
} ],
  'VACB_LEVEL_ALLOCATION_LIST' : [ 0x10, {
    'VacbLevelList' : [ 0x0, ['_LIST_ENTRY']],
    'VacbLevelWithBcbListHeads' : [ 0x8, ['pointer', ['void']]],
    'VacbLevelsAllocated' : [ 0xc, ['unsigned long']],
} ],
  '_VACB_LEVEL_REFERENCE' : [ 0x8, {
    'Reference' : [ 0x0, ['long']],
    'SpecialReference' : [ 0x4, ['long']],
} ],
  '_LOG_HANDLE_CONTEXT' : [ 0x68, {
    'LogHandle' : [ 0x0, ['pointer', ['void']]],
    'FlushToLsnRoutine' : [ 0x4, ['pointer', ['void']]],
    'QueryLogHandleInfoRoutine' : [ 0x8, ['pointer', ['void']]],
    'DirtyPageStatistics' : [ 0xc, ['_DIRTY_PAGE_STATISTICS']],
    'DirtyPageThresholds' : [ 0x18, ['_DIRTY_PAGE_THRESHOLDS']],
    'AdditionalPagesToWrite' : [ 0x40, ['unsigned long']],
    'CcLWScanDPThreshold' : [ 0x44, ['unsigned long']],
    'LargestLsnForCurrentLWScan' : [ 0x48, ['_LARGE_INTEGER']],
    'RelatedFileObject' : [ 0x50, ['pointer', ['_FILE_OBJECT']]],
    'LargestLsnFileObjectKey' : [ 0x54, ['unsigned long']],
    'LastLWTimeStamp' : [ 0x58, ['_LARGE_INTEGER']],
    'Flags' : [ 0x60, ['unsigned long']],
} ],
  '_MBCB' : [ 0x88, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeIsInZone' : [ 0x2, ['short']],
    'PagesToWrite' : [ 0x4, ['unsigned long']],
    'DirtyPages' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'BitmapRanges' : [ 0x10, ['_LIST_ENTRY']],
    'ResumeWritePage' : [ 0x18, ['long long']],
    'MostRecentlyDirtiedPage' : [ 0x20, ['long long']],
    'BitmapRange1' : [ 0x28, ['_BITMAP_RANGE']],
    'BitmapRange2' : [ 0x48, ['_BITMAP_RANGE']],
    'BitmapRange3' : [ 0x68, ['_BITMAP_RANGE']],
} ],
  '_BITMAP_RANGE' : [ 0x20, {
    'Links' : [ 0x0, ['_LIST_ENTRY']],
    'BasePage' : [ 0x8, ['long long']],
    'FirstDirtyPage' : [ 0x10, ['unsigned long']],
    'LastDirtyPage' : [ 0x14, ['unsigned long']],
    'DirtyPages' : [ 0x18, ['unsigned long']],
    'Bitmap' : [ 0x1c, ['pointer', ['unsigned long']]],
} ],
  '_SHARED_CACHE_MAP_LIST_CURSOR' : [ 0xc, {
    'SharedCacheMapLinks' : [ 0x0, ['_LIST_ENTRY']],
    'Flags' : [ 0x8, ['unsigned long']],
} ],
  '_LAZY_WRITER' : [ 0x50, {
    'ScanDpc' : [ 0x0, ['_KDPC']],
    'ScanTimer' : [ 0x20, ['_KTIMER']],
    'ScanActive' : [ 0x48, ['unsigned char']],
    'OtherWork' : [ 0x49, ['unsigned char']],
    'PendingTeardownScan' : [ 0x4a, ['unsigned char']],
    'PendingPeriodicScan' : [ 0x4b, ['unsigned char']],
    'PendingLowMemoryScan' : [ 0x4c, ['unsigned char']],
    'PendingPowerScan' : [ 0x4d, ['unsigned char']],
    'PendingCoalescingFlushScan' : [ 0x4e, ['unsigned char']],
} ],
  '_CACHE_UNINITIALIZE_EVENT' : [ 0x14, {
    'Next' : [ 0x0, ['pointer', ['_CACHE_UNINITIALIZE_EVENT']]],
    'Event' : [ 0x4, ['_KEVENT']],
} ],
  '_HEAP_SUBALLOCATOR_CALLBACKS' : [ 0x14, {
    'Allocate' : [ 0x0, ['unsigned long']],
    'Free' : [ 0x4, ['unsigned long']],
    'Commit' : [ 0x8, ['unsigned long']],
    'Decommit' : [ 0xc, ['unsigned long']],
    'ExtendContext' : [ 0x10, ['unsigned long']],
} ],
  '_SEGMENT_HEAP_EXTRA' : [ 0x8, {
    'AllocationTag' : [ 0x0, ['unsigned short']],
    'InterceptorIndex' : [ 0x2, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'UserFlags' : [ 0x2, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'ExtraSizeInUnits' : [ 0x3, ['unsigned char']],
    'Settable' : [ 0x4, ['pointer', ['void']]],
} ],
  '_RTL_CSPARSE_BITMAP' : [ 0x24, {
    'CommitBitmap' : [ 0x0, ['pointer', ['unsigned long']]],
    'UserBitmap' : [ 0x4, ['pointer', ['unsigned long']]],
    'BitCount' : [ 0x8, ['unsigned long']],
    'BitmapLock' : [ 0xc, ['unsigned long']],
    'DecommitPageIndex' : [ 0x10, ['unsigned long']],
    'RtlpCSparseBitmapWakeLock' : [ 0x14, ['unsigned long']],
    'LockType' : [ 0x18, ['unsigned char']],
    'AddressSpace' : [ 0x19, ['unsigned char']],
    'MemType' : [ 0x1a, ['unsigned char']],
    'AllocAlignment' : [ 0x1b, ['unsigned char']],
    'CommitDirectoryMaxSize' : [ 0x1c, ['unsigned long']],
    'CommitDirectory' : [ 0x20, ['array', 1, ['unsigned long']]],
} ],
  '_RTL_SPARSE_ARRAY' : [ 0x2c, {
    'ElementCount' : [ 0x0, ['unsigned long']],
    'ElementSizeShift' : [ 0x4, ['unsigned long']],
    'Bitmap' : [ 0x8, ['_RTL_CSPARSE_BITMAP']],
} ],
  '_HEAP_VAMGR_ALLOCATOR' : [ 0x1c, {
    'TreeLock' : [ 0x0, ['unsigned long']],
    'FreeRanges' : [ 0x4, ['_RTL_RB_TREE']],
    'VaSpace' : [ 0xc, ['pointer', ['_HEAP_VAMGR_VASPACE']]],
    'PartitionHandle' : [ 0x10, ['pointer', ['void']]],
    'ChunksPerRegion' : [ 0x14, ['unsigned short']],
    'RefCount' : [ 0x16, ['unsigned short']],
    'AllocatorIndex' : [ 0x18, ['unsigned char']],
    'NumaNode' : [ 0x19, ['unsigned char']],
    'LockType' : [ 0x1a, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'MemoryType' : [ 0x1a, ['BitField', dict(start_bit = 1, end_bit = 3, native_type='unsigned char')]],
    'ConstrainedVA' : [ 0x1a, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'AllowFreeHead' : [ 0x1a, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'Spare0' : [ 0x1a, ['BitField', dict(start_bit = 5, end_bit = 8, native_type='unsigned char')]],
    'Spare1' : [ 0x1b, ['unsigned char']],
} ],
  '_HEAP_VAMGR_VASPACE' : [ 0x34, {
    'AddressSpaceType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'HeapAddressUser', 1: u'HeapAddressKernel', 2: u'HeapAddressSession', 3: u'HeapAddressSecureKernel', 4: u'HeapAddressTypeMax'})]],
    'BaseAddress' : [ 0x4, ['unsigned long']],
    'VaRangeArray' : [ 0x8, ['_RTL_SPARSE_ARRAY']],
    'VaRangeArrayBuffer' : [ 0x8, ['array', 44, ['unsigned char']]],
} ],
  '_HEAP_VAMGR_RANGE' : [ 0x10, {
    'RbNode' : [ 0x0, ['_RTL_BALANCED_NODE']],
    'Next' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Allocated' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Internal' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Standalone' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Spare0' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned char')]],
    'AllocatorIndex' : [ 0x1, ['unsigned char']],
    'OwnerCtx' : [ 0x4, ['array', 2, ['unsigned long']]],
    'SizeInChunks' : [ 0xc, ['unsigned long']],
    'ChunkCount' : [ 0xc, ['unsigned short']],
    'PrevChunkCount' : [ 0xe, ['unsigned short']],
    'Signature' : [ 0xc, ['unsigned long']],
} ],
  '_RTLP_HP_HEAP_MANAGER' : [ 0x1c70, {
    'Globals' : [ 0x0, ['pointer', ['_RTLP_HP_HEAP_GLOBALS']]],
    'AllocTracker' : [ 0x4, ['_RTLP_HP_ALLOC_TRACKER']],
    'VaMgr' : [ 0x30, ['_HEAP_VAMGR_CTX']],
    'MetadataHeaps' : [ 0x1c50, ['array', 3, ['_RTLP_HP_METADATA_HEAP_CTX']]],
    'SubAllocConfigs' : [ 0x1c68, ['_RTL_HP_SUB_ALLOCATOR_CONFIGS']],
} ],
  '_RTLP_HP_ALLOC_TRACKER' : [ 0x2c, {
    'BaseAddress' : [ 0x0, ['unsigned long']],
    'AllocTrackerBitmap' : [ 0x4, ['_RTL_CSPARSE_BITMAP']],
    'AllocTrackerBitmapBuffer' : [ 0x4, ['array', 40, ['unsigned char']]],
} ],
  '_RTL_STACKDB_CONTEXT' : [ 0x2c, {
    'StackSegmentTable' : [ 0x0, ['_RTL_HASH_TABLE']],
    'StackEntryTable' : [ 0xc, ['_RTL_HASH_TABLE']],
    'StackEntryTableLock' : [ 0x18, ['_RTL_SRWLOCK']],
    'SegmentTableLock' : [ 0x1c, ['_RTL_SRWLOCK']],
    'Allocate' : [ 0x20, ['pointer', ['void']]],
    'Free' : [ 0x24, ['pointer', ['void']]],
    'AllocatorContext' : [ 0x28, ['pointer', ['void']]],
} ],
  '_HEAP_LFH_FAST_REF' : [ 0x4, {
    'Target' : [ 0x0, ['pointer', ['void']]],
    'Value' : [ 0x0, ['unsigned long']],
    'RefCount' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 12, native_type='unsigned long')]],
} ],
  '_HEAP_LFH_SUBSEGMENT_OWNER' : [ 0x1c, {
    'IsBucket' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Spare0' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 8, native_type='unsigned char')]],
    'BucketIndex' : [ 0x1, ['unsigned char']],
    'SlotCount' : [ 0x2, ['unsigned char']],
    'SlotIndex' : [ 0x2, ['unsigned char']],
    'Spare1' : [ 0x3, ['unsigned char']],
    'AvailableSubsegmentCount' : [ 0x4, ['unsigned long']],
    'Lock' : [ 0x8, ['unsigned long']],
    'AvailableSubsegmentList' : [ 0xc, ['_LIST_ENTRY']],
    'FullSubsegmentList' : [ 0x14, ['_LIST_ENTRY']],
} ],
  '_HEAP_LFH_CONTEXT' : [ 0x2c0, {
    'BackendCtx' : [ 0x0, ['pointer', ['void']]],
    'Callbacks' : [ 0x4, ['_HEAP_SUBALLOCATOR_CALLBACKS']],
    'AffinityModArray' : [ 0x18, ['pointer', ['unsigned char']]],
    'MaxAffinity' : [ 0x1c, ['unsigned char']],
    'LockType' : [ 0x1d, ['unsigned char']],
    'MemStatsOffset' : [ 0x1e, ['short']],
    'Config' : [ 0x20, ['_RTL_HP_LFH_CONFIG']],
    'BucketStats' : [ 0x40, ['_HEAP_LFH_SUBSEGMENT_STATS']],
    'SubsegmentCreationLock' : [ 0x44, ['unsigned long']],
    'Buckets' : [ 0x80, ['array', 129, ['pointer', ['_HEAP_LFH_BUCKET']]]],
} ],
  '_HEAP_LFH_BUCKET' : [ 0x38, {
    'State' : [ 0x0, ['_HEAP_LFH_SUBSEGMENT_OWNER']],
    'TotalBlockCount' : [ 0x1c, ['unsigned long']],
    'TotalSubsegmentCount' : [ 0x20, ['unsigned long']],
    'ReciprocalBlockSize' : [ 0x24, ['unsigned long']],
    'Shift' : [ 0x28, ['unsigned char']],
    'ContentionCount' : [ 0x29, ['unsigned char']],
    'AffinityMappingLock' : [ 0x2c, ['unsigned long']],
    'ProcAffinityMapping' : [ 0x30, ['pointer', ['unsigned char']]],
    'AffinitySlots' : [ 0x34, ['pointer', ['pointer', ['_HEAP_LFH_AFFINITY_SLOT']]]],
} ],
  '_HEAP_LFH_ONDEMAND_POINTER' : [ 0x4, {
    'Invalid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
