ntkrpamp_types = {
  'LIST_ENTRY64' : [ 0x10, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'Blink' : [ 0x8, ['unsigned long long']],
} ],
  'LIST_ENTRY32' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long']],
    'Blink' : [ 0x4, ['unsigned long']],
} ],
  '_KUSER_SHARED_DATA' : [ 0x708, {
    'TickCountLowDeprecated' : [ 0x0, ['unsigned long']],
    'TickCountMultiplier' : [ 0x4, ['unsigned long']],
    'InterruptTime' : [ 0x8, ['_KSYSTEM_TIME']],
    'SystemTime' : [ 0x14, ['_KSYSTEM_TIME']],
    'TimeZoneBias' : [ 0x20, ['_KSYSTEM_TIME']],
    'ImageNumberLow' : [ 0x2c, ['unsigned short']],
    'ImageNumberHigh' : [ 0x2e, ['unsigned short']],
    'NtSystemRoot' : [ 0x30, ['array', 260, ['wchar']]],
    'MaxStackTraceDepth' : [ 0x238, ['unsigned long']],
    'CryptoExponent' : [ 0x23c, ['unsigned long']],
    'TimeZoneId' : [ 0x240, ['unsigned long']],
    'LargePageMinimum' : [ 0x244, ['unsigned long']],
    'AitSamplingValue' : [ 0x248, ['unsigned long']],
    'AppCompatFlag' : [ 0x24c, ['unsigned long']],
    'RNGSeedVersion' : [ 0x250, ['unsigned long long']],
    'GlobalValidationRunlevel' : [ 0x258, ['unsigned long']],
    'TimeZoneBiasStamp' : [ 0x25c, ['long']],
    'NtBuildNumber' : [ 0x260, ['unsigned long']],
    'NtProductType' : [ 0x264, ['Enumeration', dict(target = 'long', choices = {1: u'NtProductWinNt', 2: u'NtProductLanManNt', 3: u'NtProductServer'})]],
    'ProductTypeIsValid' : [ 0x268, ['unsigned char']],
    'Reserved0' : [ 0x269, ['array', 1, ['unsigned char']]],
    'NativeProcessorArchitecture' : [ 0x26a, ['unsigned short']],
    'NtMajorVersion' : [ 0x26c, ['unsigned long']],
    'NtMinorVersion' : [ 0x270, ['unsigned long']],
    'ProcessorFeatures' : [ 0x274, ['array', 64, ['unsigned char']]],
    'Reserved1' : [ 0x2b4, ['unsigned long']],
    'Reserved3' : [ 0x2b8, ['unsigned long']],
    'TimeSlip' : [ 0x2bc, ['unsigned long']],
    'AlternativeArchitecture' : [ 0x2c0, ['Enumeration', dict(target = 'long', choices = {0: u'StandardDesign', 1: u'NEC98x86', 2: u'EndAlternatives'})]],
    'BootId' : [ 0x2c4, ['unsigned long']],
    'SystemExpirationDate' : [ 0x2c8, ['_LARGE_INTEGER']],
    'SuiteMask' : [ 0x2d0, ['unsigned long']],
    'KdDebuggerEnabled' : [ 0x2d4, ['unsigned char']],
    'MitigationPolicies' : [ 0x2d5, ['unsigned char']],
    'NXSupportPolicy' : [ 0x2d5, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'SEHValidationPolicy' : [ 0x2d5, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned char')]],
    'CurDirDevicesSkippedForDlls' : [ 0x2d5, ['BitField', dict(start_bit = 4, end_bit = 6, native_type='unsigned char')]],
    'Reserved' : [ 0x2d5, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'Reserved6' : [ 0x2d6, ['array', 2, ['unsigned char']]],
    'ActiveConsoleId' : [ 0x2d8, ['unsigned long']],
    'DismountCount' : [ 0x2dc, ['unsigned long']],
    'ComPlusPackage' : [ 0x2e0, ['unsigned long']],
    'LastSystemRITEventTickCount' : [ 0x2e4, ['unsigned long']],
    'NumberOfPhysicalPages' : [ 0x2e8, ['unsigned long']],
    'SafeBootMode' : [ 0x2ec, ['unsigned char']],
    'Reserved12' : [ 0x2ed, ['array', 3, ['unsigned char']]],
    'SharedDataFlags' : [ 0x2f0, ['unsigned long']],
    'DbgErrorPortPresent' : [ 0x2f0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DbgElevationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DbgVirtEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DbgInstallerDetectEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DbgLkgEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DbgDynProcessorEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DbgConsoleBrokerEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DbgSecureBootEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'DbgMultiSessionSku' : [ 0x2f0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'SpareBits' : [ 0x2f0, ['BitField', dict(start_bit = 9, end_bit = 32, native_type='unsigned long')]],
    'DataFlagsPad' : [ 0x2f4, ['array', 1, ['unsigned long']]],
    'TestRetInstruction' : [ 0x2f8, ['unsigned long long']],
    'QpcFrequency' : [ 0x300, ['long long']],
    'SystemCallPad' : [ 0x308, ['array', 3, ['unsigned long long']]],
    'TickCount' : [ 0x320, ['_KSYSTEM_TIME']],
    'TickCountQuad' : [ 0x320, ['unsigned long long']],
    'ReservedTickCountOverlay' : [ 0x320, ['array', 3, ['unsigned long']]],
    'TickCountPad' : [ 0x32c, ['array', 1, ['unsigned long']]],
    'Cookie' : [ 0x330, ['unsigned long']],
    'CookiePad' : [ 0x334, ['array', 1, ['unsigned long']]],
    'ConsoleSessionForegroundProcessId' : [ 0x338, ['long long']],
    'TimeUpdateLock' : [ 0x340, ['unsigned long long']],
    'BaselineSystemTimeQpc' : [ 0x348, ['unsigned long long']],
    'BaselineInterruptTimeQpc' : [ 0x350, ['unsigned long long']],
    'QpcSystemTimeIncrement' : [ 0x358, ['unsigned long long']],
    'QpcInterruptTimeIncrement' : [ 0x360, ['unsigned long long']],
    'QpcSystemTimeIncrementShift' : [ 0x368, ['unsigned char']],
    'QpcInterruptTimeIncrementShift' : [ 0x369, ['unsigned char']],
    'UnparkedProcessorCount' : [ 0x36a, ['unsigned short']],
    'Reserved8' : [ 0x36c, ['array', 20, ['unsigned char']]],
    'UserModeGlobalLogger' : [ 0x380, ['array', 16, ['unsigned short']]],
    'ImageFileExecutionOptions' : [ 0x3a0, ['unsigned long']],
    'LangGenerationCount' : [ 0x3a4, ['unsigned long']],
    'Reserved4' : [ 0x3a8, ['unsigned long long']],
    'InterruptTimeBias' : [ 0x3b0, ['unsigned long long']],
    'QpcBias' : [ 0x3b8, ['unsigned long long']],
    'ActiveProcessorCount' : [ 0x3c0, ['unsigned long']],
    'ActiveGroupCount' : [ 0x3c4, ['unsigned char']],
    'Reserved9' : [ 0x3c5, ['unsigned char']],
    'QpcData' : [ 0x3c6, ['unsigned short']],
    'QpcBypassEnabled' : [ 0x3c6, ['unsigned char']],
    'QpcShift' : [ 0x3c7, ['unsigned char']],
    'TimeZoneBiasEffectiveStart' : [ 0x3c8, ['_LARGE_INTEGER']],
    'TimeZoneBiasEffectiveEnd' : [ 0x3d0, ['_LARGE_INTEGER']],
    'XState' : [ 0x3d8, ['_XSTATE_CONFIGURATION']],
} ],
  '__unnamed_107d' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
} ],
  '_ULARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
    'u' : [ 0x0, ['__unnamed_107d']],
    'QuadPart' : [ 0x0, ['unsigned long long']],
} ],
  '__unnamed_1081' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_LARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
    'u' : [ 0x0, ['__unnamed_1081']],
    'QuadPart' : [ 0x0, ['long long']],
} ],
  '__unnamed_109c' : [ 0x4, {
    'LongFunction' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Persistent' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Private' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_109e' : [ 0x4, {
    'Flags' : [ 0x0, ['unsigned long']],
    's' : [ 0x0, ['__unnamed_109c']],
} ],
  '_TP_CALLBACK_ENVIRON_V3' : [ 0x28, {
    'Version' : [ 0x0, ['unsigned long']],
    'Pool' : [ 0x4, ['pointer', ['_TP_POOL']]],
    'CleanupGroup' : [ 0x8, ['pointer', ['_TP_CLEANUP_GROUP']]],
    'CleanupGroupCancelCallback' : [ 0xc, ['pointer', ['void']]],
    'RaceDll' : [ 0x10, ['pointer', ['void']]],
    'ActivationContext' : [ 0x14, ['pointer', ['_ACTIVATION_CONTEXT']]],
    'FinalizationCallback' : [ 0x18, ['pointer', ['void']]],
    'u' : [ 0x1c, ['__unnamed_109e']],
    'CallbackPriority' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {0: u'TP_CALLBACK_PRIORITY_HIGH', 1: u'TP_CALLBACK_PRIORITY_NORMAL', 2: u'TP_CALLBACK_PRIORITY_LOW', 3: u'TP_CALLBACK_PRIORITY_COUNT'})]],
    'Size' : [ 0x24, ['unsigned long']],
} ],
  '_TEB' : [ 0x1000, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'EnvironmentPointer' : [ 0x1c, ['pointer', ['void']]],
    'ClientId' : [ 0x20, ['_CLIENT_ID']],
    'ActiveRpcHandle' : [ 0x28, ['pointer', ['void']]],
    'ThreadLocalStoragePointer' : [ 0x2c, ['pointer', ['void']]],
    'ProcessEnvironmentBlock' : [ 0x30, ['pointer', ['_PEB']]],
    'LastErrorValue' : [ 0x34, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x38, ['unsigned long']],
    'CsrClientThread' : [ 0x3c, ['pointer', ['void']]],
    'Win32ThreadInfo' : [ 0x40, ['pointer', ['void']]],
    'User32Reserved' : [ 0x44, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xac, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0xc0, ['pointer', ['void']]],
    'CurrentLocale' : [ 0xc4, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0xc8, ['unsigned long']],
    'ReservedForDebuggerInstrumentation' : [ 0xcc, ['array', 16, ['pointer', ['void']]]],
    'SystemReserved1' : [ 0x10c, ['array', 38, ['pointer', ['void']]]],
    'ExceptionCode' : [ 0x1a4, ['long']],
    'ActivationContextStackPointer' : [ 0x1a8, ['pointer', ['_ACTIVATION_CONTEXT_STACK']]],
    'InstrumentationCallbackSp' : [ 0x1ac, ['unsigned long']],
    'InstrumentationCallbackPreviousPc' : [ 0x1b0, ['unsigned long']],
    'InstrumentationCallbackPreviousSp' : [ 0x1b4, ['unsigned long']],
    'InstrumentationCallbackDisabled' : [ 0x1b8, ['unsigned char']],
    'SpareBytes' : [ 0x1b9, ['array', 23, ['unsigned char']]],
    'TxFsContext' : [ 0x1d0, ['unsigned long']],
    'GdiTebBatch' : [ 0x1d4, ['_GDI_TEB_BATCH']],
    'RealClientId' : [ 0x6b4, ['_CLIENT_ID']],
    'GdiCachedProcessHandle' : [ 0x6bc, ['pointer', ['void']]],
    'GdiClientPID' : [ 0x6c0, ['unsigned long']],
    'GdiClientTID' : [ 0x6c4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x6c8, ['pointer', ['void']]],
    'Win32ClientInfo' : [ 0x6cc, ['array', 62, ['unsigned long']]],
    'glDispatchTable' : [ 0x7c4, ['array', 233, ['pointer', ['void']]]],
    'glReserved1' : [ 0xb68, ['array', 29, ['unsigned long']]],
    'glReserved2' : [ 0xbdc, ['pointer', ['void']]],
    'glSectionInfo' : [ 0xbe0, ['pointer', ['void']]],
    'glSection' : [ 0xbe4, ['pointer', ['void']]],
    'glTable' : [ 0xbe8, ['pointer', ['void']]],
    'glCurrentRC' : [ 0xbec, ['pointer', ['void']]],
    'glContext' : [ 0xbf0, ['pointer', ['void']]],
    'LastStatusValue' : [ 0xbf4, ['unsigned long']],
    'StaticUnicodeString' : [ 0xbf8, ['_UNICODE_STRING']],
    'StaticUnicodeBuffer' : [ 0xc00, ['array', 261, ['wchar']]],
    'DeallocationStack' : [ 0xe0c, ['pointer', ['void']]],
    'TlsSlots' : [ 0xe10, ['array', 64, ['pointer', ['void']]]],
    'TlsLinks' : [ 0xf10, ['_LIST_ENTRY']],
    'Vdm' : [ 0xf18, ['pointer', ['void']]],
    'ReservedForNtRpc' : [ 0xf1c, ['pointer', ['void']]],
    'DbgSsReserved' : [ 0xf20, ['array', 2, ['pointer', ['void']]]],
    'HardErrorMode' : [ 0xf28, ['unsigned long']],
    'Instrumentation' : [ 0xf2c, ['array', 9, ['pointer', ['void']]]],
    'ActivityId' : [ 0xf50, ['_GUID']],
    'SubProcessTag' : [ 0xf60, ['pointer', ['void']]],
    'PerflibData' : [ 0xf64, ['pointer', ['void']]],
    'EtwTraceData' : [ 0xf68, ['pointer', ['void']]],
    'WinSockData' : [ 0xf6c, ['pointer', ['void']]],
    'GdiBatchCount' : [ 0xf70, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0xf74, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0xf74, ['unsigned long']],
    'ReservedPad0' : [ 0xf74, ['unsigned char']],
    'ReservedPad1' : [ 0xf75, ['unsigned char']],
    'ReservedPad2' : [ 0xf76, ['unsigned char']],
    'IdealProcessor' : [ 0xf77, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0xf78, ['unsigned long']],
    'ReservedForPerf' : [ 0xf7c, ['pointer', ['void']]],
    'ReservedForOle' : [ 0xf80, ['pointer', ['void']]],
    'WaitingOnLoaderLock' : [ 0xf84, ['unsigned long']],
    'SavedPriorityState' : [ 0xf88, ['pointer', ['void']]],
    'ReservedForCodeCoverage' : [ 0xf8c, ['unsigned long']],
    'ThreadPoolData' : [ 0xf90, ['pointer', ['void']]],
    'TlsExpansionSlots' : [ 0xf94, ['pointer', ['pointer', ['void']]]],
    'MuiGeneration' : [ 0xf98, ['unsigned long']],
    'IsImpersonating' : [ 0xf9c, ['unsigned long']],
    'NlsCache' : [ 0xfa0, ['pointer', ['void']]],
    'pShimData' : [ 0xfa4, ['pointer', ['void']]],
    'HeapVirtualAffinity' : [ 0xfa8, ['unsigned short']],
    'LowFragHeapDataSlot' : [ 0xfaa, ['unsigned short']],
    'CurrentTransactionHandle' : [ 0xfac, ['pointer', ['void']]],
    'ActiveFrame' : [ 0xfb0, ['pointer', ['_TEB_ACTIVE_FRAME']]],
    'FlsData' : [ 0xfb4, ['pointer', ['void']]],
    'PreferredLanguages' : [ 0xfb8, ['pointer', ['void']]],
    'UserPrefLanguages' : [ 0xfbc, ['pointer', ['void']]],
    'MergedPrefLanguages' : [ 0xfc0, ['pointer', ['void']]],
    'MuiImpersonation' : [ 0xfc4, ['unsigned long']],
    'CrossTebFlags' : [ 0xfc8, ['unsigned short']],
    'SpareCrossTebBits' : [ 0xfc8, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0xfca, ['unsigned short']],
    'SafeThunkCall' : [ 0xfca, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0xfca, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0xfca, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0xfca, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0xfca, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0xfca, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0xfca, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0xfca, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0xfca, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0xfca, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0xfca, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SessionAware' : [ 0xfca, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
    'LoadOwner' : [ 0xfca, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
    'LoaderWorker' : [ 0xfca, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0xfca, ['BitField', dict(start_bit = 14, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0xfcc, ['pointer', ['void']]],
    'TxnScopeExitCallback' : [ 0xfd0, ['pointer', ['void']]],
    'TxnScopeContext' : [ 0xfd4, ['pointer', ['void']]],
    'LockCount' : [ 0xfd8, ['unsigned long']],
    'WowTebOffset' : [ 0xfdc, ['long']],
    'ResourceRetValue' : [ 0xfe0, ['pointer', ['void']]],
    'ReservedForWdf' : [ 0xfe4, ['pointer', ['void']]],
    'ReservedForCrt' : [ 0xfe8, ['unsigned long long']],
    'EffectiveContainerId' : [ 0xff0, ['_GUID']],
} ],
  '_LIST_ENTRY' : [ 0x8, {
    'Flink' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'Blink' : [ 0x4, ['pointer', ['_LIST_ENTRY']]],
} ],
  '_SINGLE_LIST_ENTRY' : [ 0x4, {
    'Next' : [ 0x0, ['pointer', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_RTL_SPLAY_LINKS' : [ 0xc, {
    'Parent' : [ 0x0, ['pointer', ['_RTL_SPLAY_LINKS']]],
    'LeftChild' : [ 0x4, ['pointer', ['_RTL_SPLAY_LINKS']]],
    'RightChild' : [ 0x8, ['pointer', ['_RTL_SPLAY_LINKS']]],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_CONTEXT' : [ 0xc, {
    'ChainHead' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'PrevLinkage' : [ 0x4, ['pointer', ['_LIST_ENTRY']]],
    'Signature' : [ 0x8, ['unsigned long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_ENUMERATOR' : [ 0x14, {
    'HashEntry' : [ 0x0, ['_RTL_DYNAMIC_HASH_TABLE_ENTRY']],
    'CurEntry' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'ChainHead' : [ 0xc, ['pointer', ['_LIST_ENTRY']]],
    'BucketIndex' : [ 0x10, ['unsigned long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE' : [ 0x24, {
    'Flags' : [ 0x0, ['unsigned long']],
    'Shift' : [ 0x4, ['unsigned long']],
    'TableSize' : [ 0x8, ['unsigned long']],
    'Pivot' : [ 0xc, ['unsigned long']],
    'DivisorMask' : [ 0x10, ['unsigned long']],
    'NumEntries' : [ 0x14, ['unsigned long']],
    'NonEmptyBuckets' : [ 0x18, ['unsigned long']],
    'NumEnumerators' : [ 0x1c, ['unsigned long']],
    'Directory' : [ 0x20, ['pointer', ['void']]],
} ],
  '_UNICODE_STRING' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x4, ['pointer', ['unsigned short']]],
} ],
  '_STRING' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x4, ['pointer', ['unsigned char']]],
} ],
  '_LUID' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_IMAGE_NT_HEADERS' : [ 0xf8, {
    'Signature' : [ 0x0, ['unsigned long']],
    'FileHeader' : [ 0x4, ['_IMAGE_FILE_HEADER']],
    'OptionalHeader' : [ 0x18, ['_IMAGE_OPTIONAL_HEADER']],
} ],
  '_IMAGE_DOS_HEADER' : [ 0x40, {
    'e_magic' : [ 0x0, ['unsigned short']],
    'e_cblp' : [ 0x2, ['unsigned short']],
    'e_cp' : [ 0x4, ['unsigned short']],
    'e_crlc' : [ 0x6, ['unsigned short']],
    'e_cparhdr' : [ 0x8, ['unsigned short']],
    'e_minalloc' : [ 0xa, ['unsigned short']],
    'e_maxalloc' : [ 0xc, ['unsigned short']],
    'e_ss' : [ 0xe, ['unsigned short']],
    'e_sp' : [ 0x10, ['unsigned short']],
    'e_csum' : [ 0x12, ['unsigned short']],
    'e_ip' : [ 0x14, ['unsigned short']],
    'e_cs' : [ 0x16, ['unsigned short']],
    'e_lfarlc' : [ 0x18, ['unsigned short']],
    'e_ovno' : [ 0x1a, ['unsigned short']],
    'e_res' : [ 0x1c, ['array', 4, ['unsigned short']]],
    'e_oemid' : [ 0x24, ['unsigned short']],
    'e_oeminfo' : [ 0x26, ['unsigned short']],
    'e_res2' : [ 0x28, ['array', 10, ['unsigned short']]],
    'e_lfanew' : [ 0x3c, ['long']],
} ],
  '_RTL_RB_TREE' : [ 0x8, {
    'Root' : [ 0x0, ['pointer', ['_RTL_BALANCED_NODE']]],
    'Min' : [ 0x4, ['pointer', ['_RTL_BALANCED_NODE']]],
} ],
  '_RTL_BALANCED_NODE' : [ 0xc, {
    'Children' : [ 0x0, ['array', 2, ['pointer', ['_RTL_BALANCED_NODE']]]],
    'Left' : [ 0x0, ['pointer', ['_RTL_BALANCED_NODE']]],
    'Right' : [ 0x4, ['pointer', ['_RTL_BALANCED_NODE']]],
    'Red' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Balance' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'ParentValue' : [ 0x8, ['unsigned long']],
} ],
  '_RTL_AVL_TREE' : [ 0x4, {
    'Root' : [ 0x0, ['pointer', ['_RTL_BALANCED_NODE']]],
} ],
  '_GUID' : [ 0x10, {
    'Data1' : [ 0x0, ['unsigned long']],
    'Data2' : [ 0x4, ['unsigned short']],
    'Data3' : [ 0x6, ['unsigned short']],
    'Data4' : [ 0x8, ['array', 8, ['unsigned char']]],
} ],
  '_KPCR' : [ 0x6020, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'Used_ExceptionList' : [ 0x0, ['pointer', ['_EXCEPTION_REGISTRATION_RECORD']]],
    'Used_StackBase' : [ 0x4, ['pointer', ['void']]],
    'MxCsr' : [ 0x8, ['unsigned long']],
    'TssCopy' : [ 0xc, ['pointer', ['void']]],
    'ContextSwitches' : [ 0x10, ['unsigned long']],
    'SetMemberCopy' : [ 0x14, ['unsigned long']],
    'Used_Self' : [ 0x18, ['pointer', ['void']]],
    'SelfPcr' : [ 0x1c, ['pointer', ['_KPCR']]],
    'Prcb' : [ 0x20, ['pointer', ['_KPRCB']]],
    'Irql' : [ 0x24, ['unsigned char']],
    'IRR' : [ 0x28, ['unsigned long']],
    'IrrActive' : [ 0x2c, ['unsigned long']],
    'IDR' : [ 0x30, ['unsigned long']],
    'KdVersionBlock' : [ 0x34, ['pointer', ['void']]],
    'IDT' : [ 0x38, ['pointer', ['_KIDTENTRY']]],
    'GDT' : [ 0x3c, ['pointer', ['_KGDTENTRY']]],
    'TSS' : [ 0x40, ['pointer', ['_KTSS']]],
    'MajorVersion' : [ 0x44, ['unsigned short']],
    'MinorVersion' : [ 0x46, ['unsigned short']],
    'SetMember' : [ 0x48, ['unsigned long']],
    'StallScaleFactor' : [ 0x4c, ['unsigned long']],
    'SpareUnused' : [ 0x50, ['unsigned char']],
    'Number' : [ 0x51, ['unsigned char']],
    'Spare0' : [ 0x52, ['unsigned char']],
    'SecondLevelCacheAssociativity' : [ 0x53, ['unsigned char']],
    'VdmAlert' : [ 0x54, ['unsigned long']],
    'KernelReserved' : [ 0x58, ['array', 14, ['unsigned long']]],
    'SecondLevelCacheSize' : [ 0x90, ['unsigned long']],
    'HalReserved' : [ 0x94, ['array', 16, ['unsigned long']]],
    'InterruptMode' : [ 0xd4, ['unsigned long']],
    'Spare1' : [ 0xd8, ['unsigned char']],
    'KernelReserved2' : [ 0xdc, ['array', 17, ['unsigned long']]],
    'PrcbData' : [ 0x120, ['_KPRCB']],
} ],
  '_KPRCB' : [ 0x5f00, {
    'MinorVersion' : [ 0x0, ['unsigned short']],
    'MajorVersion' : [ 0x2, ['unsigned short']],
    'CurrentThread' : [ 0x4, ['pointer', ['_KTHREAD']]],
    'NextThread' : [ 0x8, ['pointer', ['_KTHREAD']]],
    'IdleThread' : [ 0xc, ['pointer', ['_KTHREAD']]],
    'LegacyNumber' : [ 0x10, ['unsigned char']],
    'NestingLevel' : [ 0x11, ['unsigned char']],
    'BuildType' : [ 0x12, ['unsigned short']],
    'CpuType' : [ 0x14, ['unsigned char']],
    'CpuID' : [ 0x15, ['unsigned char']],
    'CpuStep' : [ 0x16, ['unsigned short']],
    'CpuStepping' : [ 0x16, ['unsigned char']],
    'CpuModel' : [ 0x17, ['unsigned char']],
    'ProcessorState' : [ 0x18, ['_KPROCESSOR_STATE']],
    'ParentNode' : [ 0x338, ['pointer', ['_KNODE']]],
    'PriorityState' : [ 0x33c, ['pointer', ['unsigned char']]],
    'KernelReserved' : [ 0x340, ['array', 14, ['unsigned long']]],
    'HalReserved' : [ 0x378, ['array', 16, ['unsigned long']]],
    'CFlushSize' : [ 0x3b8, ['unsigned long']],
    'CoresPerPhysicalProcessor' : [ 0x3bc, ['unsigned char']],
    'LogicalProcessorsPerCore' : [ 0x3bd, ['unsigned char']],
    'CpuVendor' : [ 0x3be, ['unsigned char']],
    'PrcbPad0' : [ 0x3bf, ['array', 1, ['unsigned char']]],
    'MHz' : [ 0x3c0, ['unsigned long']],
    'GroupIndex' : [ 0x3c4, ['unsigned char']],
    'Group' : [ 0x3c5, ['unsigned char']],
    'PrcbPad05' : [ 0x3c6, ['array', 2, ['unsigned char']]],
    'GroupSetMember' : [ 0x3c8, ['unsigned long']],
    'Number' : [ 0x3cc, ['unsigned long']],
    'ClockOwner' : [ 0x3d0, ['unsigned char']],
    'PendingTickFlags' : [ 0x3d1, ['unsigned char']],
    'PendingTick' : [ 0x3d1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'PendingBackupTick' : [ 0x3d1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'PrcbPad10' : [ 0x3d2, ['array', 70, ['unsigned char']]],
    'LockQueue' : [ 0x418, ['array', 17, ['_KSPIN_LOCK_QUEUE']]],
    'InterruptCount' : [ 0x4a0, ['unsigned long']],
    'KernelTime' : [ 0x4a4, ['unsigned long']],
    'UserTime' : [ 0x4a8, ['unsigned long']],
    'DpcTime' : [ 0x4ac, ['unsigned long']],
    'DpcTimeCount' : [ 0x4b0, ['unsigned long']],
    'InterruptTime' : [ 0x4b4, ['unsigned long']],
    'AdjustDpcThreshold' : [ 0x4b8, ['unsigned long']],
    'PageColor' : [ 0x4bc, ['unsigned long']],
    'DebuggerSavedIRQL' : [ 0x4c0, ['unsigned char']],
    'NodeColor' : [ 0x4c1, ['unsigned char']],
    'DeepSleep' : [ 0x4c2, ['unsigned char']],
    'PrcbPad20' : [ 0x4c3, ['array', 5, ['unsigned char']]],
    'NodeShiftedColor' : [ 0x4c8, ['unsigned long']],
    'SecondaryColorMask' : [ 0x4cc, ['unsigned long']],
    'DpcTimeLimit' : [ 0x4d0, ['unsigned long']],
    'PrcbPad21' : [ 0x4d4, ['array', 3, ['unsigned long']]],
    'CcFastReadNoWait' : [ 0x4e0, ['unsigned long']],
    'CcFastReadWait' : [ 0x4e4, ['unsigned long']],
    'CcFastReadNotPossible' : [ 0x4e8, ['unsigned long']],
    'CcCopyReadNoWait' : [ 0x4ec, ['unsigned long']],
    'CcCopyReadWait' : [ 0x4f0, ['unsigned long']],
    'CcCopyReadNoWaitMiss' : [ 0x4f4, ['unsigned long']],
    'MmSpinLockOrdering' : [ 0x4f8, ['long']],
    'IoReadOperationCount' : [ 0x4fc, ['long']],
    'IoWriteOperationCount' : [ 0x500, ['long']],
    'IoOtherOperationCount' : [ 0x504, ['long']],
    'IoReadTransferCount' : [ 0x508, ['_LARGE_INTEGER']],
    'IoWriteTransferCount' : [ 0x510, ['_LARGE_INTEGER']],
    'IoOtherTransferCount' : [ 0x518, ['_LARGE_INTEGER']],
    'CcFastMdlReadNoWait' : [ 0x520, ['unsigned long']],
    'CcFastMdlReadWait' : [ 0x524, ['unsigned long']],
    'CcFastMdlReadNotPossible' : [ 0x528, ['unsigned long']],
    'CcMapDataNoWait' : [ 0x52c, ['unsigned long']],
    'CcMapDataWait' : [ 0x530, ['unsigned long']],
    'CcPinMappedDataCount' : [ 0x534, ['unsigned long']],
    'CcPinReadNoWait' : [ 0x538, ['unsigned long']],
    'CcPinReadWait' : [ 0x53c, ['unsigned long']],
    'CcMdlReadNoWait' : [ 0x540, ['unsigned long']],
    'CcMdlReadWait' : [ 0x544, ['unsigned long']],
    'CcLazyWriteHotSpots' : [ 0x548, ['unsigned long']],
    'CcLazyWriteIos' : [ 0x54c, ['unsigned long']],
    'CcLazyWritePages' : [ 0x550, ['unsigned long']],
    'CcDataFlushes' : [ 0x554, ['unsigned long']],
    'CcDataPages' : [ 0x558, ['unsigned long']],
    'CcLostDelayedWrites' : [ 0x55c, ['unsigned long']],
    'CcFastReadResourceMiss' : [ 0x560, ['unsigned long']],
    'CcCopyReadWaitMiss' : [ 0x564, ['unsigned long']],
    'CcFastMdlReadResourceMiss' : [ 0x568, ['unsigned long']],
    'CcMapDataNoWaitMiss' : [ 0x56c, ['unsigned long']],
    'CcMapDataWaitMiss' : [ 0x570, ['unsigned long']],
    'CcPinReadNoWaitMiss' : [ 0x574, ['unsigned long']],
    'CcPinReadWaitMiss' : [ 0x578, ['unsigned long']],
    'CcMdlReadNoWaitMiss' : [ 0x57c, ['unsigned long']],
    'CcMdlReadWaitMiss' : [ 0x580, ['unsigned long']],
    'CcReadAheadIos' : [ 0x584, ['unsigned long']],
    'KeAlignmentFixupCount' : [ 0x588, ['unsigned long']],
    'KeExceptionDispatchCount' : [ 0x58c, ['unsigned long']],
    'KeSystemCalls' : [ 0x590, ['unsigned long']],
    'AvailableTime' : [ 0x594, ['unsigned long']],
    'PrcbPad22' : [ 0x598, ['array', 2, ['unsigned long']]],
    'PPLookasideList' : [ 0x5a0, ['array', 16, ['_PP_LOOKASIDE_LIST']]],
    'PPNxPagedLookasideList' : [ 0x620, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PPNPagedLookasideList' : [ 0xf20, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PPPagedLookasideList' : [ 0x1820, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PacketBarrier' : [ 0x2120, ['long']],
    'ReverseStall' : [ 0x2124, ['long']],
    'IpiFrame' : [ 0x2128, ['pointer', ['void']]],
    'PrcbPad3' : [ 0x212c, ['array', 52, ['unsigned char']]],
    'CurrentPacket' : [ 0x2160, ['array', 3, ['pointer', ['void']]]],
    'TargetSet' : [ 0x216c, ['unsigned long']],
    'WorkerRoutine' : [ 0x2170, ['pointer', ['void']]],
    'IpiFrozen' : [ 0x2174, ['unsigned long']],
    'PrcbPad4' : [ 0x2178, ['array', 40, ['unsigned char']]],
    'RequestSummary' : [ 0x21a0, ['unsigned long']],
    'TargetCount' : [ 0x21a4, ['long']],
    'TrappedSecurityDomain' : [ 0x21a8, ['unsigned long long']],
    'BpbState' : [ 0x21b0, ['unsigned char']],
    'BpbIbrsPresent' : [ 0x21b0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'BpbStibpPresent' : [ 0x21b0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'BpbSmepPresent' : [ 0x21b0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'BpbSimulateIbrs' : [ 0x21b0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'BpbSimulateIbpb' : [ 0x21b0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'BpbCpuIdle' : [ 0x21b0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'BpbReserved' : [ 0x21b0, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'PrcbPad50' : [ 0x21b1, ['array', 31, ['unsigned char']]],
    'InterruptLastCount' : [ 0x21d0, ['unsigned long']],
    'InterruptRate' : [ 0x21d4, ['unsigned long']],
    'DeviceInterrupts' : [ 0x21d8, ['unsigned long']],
    'IsrDpcStats' : [ 0x21dc, ['pointer', ['void']]],
    'DpcData' : [ 0x21e0, ['array', 2, ['_KDPC_DATA']]],
    'DpcStack' : [ 0x2210, ['pointer', ['void']]],
    'MaximumDpcQueueDepth' : [ 0x2214, ['long']],
    'DpcRequestRate' : [ 0x2218, ['unsigned long']],
    'MinimumDpcRate' : [ 0x221c, ['unsigned long']],
    'DpcLastCount' : [ 0x2220, ['unsigned long']],
    'PrcbLock' : [ 0x2224, ['unsigned long']],
    'DpcGate' : [ 0x2228, ['_KGATE']],
    'IdleState' : [ 0x2238, ['unsigned char']],
    'QuantumEnd' : [ 0x2239, ['unsigned char']],
    'DpcRoutineActive' : [ 0x223a, ['unsigned char']],
    'IdleSchedule' : [ 0x223b, ['unsigned char']],
    'DpcRequestSummary' : [ 0x223c, ['long']],
    'DpcRequestSlot' : [ 0x223c, ['array', 2, ['short']]],
    'NormalDpcState' : [ 0x223c, ['short']],
    'ThreadDpcState' : [ 0x223e, ['short']],
    'DpcNormalProcessingActive' : [ 0x223c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DpcNormalProcessingRequested' : [ 0x223c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DpcNormalThreadSignal' : [ 0x223c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DpcNormalTimerExpiration' : [ 0x223c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DpcNormalDpcPresent' : [ 0x223c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DpcNormalLocalInterrupt' : [ 0x223c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DpcNormalSpare' : [ 0x223c, ['BitField', dict(start_bit = 6, end_bit = 16, native_type='unsigned long')]],
    'DpcThreadActive' : [ 0x223c, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'DpcThreadRequested' : [ 0x223c, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'DpcThreadSpare' : [ 0x223c, ['BitField', dict(start_bit = 18, end_bit = 32, native_type='unsigned long')]],
    'LastTimerHand' : [ 0x2240, ['unsigned long']],
    'LastTick' : [ 0x2244, ['unsigned long']],
    'PeriodicCount' : [ 0x2248, ['unsigned long']],
    'PeriodicBias' : [ 0x224c, ['unsigned long']],
    'ClockInterrupts' : [ 0x2250, ['unsigned long']],
    'ReadyScanTick' : [ 0x2254, ['unsigned long']],
    'GroupSchedulingOverQuota' : [ 0x2258, ['unsigned char']],
    'ThreadDpcEnable' : [ 0x2259, ['unsigned char']],
    'PrcbPad41' : [ 0x225a, ['array', 2, ['unsigned char']]],
    'TimerTable' : [ 0x2260, ['_KTIMER_TABLE']],
    'CallDpc' : [ 0x3aa0, ['_KDPC']],
    'ClockKeepAlive' : [ 0x3ac0, ['long']],
    'PrcbPad6' : [ 0x3ac4, ['array', 4, ['unsigned char']]],
    'DpcWatchdogPeriod' : [ 0x3ac8, ['long']],
    'DpcWatchdogCount' : [ 0x3acc, ['long']],
    'KeSpinLockOrdering' : [ 0x3ad0, ['long']],
    'PrcbPad70' : [ 0x3ad4, ['array', 1, ['unsigned long']]],
    'QueueIndex' : [ 0x3ad8, ['unsigned long']],
    'DeferredReadyListHead' : [ 0x3adc, ['_SINGLE_LIST_ENTRY']],
    'ReadySummary' : [ 0x3ae0, ['unsigned long']],
    'AffinitizedSelectionMask' : [ 0x3ae4, ['long']],
    'WaitLock' : [ 0x3ae8, ['unsigned long']],
    'WaitListHead' : [ 0x3aec, ['_LIST_ENTRY']],
    'ScbOffset' : [ 0x3af4, ['unsigned long']],
    'StartCycles' : [ 0x3af8, ['unsigned long long']],
    'TaggedCyclesStart' : [ 0x3b00, ['unsigned long long']],
    'TaggedCycles' : [ 0x3b08, ['array', 2, ['unsigned long long']]],
    'GenerationTarget' : [ 0x3b18, ['unsigned long long']],
    'CycleTime' : [ 0x3b20, ['unsigned long long']],
    'AffinitizedCycles' : [ 0x3b28, ['unsigned long long']],
    'HighCycleTime' : [ 0x3b30, ['unsigned long']],
    'Cycles' : [ 0x3b38, ['array', 4, ['array', 2, ['unsigned long long']]]],
    'PrcbPad71' : [ 0x3b78, ['array', 10, ['unsigned long']]],
    'DispatcherReadyListHead' : [ 0x3ba0, ['array', 32, ['_LIST_ENTRY']]],
    'ChainedInterruptList' : [ 0x3ca0, ['pointer', ['void']]],
    'LookasideIrpFloat' : [ 0x3ca4, ['long']],
    'ScbQueue' : [ 0x3ca8, ['_RTL_RB_TREE']],
    'ScbList' : [ 0x3cb0, ['_LIST_ENTRY']],
    'MmPageFaultCount' : [ 0x3cb8, ['long']],
    'MmCopyOnWriteCount' : [ 0x3cbc, ['long']],
    'MmTransitionCount' : [ 0x3cc0, ['long']],
    'MmCacheTransitionCount' : [ 0x3cc4, ['long']],
    'MmDemandZeroCount' : [ 0x3cc8, ['long']],
    'MmPageReadCount' : [ 0x3ccc, ['long']],
    'MmPageReadIoCount' : [ 0x3cd0, ['long']],
    'MmCacheReadCount' : [ 0x3cd4, ['long']],
    'MmCacheIoCount' : [ 0x3cd8, ['long']],
    'MmDirtyPagesWriteCount' : [ 0x3cdc, ['long']],
    'MmDirtyWriteIoCount' : [ 0x3ce0, ['long']],
    'MmMappedPagesWriteCount' : [ 0x3ce4, ['long']],
    'MmMappedWriteIoCount' : [ 0x3ce8, ['long']],
    'CachedCommit' : [ 0x3cec, ['unsigned long']],
    'CachedResidentAvailable' : [ 0x3cf0, ['unsigned long']],
    'HyperPte' : [ 0x3cf4, ['pointer', ['void']]],
    'PrcbPad8' : [ 0x3cf8, ['array', 4, ['unsigned char']]],
    'VendorString' : [ 0x3cfc, ['array', 13, ['unsigned char']]],
    'InitialApicId' : [ 0x3d09, ['unsigned char']],
    'LogicalProcessorsPerPhysicalProcessor' : [ 0x3d0a, ['unsigned char']],
    'PrcbPad9' : [ 0x3d0b, ['array', 1, ['unsigned char']]],
    'FeatureBits' : [ 0x3d10, ['unsigned long long']],
    'UpdateSignature' : [ 0x3d18, ['_LARGE_INTEGER']],
    'IsrTime' : [ 0x3d20, ['unsigned long long']],
    'PrcbPad90' : [ 0x3d28, ['array', 2, ['unsigned long']]],
    'PowerState' : [ 0x3d30, ['_PROCESSOR_POWER_STATE']],
    'PrcbPad91' : [ 0x3eb0, ['array', 17, ['unsigned long']]],
    'DpcWatchdogDpc' : [ 0x3ef4, ['_KDPC']],
    'DpcWatchdogTimer' : [ 0x3f18, ['_KTIMER']],
    'HypercallPageList' : [ 0x3f40, ['_SLIST_HEADER']],
    'HypercallCachedPages' : [ 0x3f48, ['pointer', ['void']]],
    'VirtualApicAssist' : [ 0x3f4c, ['pointer', ['void']]],
    'StatisticsPage' : [ 0x3f50, ['pointer', ['unsigned long long']]],
    'Cache' : [ 0x3f54, ['array', 5, ['_CACHE_DESCRIPTOR']]],
    'CacheCount' : [ 0x3f90, ['unsigned long']],
    'PackageProcessorSet' : [ 0x3f94, ['_KAFFINITY_EX']],
    'SharedReadyQueueMask' : [ 0x3fa0, ['unsigned long']],
    'SharedReadyQueue' : [ 0x3fa4, ['pointer', ['_KSHARED_READY_QUEUE']]],
    'SharedQueueScanOwner' : [ 0x3fa8, ['unsigned long']],
    'CoreProcessorSet' : [ 0x3fac, ['unsigned long']],
    'ScanSiblingMask' : [ 0x3fb0, ['unsigned long']],
    'LLCMask' : [ 0x3fb4, ['unsigned long']],
    'CacheProcessorMask' : [ 0x3fb8, ['array', 5, ['unsigned long']]],
    'ScanSiblingIndex' : [ 0x3fcc, ['unsigned long']],
    'WheaInfo' : [ 0x3fd0, ['pointer', ['void']]],
    'EtwSupport' : [ 0x3fd4, ['pointer', ['void']]],
    'InterruptObjectPool' : [ 0x3fd8, ['_SLIST_HEADER']],
    'PrcbPad92' : [ 0x3fe0, ['array', 3, ['unsigned long']]],
    'PteBitCache' : [ 0x3fec, ['unsigned long']],
    'PteBitOffset' : [ 0x3ff0, ['unsigned long']],
    'PrcbPad93' : [ 0x3ff4, ['unsigned long']],
    'ProcessorProfileControlArea' : [ 0x3ff8, ['pointer', ['_PROCESSOR_PROFILE_CONTROL_AREA']]],
    'ProfileEventIndexAddress' : [ 0x3ffc, ['pointer', ['void']]],
    'TimerExpirationDpc' : [ 0x4000, ['_KDPC']],
    'SynchCounters' : [ 0x4020, ['_SYNCH_COUNTERS']],
    'FsCounters' : [ 0x40d8, ['_FILESYSTEM_DISK_COUNTERS']],
    'Context' : [ 0x40e8, ['pointer', ['_CONTEXT']]],
    'ContextFlagsInit' : [ 0x40ec, ['unsigned long']],
    'ExtendedState' : [ 0x40f0, ['pointer', ['_XSAVE_AREA']]],
    'EntropyTimingState' : [ 0x40f4, ['_KENTROPY_TIMING_STATE']],
    'IsrStack' : [ 0x421c, ['pointer', ['void']]],
    'VectorToInterruptObject' : [ 0x4220, ['array', 208, ['pointer', ['_KINTERRUPT']]]],
    'AbSelfIoBoostsList' : [ 0x4560, ['_SINGLE_LIST_ENTRY']],
    'AbPropagateBoostsList' : [ 0x4564, ['_SINGLE_LIST_ENTRY']],
    'AbDpc' : [ 0x4568, ['_KDPC']],
    'IoIrpStackProfilerCurrent' : [ 0x4588, ['_IOP_IRP_STACK_PROFILER']],
    'IoIrpStackProfilerPrevious' : [ 0x45dc, ['_IOP_IRP_STACK_PROFILER']],
    'TimerExpirationTrace' : [ 0x4630, ['array', 16, ['_KTIMER_EXPIRATION_TRACE']]],
    'TimerExpirationTraceCount' : [ 0x4730, ['unsigned long']],
    'ExSaPageArray' : [ 0x4734, ['pointer', ['void']]],
    'PrcbPad100' : [ 0x4738, ['array', 10, ['unsigned long']]],
    'LocalSharedReadyQueue' : [ 0x4760, ['_KSHARED_READY_QUEUE']],
    'PrcbPad95' : [ 0x4894, ['array', 12, ['unsigned char']]],
    'Mailbox' : [ 0x48a0, ['pointer', ['_REQUEST_MAILBOX']]],
    'PrcbPad' : [ 0x48a4, ['array', 1596, ['unsigned char']]],
    'KernelDirectoryTableBase' : [ 0x4ee0, ['unsigned long']],
    'EspBaseShadow' : [ 0x4ee4, ['unsigned long']],
    'UserEspShadow' : [ 0x4ee8, ['unsigned long']],
    'ShadowFlags' : [ 0x4eec, ['unsigned long']],
    'UserDS' : [ 0x4ef0, ['unsigned long']],
    'UserES' : [ 0x4ef4, ['unsigned long']],
    'UserFS' : [ 0x4ef8, ['unsigned long']],
    'EspIretd' : [ 0x4efc, ['pointer', ['void']]],
    'RestoreSegOption' : [ 0x4f00, ['unsigned long']],
    'SavedEsi' : [ 0x4f04, ['unsigned long']],
    'DbgLogs' : [ 0x4f08, ['array', 512, ['unsigned long']]],
    'DbgCount' : [ 0x5708, ['unsigned long']],
    'PrcbPadRemaingPage' : [ 0x570c, ['array', 501, ['unsigned long']]],
    'RequestMailbox' : [ 0x5ee0, ['array', 1, ['_REQUEST_MAILBOX']]],
} ],
  '_KAPC' : [ 0x30, {
    'Type' : [ 0x0, ['unsigned char']],
    'SpareByte0' : [ 0x1, ['unsigned char']],
    'Size' : [ 0x2, ['unsigned char']],
    'SpareByte1' : [ 0x3, ['unsigned char']],
    'SpareLong0' : [ 0x4, ['unsigned long']],
    'Thread' : [ 0x8, ['pointer', ['_KTHREAD']]],
    'ApcListEntry' : [ 0xc, ['_LIST_ENTRY']],
    'KernelRoutine' : [ 0x14, ['pointer', ['void']]],
    'RundownRoutine' : [ 0x18, ['pointer', ['void']]],
    'NormalRoutine' : [ 0x1c, ['pointer', ['void']]],
    'Reserved' : [ 0x14, ['array', 3, ['pointer', ['void']]]],
    'NormalContext' : [ 0x20, ['pointer', ['void']]],
    'SystemArgument1' : [ 0x24, ['pointer', ['void']]],
    'SystemArgument2' : [ 0x28, ['pointer', ['void']]],
    'ApcStateIndex' : [ 0x2c, ['unsigned char']],
    'ApcMode' : [ 0x2d, ['unsigned char']],
    'Inserted' : [ 0x2e, ['unsigned char']],
} ],
  '_CPU_INFO' : [ 0x10, {
    'AsUINT32' : [ 0x0, ['array', 4, ['unsigned long']]],
    'Eax' : [ 0x0, ['unsigned long']],
    'Ebx' : [ 0x4, ['unsigned long']],
    'Ecx' : [ 0x8, ['unsigned long']],
    'Edx' : [ 0xc, ['unsigned long']],
} ],
  '_EXT_SET_PARAMETERS_V0' : [ 0x10, {
    'Version' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'NoWakeTolerance' : [ 0x8, ['long long']],
} ],
  '_KPROCESS' : [ 0xa8, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'ProfileListHead' : [ 0x10, ['_LIST_ENTRY']],
    'DirectoryTableBase' : [ 0x18, ['unsigned long']],
    'LdtDescriptor' : [ 0x1c, ['_KGDTENTRY']],
    'Int21Descriptor' : [ 0x24, ['_KIDTENTRY']],
    'ThreadListHead' : [ 0x2c, ['_LIST_ENTRY']],
    'ProcessLock' : [ 0x34, ['unsigned long']],
    'DeepFreezeStartTime' : [ 0x38, ['unsigned long long']],
    'Affinity' : [ 0x40, ['_KAFFINITY_EX']],
    'ReadyListHead' : [ 0x4c, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0x54, ['_SINGLE_LIST_ENTRY']],
    'ActiveProcessors' : [ 0x58, ['_KAFFINITY_EX']],
    'AutoAlignment' : [ 0x64, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='long')]],
    'DisableBoost' : [ 0x64, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='long')]],
    'DisableQuantum' : [ 0x64, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='long')]],
    'DeepFreeze' : [ 0x64, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'TimerVirtualization' : [ 0x64, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'CheckStackExtents' : [ 0x64, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'SpareFlags0' : [ 0x64, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned long')]],
    'ActiveGroupsMask' : [ 0x64, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'ReservedFlags' : [ 0x64, ['BitField', dict(start_bit = 9, end_bit = 32, native_type='long')]],
    'ProcessFlags' : [ 0x64, ['long']],
    'BasePriority' : [ 0x68, ['unsigned char']],
    'QuantumReset' : [ 0x69, ['unsigned char']],
    'Visited' : [ 0x6a, ['unsigned char']],
    'Flags' : [ 0x6b, ['_KEXECUTE_OPTIONS']],
    'ThreadSeed' : [ 0x6c, ['array', 1, ['unsigned long']]],
    'IdealNode' : [ 0x70, ['array', 1, ['unsigned short']]],
    'IdealGlobalNode' : [ 0x72, ['unsigned short']],
    'AddressPolicy' : [ 0x74, ['unsigned char']],
    'Spare1' : [ 0x75, ['unsigned char']],
    'IopmOffset' : [ 0x76, ['unsigned short']],
    'SchedulingGroup' : [ 0x78, ['pointer', ['_KSCHEDULING_GROUP']]],
    'StackCount' : [ 0x7c, ['_KSTACK_COUNT']],
    'ProcessListEntry' : [ 0x80, ['_LIST_ENTRY']],
    'CycleTime' : [ 0x88, ['unsigned long long']],
    'ContextSwitches' : [ 0x90, ['unsigned long long']],
    'FreezeCount' : [ 0x98, ['unsigned long']],
    'KernelTime' : [ 0x9c, ['unsigned long']],
    'UserTime' : [ 0xa0, ['unsigned long']],
    'VdmTrapcHandler' : [ 0xa4, ['pointer', ['void']]],
} ],
  '_KTHREAD' : [ 0x348, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'SListFaultAddress' : [ 0x10, ['pointer', ['void']]],
    'QuantumTarget' : [ 0x18, ['unsigned long long']],
    'InitialStack' : [ 0x20, ['pointer', ['void']]],
    'StackLimit' : [ 0x24, ['pointer', ['void']]],
    'StackBase' : [ 0x28, ['pointer', ['void']]],
    'ThreadLock' : [ 0x2c, ['unsigned long']],
    'CycleTime' : [ 0x30, ['unsigned long long']],
    'HighCycleTime' : [ 0x38, ['unsigned long']],
    'ServiceTable' : [ 0x3c, ['pointer', ['void']]],
    'CurrentRunTime' : [ 0x40, ['unsigned long']],
    'ExpectedRunTime' : [ 0x44, ['unsigned long']],
    'KernelStack' : [ 0x48, ['pointer', ['void']]],
    'StateSaveArea' : [ 0x4c, ['pointer', ['_XSAVE_FORMAT']]],
    'SchedulingGroup' : [ 0x50, ['pointer', ['_KSCHEDULING_GROUP']]],
    'WaitRegister' : [ 0x54, ['_KWAIT_STATUS_REGISTER']],
    'Running' : [ 0x55, ['unsigned char']],
    'Alerted' : [ 0x56, ['array', 2, ['unsigned char']]],
    'AutoBoostActive' : [ 0x58, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReadyTransition' : [ 0x58, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'WaitNext' : [ 0x58, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'SystemAffinityActive' : [ 0x58, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Alertable' : [ 0x58, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'UserStackWalkActive' : [ 0x58, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ApcInterruptRequest' : [ 0x58, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'QuantumEndMigrate' : [ 0x58, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'UmsDirectedSwitchEnable' : [ 0x58, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'TimerActive' : [ 0x58, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'SystemThread' : [ 0x58, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ProcessDetachActive' : [ 0x58, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'CalloutActive' : [ 0x58, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'ScbReadyQueue' : [ 0x58, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'ApcQueueable' : [ 0x58, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'ReservedStackInUse' : [ 0x58, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'UmsPerformingSyscall' : [ 0x58, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'TimerSuspended' : [ 0x58, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'SuspendedWaitMode' : [ 0x58, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'SuspendSchedulerApcWait' : [ 0x58, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'Reserved' : [ 0x58, ['BitField', dict(start_bit = 20, end_bit = 32, native_type='unsigned long')]],
    'MiscFlags' : [ 0x58, ['long']],
    'AutoAlignment' : [ 0x5c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DisableBoost' : [ 0x5c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ThreadFlagsSpare0' : [ 0x5c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'AlertedByThreadId' : [ 0x5c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'QuantumDonation' : [ 0x5c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'EnableStackSwap' : [ 0x5c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'GuiThread' : [ 0x5c, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DisableQuantum' : [ 0x5c, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ChargeOnlySchedulingGroup' : [ 0x5c, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'DeferPreemption' : [ 0x5c, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'QueueDeferPreemption' : [ 0x5c, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ForceDeferSchedule' : [ 0x5c, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'SharedReadyQueueAffinity' : [ 0x5c, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'FreezeCount' : [ 0x5c, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'TerminationApcRequest' : [ 0x5c, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'AutoBoostEntriesExhausted' : [ 0x5c, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'KernelStackResident' : [ 0x5c, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'CommitFailTerminateRequest' : [ 0x5c, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'ProcessStackCountDecremented' : [ 0x5c, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'ThreadFlagsSpare' : [ 0x5c, ['BitField', dict(start_bit = 19, end_bit = 24, native_type='unsigned long')]],
    'EtwStackTraceApcInserted' : [ 0x5c, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'ThreadFlags' : [ 0x5c, ['long']],
    'Tag' : [ 0x60, ['unsigned char']],
    'SystemHeteroCpuPolicy' : [ 0x61, ['unsigned char']],
    'UserHeteroCpuPolicy' : [ 0x62, ['BitField', dict(start_bit = 0, end_bit = 7, native_type='unsigned char')]],
    'ExplicitSystemHeteroCpuPolicy' : [ 0x62, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'Spare0' : [ 0x63, ['unsigned char']],
    'SystemCallNumber' : [ 0x64, ['unsigned long']],
    'FirstArgument' : [ 0x68, ['pointer', ['void']]],
    'TrapFrame' : [ 0x6c, ['pointer', ['_KTRAP_FRAME']]],
    'ApcState' : [ 0x70, ['_KAPC_STATE']],
    'ApcStateFill' : [ 0x70, ['array', 23, ['unsigned char']]],
    'Priority' : [ 0x87, ['unsigned char']],
    'UserIdealProcessor' : [ 0x88, ['unsigned long']],
    'ContextSwitches' : [ 0x8c, ['unsigned long']],
    'State' : [ 0x90, ['unsigned char']],
    'Spare12' : [ 0x91, ['unsigned char']],
    'WaitIrql' : [ 0x92, ['unsigned char']],
    'WaitMode' : [ 0x93, ['unsigned char']],
    'WaitStatus' : [ 0x94, ['long']],
    'WaitBlockList' : [ 0x98, ['pointer', ['_KWAIT_BLOCK']]],
    'WaitListEntry' : [ 0x9c, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0x9c, ['_SINGLE_LIST_ENTRY']],
    'Queue' : [ 0xa4, ['pointer', ['_DISPATCHER_HEADER']]],
    'Teb' : [ 0xa8, ['pointer', ['void']]],
    'RelativeTimerBias' : [ 0xb0, ['unsigned long long']],
    'Timer' : [ 0xb8, ['_KTIMER']],
    'WaitBlock' : [ 0xe0, ['array', 4, ['_KWAIT_BLOCK']]],
    'WaitBlockFill8' : [ 0xe0, ['array', 20, ['unsigned char']]],
    'ThreadCounters' : [ 0xf4, ['pointer', ['_KTHREAD_COUNTERS']]],
    'WaitBlockFill9' : [ 0xe0, ['array', 44, ['unsigned char']]],
    'XStateSave' : [ 0x10c, ['pointer', ['_XSTATE_SAVE']]],
    'WaitBlockFill10' : [ 0xe0, ['array', 68, ['unsigned char']]],
    'Win32Thread' : [ 0x124, ['pointer', ['void']]],
    'WaitBlockFill11' : [ 0xe0, ['array', 88, ['unsigned char']]],
    'WaitTime' : [ 0x138, ['unsigned long']],
    'KernelApcDisable' : [ 0x13c, ['short']],
    'SpecialApcDisable' : [ 0x13e, ['short']],
    'CombinedApcDisable' : [ 0x13c, ['unsigned long']],
    'QueueListEntry' : [ 0x140, ['_LIST_ENTRY']],
    'NextProcessor' : [ 0x148, ['unsigned long']],
    'NextProcessorNumber' : [ 0x148, ['BitField', dict(start_bit = 0, end_bit = 31, native_type='unsigned long')]],
    'SharedReadyQueue' : [ 0x148, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'QueuePriority' : [ 0x14c, ['long']],
    'Process' : [ 0x150, ['pointer', ['_KPROCESS']]],
    'UserAffinity' : [ 0x154, ['_GROUP_AFFINITY']],
    'UserAffinityFill' : [ 0x154, ['array', 6, ['unsigned char']]],
    'PreviousMode' : [ 0x15a, ['unsigned char']],
    'BasePriority' : [ 0x15b, ['unsigned char']],
    'PriorityDecrement' : [ 0x15c, ['unsigned char']],
    'ForegroundBoost' : [ 0x15c, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'UnusualBoost' : [ 0x15c, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Preempted' : [ 0x15d, ['unsigned char']],
    'AdjustReason' : [ 0x15e, ['unsigned char']],
    'AdjustIncrement' : [ 0x15f, ['unsigned char']],
    'AffinityVersion' : [ 0x160, ['unsigned long']],
    'Affinity' : [ 0x164, ['_GROUP_AFFINITY']],
    'AffinityFill' : [ 0x164, ['array', 6, ['unsigned char']]],
    'ApcStateIndex' : [ 0x16a, ['unsigned char']],
    'WaitBlockCount' : [ 0x16b, ['unsigned char']],
    'IdealProcessor' : [ 0x16c, ['unsigned long']],
    'Spare15' : [ 0x170, ['array', 1, ['unsigned long']]],
    'SavedApcState' : [ 0x174, ['_KAPC_STATE']],
    'SavedApcStateFill' : [ 0x174, ['array', 23, ['unsigned char']]],
    'WaitReason' : [ 0x18b, ['unsigned char']],
    'SuspendCount' : [ 0x18c, ['unsigned char']],
    'Saturation' : [ 0x18d, ['unsigned char']],
    'SListFaultCount' : [ 0x18e, ['unsigned short']],
    'SchedulerApc' : [ 0x190, ['_KAPC']],
    'SchedulerApcFill0' : [ 0x190, ['array', 1, ['unsigned char']]],
    'ResourceIndex' : [ 0x191, ['unsigned char']],
    'SchedulerApcFill1' : [ 0x190, ['array', 3, ['unsigned char']]],
    'QuantumReset' : [ 0x193, ['unsigned char']],
    'SchedulerApcFill2' : [ 0x190, ['array', 4, ['unsigned char']]],
    'KernelTime' : [ 0x194, ['unsigned long']],
    'SchedulerApcFill3' : [ 0x190, ['array', 36, ['unsigned char']]],
    'WaitPrcb' : [ 0x1b4, ['pointer', ['_KPRCB']]],
    'SchedulerApcFill4' : [ 0x190, ['array', 40, ['unsigned char']]],
    'LegoData' : [ 0x1b8, ['pointer', ['void']]],
    'SchedulerApcFill5' : [ 0x190, ['array', 47, ['unsigned char']]],
    'CallbackNestingLevel' : [ 0x1bf, ['unsigned char']],
    'UserTime' : [ 0x1c0, ['unsigned long']],
    'SuspendEvent' : [ 0x1c4, ['_KEVENT']],
    'ThreadListEntry' : [ 0x1d4, ['_LIST_ENTRY']],
    'MutantListHead' : [ 0x1dc, ['_LIST_ENTRY']],
    'AbEntrySummary' : [ 0x1e4, ['unsigned char']],
    'AbWaitEntryCount' : [ 0x1e5, ['unsigned char']],
    'Spare20' : [ 0x1e6, ['unsigned short']],
    'LockEntries' : [ 0x1e8, ['array', 6, ['_KLOCK_ENTRY']]],
    'PropagateBoostsEntry' : [ 0x308, ['_SINGLE_LIST_ENTRY']],
    'IoSelfBoostsEntry' : [ 0x30c, ['_SINGLE_LIST_ENTRY']],
    'PriorityFloorCounts' : [ 0x310, ['array', 16, ['unsigned char']]],
    'PriorityFloorSummary' : [ 0x320, ['unsigned long']],
    'AbCompletedIoBoostCount' : [ 0x324, ['long']],
    'KeReferenceCount' : [ 0x328, ['short']],
    'AbOrphanedEntrySummary' : [ 0x32a, ['unsigned char']],
    'AbOwnedEntryCount' : [ 0x32b, ['unsigned char']],
    'ForegroundLossTime' : [ 0x32c, ['unsigned long']],
    'GlobalForegroundListEntry' : [ 0x330, ['_LIST_ENTRY']],
    'ForegroundDpcStackListEntry' : [ 0x330, ['_SINGLE_LIST_ENTRY']],
    'InGlobalForegroundList' : [ 0x334, ['unsigned long']],
    'QueuedScb' : [ 0x338, ['pointer', ['_KSCB']]],
    'NpxState' : [ 0x340, ['unsigned long long']],
} ],
  '_KSTACK_CONTROL' : [ 0x20, {
    'StackBase' : [ 0x0, ['unsigned long']],
    'ActualLimit' : [ 0x4, ['unsigned long']],
    'StackExpansion' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PreviousTrapFrame' : [ 0x8, ['pointer', ['_KTRAP_FRAME']]],
    'PreviousExceptionList' : [ 0xc, ['pointer', ['void']]],
    'Previous' : [ 0x10, ['_KERNEL_STACK_SEGMENT']],
} ],
  '_KSPIN_LOCK_QUEUE' : [ 0x8, {
    'Next' : [ 0x0, ['pointer', ['_KSPIN_LOCK_QUEUE']]],
    'Lock' : [ 0x4, ['pointer', ['unsigned long']]],
} ],
  '_FAST_MUTEX' : [ 0x20, {
    'Count' : [ 0x0, ['long']],
    'Owner' : [ 0x4, ['pointer', ['void']]],
    'Contention' : [ 0x8, ['unsigned long']],
    'Event' : [ 0xc, ['_KEVENT']],
    'OldIrql' : [ 0x1c, ['unsigned long']],
} ],
  '_KEVENT' : [ 0x10, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
} ],
  '_SLIST_HEADER' : [ 0x8, {
    'Alignment' : [ 0x0, ['unsigned long long']],
    'Next' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x4, ['unsigned short']],
    'CpuId' : [ 0x6, ['unsigned short']],
} ],
  '_LOOKASIDE_LIST_EX' : [ 0x48, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE_POOL']],
} ],
  '_NPAGED_LOOKASIDE_LIST' : [ 0xc0, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
    'Lock__ObsoleteButDoNotDelete' : [ 0x80, ['unsigned long']],
} ],
  '_PAGED_LOOKASIDE_LIST' : [ 0xc0, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
    'Lock__ObsoleteButDoNotDelete' : [ 0x80, ['_FAST_MUTEX']],
} ],
  '_IO_STATUS_BLOCK' : [ 0x8, {
    'Status' : [ 0x0, ['long']],
    'Pointer' : [ 0x0, ['pointer', ['void']]],
    'Information' : [ 0x4, ['unsigned long']],
} ],
  '_QUAD' : [ 0x8, {
    'UseThisFieldToCopy' : [ 0x0, ['long long']],
    'DoNotUseThisField' : [ 0x0, ['double']],
} ],
  '_WORK_QUEUE_ITEM' : [ 0x10, {
    'List' : [ 0x0, ['_LIST_ENTRY']],
    'WorkerRoutine' : [ 0x8, ['pointer', ['void']]],
    'Parameter' : [ 0xc, ['pointer', ['void']]],
} ],
  '_EXT_DELETE_PARAMETERS' : [ 0x10, {
    'Version' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'DeleteCallback' : [ 0x8, ['pointer', ['void']]],
    'DeleteContext' : [ 0xc, ['pointer', ['void']]],
} ],
  '_EX_PUSH_LOCK' : [ 0x4, {
    'Locked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Waiting' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Waking' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'MultipleShared' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Shared' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
    'Value' : [ 0x0, ['unsigned long']],
    'Ptr' : [ 0x0, ['pointer', ['void']]],
} ],
  '_PP_LOOKASIDE_LIST' : [ 0x8, {
    'P' : [ 0x0, ['pointer', ['_GENERAL_LOOKASIDE']]],
    'L' : [ 0x4, ['pointer', ['_GENERAL_LOOKASIDE']]],
} ],
  '_GENERAL_LOOKASIDE' : [ 0x80, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'SingleListHead' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x8, ['unsigned short']],
    'MaximumDepth' : [ 0xa, ['unsigned short']],
    'TotalAllocates' : [ 0xc, ['unsigned long']],
    'AllocateMisses' : [ 0x10, ['unsigned long']],
    'AllocateHits' : [ 0x10, ['unsigned long']],
    'TotalFrees' : [ 0x14, ['unsigned long']],
    'FreeMisses' : [ 0x18, ['unsigned long']],
    'FreeHits' : [ 0x18, ['unsigned long']],
    'Type' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: u'NonPagedPoolBase', 1: u'PagedPool', 2: u'NonPagedPoolBaseMustSucceed', 3: u'DontUseThisType', 4: u'NonPagedPoolBaseCacheAligned', 5: u'PagedPoolCacheAligned', 6: u'NonPagedPoolBaseCacheAlignedMustS', 7: u'MaxPoolType', 34: u'NonPagedPoolMustSucceedSession', 516: u'NonPagedPoolNxCacheAligned', 35: u'DontUseThisTypeSession', 32: u'NonPagedPoolSession', 512: u'NonPagedPoolNx', 544: u'NonPagedPoolSessionNx', 36: u'NonPagedPoolCacheAlignedSession', 33: u'PagedPoolSession', 38: u'NonPagedPoolCacheAlignedMustSSession', 37: u'PagedPoolCacheAlignedSession'})]],
    'Tag' : [ 0x20, ['unsigned long']],
    'Size' : [ 0x24, ['unsigned long']],
    'AllocateEx' : [ 0x28, ['pointer', ['void']]],
    'Allocate' : [ 0x28, ['pointer', ['void']]],
    'FreeEx' : [ 0x2c, ['pointer', ['void']]],
    'Free' : [ 0x2c, ['pointer', ['void']]],
    'ListEntry' : [ 0x30, ['_LIST_ENTRY']],
    'LastTotalAllocates' : [ 0x38, ['unsigned long']],
    'LastAllocateMisses' : [ 0x3c, ['unsigned long']],
    'LastAllocateHits' : [ 0x3c, ['unsigned long']],
    'Future' : [ 0x40, ['array', 2, ['unsigned long']]],
} ],
  '_KNODE' : [ 0x100, {
    'IdleNonParkedCpuSet' : [ 0x0, ['unsigned long']],
    'IdleSmtSet' : [ 0x4, ['unsigned long']],
    'IdleCpuSet' : [ 0x8, ['unsigned long']],
    'DeepIdleSet' : [ 0x40, ['unsigned long']],
    'IdleConstrainedSet' : [ 0x44, ['unsigned long']],
    'NonParkedSet' : [ 0x48, ['unsigned long']],
    'ParkLock' : [ 0x4c, ['long']],
    'Seed' : [ 0x50, ['unsigned long']],
    'SiblingMask' : [ 0x80, ['unsigned long']],
    'Affinity' : [ 0x84, ['_GROUP_AFFINITY']],
    'AffinityFill' : [ 0x84, ['array', 6, ['unsigned char']]],
    'NodeNumber' : [ 0x8a, ['unsigned short']],
    'PrimaryNodeNumber' : [ 0x8c, ['unsigned short']],
    'Stride' : [ 0x8e, ['unsigned char']],
    'Spare0' : [ 0x8f, ['unsigned char']],
    'SharedReadyQueueLeaders' : [ 0x90, ['unsigned long']],
    'ProximityId' : [ 0x94, ['unsigned long']],
    'Lowest' : [ 0x98, ['unsigned long']],
    'Highest' : [ 0x9c, ['unsigned long']],
    'MaximumProcessors' : [ 0xa0, ['unsigned char']],
    'Flags' : [ 0xa1, ['_flags']],
    'Spare10' : [ 0xa2, ['unsigned char']],
    'HeteroSets' : [ 0xa4, ['array', 5, ['_KHETERO_PROCESSOR_SET']]],
} ],
  '_ENODE' : [ 0x380, {
    'Ncb' : [ 0x0, ['_KNODE']],
    'ExWorkQueues' : [ 0x100, ['array', 8, ['pointer', ['_EX_WORK_QUEUE']]]],
    'ExWorkQueue' : [ 0x120, ['_EX_WORK_QUEUE']],
    'ExpThreadSetManagerEvent' : [ 0x2d8, ['_KEVENT']],
    'ExpDeadlockTimer' : [ 0x2e8, ['_KTIMER']],
    'ExpThreadReaperEvent' : [ 0x310, ['_KEVENT']],
    'WaitBlocks' : [ 0x320, ['array', 3, ['_KWAIT_BLOCK']]],
    'ExpWorkerThreadBalanceManagerPtr' : [ 0x368, ['pointer', ['_ETHREAD']]],
    'ExpWorkerSeed' : [ 0x36c, ['unsigned long']],
    'ExWorkerFullInit' : [ 0x370, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ExWorkerStructInit' : [ 0x370, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ExWorkerFlags' : [ 0x370, ['unsigned long']],
} ],
  '_HANDLE_TABLE' : [ 0x5c, {
    'NextHandleNeedingPool' : [ 0x0, ['unsigned long']],
    'ExtraInfoPages' : [ 0x4, ['long']],
    'TableCode' : [ 0x8, ['unsigned long']],
    'QuotaProcess' : [ 0xc, ['pointer', ['_EPROCESS']]],
    'HandleTableList' : [ 0x10, ['_LIST_ENTRY']],
    'UniqueProcessId' : [ 0x18, ['unsigned long']],
    'Flags' : [ 0x1c, ['unsigned long']],
    'StrictFIFO' : [ 0x1c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'EnableHandleExceptions' : [ 0x1c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Rundown' : [ 0x1c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Duplicated' : [ 0x1c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'RaiseUMExceptionOnInvalidHandleClose' : [ 0x1c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'HandleContentionEvent' : [ 0x20, ['_EX_PUSH_LOCK']],
    'HandleTableLock' : [ 0x24, ['_EX_PUSH_LOCK']],
    'FreeLists' : [ 0x28, ['array', 1, ['_HANDLE_TABLE_FREE_LIST']]],
    'ActualEntry' : [ 0x28, ['array', 20, ['unsigned char']]],
    'DebugInfo' : [ 0x3c, ['pointer', ['_HANDLE_TRACE_DEBUG_INFO']]],
} ],
  '_HANDLE_TABLE_ENTRY_INFO' : [ 0x4, {
    'AuditMask' : [ 0x0, ['unsigned long']],
} ],
  '_HANDLE_TABLE_ENTRY' : [ 0x8, {
    'VolatileLowValue' : [ 0x0, ['long']],
    'LowValue' : [ 0x0, ['long']],
    'InfoTable' : [ 0x0, ['pointer', ['_HANDLE_TABLE_ENTRY_INFO']]],
    'HighValue' : [ 0x4, ['long']],
    'NextFreeHandleEntry' : [ 0x4, ['pointer', ['_HANDLE_TABLE_ENTRY']]],
    'LeafHandleValue' : [ 0x4, ['_EXHANDLE']],
    'Unlocked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Attributes' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 3, native_type='unsigned long')]],
    'ObjectPointerBits' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'RefCountField' : [ 0x4, ['long']],
    'GrantedAccessBits' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 25, native_type='unsigned long')]],
    'ProtectFromClose' : [ 0x4, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'NoRightsUpgrade' : [ 0x4, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'RefCnt' : [ 0x4, ['BitField', dict(start_bit = 27, end_bit = 32, native_type='unsigned long')]],
} ],
  '_EX_FAST_REF' : [ 0x4, {
    'Object' : [ 0x0, ['pointer', ['void']]],
    'RefCnt' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'Value' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_1321' : [ 0x2c, {
    'InitialPrivilegeSet' : [ 0x0, ['_INITIAL_PRIVILEGE_SET']],
    'PrivilegeSet' : [ 0x0, ['_PRIVILEGE_SET']],
} ],
  '_ACCESS_STATE' : [ 0x74, {
    'OperationID' : [ 0x0, ['_LUID']],
    'SecurityEvaluated' : [ 0x8, ['unsigned char']],
    'GenerateAudit' : [ 0x9, ['unsigned char']],
    'GenerateOnClose' : [ 0xa, ['unsigned char']],
    'PrivilegesAllocated' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['unsigned long']],
    'RemainingDesiredAccess' : [ 0x10, ['unsigned long']],
    'PreviouslyGrantedAccess' : [ 0x14, ['unsigned long']],
    'OriginalDesiredAccess' : [ 0x18, ['unsigned long']],
    'SubjectSecurityContext' : [ 0x1c, ['_SECURITY_SUBJECT_CONTEXT']],
    'SecurityDescriptor' : [ 0x2c, ['pointer', ['void']]],
    'AuxData' : [ 0x30, ['pointer', ['void']]],
    'Privileges' : [ 0x34, ['__unnamed_1321']],
    'AuditPrivileges' : [ 0x60, ['unsigned char']],
    'ObjectName' : [ 0x64, ['_UNICODE_STRING']],
    'ObjectTypeName' : [ 0x6c, ['_UNICODE_STRING']],
} ],
  '_AUX_ACCESS_DATA' : [ 0xc4, {
    'PrivilegesUsed' : [ 0x0, ['pointer', ['_PRIVILEGE_SET']]],
    'GenericMapping' : [ 0x4, ['_GENERIC_MAPPING']],
    'AccessesToAudit' : [ 0x14, ['unsigned long']],
    'MaximumAuditMask' : [ 0x18, ['unsigned long']],
    'TransactionId' : [ 0x1c, ['_GUID']],
    'NewSecurityDescriptor' : [ 0x2c, ['pointer', ['void']]],
    'ExistingSecurityDescriptor' : [ 0x30, ['pointer', ['void']]],
    'ParentSecurityDescriptor' : [ 0x34, ['pointer', ['void']]],
    'DeRefSecurityDescriptor' : [ 0x38, ['pointer', ['void']]],
    'SDLock' : [ 0x3c, ['pointer', ['void']]],
    'AccessReasons' : [ 0x40, ['_ACCESS_REASONS']],
    'GenerateStagingEvents' : [ 0xc0, ['unsigned char']],
} ],
  '_OBJECT_HANDLE_INFORMATION' : [ 0x8, {
    'HandleAttributes' : [ 0x0, ['unsigned long']],
    'GrantedAccess' : [ 0x4, ['unsigned long']],
} ],
  '_ETHREAD' : [ 0x458, {
    'Tcb' : [ 0x0, ['_KTHREAD']],
    'CreateTime' : [ 0x348, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0x350, ['_LARGE_INTEGER']],
    'KeyedWaitChain' : [ 0x350, ['_LIST_ENTRY']],
    'ChargeOnlySession' : [ 0x358, ['pointer', ['void']]],
    'PostBlockList' : [ 0x35c, ['_LIST_ENTRY']],
    'ForwardLinkShadow' : [ 0x35c, ['pointer', ['void']]],
    'StartAddress' : [ 0x360, ['pointer', ['void']]],
    'TerminationPort' : [ 0x364, ['pointer', ['_TERMINATION_PORT']]],
    'ReaperLink' : [ 0x364, ['pointer', ['_ETHREAD']]],
    'KeyedWaitValue' : [ 0x364, ['pointer', ['void']]],
    'ActiveTimerListLock' : [ 0x368, ['unsigned long']],
    'ActiveTimerListHead' : [ 0x36c, ['_LIST_ENTRY']],
    'Cid' : [ 0x374, ['_CLIENT_ID']],
    'KeyedWaitSemaphore' : [ 0x37c, ['_KSEMAPHORE']],
    'AlpcWaitSemaphore' : [ 0x37c, ['_KSEMAPHORE']],
    'ClientSecurity' : [ 0x390, ['_PS_CLIENT_SECURITY_CONTEXT']],
    'IrpList' : [ 0x394, ['_LIST_ENTRY']],
    'TopLevelIrp' : [ 0x39c, ['unsigned long']],
    'DeviceToVerify' : [ 0x3a0, ['pointer', ['_DEVICE_OBJECT']]],
    'Win32StartAddress' : [ 0x3a4, ['pointer', ['void']]],
    'LegacyPowerObject' : [ 0x3a8, ['pointer', ['void']]],
    'ThreadListEntry' : [ 0x3ac, ['_LIST_ENTRY']],
    'RundownProtect' : [ 0x3b4, ['_EX_RUNDOWN_REF']],
    'ThreadLock' : [ 0x3b8, ['_EX_PUSH_LOCK']],
    'ReadClusterSize' : [ 0x3bc, ['unsigned long']],
    'MmLockOrdering' : [ 0x3c0, ['long']],
    'CmLockOrdering' : [ 0x3c4, ['long']],
    'CrossThreadFlags' : [ 0x3c8, ['unsigned long']],
    'Terminated' : [ 0x3c8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ThreadInserted' : [ 0x3c8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'HideFromDebugger' : [ 0x3c8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ActiveImpersonationInfo' : [ 0x3c8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'HardErrorsAreDisabled' : [ 0x3c8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0x3c8, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'SkipCreationMsg' : [ 0x3c8, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'SkipTerminationMsg' : [ 0x3c8, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'CopyTokenOnOpen' : [ 0x3c8, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'ThreadIoPriority' : [ 0x3c8, ['BitField', dict(start_bit = 9, end_bit = 12, native_type='unsigned long')]],
    'ThreadPagePriority' : [ 0x3c8, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
    'RundownFail' : [ 0x3c8, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'UmsForceQueueTermination' : [ 0x3c8, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'IndirectCpuSets' : [ 0x3c8, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'ReservedCrossThreadFlags' : [ 0x3c8, ['BitField', dict(start_bit = 18, end_bit = 32, native_type='unsigned long')]],
    'SameThreadPassiveFlags' : [ 0x3cc, ['unsigned long']],
    'ActiveExWorker' : [ 0x3cc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MemoryMaker' : [ 0x3cc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ClonedThread' : [ 0x3cc, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'KeyedEventInUse' : [ 0x3cc, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'SelfTerminate' : [ 0x3cc, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'RespectIoPriority' : [ 0x3cc, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ReservedSameThreadPassiveFlags' : [ 0x3cc, ['BitField', dict(start_bit = 6, end_bit = 32, native_type='unsigned long')]],
    'SameThreadApcFlags' : [ 0x3d0, ['unsigned long']],
    'OwnsProcessAddressSpaceExclusive' : [ 0x3d0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'OwnsProcessAddressSpaceShared' : [ 0x3d0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'HardFaultBehavior' : [ 0x3d0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'StartAddressInvalid' : [ 0x3d0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'EtwCalloutActive' : [ 0x3d0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'SuppressSymbolLoad' : [ 0x3d0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'Prefetching' : [ 0x3d0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'OwnsVadExclusive' : [ 0x3d0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'SystemPagePriorityActive' : [ 0x3d1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'SystemPagePriority' : [ 0x3d1, ['BitField', dict(start_bit = 1, end_bit = 4, native_type='unsigned char')]],
    'CacheManagerActive' : [ 0x3d4, ['unsigned char']],
    'DisablePageFaultClustering' : [ 0x3d5, ['unsigned char']],
    'ActiveFaultCount' : [ 0x3d6, ['unsigned char']],
    'LockOrderState' : [ 0x3d7, ['unsigned char']],
    'AlpcMessageId' : [ 0x3d8, ['unsigned long']],
    'AlpcMessage' : [ 0x3dc, ['pointer', ['void']]],
    'AlpcReceiveAttributeSet' : [ 0x3dc, ['unsigned long']],
    'ExitStatus' : [ 0x3e0, ['long']],
    'AlpcWaitListEntry' : [ 0x3e4, ['_LIST_ENTRY']],
    'CacheManagerCount' : [ 0x3ec, ['unsigned long']],
    'IoBoostCount' : [ 0x3f0, ['unsigned long']],
    'BoostList' : [ 0x3f4, ['_LIST_ENTRY']],
    'DeboostList' : [ 0x3fc, ['_LIST_ENTRY']],
    'BoostListLock' : [ 0x404, ['unsigned long']],
    'IrpListLock' : [ 0x408, ['unsigned long']],
    'ReservedForSynchTracking' : [ 0x40c, ['pointer', ['void']]],
    'CmCallbackListHead' : [ 0x410, ['_SINGLE_LIST_ENTRY']],
    'ActivityId' : [ 0x414, ['pointer', ['_GUID']]],
    'SeLearningModeListHead' : [ 0x418, ['_SINGLE_LIST_ENTRY']],
    'VerifierContext' : [ 0x41c, ['pointer', ['void']]],
    'KernelStackReference' : [ 0x420, ['unsigned long']],
    'AdjustedClientToken' : [ 0x424, ['pointer', ['void']]],
    'WorkingOnBehalfClient' : [ 0x428, ['pointer', ['void']]],
    'PropertySet' : [ 0x42c, ['_PS_PROPERTY_SET']],
    'PicoContext' : [ 0x438, ['pointer', ['void']]],
    'UserFsBase' : [ 0x43c, ['unsigned long']],
    'UserGsBase' : [ 0x440, ['unsigned long']],
    'EnergyValues' : [ 0x444, ['pointer', ['_THREAD_ENERGY_VALUES']]],
    'CmCellReferences' : [ 0x448, ['unsigned long']],
    'SelectedCpuSets' : [ 0x44c, ['unsigned long']],
    'SelectedCpuSetsIndirect' : [ 0x44c, ['pointer', ['unsigned long']]],
    'Silo' : [ 0x450, ['pointer', ['_ESILO']]],
} ],
  '_EPROCESS' : [ 0x388, {
    'Pcb' : [ 0x0, ['_KPROCESS']],
    'ProcessLock' : [ 0xa8, ['_EX_PUSH_LOCK']],
    'RundownProtect' : [ 0xac, ['_EX_RUNDOWN_REF']],
    'VdmObjects' : [ 0xb0, ['pointer', ['void']]],
    'UniqueProcessId' : [ 0xb4, ['pointer', ['void']]],
    'ActiveProcessLinks' : [ 0xb8, ['_LIST_ENTRY']],
    'Flags2' : [ 0xc0, ['unsigned long']],
    'JobNotReallyActive' : [ 0xc0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AccountingFolded' : [ 0xc0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'NewProcessReported' : [ 0xc0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ExitProcessReported' : [ 0xc0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ReportCommitChanges' : [ 0xc0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'LastReportMemory' : [ 0xc0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ForceWakeCharge' : [ 0xc0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'CrossSessionCreate' : [ 0xc0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'NeedsHandleRundown' : [ 0xc0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'RefTraceEnabled' : [ 0xc0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DisableDynamicCode' : [ 0xc0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'EmptyJobEvaluated' : [ 0xc0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DefaultPagePriority' : [ 0xc0, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
    'PrimaryTokenFrozen' : [ 0xc0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessVerifierTarget' : [ 0xc0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'StackRandomizationDisabled' : [ 0xc0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'AffinityPermanent' : [ 0xc0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'AffinityUpdateEnable' : [ 0xc0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'PropagateNode' : [ 0xc0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'ExplicitAffinity' : [ 0xc0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ProcessExecutionState' : [ 0xc0, ['BitField', dict(start_bit = 22, end_bit = 24, native_type='unsigned long')]],
    'DisallowStrippedImages' : [ 0xc0, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'HighEntropyASLREnabled' : [ 0xc0, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'ExtensionPointDisable' : [ 0xc0, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'ForceRelocateImages' : [ 0xc0, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'ProcessStateChangeRequest' : [ 0xc0, ['BitField', dict(start_bit = 28, end_bit = 30, native_type='unsigned long')]],
    'ProcessStateChangeInProgress' : [ 0xc0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'DisallowWin32kSystemCalls' : [ 0xc0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'Flags' : [ 0xc4, ['unsigned long']],
    'CreateReported' : [ 0xc4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'NoDebugInherit' : [ 0xc4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessExiting' : [ 0xc4, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ProcessDelete' : [ 0xc4, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ControlFlowGuardEnabled' : [ 0xc4, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'VmDeleted' : [ 0xc4, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'OutswapEnabled' : [ 0xc4, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Outswapped' : [ 0xc4, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'FailFastOnCommitFail' : [ 0xc4, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Wow64VaSpace4Gb' : [ 0xc4, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'AddressSpaceInitialized' : [ 0xc4, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
    'SetTimerResolution' : [ 0xc4, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0xc4, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'DeprioritizeViews' : [ 0xc4, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'WriteWatch' : [ 0xc4, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessInSession' : [ 0xc4, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'OverrideAddressSpace' : [ 0xc4, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HasAddressSpace' : [ 0xc4, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'LaunchPrefetched' : [ 0xc4, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'Background' : [ 0xc4, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'VmTopDown' : [ 0xc4, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ImageNotifyDone' : [ 0xc4, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'PdeUpdateNeeded' : [ 0xc4, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'VdmAllowed' : [ 0xc4, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'ProcessRundown' : [ 0xc4, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'ProcessInserted' : [ 0xc4, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'DefaultIoPriority' : [ 0xc4, ['BitField', dict(start_bit = 27, end_bit = 30, native_type='unsigned long')]],
    'ProcessSelfDelete' : [ 0xc4, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'SetTimerResolutionLink' : [ 0xc4, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'CreateTime' : [ 0xc8, ['_LARGE_INTEGER']],
    'ProcessQuotaUsage' : [ 0xd0, ['array', 2, ['unsigned long']]],
    'ProcessQuotaPeak' : [ 0xd8, ['array', 2, ['unsigned long']]],
    'PeakVirtualSize' : [ 0xe0, ['unsigned long']],
    'VirtualSize' : [ 0xe4, ['unsigned long']],
    'SessionProcessLinks' : [ 0xe8, ['_LIST_ENTRY']],
    'ExceptionPortData' : [ 0xf0, ['pointer', ['void']]],
    'ExceptionPortValue' : [ 0xf0, ['unsigned long']],
    'ExceptionPortState' : [ 0xf0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'Token' : [ 0xf4, ['_EX_FAST_REF']],
    'WorkingSetPage' : [ 0xf8, ['unsigned long']],
    'AddressCreationLock' : [ 0xfc, ['_EX_PUSH_LOCK']],
    'PageTableCommitmentLock' : [ 0x100, ['_EX_PUSH_LOCK']],
    'RotateInProgress' : [ 0x104, ['pointer', ['_ETHREAD']]],
    'ForkInProgress' : [ 0x108, ['pointer', ['_ETHREAD']]],
    'CommitChargeJob' : [ 0x10c, ['pointer', ['_EJOB']]],
    'CloneRoot' : [ 0x110, ['_RTL_AVL_TREE']],
    'NumberOfPrivatePages' : [ 0x114, ['unsigned long']],
    'NumberOfLockedPages' : [ 0x118, ['unsigned long']],
    'Win32Process' : [ 0x11c, ['pointer', ['void']]],
    'Job' : [ 0x120, ['pointer', ['_EJOB']]],
    'SectionObject' : [ 0x124, ['pointer', ['void']]],
    'SectionBaseAddress' : [ 0x128, ['pointer', ['void']]],
    'Cookie' : [ 0x12c, ['unsigned long']],
    'WorkingSetWatch' : [ 0x130, ['pointer', ['_PAGEFAULT_HISTORY']]],
    'Win32WindowStation' : [ 0x134, ['pointer', ['void']]],
    'InheritedFromUniqueProcessId' : [ 0x138, ['pointer', ['void']]],
    'LdtInformation' : [ 0x13c, ['pointer', ['void']]],
    'OwnerProcessId' : [ 0x140, ['unsigned long']],
    'Peb' : [ 0x144, ['pointer', ['_PEB']]],
    'Session' : [ 0x148, ['pointer', ['void']]],
    'AweInfo' : [ 0x14c, ['pointer', ['void']]],
    'QuotaBlock' : [ 0x150, ['pointer', ['_EPROCESS_QUOTA_BLOCK']]],
    'ObjectTable' : [ 0x154, ['pointer', ['_HANDLE_TABLE']]],
    'DebugPort' : [ 0x158, ['pointer', ['void']]],
    'PaeTop' : [ 0x15c, ['pointer', ['void']]],
    'DeviceMap' : [ 0x160, ['pointer', ['void']]],
    'EtwDataSource' : [ 0x164, ['pointer', ['void']]],
    'PageDirectoryPte' : [ 0x168, ['unsigned long long']],
    'ImageFileName' : [ 0x170, ['array', 15, ['unsigned char']]],
    'PriorityClass' : [ 0x17f, ['unsigned char']],
    'SecurityPort' : [ 0x180, ['pointer', ['void']]],
    'SeAuditProcessCreationInfo' : [ 0x184, ['_SE_AUDIT_PROCESS_CREATION_INFO']],
    'JobLinks' : [ 0x188, ['_LIST_ENTRY']],
    'HighestUserAddress' : [ 0x190, ['pointer', ['void']]],
    'ThreadListHead' : [ 0x194, ['_LIST_ENTRY']],
    'ActiveThreads' : [ 0x19c, ['unsigned long']],
    'ImagePathHash' : [ 0x1a0, ['unsigned long']],
    'DefaultHardErrorProcessing' : [ 0x1a4, ['unsigned long']],
    'LastThreadExitStatus' : [ 0x1a8, ['long']],
    'PrefetchTrace' : [ 0x1ac, ['_EX_FAST_REF']],
    'LockedPagesList' : [ 0x1b0, ['pointer', ['void']]],
    'ReadOperationCount' : [ 0x1b8, ['_LARGE_INTEGER']],
    'WriteOperationCount' : [ 0x1c0, ['_LARGE_INTEGER']],
    'OtherOperationCount' : [ 0x1c8, ['_LARGE_INTEGER']],
    'ReadTransferCount' : [ 0x1d0, ['_LARGE_INTEGER']],
    'WriteTransferCount' : [ 0x1d8, ['_LARGE_INTEGER']],
    'OtherTransferCount' : [ 0x1e0, ['_LARGE_INTEGER']],
    'CommitChargeLimit' : [ 0x1e8, ['unsigned long']],
    'CommitCharge' : [ 0x1ec, ['unsigned long']],
    'CommitChargePeak' : [ 0x1f0, ['unsigned long']],
    'Vm' : [ 0x1f4, ['_MMSUPPORT']],
    'MmProcessLinks' : [ 0x278, ['_LIST_ENTRY']],
    'ModifiedPageCount' : [ 0x280, ['unsigned long']],
    'ExitStatus' : [ 0x284, ['long']],
    'VadRoot' : [ 0x288, ['_RTL_AVL_TREE']],
    'VadHint' : [ 0x28c, ['pointer', ['void']]],
    'VadCount' : [ 0x290, ['unsigned long']],
    'VadPhysicalPages' : [ 0x294, ['unsigned long']],
    'VadPhysicalPagesLimit' : [ 0x298, ['unsigned long']],
    'AlpcContext' : [ 0x29c, ['_ALPC_PROCESS_CONTEXT']],
    'TimerResolutionLink' : [ 0x2ac, ['_LIST_ENTRY']],
    'TimerResolutionStackRecord' : [ 0x2b4, ['pointer', ['_PO_DIAG_STACK_RECORD']]],
    'RequestedTimerResolution' : [ 0x2b8, ['unsigned long']],
    'SmallestTimerResolution' : [ 0x2bc, ['unsigned long']],
    'ExitTime' : [ 0x2c0, ['_LARGE_INTEGER']],
    'ActiveThreadsHighWatermark' : [ 0x2c8, ['unsigned long']],
    'LargePrivateVadCount' : [ 0x2cc, ['unsigned long']],
    'ThreadListLock' : [ 0x2d0, ['_EX_PUSH_LOCK']],
    'WnfContext' : [ 0x2d4, ['pointer', ['void']]],
    'Spare0' : [ 0x2d8, ['unsigned long']],
    'SignatureLevel' : [ 0x2dc, ['unsigned char']],
    'SectionSignatureLevel' : [ 0x2dd, ['unsigned char']],
    'Protection' : [ 0x2de, ['_PS_PROTECTION']],
    'HangCount' : [ 0x2df, ['unsigned char']],
    'Flags3' : [ 0x2e0, ['unsigned long']],
    'Minimal' : [ 0x2e0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReplacingPageRoot' : [ 0x2e0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DisableNonSystemFonts' : [ 0x2e0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'AuditNonSystemFontLoading' : [ 0x2e0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Crashed' : [ 0x2e0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'JobVadsAreTracked' : [ 0x2e0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'VadTrackingDisabled' : [ 0x2e0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'AuxiliaryProcess' : [ 0x2e0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'SubsystemProcess' : [ 0x2e0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'IndirectCpuSets' : [ 0x2e0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'InPrivate' : [ 0x2e0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'AddressPolicyFrozen' : [ 0x2e0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'RestrictIndirectBranchPrediction' : [ 0x2e0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'DeviceAsid' : [ 0x2e4, ['long']],
    'SvmData' : [ 0x2e8, ['pointer', ['void']]],
    'SvmProcessLock' : [ 0x2ec, ['_EX_PUSH_LOCK']],
    'SvmLock' : [ 0x2f0, ['unsigned long']],
    'SvmProcessDeviceListHead' : [ 0x2f4, ['_LIST_ENTRY']],
    'LastFreezeInterruptTime' : [ 0x300, ['unsigned long long']],
    'DiskCounters' : [ 0x308, ['pointer', ['_PROCESS_DISK_COUNTERS']]],
    'PicoContext' : [ 0x30c, ['pointer', ['void']]],
    'KeepAliveCounter' : [ 0x310, ['unsigned long']],
    'NoWakeKeepAliveCounter' : [ 0x314, ['unsigned long']],
    'HighPriorityFaultsAllowed' : [ 0x318, ['unsigned long']],
    'InstrumentationCallback' : [ 0x31c, ['pointer', ['void']]],
    'EnergyValues' : [ 0x320, ['pointer', ['_PROCESS_ENERGY_VALUES']]],
    'VmContext' : [ 0x324, ['pointer', ['void']]],
    'Silo' : [ 0x328, ['pointer', ['_ESILO']]],
    'SiloEntry' : [ 0x32c, ['_LIST_ENTRY']],
    'SequenceNumber' : [ 0x338, ['unsigned long long']],
    'CreateInterruptTime' : [ 0x340, ['unsigned long long']],
    'CreateUnbiasedInterruptTime' : [ 0x348, ['unsigned long long']],
    'TotalUnbiasedFrozenTime' : [ 0x350, ['unsigned long long']],
    'LastAppStateUpdateTime' : [ 0x358, ['unsigned long long']],
    'LastAppStateUptime' : [ 0x360, ['BitField', dict(start_bit = 0, end_bit = 61, native_type='unsigned long long')]],
    'LastAppState' : [ 0x360, ['BitField', dict(start_bit = 61, end_bit = 64, native_type='unsigned long long')]],
    'SharedCommitCharge' : [ 0x368, ['unsigned long']],
    'SharedCommitLock' : [ 0x36c, ['_EX_PUSH_LOCK']],
    'SharedCommitLinks' : [ 0x370, ['_LIST_ENTRY']],
    'AllowedCpuSets' : [ 0x378, ['unsigned long']],
    'DefaultCpuSets' : [ 0x37c, ['unsigned long']],
    'AllowedCpuSetsIndirect' : [ 0x378, ['pointer', ['unsigned long']]],
    'DefaultCpuSetsIndirect' : [ 0x37c, ['pointer', ['unsigned long']]],
    'SecurityDomain' : [ 0x380, ['unsigned long long']],
} ],
  '__unnamed_1379' : [ 0x4, {
    'MasterIrp' : [ 0x0, ['pointer', ['_IRP']]],
    'IrpCount' : [ 0x0, ['long']],
    'SystemBuffer' : [ 0x0, ['pointer', ['void']]],
} ],
  '__unnamed_137f' : [ 0x8, {
    'UserApcRoutine' : [ 0x0, ['pointer', ['void']]],
    'IssuingProcess' : [ 0x0, ['pointer', ['void']]],
    'UserApcContext' : [ 0x4, ['pointer', ['void']]],
} ],
  '__unnamed_1381' : [ 0x8, {
    'AsynchronousParameters' : [ 0x0, ['__unnamed_137f']],
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
} ],
  '__unnamed_138c' : [ 0x2c, {
    'DeviceQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DriverContext' : [ 0x0, ['array', 4, ['pointer', ['void']]]],
    'Thread' : [ 0x10, ['pointer', ['_ETHREAD']]],
    'AuxiliaryBuffer' : [ 0x14, ['pointer', ['unsigned char']]],
    'ListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'CurrentStackLocation' : [ 0x20, ['pointer', ['_IO_STACK_LOCATION']]],
    'PacketType' : [ 0x20, ['unsigned long']],
    'OriginalFileObject' : [ 0x24, ['pointer', ['_FILE_OBJECT']]],
    'IrpExtension' : [ 0x28, ['pointer', ['void']]],
} ],
  '__unnamed_138e' : [ 0x30, {
    'Overlay' : [ 0x0, ['__unnamed_138c']],
    'Apc' : [ 0x0, ['_KAPC']],
    'CompletionKey' : [ 0x0, ['pointer', ['void']]],
} ],
  '_IRP' : [ 0x70, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'MdlAddress' : [ 0x4, ['pointer', ['_MDL']]],
    'Flags' : [ 0x8, ['unsigned long']],
    'AssociatedIrp' : [ 0xc, ['__unnamed_1379']],
    'ThreadListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'IoStatus' : [ 0x18, ['_IO_STATUS_BLOCK']],
    'RequestorMode' : [ 0x20, ['unsigned char']],
    'PendingReturned' : [ 0x21, ['unsigned char']],
    'StackCount' : [ 0x22, ['unsigned char']],
    'CurrentLocation' : [ 0x23, ['unsigned char']],
    'Cancel' : [ 0x24, ['unsigned char']],
    'CancelIrql' : [ 0x25, ['unsigned char']],
    'ApcEnvironment' : [ 0x26, ['unsigned char']],
    'AllocationFlags' : [ 0x27, ['unsigned char']],
    'UserIosb' : [ 0x28, ['pointer', ['_IO_STATUS_BLOCK']]],
    'UserEvent' : [ 0x2c, ['pointer', ['_KEVENT']]],
    'Overlay' : [ 0x30, ['__unnamed_1381']],
    'CancelRoutine' : [ 0x38, ['pointer', ['void']]],
    'UserBuffer' : [ 0x3c, ['pointer', ['void']]],
    'Tail' : [ 0x40, ['__unnamed_138e']],
} ],
  '__unnamed_1395' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['pointer', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x4, ['unsigned long']],
    'FileAttributes' : [ 0x8, ['unsigned short']],
    'ShareAccess' : [ 0xa, ['unsigned short']],
    'EaLength' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_1399' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['pointer', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned short']],
    'ShareAccess' : [ 0xa, ['unsigned short']],
    'Parameters' : [ 0xc, ['pointer', ['_NAMED_PIPE_CREATE_PARAMETERS']]],
} ],
  '__unnamed_139d' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['pointer', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned short']],
    'ShareAccess' : [ 0xa, ['unsigned short']],
    'Parameters' : [ 0xc, ['pointer', ['_MAILSLOT_CREATE_PARAMETERS']]],
} ],
  '__unnamed_139f' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'Key' : [ 0x4, ['unsigned long']],
    'ByteOffset' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '__unnamed_13a3' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileName' : [ 0x4, ['pointer', ['_UNICODE_STRING']]],
    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileMaximumInformation'})]],
    'FileIndex' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_13a5' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
    'CompletionFilter' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_13a7' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileMaximumInformation'})]],
} ],
  '__unnamed_13a9' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {1: u'FileDirectoryInformation', 2: u'FileFullDirectoryInformation', 3: u'FileBothDirectoryInformation', 4: u'FileBasicInformation', 5: u'FileStandardInformation', 6: u'FileInternalInformation', 7: u'FileEaInformation', 8: u'FileAccessInformation', 9: u'FileNameInformation', 10: u'FileRenameInformation', 11: u'FileLinkInformation', 12: u'FileNamesInformation', 13: u'FileDispositionInformation', 14: u'FilePositionInformation', 15: u'FileFullEaInformation', 16: u'FileModeInformation', 17: u'FileAlignmentInformation', 18: u'FileAllInformation', 19: u'FileAllocationInformation', 20: u'FileEndOfFileInformation', 21: u'FileAlternateNameInformation', 22: u'FileStreamInformation', 23: u'FilePipeInformation', 24: u'FilePipeLocalInformation', 25: u'FilePipeRemoteInformation', 26: u'FileMailslotQueryInformation', 27: u'FileMailslotSetInformation', 28: u'FileCompressionInformation', 29: u'FileObjectIdInformation', 30: u'FileCompletionInformation', 31: u'FileMoveClusterInformation', 32: u'FileQuotaInformation', 33: u'FileReparsePointInformation', 34: u'FileNetworkOpenInformation', 35: u'FileAttributeTagInformation', 36: u'FileTrackingInformation', 37: u'FileIdBothDirectoryInformation', 38: u'FileIdFullDirectoryInformation', 39: u'FileValidDataLengthInformation', 40: u'FileShortNameInformation', 41: u'FileIoCompletionNotificationInformation', 42: u'FileIoStatusBlockRangeInformation', 43: u'FileIoPriorityHintInformation', 44: u'FileSfioReserveInformation', 45: u'FileSfioVolumeInformation', 46: u'FileHardLinkInformation', 47: u'FileProcessIdsUsingFileInformation', 48: u'FileNormalizedNameInformation', 49: u'FileNetworkPhysicalNameInformation', 50: u'FileIdGlobalTxDirectoryInformation', 51: u'FileIsRemoteDeviceInformation', 52: u'FileUnusedInformation', 53: u'FileNumaNodeInformation', 54: u'FileStandardLinkInformation', 55: u'FileRemoteProtocolInformation', 56: u'FileRenameInformationBypassAccessCheck', 57: u'FileLinkInformationBypassAccessCheck', 58: u'FileVolumeNameInformation', 59: u'FileIdInformation', 60: u'FileIdExtdDirectoryInformation', 61: u'FileReplaceCompletionInformation', 62: u'FileHardLinkFullIdInformation', 63: u'FileIdExtdBothDirectoryInformation', 64: u'FileMaximumInformation'})]],
    'FileObject' : [ 0x8, ['pointer', ['_FILE_OBJECT']]],
    'ReplaceIfExists' : [ 0xc, ['unsigned char']],
    'AdvanceOnly' : [ 0xd, ['unsigned char']],
    'ClusterCount' : [ 0xc, ['unsigned long']],
    'DeleteHandle' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_13ab' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'EaList' : [ 0x4, ['pointer', ['void']]],
    'EaListLength' : [ 0x8, ['unsigned long']],
    'EaIndex' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_13ad' : [ 0x4, {
    'Length' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_13b1' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
    'FsInformationClass' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {1: u'FileFsVolumeInformation', 2: u'FileFsLabelInformation', 3: u'FileFsSizeInformation', 4: u'FileFsDeviceInformation', 5: u'FileFsAttributeInformation', 6: u'FileFsControlInformation', 7: u'FileFsFullSizeInformation', 8: u'FileFsObjectIdInformation', 9: u'FileFsDriverPathInformation', 10: u'FileFsVolumeFlagsInformation', 11: u'FileFsSectorSizeInformation', 12: u'FileFsDataCopyInformation', 13: u'FileFsMetadataSizeInformation', 14: u'FileFsMaximumInformation'})]],
} ],
  '__unnamed_13b3' : [ 0x10, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x4, ['unsigned long']],
    'FsControlCode' : [ 0x8, ['unsigned long']],
    'Type3InputBuffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_13b6' : [ 0x10, {
    'Length' : [ 0x0, ['pointer', ['_LARGE_INTEGER']]],
    'Key' : [ 0x4, ['unsigned long']],
    'ByteOffset' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '__unnamed_13b8' : [ 0x10, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x4, ['unsigned long']],
    'IoControlCode' : [ 0x8, ['unsigned long']],
    'Type3InputBuffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_13ba' : [ 0x8, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_13bc' : [ 0x8, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'SecurityDescriptor' : [ 0x4, ['pointer', ['void']]],
} ],
  '__unnamed_13c0' : [ 0x8, {
    'Vpb' : [ 0x0, ['pointer', ['_VPB']]],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
} ],
  '__unnamed_13c4' : [ 0x4, {
    'Srb' : [ 0x0, ['pointer', ['_SCSI_REQUEST_BLOCK']]],
} ],
  '__unnamed_13c8' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'StartSid' : [ 0x4, ['pointer', ['void']]],
    'SidList' : [ 0x8, ['pointer', ['_FILE_GET_QUOTA_INFORMATION']]],
    'SidListLength' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_13cc' : [ 0x4, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'BusRelations', 1: u'EjectionRelations', 2: u'PowerRelations', 3: u'RemovalRelations', 4: u'TargetDeviceRelation', 5: u'SingleBusRelations', 6: u'TransportRelations'})]],
} ],
  '__unnamed_13d0' : [ 0x10, {
    'InterfaceType' : [ 0x0, ['pointer', ['_GUID']]],
    'Size' : [ 0x4, ['unsigned short']],
    'Version' : [ 0x6, ['unsigned short']],
    'Interface' : [ 0x8, ['pointer', ['_INTERFACE']]],
    'InterfaceSpecificData' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_13d4' : [ 0x4, {
    'Capabilities' : [ 0x0, ['pointer', ['_DEVICE_CAPABILITIES']]],
} ],
  '__unnamed_13d8' : [ 0x4, {
    'IoResourceRequirementList' : [ 0x0, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
} ],
  '__unnamed_13da' : [ 0x10, {
    'WhichSpace' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x4, ['pointer', ['void']]],
    'Offset' : [ 0x8, ['unsigned long']],
    'Length' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_13dc' : [ 0x1, {
    'Lock' : [ 0x0, ['unsigned char']],
} ],
  '__unnamed_13e0' : [ 0x4, {
    'IdType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'BusQueryDeviceID', 1: u'BusQueryHardwareIDs', 2: u'BusQueryCompatibleIDs', 3: u'BusQueryInstanceID', 4: u'BusQueryDeviceSerialNumber', 5: u'BusQueryContainerID'})]],
} ],
  '__unnamed_13e4' : [ 0x8, {
    'DeviceTextType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'DeviceTextDescription', 1: u'DeviceTextLocationInformation'})]],
    'LocaleId' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_13e8' : [ 0x8, {
    'InPath' : [ 0x0, ['unsigned char']],
    'Reserved' : [ 0x1, ['array', 3, ['unsigned char']]],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'DeviceUsageTypeUndefined', 1: u'DeviceUsageTypePaging', 2: u'DeviceUsageTypeHibernation', 3: u'DeviceUsageTypeDumpFile', 4: u'DeviceUsageTypeBoot', 5: u'DeviceUsageTypePostDisplay'})]],
} ],
  '__unnamed_13ec' : [ 0x4, {
    'PowerState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PowerSystemUnspecified', 1: u'PowerSystemWorking', 2: u'PowerSystemSleeping1', 3: u'PowerSystemSleeping2', 4: u'PowerSystemSleeping3', 5: u'PowerSystemHibernate', 6: u'PowerSystemShutdown', 7: u'PowerSystemMaximum'})]],
} ],
  '__unnamed_13f0' : [ 0x4, {
    'PowerSequence' : [ 0x0, ['pointer', ['_POWER_SEQUENCE']]],
} ],
  '__unnamed_13f8' : [ 0x10, {
    'SystemContext' : [ 0x0, ['unsigned long']],
    'SystemPowerStateContext' : [ 0x0, ['_SYSTEM_POWER_STATE_CONTEXT']],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'SystemPowerState', 1: u'DevicePowerState'})]],
    'State' : [ 0x8, ['_POWER_STATE']],
    'ShutdownType' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'PowerActionNone', 1: u'PowerActionReserved', 2: u'PowerActionSleep', 3: u'PowerActionHibernate', 4: u'PowerActionShutdown', 5: u'PowerActionShutdownReset', 6: u'PowerActionShutdownOff', 7: u'PowerActionWarmEject', 8: u'PowerActionDisplayOff'})]],
} ],
  '__unnamed_13fc' : [ 0x8, {
    'AllocatedResources' : [ 0x0, ['pointer', ['_CM_RESOURCE_LIST']]],
    'AllocatedResourcesTranslated' : [ 0x4, ['pointer', ['_CM_RESOURCE_LIST']]],
} ],
  '__unnamed_13fe' : [ 0x10, {
    'ProviderId' : [ 0x0, ['unsigned long']],
    'DataPath' : [ 0x4, ['pointer', ['void']]],
    'BufferSize' : [ 0x8, ['unsigned long']],
    'Buffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_1400' : [ 0x10, {
    'Argument1' : [ 0x0, ['pointer', ['void']]],
    'Argument2' : [ 0x4, ['pointer', ['void']]],
    'Argument3' : [ 0x8, ['pointer', ['void']]],
    'Argument4' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_1402' : [ 0x10, {
    'Create' : [ 0x0, ['__unnamed_1395']],
    'CreatePipe' : [ 0x0, ['__unnamed_1399']],
    'CreateMailslot' : [ 0x0, ['__unnamed_139d']],
    'Read' : [ 0x0, ['__unnamed_139f']],
    'Write' : [ 0x0, ['__unnamed_139f']],
    'QueryDirectory' : [ 0x0, ['__unnamed_13a3']],
    'NotifyDirectory' : [ 0x0, ['__unnamed_13a5']],
    'QueryFile' : [ 0x0, ['__unnamed_13a7']],
    'SetFile' : [ 0x0, ['__unnamed_13a9']],
    'QueryEa' : [ 0x0, ['__unnamed_13ab']],
    'SetEa' : [ 0x0, ['__unnamed_13ad']],
    'QueryVolume' : [ 0x0, ['__unnamed_13b1']],
    'SetVolume' : [ 0x0, ['__unnamed_13b1']],
    'FileSystemControl' : [ 0x0, ['__unnamed_13b3']],
    'LockControl' : [ 0x0, ['__unnamed_13b6']],
    'DeviceIoControl' : [ 0x0, ['__unnamed_13b8']],
    'QuerySecurity' : [ 0x0, ['__unnamed_13ba']],
    'SetSecurity' : [ 0x0, ['__unnamed_13bc']],
    'MountVolume' : [ 0x0, ['__unnamed_13c0']],
    'VerifyVolume' : [ 0x0, ['__unnamed_13c0']],
    'Scsi' : [ 0x0, ['__unnamed_13c4']],
    'QueryQuota' : [ 0x0, ['__unnamed_13c8']],
    'SetQuota' : [ 0x0, ['__unnamed_13ad']],
    'QueryDeviceRelations' : [ 0x0, ['__unnamed_13cc']],
    'QueryInterface' : [ 0x0, ['__unnamed_13d0']],
    'DeviceCapabilities' : [ 0x0, ['__unnamed_13d4']],
    'FilterResourceRequirements' : [ 0x0, ['__unnamed_13d8']],
    'ReadWriteConfig' : [ 0x0, ['__unnamed_13da']],
    'SetLock' : [ 0x0, ['__unnamed_13dc']],
    'QueryId' : [ 0x0, ['__unnamed_13e0']],
    'QueryDeviceText' : [ 0x0, ['__unnamed_13e4']],
    'UsageNotification' : [ 0x0, ['__unnamed_13e8']],
    'WaitWake' : [ 0x0, ['__unnamed_13ec']],
    'PowerSequence' : [ 0x0, ['__unnamed_13f0']],
    'Power' : [ 0x0, ['__unnamed_13f8']],
    'StartDevice' : [ 0x0, ['__unnamed_13fc']],
    'WMI' : [ 0x0, ['__unnamed_13fe']],
    'Others' : [ 0x0, ['__unnamed_1400']],
} ],
  '_IO_STACK_LOCATION' : [ 0x24, {
    'MajorFunction' : [ 0x0, ['unsigned char']],
    'MinorFunction' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned char']],
    'Control' : [ 0x3, ['unsigned char']],
    'Parameters' : [ 0x4, ['__unnamed_1402']],
    'DeviceObject' : [ 0x14, ['pointer', ['_DEVICE_OBJECT']]],
    'FileObject' : [ 0x18, ['pointer', ['_FILE_OBJECT']]],
    'CompletionRoutine' : [ 0x1c, ['pointer', ['void']]],
    'Context' : [ 0x20, ['pointer', ['void']]],
} ],
  '__unnamed_1418' : [ 0x28, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Wcb' : [ 0x0, ['_WAIT_CONTEXT_BLOCK']],
} ],
  '_DEVICE_OBJECT' : [ 0xb8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'ReferenceCount' : [ 0x4, ['long']],
    'DriverObject' : [ 0x8, ['pointer', ['_DRIVER_OBJECT']]],
    'NextDevice' : [ 0xc, ['pointer', ['_DEVICE_OBJECT']]],
    'AttachedDevice' : [ 0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'CurrentIrp' : [ 0x14, ['pointer', ['_IRP']]],
    'Timer' : [ 0x18, ['pointer', ['_IO_TIMER']]],
    'Flags' : [ 0x1c, ['unsigned long']],
    'Characteristics' : [ 0x20, ['unsigned long']],
    'Vpb' : [ 0x24, ['pointer', ['_VPB']]],
    'DeviceExtension' : [ 0x28, ['pointer', ['void']]],
    'DeviceType' : [ 0x2c, ['unsigned long']],
    'StackSize' : [ 0x30, ['unsigned char']],
    'Queue' : [ 0x34, ['__unnamed_1418']],
    'AlignmentRequirement' : [ 0x5c, ['unsigned long']],
    'DeviceQueue' : [ 0x60, ['_KDEVICE_QUEUE']],
    'Dpc' : [ 0x74, ['_KDPC']],
    'ActiveThreadCount' : [ 0x94, ['unsigned long']],
    'SecurityDescriptor' : [ 0x98, ['pointer', ['void']]],
    'DeviceLock' : [ 0x9c, ['_KEVENT']],
    'SectorSize' : [ 0xac, ['unsigned short']],
    'Spare1' : [ 0xae, ['unsigned short']],
    'DeviceObjectExtension' : [ 0xb0, ['pointer', ['_DEVOBJ_EXTENSION']]],
    'Reserved' : [ 0xb4, ['pointer', ['void']]],
} ],
  '_KDPC' : [ 0x20, {
    'TargetInfoAsUlong' : [ 0x0, ['unsigned long']],
    'Type' : [ 0x0, ['unsigned char']],
    'Importance' : [ 0x1, ['unsigned char']],
    'Number' : [ 0x2, ['unsigned short']],
    'DpcListEntry' : [ 0x4, ['_SINGLE_LIST_ENTRY']],
    'ProcessorHistory' : [ 0x8, ['unsigned long']],
    'DeferredRoutine' : [ 0xc, ['pointer', ['void']]],
    'DeferredContext' : [ 0x10, ['pointer', ['void']]],
    'SystemArgument1' : [ 0x14, ['pointer', ['void']]],
    'SystemArgument2' : [ 0x18, ['pointer', ['void']]],
    'DpcData' : [ 0x1c, ['pointer', ['void']]],
} ],
  '_IO_DRIVER_CREATE_CONTEXT' : [ 0x10, {
    'Size' : [ 0x0, ['short']],
    'ExtraCreateParameter' : [ 0x4, ['pointer', ['_ECP_LIST']]],
    'DeviceObjectHint' : [ 0x8, ['pointer', ['void']]],
    'TxnParameters' : [ 0xc, ['pointer', ['_TXN_PARAMETER_BLOCK']]],
} ],
  '_IO_PRIORITY_INFO' : [ 0x10, {
    'Size' : [ 0x0, ['unsigned long']],
    'ThreadPriority' : [ 0x4, ['unsigned long']],
    'PagePriority' : [ 0x8, ['unsigned long']],
    'IoPriority' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'IoPriorityVeryLow', 1: u'IoPriorityLow', 2: u'IoPriorityNormal', 3: u'IoPriorityHigh', 4: u'IoPriorityCritical', 5: u'MaxIoPriorityTypes'})]],
} ],
  '_MDL' : [ 0x1c, {
    'Next' : [ 0x0, ['pointer', ['_MDL']]],
    'Size' : [ 0x4, ['short']],
    'MdlFlags' : [ 0x6, ['short']],
    'Process' : [ 0x8, ['pointer', ['_EPROCESS']]],
    'MappedSystemVa' : [ 0xc, ['pointer', ['void']]],
    'StartVa' : [ 0x10, ['pointer', ['void']]],
    'ByteCount' : [ 0x14, ['unsigned long']],
    'ByteOffset' : [ 0x18, ['unsigned long']],
} ],
  '_EVENT_DATA_DESCRIPTOR' : [ 0x10, {
    'Ptr' : [ 0x0, ['unsigned long long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned char']],
    'Reserved1' : [ 0xd, ['unsigned char']],
    'Reserved2' : [ 0xe, ['unsigned short']],
} ],
  '_EVENT_DESCRIPTOR' : [ 0x10, {
    'Id' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned char']],
    'Channel' : [ 0x3, ['unsigned char']],
    'Level' : [ 0x4, ['unsigned char']],
    'Opcode' : [ 0x5, ['unsigned char']],
    'Task' : [ 0x6, ['unsigned short']],
    'Keyword' : [ 0x8, ['unsigned long long']],
} ],
  '_EVENT_RECORD' : [ 0x68, {
    'EventHeader' : [ 0x0, ['_EVENT_HEADER']],
    'BufferContext' : [ 0x50, ['_ETW_BUFFER_CONTEXT']],
    'ExtendedDataCount' : [ 0x54, ['unsigned short']],
    'UserDataLength' : [ 0x56, ['unsigned short']],
    'ExtendedData' : [ 0x58, ['pointer', ['_EVENT_HEADER_EXTENDED_DATA_ITEM']]],
    'UserData' : [ 0x5c, ['pointer', ['void']]],
    'UserContext' : [ 0x60, ['pointer', ['void']]],
} ],
  '_PERFINFO_GROUPMASK' : [ 0x20, {
    'Masks' : [ 0x0, ['array', 8, ['unsigned long']]],
} ],
  '_FILE_OBJECT' : [ 0x80, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
    'Vpb' : [ 0x8, ['pointer', ['_VPB']]],
    'FsContext' : [ 0xc, ['pointer', ['void']]],
    'FsContext2' : [ 0x10, ['pointer', ['void']]],
    'SectionObjectPointer' : [ 0x14, ['pointer', ['_SECTION_OBJECT_POINTERS']]],
    'PrivateCacheMap' : [ 0x18, ['pointer', ['void']]],
    'FinalStatus' : [ 0x1c, ['long']],
    'RelatedFileObject' : [ 0x20, ['pointer', ['_FILE_OBJECT']]],
    'LockOperation' : [ 0x24, ['unsigned char']],
    'DeletePending' : [ 0x25, ['unsigned char']],
    'ReadAccess' : [ 0x26, ['unsigned char']],
    'WriteAccess' : [ 0x27, ['unsigned char']],
    'DeleteAccess' : [ 0x28, ['unsigned char']],
    'SharedRead' : [ 0x29, ['unsigned char']],
    'SharedWrite' : [ 0x2a, ['unsigned char']],
    'SharedDelete' : [ 0x2b, ['unsigned char']],
    'Flags' : [ 0x2c, ['unsigned long']],
    'FileName' : [ 0x30, ['_UNICODE_STRING']],
    'CurrentByteOffset' : [ 0x38, ['_LARGE_INTEGER']],
    'Waiters' : [ 0x40, ['unsigned long']],
    'Busy' : [ 0x44, ['unsigned long']],
    'LastLock' : [ 0x48, ['pointer', ['void']]],
    'Lock' : [ 0x4c, ['_KEVENT']],
    'Event' : [ 0x5c, ['_KEVENT']],
    'CompletionContext' : [ 0x6c, ['pointer', ['_IO_COMPLETION_CONTEXT']]],
    'IrpListLock' : [ 0x70, ['unsigned long']],
    'IrpList' : [ 0x74, ['_LIST_ENTRY']],
    'FileObjectExtension' : [ 0x7c, ['pointer', ['void']]],
} ],
  '_EX_RUNDOWN_REF' : [ 0x4, {
    'Count' : [ 0x0, ['unsigned long']],
    'Ptr' : [ 0x0, ['pointer', ['void']]],
} ],
  '_MM_PAGE_ACCESS_INFO_HEADER' : [ 0x38, {
    'Link' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'MmPteAccessType', 1: u'MmCcReadAheadType', 2: u'MmPfnRepurposeType', 3: u'MmMaximumPageAccessType'})]],
    'EmptySequenceNumber' : [ 0x8, ['unsigned long']],
    'CurrentFileIndex' : [ 0x8, ['unsigned long']],
    'CreateTime' : [ 0x10, ['unsigned long long']],
    'EmptyTime' : [ 0x18, ['unsigned long long']],
    'TempEntry' : [ 0x18, ['pointer', ['_MM_PAGE_ACCESS_INFO']]],
    'PageEntry' : [ 0x20, ['pointer', ['_MM_PAGE_ACCESS_INFO']]],
    'FileEntry' : [ 0x24, ['pointer', ['unsigned long']]],
    'FirstFileEntry' : [ 0x28, ['pointer', ['unsigned long']]],
    'Process' : [ 0x2c, ['pointer', ['_EPROCESS']]],
    'SessionId' : [ 0x30, ['unsigned long']],
    'PageFrameEntry' : [ 0x20, ['pointer', ['unsigned long']]],
    'LastPageFrameEntry' : [ 0x24, ['pointer', ['unsigned long']]],
} ],
  '_WHEA_ERROR_PACKET_V2' : [ 0x50, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'Length' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_PACKET_FLAGS']],
    'ErrorType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrTypeProcessor', 1: u'WheaErrTypeMemory', 2: u'WheaErrTypePCIExpress', 3: u'WheaErrTypeNMI', 4: u'WheaErrTypePCIXBus', 5: u'WheaErrTypePCIXDevice', 6: u'WheaErrTypeGeneric'})]],
    'ErrorSeverity' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSevRecoverable', 1: u'WheaErrSevFatal', 2: u'WheaErrSevCorrected', 3: u'WheaErrSevInformational'})]],
    'ErrorSourceId' : [ 0x18, ['unsigned long']],
    'ErrorSourceType' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSrcTypeMCE', 1: u'WheaErrSrcTypeCMC', 2: u'WheaErrSrcTypeCPE', 3: u'WheaErrSrcTypeNMI', 4: u'WheaErrSrcTypePCIe', 5: u'WheaErrSrcTypeGeneric', 6: u'WheaErrSrcTypeINIT', 7: u'WheaErrSrcTypeBOOT', 8: u'WheaErrSrcTypeSCIGeneric', 9: u'WheaErrSrcTypeIPFMCA', 10: u'WheaErrSrcTypeIPFCMC', 11: u'WheaErrSrcTypeIPFCPE', 12: u'WheaErrSrcTypeMax'})]],
    'NotifyType' : [ 0x20, ['_GUID']],
    'Context' : [ 0x30, ['unsigned long long']],
    'DataFormat' : [ 0x38, ['Enumeration', dict(target = 'long', choices = {0: u'WheaDataFormatIPFSalRecord', 1: u'WheaDataFormatXPFMCA', 2: u'WheaDataFormatMemory', 3: u'WheaDataFormatPCIExpress', 4: u'WheaDataFormatNMIPort', 5: u'WheaDataFormatPCIXBus', 6: u'WheaDataFormatPCIXDevice', 7: u'WheaDataFormatGeneric', 8: u'WheaDataFormatMax'})]],
    'Reserved1' : [ 0x3c, ['unsigned long']],
    'DataOffset' : [ 0x40, ['unsigned long']],
    'DataLength' : [ 0x44, ['unsigned long']],
    'PshedDataOffset' : [ 0x48, ['unsigned long']],
    'PshedDataLength' : [ 0x4c, ['unsigned long']],
} ],
  '_WHEA_ERROR_RECORD' : [ 0xc8, {
    'Header' : [ 0x0, ['_WHEA_ERROR_RECORD_HEADER']],
    'SectionDescriptor' : [ 0x80, ['array', 1, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR']]],
} ],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR' : [ 0x48, {
    'SectionOffset' : [ 0x0, ['unsigned long']],
    'SectionLength' : [ 0x4, ['unsigned long']],
    'Revision' : [ 0x8, ['_WHEA_REVISION']],
    'ValidBits' : [ 0xa, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS']],
    'Reserved' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS']],
    'SectionType' : [ 0x10, ['_GUID']],
    'FRUId' : [ 0x20, ['_GUID']],
    'SectionSeverity' : [ 0x30, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSevRecoverable', 1: u'WheaErrSevFatal', 2: u'WheaErrSevCorrected', 3: u'WheaErrSevInformational'})]],
    'FRUText' : [ 0x34, ['array', 20, ['unsigned char']]],
} ],
  '_FSRTL_ADVANCED_FCB_HEADER' : [ 0x48, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'Flags' : [ 0x4, ['unsigned char']],
    'IsFastIoPossible' : [ 0x5, ['unsigned char']],
    'Flags2' : [ 0x6, ['unsigned char']],
    'Reserved' : [ 0x7, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'Version' : [ 0x7, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Resource' : [ 0x8, ['pointer', ['_ERESOURCE']]],
    'PagingIoResource' : [ 0xc, ['pointer', ['_ERESOURCE']]],
    'AllocationSize' : [ 0x10, ['_LARGE_INTEGER']],
    'FileSize' : [ 0x18, ['_LARGE_INTEGER']],
    'ValidDataLength' : [ 0x20, ['_LARGE_INTEGER']],
    'FastMutex' : [ 0x28, ['pointer', ['_FAST_MUTEX']]],
    'FilterContexts' : [ 0x2c, ['_LIST_ENTRY']],
    'PushLock' : [ 0x34, ['_EX_PUSH_LOCK']],
    'FileContextSupportPointer' : [ 0x38, ['pointer', ['pointer', ['void']]]],
    'Oplock' : [ 0x3c, ['pointer', ['void']]],
    'ReservedForRemote' : [ 0x3c, ['pointer', ['void']]],
    'ReservedContext' : [ 0x40, ['pointer', ['void']]],
} ],
  '_iobuf' : [ 0x20, {
    '_ptr' : [ 0x0, ['pointer', ['unsigned char']]],
    '_cnt' : [ 0x4, ['long']],
    '_base' : [ 0x8, ['pointer', ['unsigned char']]],
    '_flag' : [ 0xc, ['long']],
    '_file' : [ 0x10, ['long']],
    '_charbuf' : [ 0x14, ['long']],
    '_bufsiz' : [ 0x18, ['long']],
    '_tmpfname' : [ 0x1c, ['pointer', ['unsigned char']]],
} ],
  '_TlgProvider_t' : [ 0x30, {
    'LevelPlus1' : [ 0x0, ['unsigned long']],
    'ProviderMetadataPtr' : [ 0x4, ['pointer', ['unsigned short']]],
    'KeywordAny' : [ 0x8, ['unsigned long long']],
    'KeywordAll' : [ 0x10, ['unsigned long long']],
    'RegHandle' : [ 0x18, ['unsigned long long']],
    'EnableCallback' : [ 0x20, ['pointer', ['void']]],
    'CallbackContext' : [ 0x24, ['pointer', ['void']]],
    'AnnotationFunc' : [ 0x28, ['pointer', ['void']]],
} ],
  '_EVENT_FILTER_DESCRIPTOR' : [ 0x10, {
    'Ptr' : [ 0x0, ['unsigned long long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned long']],
} ],
  '_TlgProviderMetadata_t' : [ 0x13, {
    'Type' : [ 0x0, ['unsigned char']],
    'ProviderId' : [ 0x1, ['_GUID']],
    'RemainingSize' : [ 0x11, ['unsigned short']],
} ],
  '_SID' : [ 0xc, {
    'Revision' : [ 0x0, ['unsigned char']],
    'SubAuthorityCount' : [ 0x1, ['unsigned char']],
    'IdentifierAuthority' : [ 0x2, ['_SID_IDENTIFIER_AUTHORITY']],
    'SubAuthority' : [ 0x8, ['array', 1, ['unsigned long']]],
} ],
  '__unnamed_15e6' : [ 0x8, {
    'Long' : [ 0x0, ['unsigned long long']],
    'VolatileLong' : [ 0x0, ['unsigned long long']],
    'HighLow' : [ 0x0, ['_MMPTE_HIGHLOW']],
    'Flush' : [ 0x0, ['_HARDWARE_PTE']],
    'Hard' : [ 0x0, ['_MMPTE_HARDWARE']],
    'Proto' : [ 0x0, ['_MMPTE_PROTOTYPE']],
    'Soft' : [ 0x0, ['_MMPTE_SOFTWARE']],
    'TimeStamp' : [ 0x0, ['_MMPTE_TIMESTAMP']],
    'Trans' : [ 0x0, ['_MMPTE_TRANSITION']],
    'Subsect' : [ 0x0, ['_MMPTE_SUBSECTION']],
    'List' : [ 0x0, ['_MMPTE_LIST']],
} ],
  '_MMPTE' : [ 0x8, {
    'u' : [ 0x0, ['__unnamed_15e6']],
} ],
  '_EX_PUSH_LOCK_AUTO_EXPAND' : [ 0xc, {
    'LocalLock' : [ 0x0, ['_EX_PUSH_LOCK']],
    'State' : [ 0x4, ['_EX_PUSH_LOCK_AUTO_EXPAND_STATE']],
    'Stats' : [ 0x8, ['unsigned long']],
} ],
  '_ERESOURCE' : [ 0x38, {
    'SystemResourcesList' : [ 0x0, ['_LIST_ENTRY']],
    'OwnerTable' : [ 0x8, ['pointer', ['_OWNER_ENTRY']]],
    'ActiveCount' : [ 0xc, ['short']],
    'Flag' : [ 0xe, ['unsigned short']],
    'ReservedLowFlags' : [ 0xe, ['unsigned char']],
    'WaiterPriority' : [ 0xf, ['unsigned char']],
    'SharedWaiters' : [ 0x10, ['_KWAIT_CHAIN']],
    'ExclusiveWaiters' : [ 0x14, ['pointer', ['_KEVENT']]],
    'OwnerEntry' : [ 0x18, ['_OWNER_ENTRY']],
    'ActiveEntries' : [ 0x20, ['unsigned long']],
    'ContentionCount' : [ 0x24, ['unsigned long']],
    'NumberOfSharedWaiters' : [ 0x28, ['unsigned long']],
    'NumberOfExclusiveWaiters' : [ 0x2c, ['unsigned long']],
    'Address' : [ 0x30, ['pointer', ['void']]],
    'CreatorBackTraceIndex' : [ 0x30, ['unsigned long']],
    'SpinLock' : [ 0x34, ['unsigned long']],
} ],
  '_MI_CACHED_PTE' : [ 0x8, {
    'GlobalTimeStamp' : [ 0x0, ['unsigned long']],
    'PteIndex' : [ 0x4, ['unsigned long']],
    'Long' : [ 0x0, ['long long']],
} ],
  '_KLOCK_QUEUE_HANDLE' : [ 0xc, {
    'LockQueue' : [ 0x0, ['_KSPIN_LOCK_QUEUE']],
    'OldIrql' : [ 0x8, ['unsigned char']],
} ],
  '_MMPFNLIST' : [ 0x14, {
    'Total' : [ 0x0, ['unsigned long']],
    'ListName' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'ZeroedPageList', 1: u'FreePageList', 2: u'StandbyPageList', 3: u'ModifiedPageList', 4: u'ModifiedNoWritePageList', 5: u'BadPageList', 6: u'ActiveAndValid', 7: u'TransitionPage'})]],
    'Flink' : [ 0x8, ['unsigned long']],
    'Blink' : [ 0xc, ['unsigned long']],
    'Lock' : [ 0x10, ['unsigned long']],
} ],
  '__unnamed_161e' : [ 0x4, {
    'Flink' : [ 0x0, ['unsigned long']],
    'WsIndex' : [ 0x0, ['unsigned long']],
    'Event' : [ 0x0, ['pointer', ['_KEVENT']]],
    'Next' : [ 0x0, ['pointer', ['void']]],
    'VolatileNext' : [ 0x0, ['pointer', ['void']]],
    'KernelStackOwner' : [ 0x0, ['pointer', ['_KTHREAD']]],
    'NextStackPfn' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
} ],
  '__unnamed_1622' : [ 0x4, {
    'ReferenceCount' : [ 0x0, ['unsigned short']],
    'ShortFlags' : [ 0x2, ['unsigned short']],
    'VolatileShortFlags' : [ 0x2, ['unsigned short']],
} ],
  '__unnamed_1624' : [ 0x4, {
    'ReferenceCount' : [ 0x0, ['unsigned short']],
    'e1' : [ 0x2, ['_MMPFNENTRY']],
    'e2' : [ 0x0, ['__unnamed_1622']],
} ],
  '__unnamed_1629' : [ 0x4, {
    'PteFrame' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 24, native_type='unsigned long')]],
    'PageIdentity' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 27, native_type='unsigned long')]],
    'PrototypePte' : [ 0x0, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'PageColor' : [ 0x0, ['BitField', dict(start_bit = 28, end_bit = 32, native_type='unsigned long')]],
    'EntireField' : [ 0x0, ['unsigned long']],
} ],
  '_MMPFN' : [ 0x1c, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'TreeNode' : [ 0x0, ['_RTL_BALANCED_NODE']],
    'u1' : [ 0x0, ['__unnamed_161e']],
    'PteAddress' : [ 0x4, ['pointer', ['_MMPTE']]],
    'VolatilePteAddress' : [ 0x4, ['pointer', ['void']]],
    'PteLong' : [ 0x4, ['unsigned long']],
    'OriginalPte' : [ 0x8, ['_MMPTE']],
    'u2' : [ 0x10, ['_MIPFNBLINK']],
    'u3' : [ 0x14, ['__unnamed_1624']],
    'u4' : [ 0x18, ['__unnamed_1629']],
} ],
  '_MI_SYSTEM_PTE_TYPE' : [ 0x34, {
    'Bitmap' : [ 0x0, ['_RTL_BITMAP']],
    'BasePte' : [ 0x8, ['pointer', ['_MMPTE']]],
    'Flags' : [ 0xc, ['unsigned long']],
    'VaType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: u'MiVaUnused', 1: u'MiVaSessionSpace', 2: u'MiVaProcessSpace', 3: u'MiVaBootLoaded', 4: u'MiVaPfnDatabase', 5: u'MiVaNonPagedPool', 6: u'MiVaPagedPool', 7: u'MiVaSpecialPoolPaged', 8: u'MiVaSystemCache', 9: u'MiVaSystemPtes', 10: u'MiVaHal', 11: u'MiVaSessionGlobalSpace', 12: u'MiVaDriverImages', 13: u'MiVaSpecialPoolNonPaged', 14: u'MiVaPagedProtoPool', 15: u'MiVaMaximumType', 16: u'MiVaSystemPtesLarge'})]],
    'FailureCount' : [ 0x14, ['pointer', ['unsigned long']]],
    'PteFailures' : [ 0x18, ['unsigned long']],
    'SpinLock' : [ 0x1c, ['unsigned long']],
    'GlobalPushLock' : [ 0x1c, ['pointer', ['_EX_PUSH_LOCK']]],
    'Vm' : [ 0x20, ['pointer', ['_MMSUPPORT']]],
    'TotalSystemPtes' : [ 0x24, ['unsigned long']],
    'Hint' : [ 0x28, ['unsigned long']],
    'CachedPtes' : [ 0x2c, ['pointer', ['_MI_CACHED_PTES']]],
    'TotalFreeSystemPtes' : [ 0x30, ['unsigned long']],
} ],
  '_MMCLONE_DESCRIPTOR' : [ 0x30, {
    'CloneNode' : [ 0x0, ['_RTL_BALANCED_NODE']],
    'Next' : [ 0x0, ['pointer', ['_MMCLONE_DESCRIPTOR']]],
    'StartingCloneBlock' : [ 0xc, ['pointer', ['_MMCLONE_BLOCK']]],
    'EndingCloneBlock' : [ 0x10, ['pointer', ['_MMCLONE_BLOCK']]],
    'NumberOfPtes' : [ 0x14, ['unsigned long']],
    'NumberOfReferences' : [ 0x18, ['unsigned long']],
    'CloneHeader' : [ 0x1c, ['pointer', ['_MMCLONE_HEADER']]],
    'NonPagedPoolQuotaCharge' : [ 0x20, ['unsigned long']],
    'NestingLevel' : [ 0x28, ['unsigned long long']],
} ],
  '__unnamed_165c' : [ 0x4, {
    'VirtualAddress' : [ 0x0, ['pointer', ['void']]],
    'Long' : [ 0x0, ['unsigned long']],
    'e1' : [ 0x0, ['_MMWSLENTRY']],
    'e2' : [ 0x0, ['_MMWSLE_FREE_ENTRY']],
} ],
  '_MMWSLE' : [ 0x4, {
    'u1' : [ 0x0, ['__unnamed_165c']],
} ],
  '_MMWSL' : [ 0xe20, {
    'FirstFree' : [ 0x0, ['unsigned long']],
    'FirstDynamic' : [ 0x4, ['unsigned long']],
    'LastEntry' : [ 0x8, ['unsigned long']],
    'NextSlot' : [ 0xc, ['unsigned long']],
    'LastInitializedWsle' : [ 0x10, ['unsigned long']],
    'NextAgingSlot' : [ 0x14, ['unsigned long']],
    'NextAccessClearingSlot' : [ 0x18, ['unsigned long']],
    'LastAccessClearingRemainder' : [ 0x1c, ['unsigned long']],
    'LastAgingRemainder' : [ 0x20, ['unsigned long']],
    'WsleSize' : [ 0x24, ['unsigned long']],
    'NonDirectCount' : [ 0x28, ['unsigned long']],
    'LowestPagableAddress' : [ 0x2c, ['pointer', ['void']]],
    'NonDirectHash' : [ 0x30, ['pointer', ['_MMWSLE_NONDIRECT_HASH']]],
    'HashTableStart' : [ 0x34, ['pointer', ['_MMWSLE_HASH']]],
    'HighestPermittedHashAddress' : [ 0x38, ['pointer', ['_MMWSLE_HASH']]],
    'ActiveWsleCounts' : [ 0x3c, ['array', 16, ['unsigned long']]],
    'ActiveWsles' : [ 0x7c, ['array', 16, ['_MI_ACTIVE_WSLE_LISTHEAD']]],
    'Wsle' : [ 0xfc, ['pointer', ['_MMWSLE']]],
    'UserVaInfo' : [ 0x100, ['_MI_USER_VA_INFO']],
} ],
  '_MMSUPPORT' : [ 0x84, {
    'WorkingSetLock' : [ 0x0, ['long']],
    'ExitOutswapGate' : [ 0x4, ['pointer', ['_KGATE']]],
    'AccessLog' : [ 0x8, ['pointer', ['void']]],
    'WorkingSetExpansionLinks' : [ 0xc, ['_LIST_ENTRY']],
    'AgeDistribution' : [ 0x14, ['array', 7, ['unsigned long']]],
    'MinimumWorkingSetSize' : [ 0x30, ['unsigned long']],
    'WorkingSetLeafSize' : [ 0x34, ['unsigned long']],
    'WorkingSetLeafPrivateSize' : [ 0x38, ['unsigned long']],
    'WorkingSetSize' : [ 0x3c, ['unsigned long']],
    'WorkingSetPrivateSize' : [ 0x40, ['unsigned long']],
    'MaximumWorkingSetSize' : [ 0x44, ['unsigned long']],
    'ChargedWslePages' : [ 0x48, ['unsigned long']],
    'ActualWslePages' : [ 0x4c, ['unsigned long']],
    'WorkingSetSizeOverhead' : [ 0x50, ['unsigned long']],
    'PeakWorkingSetSize' : [ 0x54, ['unsigned long']],
    'HardFaultCount' : [ 0x58, ['unsigned long']],
    'VmWorkingSetList' : [ 0x5c, ['pointer', ['_MMWSL']]],
    'NextPageColor' : [ 0x60, ['unsigned short']],
    'LastTrimStamp' : [ 0x62, ['unsigned short']],
    'PageFaultCount' : [ 0x64, ['unsigned long']],
    'TrimmedPageCount' : [ 0x68, ['unsigned long']],
    'ForceTrimPages' : [ 0x6c, ['unsigned long']],
    'Flags' : [ 0x70, ['_MMSUPPORT_FLAGS']],
    'ReleasedCommitDebt' : [ 0x74, ['unsigned long']],
    'WsSwapSupport' : [ 0x78, ['pointer', ['void']]],
    'CommitReAcquireFailSupport' : [ 0x7c, ['pointer', ['void']]],
    'ShadowMapping' : [ 0x80, ['pointer', ['void']]],
} ],
  '__unnamed_1677' : [ 0x4, {
    'ImageCommitment' : [ 0x0, ['unsigned long']],
    'CreatingProcess' : [ 0x0, ['pointer', ['_EPROCESS']]],
} ],
  '__unnamed_167b' : [ 0x4, {
    'ImageInformation' : [ 0x0, ['pointer', ['_MI_SECTION_IMAGE_INFORMATION']]],
    'FirstMappedVa' : [ 0x0, ['pointer', ['void']]],
} ],
  '_SEGMENT' : [ 0x30, {
    'ControlArea' : [ 0x0, ['pointer', ['_CONTROL_AREA']]],
    'TotalNumberOfPtes' : [ 0x4, ['unsigned long']],
    'SegmentFlags' : [ 0x8, ['_SEGMENT_FLAGS']],
    'NumberOfCommittedPages' : [ 0xc, ['unsigned long']],
    'SizeOfSegment' : [ 0x10, ['unsigned long long']],
    'ExtendInfo' : [ 0x18, ['pointer', ['_MMEXTEND_INFO']]],
    'BasedAddress' : [ 0x18, ['pointer', ['void']]],
    'SegmentLock' : [ 0x1c, ['_EX_PUSH_LOCK']],
    'u1' : [ 0x20, ['__unnamed_1677']],
    'u2' : [ 0x24, ['__unnamed_167b']],
    'PrototypePte' : [ 0x28, ['pointer', ['_MMPTE']]],
} ],
  '__unnamed_1680' : [ 0x4, {
    'LongFlags' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x0, ['_MMSECTION_FLAGS']],
} ],
  '__unnamed_168b' : [ 0xc, {
    'NumberOfSystemCacheViews' : [ 0x0, ['unsigned long']],
    'ImageRelocationStartBit' : [ 0x0, ['unsigned long']],
    'WritableUserReferences' : [ 0x4, ['long']],
    'ImageRelocationSizeIn64k' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'Unused' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 25, native_type='unsigned long')]],
    'SystemImage' : [ 0x4, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'StrongCode' : [ 0x4, ['BitField', dict(start_bit = 26, end_bit = 28, native_type='unsigned long')]],
    'CantMove' : [ 0x4, ['BitField', dict(start_bit = 28, end_bit = 29, native_type='unsigned long')]],
    'BitMap' : [ 0x4, ['BitField', dict(start_bit = 29, end_bit = 31, native_type='unsigned long')]],
    'ImageActive' : [ 0x4, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'FlushInProgressCount' : [ 0x8, ['unsigned long']],
    'NumberOfSubsections' : [ 0x8, ['unsigned long']],
    'SeImageStub' : [ 0x8, ['pointer', ['_MI_IMAGE_SECURITY_REFERENCE']]],
} ],
  '__unnamed_168d' : [ 0xc, {
    'e2' : [ 0x0, ['__unnamed_168b']],
} ],
  '_CONTROL_AREA' : [ 0x50, {
    'Segment' : [ 0x0, ['pointer', ['_SEGMENT']]],
    'ListHead' : [ 0x4, ['_LIST_ENTRY']],
    'NumberOfSectionReferences' : [ 0xc, ['unsigned long']],
    'NumberOfPfnReferences' : [ 0x10, ['unsigned long']],
    'NumberOfMappedViews' : [ 0x14, ['unsigned long']],
    'NumberOfUserReferences' : [ 0x18, ['unsigned long']],
    'u' : [ 0x1c, ['__unnamed_1680']],
    'FilePointer' : [ 0x20, ['_EX_FAST_REF']],
    'ControlAreaLock' : [ 0x24, ['long']],
    'ModifiedWriteCount' : [ 0x28, ['unsigned long']],
    'WaitList' : [ 0x2c, ['pointer', ['_MI_CONTROL_AREA_WAIT_BLOCK']]],
    'u2' : [ 0x30, ['__unnamed_168d']],
    'LockedPages' : [ 0x40, ['unsigned long long']],
    'FileObjectLock' : [ 0x48, ['_EX_PUSH_LOCK']],
} ],
  '__unnamed_169e' : [ 0x4, {
    'LongFlags' : [ 0x0, ['unsigned long']],
    'VadFlags' : [ 0x0, ['_MMVAD_FLAGS']],
} ],
  '__unnamed_16a1' : [ 0x4, {
    'LongFlags1' : [ 0x0, ['unsigned long']],
    'VadFlags1' : [ 0x0, ['_MMVAD_FLAGS1']],
} ],
  '_MMVAD_SHORT' : [ 0x28, {
    'VadNode' : [ 0x0, ['_RTL_BALANCED_NODE']],
    'NextVad' : [ 0x0, ['pointer', ['_MMVAD_SHORT']]],
    'StartingVpn' : [ 0xc, ['unsigned long']],
    'EndingVpn' : [ 0x10, ['unsigned long']],
    'ReferenceCount' : [ 0x14, ['long']],
    'PushLock' : [ 0x18, ['_EX_PUSH_LOCK']],
    'u' : [ 0x1c, ['__unnamed_169e']],
    'u1' : [ 0x20, ['__unnamed_16a1']],
    'EventList' : [ 0x24, ['pointer', ['_MI_VAD_EVENT_BLOCK']]],
} ],
  '_MI_PARTITION' : [ 0x1740, {
    'Core' : [ 0x0, ['_MI_PARTITION_CORE']],
    'Modwriter' : [ 0xe8, ['_MI_PARTITION_MODWRITES']],
    'Store' : [ 0x298, ['_MI_PARTITION_STORES']],
    'Segments' : [ 0x2e8, ['_MI_PARTITION_SEGMENTS']],
    'PageLists' : [ 0x3c0, ['_MI_PARTITION_PAGE_LISTS']],
    'Commit' : [ 0xa80, ['_MI_PARTITION_COMMIT']],
    'Zeroing' : [ 0xaa0, ['_MI_PARTITION_ZEROING']],
    'PageCombine' : [ 0xad0, ['_MI_PAGE_COMBINING_SUPPORT']],
    'WorkingSetControl' : [ 0xba8, ['pointer', ['void']]],
    'WorkingSetExpansionHead' : [ 0xbac, ['_MMWORKING_SET_EXPANSION_HEAD']],
    'Vp' : [ 0xbc0, ['_MI_VISIBLE_PARTITION']],
} ],
  '_MM_STORE_KEY' : [ 0x4, {
    'KeyLow' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 28, native_type='unsigned long')]],
    'KeyHigh' : [ 0x0, ['BitField', dict(start_bit = 28, end_bit = 32, native_type='unsigned long')]],
    'EntireKey' : [ 0x0, ['unsigned long']],
} ],
  '_MMPAGING_FILE' : [ 0x90, {
    'Size' : [ 0x0, ['unsigned long']],
    'MaximumSize' : [ 0x4, ['unsigned long']],
    'MinimumSize' : [ 0x8, ['unsigned long']],
    'FreeSpace' : [ 0xc, ['unsigned long']],
    'PeakUsage' : [ 0x10, ['unsigned long']],
    'HighestPage' : [ 0x14, ['unsigned long']],
    'FreeReservationSpace' : [ 0x18, ['unsigned long']],
    'LargestReserveCluster' : [ 0x1c, ['unsigned long']],
    'File' : [ 0x20, ['pointer', ['_FILE_OBJECT']]],
    'Entry' : [ 0x24, ['array', 2, ['pointer', ['_MMMOD_WRITER_MDL_ENTRY']]]],
    'PfnsToFree' : [ 0x30, ['_SLIST_HEADER']],
    'PageFileName' : [ 0x38, ['_UNICODE_STRING']],
    'Bitmaps' : [ 0x40, ['pointer', ['_MI_PAGING_FILE_SPACE_BITMAPS']]],
    'AllocationBitmapHint' : [ 0x44, ['unsigned long']],
    'ReservationBitmapHint' : [ 0x48, ['unsigned long']],
    'LargestNonReservedClusterSize' : [ 0x4c, ['unsigned long']],
    'RefreshClusterSize' : [ 0x50, ['unsigned long']],
    'LastRefreshClusterSize' : [ 0x54, ['unsigned long']],
    'ReservedClusterSizeAggregate' : [ 0x58, ['unsigned long']],
    'ToBeEvictedCount' : [ 0x5c, ['unsigned long']],
    'HybridPriority' : [ 0x5c, ['unsigned long']],
    'PageFileNumber' : [ 0x60, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned short')]],
    'WsSwapPagefile' : [ 0x60, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'NoReservations' : [ 0x60, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'VirtualStorePagefile' : [ 0x60, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SwapSupported' : [ 0x60, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'NodeInserted' : [ 0x60, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'StackNotified' : [ 0x60, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'Spare0' : [ 0x60, ['BitField', dict(start_bit = 10, end_bit = 15, native_type='unsigned short')]],
    'AdriftMdls' : [ 0x62, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Spare1' : [ 0x62, ['BitField', dict(start_bit = 1, end_bit = 8, native_type='unsigned char')]],
    'Spare2' : [ 0x63, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned char')]],
    'PageHashPages' : [ 0x64, ['unsigned long']],
    'PageHashPagesPeak' : [ 0x68, ['unsigned long']],
    'PageHash' : [ 0x6c, ['pointer', ['unsigned long']]],
    'FileHandle' : [ 0x70, ['pointer', ['void']]],
    'Lock' : [ 0x74, ['unsigned long']],
    'LockOwner' : [ 0x78, ['pointer', ['_ETHREAD']]],
    'FlowThroughReadRoot' : [ 0x7c, ['_RTL_AVL_TREE']],
    'Partition' : [ 0x80, ['pointer', ['_MI_PARTITION']]],
    'FileObjectNode' : [ 0x84, ['_RTL_BALANCED_NODE']],
} ],
  'tagSWITCH_CONTEXT' : [ 0x68, {
    'Attribute' : [ 0x0, ['tagSWITCH_CONTEXT_ATTRIBUTE']],
    'Data' : [ 0x18, ['tagSWITCH_CONTEXT_DATA']],
} ],
  '__unnamed_16e2' : [ 0xc, {
    'Failure' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'_None', 1: u'_CmInitializeHive', 2: u'_HvInitializeHive', 3: u'_HvpBuildMap', 4: u'_HvpBuildMapForLoaderHive', 5: u'_HvpInitMap', 6: u'_HvLoadHive', 7: u'_HvpMapHiveImage', 8: u'_HvpRecoverData', 9: u'_CmpValidateHiveSecurityDescriptors', 10: u'_HvpEnlistBinInMap', 11: u'_CmCheckRegistry', 12: u'_CmRegistryIO', 13: u'_CmCheckRegistry2', 14: u'_CmpCheckKey', 15: u'_CmpCheckValueList', 16: u'_HvCheckHive', 17: u'_HvCheckBin', 18: u'_HvpGetLogEntryDirtyVector', 19: u'_HvpReadLogEntryHeader', 20: u'_HvpReadLogEntry', 21: u'_CmpMountPreloadedHives', 22: u'_CmpLoadHiveThread'})]],
    'Status' : [ 0x4, ['long']],
    'Point' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_16e5' : [ 0xc, {
    'Action' : [ 0x0, ['unsigned long']],
    'Handle' : [ 0x4, ['pointer', ['void']]],
    'Status' : [ 0x8, ['long']],
} ],
  '__unnamed_16e7' : [ 0x4, {
    'CheckStack' : [ 0x0, ['pointer', ['void']]],
} ],
  '__unnamed_16eb' : [ 0x10, {
    'Cell' : [ 0x0, ['unsigned long']],
    'CellPoint' : [ 0x4, ['pointer', ['_CELL_DATA']]],
    'RootPoint' : [ 0x8, ['pointer', ['void']]],
    'Index' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_16ed' : [ 0x10, {
    'List' : [ 0x0, ['pointer', ['_CELL_DATA']]],
    'Index' : [ 0x4, ['unsigned long']],
    'Cell' : [ 0x8, ['unsigned long']],
    'CellPoint' : [ 0xc, ['pointer', ['_CELL_DATA']]],
} ],
  '__unnamed_16f1' : [ 0xc, {
    'Space' : [ 0x0, ['unsigned long']],
    'MapPoint' : [ 0x4, ['unsigned long']],
    'BinPoint' : [ 0x8, ['pointer', ['_HBIN']]],
} ],
  '__unnamed_16f5' : [ 0x8, {
    'Bin' : [ 0x0, ['pointer', ['_HBIN']]],
    'CellPoint' : [ 0x4, ['pointer', ['_HCELL']]],
} ],
  '__unnamed_16f7' : [ 0x4, {
    'FileOffset' : [ 0x0, ['unsigned long']],
} ],
  '_HIVE_LOAD_FAILURE' : [ 0x120, {
    'Hive' : [ 0x0, ['pointer', ['_HHIVE']]],
    'Index' : [ 0x4, ['unsigned long']],
    'RecoverableIndex' : [ 0x8, ['unsigned long']],
    'Locations' : [ 0xc, ['array', 8, ['__unnamed_16e2']]],
    'RecoverableLocations' : [ 0x6c, ['array', 8, ['__unnamed_16e2']]],
    'RegistryIO' : [ 0xcc, ['__unnamed_16e5']],
    'CheckRegistry2' : [ 0xd8, ['__unnamed_16e7']],
    'CheckKey' : [ 0xdc, ['__unnamed_16eb']],
    'CheckValueList' : [ 0xec, ['__unnamed_16ed']],
    'CheckHive' : [ 0xfc, ['__unnamed_16f1']],
    'CheckHive1' : [ 0x108, ['__unnamed_16f1']],
    'CheckBin' : [ 0x114, ['__unnamed_16f5']],
    'RecoverData' : [ 0x11c, ['__unnamed_16f7']],
} ],
  '_PCW_COUNTER_DESCRIPTOR' : [ 0x8, {
    'Id' : [ 0x0, ['unsigned short']],
    'StructIndex' : [ 0x2, ['unsigned short']],
    'Offset' : [ 0x4, ['unsigned short']],
    'Size' : [ 0x6, ['unsigned short']],
} ],
  '_PCW_REGISTRATION_INFORMATION' : [ 0x18, {
    'Version' : [ 0x0, ['unsigned long']],
    'Name' : [ 0x4, ['pointer', ['_UNICODE_STRING']]],
    'CounterCount' : [ 0x8, ['unsigned long']],
    'Counters' : [ 0xc, ['pointer', ['_PCW_COUNTER_DESCRIPTOR']]],
    'Callback' : [ 0x10, ['pointer', ['void']]],
    'CallbackContext' : [ 0x14, ['pointer', ['void']]],
} ],
  '_PCW_PROCESSOR_INFO' : [ 0xc0, {
    'IdleTime' : [ 0x0, ['unsigned long long']],
    'AvailableTime' : [ 0x8, ['unsigned long long']],
    'UserTime' : [ 0x10, ['unsigned long long']],
    'KernelTime' : [ 0x18, ['unsigned long long']],
    'Interrupts' : [ 0x20, ['unsigned long']],
    'DpcTime' : [ 0x28, ['unsigned long long']],
    'InterruptTime' : [ 0x30, ['unsigned long long']],
    'ClockInterrupts' : [ 0x38, ['unsigned long']],
    'DpcCount' : [ 0x3c, ['unsigned long']],
    'DpcRate' : [ 0x40, ['unsigned long']],
    'C1Time' : [ 0x48, ['unsigned long long']],
    'C2Time' : [ 0x50, ['unsigned long long']],
    'C3Time' : [ 0x58, ['unsigned long long']],
    'C1Transitions' : [ 0x60, ['unsigned long long']],
    'C2Transitions' : [ 0x68, ['unsigned long long']],
    'C3Transitions' : [ 0x70, ['unsigned long long']],
    'StallTime' : [ 0x78, ['unsigned long long']],
    'ParkingStatus' : [ 0x80, ['unsigned long']],
    'CurrentFrequency' : [ 0x84, ['unsigned long']],
    'PercentMaxFrequency' : [ 0x88, ['unsigned long']],
    'StateFlags' : [ 0x8c, ['unsigned long']],
    'NominalThroughput' : [ 0x90, ['unsigned long']],
    'ActiveThroughput' : [ 0x94, ['unsigned long']],
    'ScaledThroughput' : [ 0x98, ['unsigned long long']],
    'ScaledKernelThroughput' : [ 0xa0, ['unsigned long long']],
    'AverageIdleTime' : [ 0xa8, ['unsigned long long']],
    'IdleBreakEvents' : [ 0xb0, ['unsigned long long']],
    'PerformanceLimit' : [ 0xb8, ['unsigned long']],
    'PerformanceLimitFlags' : [ 0xbc, ['unsigned long']],
} ],
  '_PCW_DATA' : [ 0x8, {
    'Data' : [ 0x0, ['pointer', ['void']]],
    'Size' : [ 0x4, ['unsigned long']],
} ],
  '_SYNCH_COUNTERS' : [ 0xb8, {
    'SpinLockAcquireCount' : [ 0x0, ['unsigned long']],
    'SpinLockContentionCount' : [ 0x4, ['unsigned long']],
    'SpinLockSpinCount' : [ 0x8, ['unsigned long']],
    'IpiSendRequestBroadcastCount' : [ 0xc, ['unsigned long']],
    'IpiSendRequestRoutineCount' : [ 0x10, ['unsigned long']],
    'IpiSendSoftwareInterruptCount' : [ 0x14, ['unsigned long']],
    'ExInitializeResourceCount' : [ 0x18, ['unsigned long']],
    'ExReInitializeResourceCount' : [ 0x1c, ['unsigned long']],
    'ExDeleteResourceCount' : [ 0x20, ['unsigned long']],
    'ExecutiveResourceAcquiresCount' : [ 0x24, ['unsigned long']],
    'ExecutiveResourceContentionsCount' : [ 0x28, ['unsigned long']],
    'ExecutiveResourceReleaseExclusiveCount' : [ 0x2c, ['unsigned long']],
    'ExecutiveResourceReleaseSharedCount' : [ 0x30, ['unsigned long']],
    'ExecutiveResourceConvertsCount' : [ 0x34, ['unsigned long']],
    'ExAcqResExclusiveAttempts' : [ 0x38, ['unsigned long']],
    'ExAcqResExclusiveAcquiresExclusive' : [ 0x3c, ['unsigned long']],
    'ExAcqResExclusiveAcquiresExclusiveRecursive' : [ 0x40, ['unsigned long']],
    'ExAcqResExclusiveWaits' : [ 0x44, ['unsigned long']],
    'ExAcqResExclusiveNotAcquires' : [ 0x48, ['unsigned long']],
    'ExAcqResSharedAttempts' : [ 0x4c, ['unsigned long']],
    'ExAcqResSharedAcquiresExclusive' : [ 0x50, ['unsigned long']],
    'ExAcqResSharedAcquiresShared' : [ 0x54, ['unsigned long']],
    'ExAcqResSharedAcquiresSharedRecursive' : [ 0x58, ['unsigned long']],
    'ExAcqResSharedWaits' : [ 0x5c, ['unsigned long']],
    'ExAcqResSharedNotAcquires' : [ 0x60, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAttempts' : [ 0x64, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresExclusive' : [ 0x68, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresShared' : [ 0x6c, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresSharedRecursive' : [ 0x70, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveWaits' : [ 0x74, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveNotAcquires' : [ 0x78, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAttempts' : [ 0x7c, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresExclusive' : [ 0x80, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresShared' : [ 0x84, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresSharedRecursive' : [ 0x88, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveWaits' : [ 0x8c, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveNotAcquires' : [ 0x90, ['unsigned long']],
    'ExSetResOwnerPointerExclusive' : [ 0x94, ['unsigned long']],
    'ExSetResOwnerPointerSharedNew' : [ 0x98, ['unsigned long']],
    'ExSetResOwnerPointerSharedOld' : [ 0x9c, ['unsigned long']],
    'ExTryToAcqExclusiveAttempts' : [ 0xa0, ['unsigned long']],
    'ExTryToAcqExclusiveAcquires' : [ 0xa4, ['unsigned long']],
    'ExBoostExclusiveOwner' : [ 0xa8, ['unsigned long']],
    'ExBoostSharedOwners' : [ 0xac, ['unsigned long']],
    'ExEtwSynchTrackingNotificationsCount' : [ 0xb0, ['unsigned long']],
    'ExEtwSynchTrackingNotificationsAccountedCount' : [ 0xb4, ['unsigned long']],
} ],
  '_ETW_PERF_COUNTERS' : [ 0x18, {
    'TotalActiveSessions' : [ 0x0, ['long']],
    'TotalBufferMemoryNonPagedPool' : [ 0x4, ['long']],
    'TotalBufferMemoryPagedPool' : [ 0x8, ['long']],
    'TotalGuidsEnabled' : [ 0xc, ['long']],
    'TotalGuidsNotEnabled' : [ 0x10, ['long']],
    'TotalGuidsPreEnabled' : [ 0x14, ['long']],
} ],
  '_ETW_SESSION_PERF_COUNTERS' : [ 0x18, {
    'BufferMemoryPagedPool' : [ 0x0, ['long']],
    'BufferMemoryNonPagedPool' : [ 0x4, ['long']],
    'EventsLoggedCount' : [ 0x8, ['unsigned long long']],
    'EventsLost' : [ 0x10, ['long']],
    'NumConsumers' : [ 0x14, ['long']],
} ],
  '_FILESYSTEM_DISK_COUNTERS' : [ 0x10, {
    'FsBytesRead' : [ 0x0, ['unsigned long long']],
    'FsBytesWritten' : [ 0x8, ['unsigned long long']],
} ],
  '_THERMAL_ZONE_COUNTERS' : [ 0xc, {
    'Temperature' : [ 0x0, ['unsigned long']],
    'ThrottleLimit' : [ 0x4, ['unsigned long']],
    'ThrottleReasons' : [ 0x8, ['unsigned long']],
} ],
  '_TEB32' : [ 0x1000, {
    'NtTib' : [ 0x0, ['_NT_TIB32']],
    'EnvironmentPointer' : [ 0x1c, ['unsigned long']],
    'ClientId' : [ 0x20, ['_CLIENT_ID32']],
    'ActiveRpcHandle' : [ 0x28, ['unsigned long']],
    'ThreadLocalStoragePointer' : [ 0x2c, ['unsigned long']],
    'ProcessEnvironmentBlock' : [ 0x30, ['unsigned long']],
    'LastErrorValue' : [ 0x34, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x38, ['unsigned long']],
    'CsrClientThread' : [ 0x3c, ['unsigned long']],
    'Win32ThreadInfo' : [ 0x40, ['unsigned long']],
    'User32Reserved' : [ 0x44, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xac, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0xc0, ['unsigned long']],
    'CurrentLocale' : [ 0xc4, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0xc8, ['unsigned long']],
    'ReservedForDebuggerInstrumentation' : [ 0xcc, ['array', 16, ['unsigned long']]],
    'SystemReserved1' : [ 0x10c, ['array', 38, ['unsigned long']]],
    'ExceptionCode' : [ 0x1a4, ['long']],
    'ActivationContextStackPointer' : [ 0x1a8, ['unsigned long']],
    'InstrumentationCallbackSp' : [ 0x1ac, ['unsigned long']],
    'InstrumentationCallbackPreviousPc' : [ 0x1b0, ['unsigned long']],
    'InstrumentationCallbackPreviousSp' : [ 0x1b4, ['unsigned long']],
    'InstrumentationCallbackDisabled' : [ 0x1b8, ['unsigned char']],
    'SpareBytes' : [ 0x1b9, ['array', 23, ['unsigned char']]],
    'TxFsContext' : [ 0x1d0, ['unsigned long']],
    'GdiTebBatch' : [ 0x1d4, ['_GDI_TEB_BATCH32']],
    'RealClientId' : [ 0x6b4, ['_CLIENT_ID32']],
    'GdiCachedProcessHandle' : [ 0x6bc, ['unsigned long']],
    'GdiClientPID' : [ 0x6c0, ['unsigned long']],
    'GdiClientTID' : [ 0x6c4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x6c8, ['unsigned long']],
    'Win32ClientInfo' : [ 0x6cc, ['array', 62, ['unsigned long']]],
    'glDispatchTable' : [ 0x7c4, ['array', 233, ['unsigned long']]],
    'glReserved1' : [ 0xb68, ['array', 29, ['unsigned long']]],
    'glReserved2' : [ 0xbdc, ['unsigned long']],
    'glSectionInfo' : [ 0xbe0, ['unsigned long']],
    'glSection' : [ 0xbe4, ['unsigned long']],
    'glTable' : [ 0xbe8, ['unsigned long']],
    'glCurrentRC' : [ 0xbec, ['unsigned long']],
    'glContext' : [ 0xbf0, ['unsigned long']],
    'LastStatusValue' : [ 0xbf4, ['unsigned long']],
    'StaticUnicodeString' : [ 0xbf8, ['_STRING32']],
    'StaticUnicodeBuffer' : [ 0xc00, ['array', 261, ['wchar']]],
    'DeallocationStack' : [ 0xe0c, ['unsigned long']],
    'TlsSlots' : [ 0xe10, ['array', 64, ['unsigned long']]],
    'TlsLinks' : [ 0xf10, ['LIST_ENTRY32']],
    'Vdm' : [ 0xf18, ['unsigned long']],
    'ReservedForNtRpc' : [ 0xf1c, ['unsigned long']],
    'DbgSsReserved' : [ 0xf20, ['array', 2, ['unsigned long']]],
    'HardErrorMode' : [ 0xf28, ['unsigned long']],
    'Instrumentation' : [ 0xf2c, ['array', 9, ['unsigned long']]],
    'ActivityId' : [ 0xf50, ['_GUID']],
    'SubProcessTag' : [ 0xf60, ['unsigned long']],
    'PerflibData' : [ 0xf64, ['unsigned long']],
    'EtwTraceData' : [ 0xf68, ['unsigned long']],
    'WinSockData' : [ 0xf6c, ['unsigned long']],
    'GdiBatchCount' : [ 0xf70, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0xf74, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0xf74, ['unsigned long']],
    'ReservedPad0' : [ 0xf74, ['unsigned char']],
    'ReservedPad1' : [ 0xf75, ['unsigned char']],
    'ReservedPad2' : [ 0xf76, ['unsigned char']],
    'IdealProcessor' : [ 0xf77, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0xf78, ['unsigned long']],
    'ReservedForPerf' : [ 0xf7c, ['unsigned long']],
    'ReservedForOle' : [ 0xf80, ['unsigned long']],
    'WaitingOnLoaderLock' : [ 0xf84, ['unsigned long']],
    'SavedPriorityState' : [ 0xf88, ['unsigned long']],
    'ReservedForCodeCoverage' : [ 0xf8c, ['unsigned long']],
    'ThreadPoolData' : [ 0xf90, ['unsigned long']],
    'TlsExpansionSlots' : [ 0xf94, ['unsigned long']],
    'MuiGeneration' : [ 0xf98, ['unsigned long']],
    'IsImpersonating' : [ 0xf9c, ['unsigned long']],
    'NlsCache' : [ 0xfa0, ['unsigned long']],
    'pShimData' : [ 0xfa4, ['unsigned long']],
    'HeapVirtualAffinity' : [ 0xfa8, ['unsigned short']],
    'LowFragHeapDataSlot' : [ 0xfaa, ['unsigned short']],
    'CurrentTransactionHandle' : [ 0xfac, ['unsigned long']],
    'ActiveFrame' : [ 0xfb0, ['unsigned long']],
    'FlsData' : [ 0xfb4, ['unsigned long']],
    'PreferredLanguages' : [ 0xfb8, ['unsigned long']],
    'UserPrefLanguages' : [ 0xfbc, ['unsigned long']],
    'MergedPrefLanguages' : [ 0xfc0, ['unsigned long']],
    'MuiImpersonation' : [ 0xfc4, ['unsigned long']],
    'CrossTebFlags' : [ 0xfc8, ['unsigned short']],
    'SpareCrossTebBits' : [ 0xfc8, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0xfca, ['unsigned short']],
    'SafeThunkCall' : [ 0xfca, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0xfca, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0xfca, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0xfca, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0xfca, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0xfca, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0xfca, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0xfca, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0xfca, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0xfca, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0xfca, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SessionAware' : [ 0xfca, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
    'LoadOwner' : [ 0xfca, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
    'LoaderWorker' : [ 0xfca, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0xfca, ['BitField', dict(start_bit = 14, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0xfcc, ['unsigned long']],
    'TxnScopeExitCallback' : [ 0xfd0, ['unsigned long']],
    'TxnScopeContext' : [ 0xfd4, ['unsigned long']],
    'LockCount' : [ 0xfd8, ['unsigned long']],
    'WowTebOffset' : [ 0xfdc, ['long']],
    'ResourceRetValue' : [ 0xfe0, ['unsigned long']],
    'ReservedForWdf' : [ 0xfe4, ['unsigned long']],
    'ReservedForCrt' : [ 0xfe8, ['unsigned long long']],
    'EffectiveContainerId' : [ 0xff0, ['_GUID']],
} ],
  '_TEB64' : [ 0x1838, {
    'NtTib' : [ 0x0, ['_NT_TIB64']],
    'EnvironmentPointer' : [ 0x38, ['unsigned long long']],
    'ClientId' : [ 0x40, ['_CLIENT_ID64']],
    'ActiveRpcHandle' : [ 0x50, ['unsigned long long']],
    'ThreadLocalStoragePointer' : [ 0x58, ['unsigned long long']],
    'ProcessEnvironmentBlock' : [ 0x60, ['unsigned long long']],
    'LastErrorValue' : [ 0x68, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x6c, ['unsigned long']],
    'CsrClientThread' : [ 0x70, ['unsigned long long']],
    'Win32ThreadInfo' : [ 0x78, ['unsigned long long']],
    'User32Reserved' : [ 0x80, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xe8, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0x100, ['unsigned long long']],
    'CurrentLocale' : [ 0x108, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0x10c, ['unsigned long']],
    'ReservedForDebuggerInstrumentation' : [ 0x110, ['array', 16, ['unsigned long long']]],
    'SystemReserved1' : [ 0x190, ['array', 38, ['unsigned long long']]],
    'ExceptionCode' : [ 0x2c0, ['long']],
    'Padding0' : [ 0x2c4, ['array', 4, ['unsigned char']]],
    'ActivationContextStackPointer' : [ 0x2c8, ['unsigned long long']],
    'InstrumentationCallbackSp' : [ 0x2d0, ['unsigned long long']],
    'InstrumentationCallbackPreviousPc' : [ 0x2d8, ['unsigned long long']],
    'InstrumentationCallbackPreviousSp' : [ 0x2e0, ['unsigned long long']],
    'TxFsContext' : [ 0x2e8, ['unsigned long']],
    'InstrumentationCallbackDisabled' : [ 0x2ec, ['unsigned char']],
    'Padding1' : [ 0x2ed, ['array', 3, ['unsigned char']]],
    'GdiTebBatch' : [ 0x2f0, ['_GDI_TEB_BATCH64']],
    'RealClientId' : [ 0x7d8, ['_CLIENT_ID64']],
    'GdiCachedProcessHandle' : [ 0x7e8, ['unsigned long long']],
    'GdiClientPID' : [ 0x7f0, ['unsigned long']],
    'GdiClientTID' : [ 0x7f4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x7f8, ['unsigned long long']],
    'Win32ClientInfo' : [ 0x800, ['array', 62, ['unsigned long long']]],
    'glDispatchTable' : [ 0x9f0, ['array', 233, ['unsigned long long']]],
    'glReserved1' : [ 0x1138, ['array', 29, ['unsigned long long']]],
    'glReserved2' : [ 0x1220, ['unsigned long long']],
    'glSectionInfo' : [ 0x1228, ['unsigned long long']],
    'glSection' : [ 0x1230, ['unsigned long long']],
    'glTable' : [ 0x1238, ['unsigned long long']],
    'glCurrentRC' : [ 0x1240, ['unsigned long long']],
    'glContext' : [ 0x1248, ['unsigned long long']],
    'LastStatusValue' : [ 0x1250, ['unsigned long']],
    'Padding2' : [ 0x1254, ['array', 4, ['unsigned char']]],
    'StaticUnicodeString' : [ 0x1258, ['_STRING64']],
    'StaticUnicodeBuffer' : [ 0x1268, ['array', 261, ['wchar']]],
    'Padding3' : [ 0x1472, ['array', 6, ['unsigned char']]],
    'DeallocationStack' : [ 0x1478, ['unsigned long long']],
    'TlsSlots' : [ 0x1480, ['array', 64, ['unsigned long long']]],
    'TlsLinks' : [ 0x1680, ['LIST_ENTRY64']],
    'Vdm' : [ 0x1690, ['unsigned long long']],
    'ReservedForNtRpc' : [ 0x1698, ['unsigned long long']],
    'DbgSsReserved' : [ 0x16a0, ['array', 2, ['unsigned long long']]],
    'HardErrorMode' : [ 0x16b0, ['unsigned long']],
    'Padding4' : [ 0x16b4, ['array', 4, ['unsigned char']]],
    'Instrumentation' : [ 0x16b8, ['array', 11, ['unsigned long long']]],
    'ActivityId' : [ 0x1710, ['_GUID']],
    'SubProcessTag' : [ 0x1720, ['unsigned long long']],
    'PerflibData' : [ 0x1728, ['unsigned long long']],
    'EtwTraceData' : [ 0x1730, ['unsigned long long']],
    'WinSockData' : [ 0x1738, ['unsigned long long']],
    'GdiBatchCount' : [ 0x1740, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0x1744, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0x1744, ['unsigned long']],
    'ReservedPad0' : [ 0x1744, ['unsigned char']],
    'ReservedPad1' : [ 0x1745, ['unsigned char']],
    'ReservedPad2' : [ 0x1746, ['unsigned char']],
    'IdealProcessor' : [ 0x1747, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0x1748, ['unsigned long']],
    'Padding5' : [ 0x174c, ['array', 4, ['unsigned char']]],
    'ReservedForPerf' : [ 0x1750, ['unsigned long long']],
    'ReservedForOle' : [ 0x1758, ['unsigned long long']],
    'WaitingOnLoaderLock' : [ 0x1760, ['unsigned long']],
    'Padding6' : [ 0x1764, ['array', 4, ['unsigned char']]],
    'SavedPriorityState' : [ 0x1768, ['unsigned long long']],
    'ReservedForCodeCoverage' : [ 0x1770, ['unsigned long long']],
    'ThreadPoolData' : [ 0x1778, ['unsigned long long']],
    'TlsExpansionSlots' : [ 0x1780, ['unsigned long long']],
    'DeallocationBStore' : [ 0x1788, ['unsigned long long']],
    'BStoreLimit' : [ 0x1790, ['unsigned long long']],
    'MuiGeneration' : [ 0x1798, ['unsigned long']],
    'IsImpersonating' : [ 0x179c, ['unsigned long']],
    'NlsCache' : [ 0x17a0, ['unsigned long long']],
    'pShimData' : [ 0x17a8, ['unsigned long long']],
    'HeapVirtualAffinity' : [ 0x17b0, ['unsigned short']],
    'LowFragHeapDataSlot' : [ 0x17b2, ['unsigned short']],
    'Padding7' : [ 0x17b4, ['array', 4, ['unsigned char']]],
    'CurrentTransactionHandle' : [ 0x17b8, ['unsigned long long']],
    'ActiveFrame' : [ 0x17c0, ['unsigned long long']],
    'FlsData' : [ 0x17c8, ['unsigned long long']],
    'PreferredLanguages' : [ 0x17d0, ['unsigned long long']],
    'UserPrefLanguages' : [ 0x17d8, ['unsigned long long']],
    'MergedPrefLanguages' : [ 0x17e0, ['unsigned long long']],
    'MuiImpersonation' : [ 0x17e8, ['unsigned long']],
    'CrossTebFlags' : [ 0x17ec, ['unsigned short']],
    'SpareCrossTebBits' : [ 0x17ec, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0x17ee, ['unsigned short']],
    'SafeThunkCall' : [ 0x17ee, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0x17ee, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0x17ee, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0x17ee, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0x17ee, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0x17ee, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0x17ee, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0x17ee, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0x17ee, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0x17ee, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0x17ee, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SessionAware' : [ 0x17ee, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
    'LoadOwner' : [ 0x17ee, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
    'LoaderWorker' : [ 0x17ee, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0x17ee, ['BitField', dict(start_bit = 14, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0x17f0, ['unsigned long long']],
    'TxnScopeExitCallback' : [ 0x17f8, ['unsigned long long']],
    'TxnScopeContext' : [ 0x1800, ['unsigned long long']],
    'LockCount' : [ 0x1808, ['unsigned long']],
    'WowTebOffset' : [ 0x180c, ['long']],
    'ResourceRetValue' : [ 0x1810, ['unsigned long long']],
    'ReservedForWdf' : [ 0x1818, ['unsigned long long']],
    'ReservedForCrt' : [ 0x1820, ['unsigned long long']],
    'EffectiveContainerId' : [ 0x1828, ['_GUID']],
} ],
  '_HV_X64_HYPERVISOR_FEATURES' : [ 0x10, {
    'PartitionPrivileges' : [ 0x0, ['_HV_PARTITION_PRIVILEGE_MASK']],
    'MaxSupportedCState' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long')]],
    'HpetNeededForC3PowerState_Deprecated' : [ 0x8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Reserved' : [ 0x8, ['BitField', dict(start_bit = 5, end_bit = 32, native_type='unsigned long')]],
    'MwaitAvailable_Deprecated' : [ 0xc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'GuestDebuggingAvailable' : [ 0xc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'PerformanceMonitorsAvailable' : [ 0xc, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'CpuDynamicPartitioningAvailable' : [ 0xc, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'XmmRegistersForFastHypercallAvailable' : [ 0xc, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'GuestIdleAvailable' : [ 0xc, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'HypervisorSleepStateSupportAvailable' : [ 0xc, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'NumaDistanceQueryAvailable' : [ 0xc, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'FrequencyRegsAvailable' : [ 0xc, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'SyntheticMachineCheckAvailable' : [ 0xc, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'GuestCrashRegsAvailable' : [ 0xc, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'DebugRegsAvailable' : [ 0xc, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'Npiep1Available' : [ 0xc, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'DisableHypervisorAvailable' : [ 0xc, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'ExtendedGvaRangesForFlushVirtualAddressListAvailable' : [ 0xc, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'FastHypercallOutputAvailable' : [ 0xc, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'SvmFeaturesAvailable' : [ 0xc, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'SintPollingModeAvailable' : [ 0xc, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'Reserved1' : [ 0xc, ['BitField', dict(start_bit = 18, end_bit = 32, native_type='unsigned long')]],
} ],
  '_HV_PARTITION_PRIVILEGE_MASK' : [ 0x8, {
    'AsUINT64' : [ 0x0, ['unsigned long long']],
    'AccessVpRunTimeReg' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'AccessPartitionReferenceCounter' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'AccessSynicRegs' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'AccessSyntheticTimerRegs' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'AccessIntrCtrlRegs' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'AccessHypercallMsrs' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
    'AccessVpIndex' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long long')]],
    'AccessResetReg' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long long')]],
    'AccessStatsReg' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'AccessPartitionReferenceTsc' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'AccessGuestIdleReg' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'AccessFrequencyRegs' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'AccessDebugRegs' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long long')]],
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 32, native_type='unsigned long long')]],
    'CreatePartitions' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 33, native_type='unsigned long long')]],
    'AccessPartitionId' : [ 0x0, ['BitField', dict(start_bit = 33, end_bit = 34, native_type='unsigned long long')]],
    'AccessMemoryPool' : [ 0x0, ['BitField', dict(start_bit = 34, end_bit = 35, native_type='unsigned long long')]],
    'AdjustMessageBuffers' : [ 0x0, ['BitField', dict(start_bit = 35, end_bit = 36, native_type='unsigned long long')]],
    'PostMessages' : [ 0x0, ['BitField', dict(start_bit = 36, end_bit = 37, native_type='unsigned long long')]],
    'SignalEvents' : [ 0x0, ['BitField', dict(start_bit = 37, end_bit = 38, native_type='unsigned long long')]],
    'CreatePort' : [ 0x0, ['BitField', dict(start_bit = 38, end_bit = 39, native_type='unsigned long long')]],
    'ConnectPort' : [ 0x0, ['BitField', dict(start_bit = 39, end_bit = 40, native_type='unsigned long long')]],
    'AccessStats' : [ 0x0, ['BitField', dict(start_bit = 40, end_bit = 41, native_type='unsigned long long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 41, end_bit = 43, native_type='unsigned long long')]],
    'Debugging' : [ 0x0, ['BitField', dict(start_bit = 43, end_bit = 44, native_type='unsigned long long')]],
    'CpuManagement' : [ 0x0, ['BitField', dict(start_bit = 44, end_bit = 45, native_type='unsigned long long')]],
    'ConfigureProfiler' : [ 0x0, ['BitField', dict(start_bit = 45, end_bit = 46, native_type='unsigned long long')]],
    'AccessVpExitTracing' : [ 0x0, ['BitField', dict(start_bit = 46, end_bit = 47, native_type='unsigned long long')]],
    'EnableExtendedGvaRangesForFlushVirtualAddressList' : [ 0x0, ['BitField', dict(start_bit = 47, end_bit = 48, native_type='unsigned long long')]],
    'AccessVsm' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 49, native_type='unsigned long long')]],
    'AccessVpRegisters' : [ 0x0, ['BitField', dict(start_bit = 49, end_bit = 50, native_type='unsigned long long')]],
    'UnusedBit' : [ 0x0, ['BitField', dict(start_bit = 50, end_bit = 51, native_type='unsigned long long')]],
    'FastHypercallOutput' : [ 0x0, ['BitField', dict(start_bit = 51, end_bit = 52, native_type='unsigned long long')]],
    'EnableExtendedHypercalls' : [ 0x0, ['BitField', dict(start_bit = 52, end_bit = 53, native_type='unsigned long long')]],
    'StartVirtualProcessor' : [ 0x0, ['BitField', dict(start_bit = 53, end_bit = 54, native_type='unsigned long long')]],
    'Reserved3' : [ 0x0, ['BitField', dict(start_bit = 54, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_KTIMER_TABLE' : [ 0x1840, {
    'TimerExpiry' : [ 0x0, ['array', 16, ['pointer', ['_KTIMER']]]],
    'TimerEntries' : [ 0x40, ['array', 256, ['_KTIMER_TABLE_ENTRY']]],
} ],
  '_KTIMER_TABLE_ENTRY' : [ 0x18, {
    'Lock' : [ 0x0, ['unsigned long']],
    'Entry' : [ 0x4, ['_LIST_ENTRY']],
    'Time' : [ 0x10, ['_ULARGE_INTEGER']],
} ],
  '_XSTATE_SAVE' : [ 0x20, {
    'Reserved1' : [ 0x0, ['long long']],
    'Reserved2' : [ 0x8, ['unsigned long']],
    'Prev' : [ 0xc, ['pointer', ['_XSTATE_SAVE']]],
    'Reserved3' : [ 0x10, ['pointer', ['_XSAVE_AREA']]],
    'Thread' : [ 0x14, ['pointer', ['_KTHREAD']]],
    'Reserved4' : [ 0x18, ['pointer', ['void']]],
    'Level' : [ 0x1c, ['unsigned char']],
    'XStateContext' : [ 0x0, ['_XSTATE_CONTEXT']],
} ],
  '_XSAVE_AREA' : [ 0x240, {
    'LegacyState' : [ 0x0, ['_XSAVE_FORMAT']],
    'Header' : [ 0x200, ['_XSAVE_AREA_HEADER']],
} ],
  '_KSHARED_READY_QUEUE' : [ 0x134, {
    'Lock' : [ 0x0, ['unsigned long']],
    'ReadySummary' : [ 0x4, ['unsigned long']],
    'ReadyListHead' : [ 0x8, ['array', 32, ['_LIST_ENTRY']]],
    'RunningSummary' : [ 0x108, ['array', 32, ['unsigned char']]],
    'Span' : [ 0x128, ['unsigned char']],
    'LowProcIndex' : [ 0x129, ['unsigned char']],
    'QueueIndex' : [ 0x12a, ['unsigned char']],
    'ProcCount' : [ 0x12b, ['unsigned char']],
    'ScanOwner' : [ 0x12c, ['unsigned char']],
    'Spare' : [ 0x12d, ['array', 3, ['unsigned char']]],
    'Affinity' : [ 0x130, ['unsigned long']],
} ],
  '_KAFFINITY_EX' : [ 0xc, {
    'Count' : [ 0x0, ['unsigned short']],
    'Size' : [ 0x2, ['unsigned short']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Bitmap' : [ 0x8, ['array', 1, ['unsigned long']]],
} ],
  '_KAFFINITY_ENUMERATION_CONTEXT' : [ 0xc, {
    'Affinity' : [ 0x0, ['pointer', ['_KAFFINITY_EX']]],
    'CurrentMask' : [ 0x4, ['unsigned long']],
    'CurrentIndex' : [ 0x8, ['unsigned short']],
} ],
  '__unnamed_1807' : [ 0x4, {
    'LegacyDeviceNode' : [ 0x0, ['pointer', ['_DEVICE_NODE']]],
    'PendingDeviceRelations' : [ 0x0, ['pointer', ['_DEVICE_RELATIONS']]],
    'Information' : [ 0x0, ['pointer', ['void']]],
} ],
  '__unnamed_1809' : [ 0x4, {
    'NextResourceDeviceNode' : [ 0x0, ['pointer', ['_DEVICE_NODE']]],
} ],
  '__unnamed_180d' : [ 0x10, {
    'DockStatus' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'DOCK_NOTDOCKDEVICE', 1: u'DOCK_QUIESCENT', 2: u'DOCK_ARRIVING', 3: u'DOCK_DEPARTING', 4: u'DOCK_EJECTIRP_COMPLETED'})]],
    'ListEntry' : [ 0x4, ['_LIST_ENTRY']],
    'SerialNumber' : [ 0xc, ['pointer', ['unsigned short']]],
} ],
  '_DEVICE_NODE' : [ 0x1cc, {
    'Sibling' : [ 0x0, ['pointer', ['_DEVICE_NODE']]],
    'Child' : [ 0x4, ['pointer', ['_DEVICE_NODE']]],
    'Parent' : [ 0x8, ['pointer', ['_DEVICE_NODE']]],
    'LastChild' : [ 0xc, ['pointer', ['_DEVICE_NODE']]],
    'PhysicalDeviceObject' : [ 0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'InstancePath' : [ 0x14, ['_UNICODE_STRING']],
    'ServiceName' : [ 0x1c, ['_UNICODE_STRING']],
    'PendingIrp' : [ 0x24, ['pointer', ['_IRP']]],
    'FxDevice' : [ 0x28, ['pointer', ['_POP_FX_DEVICE']]],
    'FxDeviceLock' : [ 0x2c, ['long']],
    'FxRemoveEvent' : [ 0x30, ['_KEVENT']],
    'FxActivationCount' : [ 0x40, ['long']],
    'FxSleepCount' : [ 0x44, ['long']],
    'Plugin' : [ 0x48, ['pointer', ['_POP_FX_PLUGIN']]],
    'Level' : [ 0x4c, ['unsigned long']],
    'CurrentPowerState' : [ 0x50, ['_POWER_STATE']],
    'Notify' : [ 0x54, ['_PO_DEVICE_NOTIFY']],
    'PoIrpManager' : [ 0x90, ['_PO_IRP_MANAGER']],
    'UniqueId' : [ 0xa0, ['_UNICODE_STRING']],
    'PowerFlags' : [ 0xa8, ['unsigned long']],
    'State' : [ 0xac, ['Enumeration', dict(target = 'long', choices = {768: u'DeviceNodeUnspecified', 769: u'DeviceNodeUninitialized', 770: u'DeviceNodeInitialized', 771: u'DeviceNodeDriversAdded', 772: u'DeviceNodeResourcesAssigned', 773: u'DeviceNodeStartPending', 774: u'DeviceNodeStartCompletion', 775: u'DeviceNodeStartPostWork', 776: u'DeviceNodeStarted', 777: u'DeviceNodeQueryStopped', 778: u'DeviceNodeStopped', 779: u'DeviceNodeRestartCompletion', 780: u'DeviceNodeEnumeratePending', 781: u'DeviceNodeEnumerateCompletion', 782: u'DeviceNodeAwaitingQueuedDeletion', 783: u'DeviceNodeAwaitingQueuedRemoval', 784: u'DeviceNodeQueryRemoved', 785: u'DeviceNodeRemovePendingCloses', 786: u'DeviceNodeRemoved', 787: u'DeviceNodeDeletePendingCloses', 788: u'DeviceNodeDeleted', 789: u'MaxDeviceNodeState'})]],
    'PreviousState' : [ 0xb0, ['Enumeration', dict(target = 'long', choices = {768: u'DeviceNodeUnspecified', 769: u'DeviceNodeUninitialized', 770: u'DeviceNodeInitialized', 771: u'DeviceNodeDriversAdded', 772: u'DeviceNodeResourcesAssigned', 773: u'DeviceNodeStartPending', 774: u'DeviceNodeStartCompletion', 775: u'DeviceNodeStartPostWork', 776: u'DeviceNodeStarted', 777: u'DeviceNodeQueryStopped', 778: u'DeviceNodeStopped', 779: u'DeviceNodeRestartCompletion', 780: u'DeviceNodeEnumeratePending', 781: u'DeviceNodeEnumerateCompletion', 782: u'DeviceNodeAwaitingQueuedDeletion', 783: u'DeviceNodeAwaitingQueuedRemoval', 784: u'DeviceNodeQueryRemoved', 785: u'DeviceNodeRemovePendingCloses', 786: u'DeviceNodeRemoved', 787: u'DeviceNodeDeletePendingCloses', 788: u'DeviceNodeDeleted', 789: u'MaxDeviceNodeState'})]],
    'StateHistory' : [ 0xb4, ['array', 20, ['Enumeration', dict(target = 'long', choices = {768: u'DeviceNodeUnspecified', 769: u'DeviceNodeUninitialized', 770: u'DeviceNodeInitialized', 771: u'DeviceNodeDriversAdded', 772: u'DeviceNodeResourcesAssigned', 773: u'DeviceNodeStartPending', 774: u'DeviceNodeStartCompletion', 775: u'DeviceNodeStartPostWork', 776: u'DeviceNodeStarted', 777: u'DeviceNodeQueryStopped', 778: u'DeviceNodeStopped', 779: u'DeviceNodeRestartCompletion', 780: u'DeviceNodeEnumeratePending', 781: u'DeviceNodeEnumerateCompletion', 782: u'DeviceNodeAwaitingQueuedDeletion', 783: u'DeviceNodeAwaitingQueuedRemoval', 784: u'DeviceNodeQueryRemoved', 785: u'DeviceNodeRemovePendingCloses', 786: u'DeviceNodeRemoved', 787: u'DeviceNodeDeletePendingCloses', 788: u'DeviceNodeDeleted', 789: u'MaxDeviceNodeState'})]]],
    'StateHistoryEntry' : [ 0x104, ['unsigned long']],
    'CompletionStatus' : [ 0x108, ['long']],
    'Flags' : [ 0x10c, ['unsigned long']],
    'UserFlags' : [ 0x110, ['unsigned long']],
    'Problem' : [ 0x114, ['unsigned long']],
    'ProblemStatus' : [ 0x118, ['long']],
    'ResourceList' : [ 0x11c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'ResourceListTranslated' : [ 0x120, ['pointer', ['_CM_RESOURCE_LIST']]],
    'DuplicatePDO' : [ 0x124, ['pointer', ['_DEVICE_OBJECT']]],
    'ResourceRequirements' : [ 0x128, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'InterfaceType' : [ 0x12c, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x130, ['unsigned long']],
    'ChildInterfaceType' : [ 0x134, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
    'ChildBusNumber' : [ 0x138, ['unsigned long']],
    'ChildBusTypeIndex' : [ 0x13c, ['unsigned short']],
    'RemovalPolicy' : [ 0x13e, ['unsigned char']],
    'HardwareRemovalPolicy' : [ 0x13f, ['unsigned char']],
    'TargetDeviceNotify' : [ 0x140, ['_LIST_ENTRY']],
    'DeviceArbiterList' : [ 0x148, ['_LIST_ENTRY']],
    'DeviceTranslatorList' : [ 0x150, ['_LIST_ENTRY']],
    'NoTranslatorMask' : [ 0x158, ['unsigned short']],
    'QueryTranslatorMask' : [ 0x15a, ['unsigned short']],
    'NoArbiterMask' : [ 0x15c, ['unsigned short']],
    'QueryArbiterMask' : [ 0x15e, ['unsigned short']],
    'OverUsed1' : [ 0x160, ['__unnamed_1807']],
    'OverUsed2' : [ 0x164, ['__unnamed_1809']],
    'BootResources' : [ 0x168, ['pointer', ['_CM_RESOURCE_LIST']]],
    'BootResourcesTranslated' : [ 0x16c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'CapabilityFlags' : [ 0x170, ['unsigned long']],
    'DockInfo' : [ 0x174, ['__unnamed_180d']],
    'DisableableDepends' : [ 0x184, ['unsigned long']],
    'PendedSetInterfaceState' : [ 0x188, ['_LIST_ENTRY']],
    'LegacyBusListEntry' : [ 0x190, ['_LIST_ENTRY']],
    'DriverUnloadRetryCount' : [ 0x198, ['unsigned long']],
    'PreviousParent' : [ 0x19c, ['pointer', ['_DEVICE_NODE']]],
    'DeletedChildren' : [ 0x1a0, ['long']],
    'NumaNodeIndex' : [ 0x1a4, ['unsigned long']],
    'ContainerID' : [ 0x1a8, ['_GUID']],
    'OverrideFlags' : [ 0x1b8, ['unsigned char']],
    'DeviceIdsHash' : [ 0x1bc, ['unsigned long']],
    'RequiresUnloadedDriver' : [ 0x1c0, ['unsigned char']],
    'PendingEjectRelations' : [ 0x1c4, ['pointer', ['_PENDING_RELATIONS_LIST_ENTRY']]],
    'StateFlags' : [ 0x1c8, ['unsigned long']],
} ],
  '_MCGEN_TRACE_CONTEXT' : [ 0x38, {
    'RegistrationHandle' : [ 0x0, ['unsigned long long']],
    'Logger' : [ 0x8, ['unsigned long long']],
    'MatchAnyKeyword' : [ 0x10, ['unsigned long long']],
    'MatchAllKeyword' : [ 0x18, ['unsigned long long']],
    'Flags' : [ 0x20, ['unsigned long']],
    'IsEnabled' : [ 0x24, ['unsigned long']],
    'Level' : [ 0x28, ['unsigned char']],
    'Reserve' : [ 0x29, ['unsigned char']],
    'EnableBitsCount' : [ 0x2a, ['unsigned short']],
    'EnableBitMask' : [ 0x2c, ['pointer', ['unsigned long']]],
    'EnableKeyWords' : [ 0x30, ['pointer', ['unsigned long long']]],
    'EnableLevel' : [ 0x34, ['pointer', ['unsigned char']]],
} ],
  '_PNP_DEVICE_COMPLETION_QUEUE' : [ 0x2c, {
    'DispatchedList' : [ 0x0, ['_LIST_ENTRY']],
    'DispatchedCount' : [ 0x8, ['unsigned long']],
    'CompletedList' : [ 0xc, ['_LIST_ENTRY']],
    'CompletedSemaphore' : [ 0x14, ['_KSEMAPHORE']],
    'SpinLock' : [ 0x28, ['unsigned long']],
} ],
  '_KSEMAPHORE' : [ 0x14, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'Limit' : [ 0x10, ['long']],
} ],
  '_DEVOBJ_EXTENSION' : [ 0x38, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
    'PowerFlags' : [ 0x8, ['unsigned long']],
    'Dope' : [ 0xc, ['pointer', ['_DEVICE_OBJECT_POWER_EXTENSION']]],
    'ExtensionFlags' : [ 0x10, ['unsigned long']],
    'DeviceNode' : [ 0x14, ['pointer', ['void']]],
    'AttachedTo' : [ 0x18, ['pointer', ['_DEVICE_OBJECT']]],
    'StartIoCount' : [ 0x1c, ['long']],
    'StartIoKey' : [ 0x20, ['long']],
    'StartIoFlags' : [ 0x24, ['unsigned long']],
    'Vpb' : [ 0x28, ['pointer', ['_VPB']]],
    'DependencyNode' : [ 0x2c, ['pointer', ['void']]],
    'InterruptContext' : [ 0x30, ['pointer', ['void']]],
    'VerifierContext' : [ 0x34, ['pointer', ['void']]],
} ],
  '_GROUP_AFFINITY' : [ 0xc, {
    'Mask' : [ 0x0, ['unsigned long']],
    'Group' : [ 0x4, ['unsigned short']],
    'Reserved' : [ 0x6, ['array', 3, ['unsigned short']]],
} ],
  '_PNP_ASSIGN_RESOURCES_CONTEXT' : [ 0xc, {
    'IncludeFailedDevices' : [ 0x0, ['unsigned long']],
    'DeviceCount' : [ 0x4, ['unsigned long']],
    'DeviceList' : [ 0x8, ['array', 1, ['pointer', ['_DEVICE_OBJECT']]]],
} ],
  '_PNP_RESOURCE_REQUEST' : [ 0x28, {
    'PhysicalDevice' : [ 0x0, ['pointer', ['_DEVICE_OBJECT']]],
    'Flags' : [ 0x4, ['unsigned long']],
    'AllocationType' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'ArbiterRequestLegacyReported', 1: u'ArbiterRequestHalReported', 2: u'ArbiterRequestLegacyAssigned', 3: u'ArbiterRequestPnpDetected', 4: u'ArbiterRequestPnpEnumerated', -1: u'ArbiterRequestUndefined'})]],
    'Priority' : [ 0xc, ['unsigned long']],
    'Position' : [ 0x10, ['unsigned long']],
    'ResourceRequirements' : [ 0x14, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'ReqList' : [ 0x18, ['pointer', ['void']]],
    'ResourceAssignment' : [ 0x1c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'TranslatedResourceAssignment' : [ 0x20, ['pointer', ['_CM_RESOURCE_LIST']]],
    'Status' : [ 0x24, ['long']],
} ],
  '_IO_RESOURCE_REQUIREMENTS_LIST' : [ 0x48, {
    'ListSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'Internal', 1: u'Isa', 2: u'Eisa', 3: u'MicroChannel', 4: u'TurboChannel', 5: u'PCIBus', 6: u'VMEBus', 7: u'NuBus', 8: u'PCMCIABus', 9: u'CBus', 10: u'MPIBus', 11: u'MPSABus', 12: u'ProcessorInternal', 13: u'InternalPowerBus', 14: u'PNPISABus', 15: u'PNPBus', 16: u'Vmcs', 17: u'ACPIBus', 18: u'MaximumInterfaceType', -1: u'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'SlotNumber' : [ 0xc, ['unsigned long']],
    'Reserved' : [ 0x10, ['array', 3, ['unsigned long']]],
    'AlternativeLists' : [ 0x1c, ['unsigned long']],
    'List' : [ 0x20, ['array', 1, ['_IO_RESOURCE_LIST']]],
} ],
  '_EXCEPTION_RECORD64' : [ 0x98, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['unsigned long long']],
    'ExceptionAddress' : [ 0x10, ['unsigned long long']],
    'NumberParameters' : [ 0x18, ['unsigned long']],
    '__unusedAlignment' : [ 0x1c, ['unsigned long']],
    'ExceptionInformation' : [ 0x20, ['array', 15, ['unsigned long long']]],
} ],
  '_EXCEPTION_RECORD32' : [ 0x50, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['unsigned long']],
    'ExceptionAddress' : [ 0xc, ['unsigned long']],
    'NumberParameters' : [ 0x10, ['unsigned long']],
    'ExceptionInformation' : [ 0x14, ['array', 15, ['unsigned long']]],
} ],
  '_DBGKM_EXCEPTION64' : [ 0xa0, {
    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD64']],
    'FirstChance' : [ 0x98, ['unsigned long']],
} ],
  '_DBGKM_EXCEPTION32' : [ 0x54, {
    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD32']],
    'FirstChance' : [ 0x50, ['unsigned long']],
} ],
  '_X86_KTRAP_FRAME' : [ 0x8c, {
    'DbgEbp' : [ 0x0, ['unsigned long']],
    'DbgEip' : [ 0x4, ['unsigned long']],
    'DbgArgMark' : [ 0x8, ['unsigned long']],
    'DbgArgPointer' : [ 0xc, ['unsigned long']],
    'TempSegCs' : [ 0x10, ['unsigned long']],
    'TempEsp' : [ 0x14, ['unsigned long']],
    'Dr0' : [ 0x18, ['unsigned long']],
    'Dr1' : [ 0x1c, ['unsigned long']],
    'Dr2' : [ 0x20, ['unsigned long']],
    'Dr3' : [ 0x24, ['unsigned long']],
    'Dr6' : [ 0x28, ['unsigned long']],
    'Dr7' : [ 0x2c, ['unsigned long']],
    'SegGs' : [ 0x30, ['unsigned long']],
    'SegEs' : [ 0x34, ['unsigned long']],
    'SegDs' : [ 0x38, ['unsigned long']],
    'Edx' : [ 0x3c, ['unsigned long']],
    'Ecx' : [ 0x40, ['unsigned long']],
    'Eax' : [ 0x44, ['unsigned long']],
    'PreviousPreviousMode' : [ 0x48, ['unsigned char']],
    'EntropyQueueDpc' : [ 0x49, ['unsigned char']],
    'Reserved' : [ 0x4a, ['array', 2, ['unsigned char']]],
    'ExceptionList' : [ 0x4c, ['unsigned long']],
    'SegFs' : [ 0x50, ['unsigned long']],
    'Edi' : [ 0x54, ['unsigned long']],
    'Esi' : [ 0x58, ['unsigned long']],
    'Ebx' : [ 0x5c, ['unsigned long']],
    'Ebp' : [ 0x60, ['unsigned long']],
    'ErrCode' : [ 0x64, ['unsigned long']],
    'Eip' : [ 0x68, ['unsigned long']],
    'SegCs' : [ 0x6c, ['unsigned long']],
    'EFlags' : [ 0x70, ['unsigned long']],
    'HardwareEsp' : [ 0x74, ['unsigned long']],
    'HardwareSegSs' : [ 0x78, ['unsigned long']],
    'V86Es' : [ 0x7c, ['unsigned long']],
    'V86Ds' : [ 0x80, ['unsigned long']],
    'V86Fs' : [ 0x84, ['unsigned long']],
    'V86Gs' : [ 0x88, ['unsigned long']],
} ],
  '_X86_KTRAP_FRAME_BLUE' : [ 0x8c, {
    'DbgEbp' : [ 0x0, ['unsigned long']],
    'DbgEip' : [ 0x4, ['unsigned long']],
    'DbgArgMark' : [ 0x8, ['unsigned long']],
    'TempSegCs' : [ 0xc, ['unsigned short']],
    'Logging' : [ 0xe, ['unsigned char']],
    'FrameType' : [ 0xf, ['unsigned char']],
    'TempEsp' : [ 0x10, ['unsigned long']],
    'Dr0' : [ 0x14, ['unsigned long']],
    'Dr1' : [ 0x18, ['unsigned long']],
    'Dr2' : [ 0x1c, ['unsigned long']],
    'Dr3' : [ 0x20, ['unsigned long']],
    'Dr6' : [ 0x24, ['unsigned long']],
    'Dr7' : [ 0x28, ['unsigned long']],
    'SegGs' : [ 0x2c, ['unsigned long']],
    'SegEs' : [ 0x30, ['unsigned long']],
    'SegDs' : [ 0x34, ['unsigned long']],
    'Edx' : [ 0x38, ['unsigned long']],
    'Ecx' : [ 0x3c, ['unsigned long']],
    'Eax' : [ 0x40, ['unsigned long']],
    'PreviousPreviousMode' : [ 0x44, ['unsigned char']],
    'EntropyQueueDpc' : [ 0x45, ['unsigned char']],
    'Reserved' : [ 0x46, ['array', 2, ['unsigned char']]],
    'MxCsr' : [ 0x48, ['unsigned long']],
    'ExceptionList' : [ 0x4c, ['unsigned long']],
    'SegFs' : [ 0x50, ['unsigned long']],
    'Edi' : [ 0x54, ['unsigned long']],
    'Esi' : [ 0x58, ['unsigned long']],
    'Ebx' : [ 0x5c, ['unsigned long']],
    'Ebp' : [ 0x60, ['unsigned long']],
    'ErrCode' : [ 0x64, ['unsigned long']],
    'Eip' : [ 0x68, ['unsigned long']],
    'SegCs' : [ 0x6c, ['unsigned long']],
    'EFlags' : [ 0x70, ['unsigned long']],
    'HardwareEsp' : [ 0x74, ['unsigned long']],
    'HardwareSegSs' : [ 0x78, ['unsigned long']],
    'V86Es' : [ 0x7c, ['unsigned long']],
    'V86Ds' : [ 0x80, ['unsigned long']],
    'V86Fs' : [ 0x84, ['unsigned long']],
    'V86Gs' : [ 0x88, ['unsigned long']],
} ],
  '_DBGKD_LOAD_SYMBOLS64' : [ 0x28, {
    'PathNameLength' : [ 0x0, ['unsigned long']],
    'BaseOfDll' : [ 0x8, ['unsigned long long']],
    'ProcessId' : [ 0x10, ['unsigned long long']],
    'CheckSum' : [ 0x18, ['unsigned long']],
    'SizeOfImage' : [ 0x1c, ['unsigned long']],
    'UnloadSymbols' : [ 0x20, ['unsigned char']],
} ],
  '_DBGKD_LOAD_SYMBOLS32' : [ 0x18, {
    'PathNameLength' : [ 0x0, ['unsigned long']],
    'BaseOfDll' : [ 0x4, ['unsigned long']],
    'ProcessId' : [ 0x8, ['unsigned long']],
    'CheckSum' : [ 0xc, ['unsigned long']],
    'SizeOfImage' : [ 0x10, ['unsigned long']],
    'UnloadSymbols' : [ 0x14, ['unsigned char']],
} ],
  '_DBGKD_READ_MEMORY64' : [ 0x10, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
    'TransferCount' : [ 0x8, ['unsigned long']],
    'ActualBytesRead' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_READ_MEMORY32' : [ 0xc, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
    'TransferCount' : [ 0x4, ['unsigned long']],
    'ActualBytesRead' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_MEMORY64' : [ 0x10, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
    'TransferCount' : [ 0x8, ['unsigned long']],
    'ActualBytesWritten' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_WRITE_MEMORY32' : [ 0xc, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
    'TransferCount' : [ 0x4, ['unsigned long']],
    'ActualBytesWritten' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_BREAKPOINT64' : [ 0x10, {
    'BreakPointAddress' : [ 0x0, ['unsigned long long']],
    'BreakPointHandle' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_BREAKPOINT32' : [ 0x8, {
    'BreakPointAddress' : [ 0x0, ['unsigned long']],
    'BreakPointHandle' : [ 0x4, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO64' : [ 0x10, {
    'IoAddress' : [ 0x0, ['unsigned long long']],
    'DataSize' : [ 0x8, ['unsigned long']],
    'DataValue' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO32' : [ 0xc, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'IoAddress' : [ 0x4, ['unsigned long']],
    'DataValue' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO_EXTENDED64' : [ 0x20, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['unsigned long']],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'AddressSpace' : [ 0xc, ['unsigned long']],
    'IoAddress' : [ 0x10, ['unsigned long long']],
    'DataValue' : [ 0x18, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO_EXTENDED32' : [ 0x18, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['unsigned long']],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'AddressSpace' : [ 0xc, ['unsigned long']],
    'IoAddress' : [ 0x10, ['unsigned long']],
    'DataValue' : [ 0x14, ['unsigned long']],
} ],
  '_DBGKD_SET_SPECIAL_CALL32' : [ 0x4, {
    'SpecialCall' : [ 0x0, ['unsigned long']],
} ],
  '_DBGKD_SET_SPECIAL_CALL64' : [ 0x8, {
    'SpecialCall' : [ 0x0, ['unsigned long long']],
} ],
  '_DBGKD_SET_INTERNAL_BREAKPOINT32' : [ 0x8, {
    'BreakpointAddress' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
} ],
  '_DBGKD_SET_INTERNAL_BREAKPOINT64' : [ 0x10, {
    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_GET_INTERNAL_BREAKPOINT64' : [ 0x20, {
    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x8, ['unsigned long']],
    'Calls' : [ 0xc, ['unsigned long']],
    'MaxCallsPerPeriod' : [ 0x10, ['unsigned long']],
    'MinInstructions' : [ 0x14, ['unsigned long']],
    'MaxInstructions' : [ 0x18, ['unsigned long']],
    'TotalInstructions' : [ 0x1c, ['unsigned long']],
} ],
  '_DBGKD_GET_INTERNAL_BREAKPOINT32' : [ 0x1c, {
    'BreakpointAddress' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'Calls' : [ 0x8, ['unsigned long']],
    'MaxCallsPerPeriod' : [ 0xc, ['unsigned long']],
    'MinInstructions' : [ 0x10, ['unsigned long']],
    'MaxInstructions' : [ 0x14, ['unsigned long']],
    'TotalInstructions' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1907' : [ 0x28, {
    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT64']],
    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
    'ReadWriteIo' : [ 0x0, ['_DBGKD_READ_WRITE_IO64']],
    'ReadWriteIoExtended' : [ 0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED64']],
    'QuerySpecialCalls' : [ 0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
    'SetSpecialCall' : [ 0x0, ['_DBGKD_SET_SPECIAL_CALL64']],
    'SetInternalBreakpoint' : [ 0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT64']],
    'GetInternalBreakpoint' : [ 0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT64']],
    'GetVersion64' : [ 0x0, ['_DBGKD_GET_VERSION64']],
    'BreakPointEx' : [ 0x0, ['_DBGKD_BREAKPOINTEX']],
    'ReadWriteMsr' : [ 0x0, ['_DBGKD_READ_WRITE_MSR']],
    'SearchMemory' : [ 0x0, ['_DBGKD_SEARCH_MEMORY']],
    'GetSetBusData' : [ 0x0, ['_DBGKD_GET_SET_BUS_DATA']],
    'FillMemory' : [ 0x0, ['_DBGKD_FILL_MEMORY']],
    'QueryMemory' : [ 0x0, ['_DBGKD_QUERY_MEMORY']],
    'SwitchPartition' : [ 0x0, ['_DBGKD_SWITCH_PARTITION']],
    'GetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
    'SetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
    'WriteCustomBreakPoint' : [ 0x0, ['_DBGKD_WRITE_CUSTOM_BREAKPOINT']],
} ],
  '_DBGKD_MANIPULATE_STATE64' : [ 0x38, {
    'ApiNumber' : [ 0x0, ['unsigned long']],
    'ProcessorLevel' : [ 0x4, ['unsigned short']],
    'Processor' : [ 0x6, ['unsigned short']],
    'ReturnStatus' : [ 0x8, ['long']],
    'u' : [ 0x10, ['__unnamed_1907']],
} ],
  '__unnamed_190e' : [ 0x28, {
    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY32']],
    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY32']],
    'ReadMemory64' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
    'WriteMemory64' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT32']],
    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
    'ReadWriteIo' : [ 0x0, ['_DBGKD_READ_WRITE_IO32']],
    'ReadWriteIoExtended' : [ 0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED32']],
    'QuerySpecialCalls' : [ 0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
    'SetSpecialCall' : [ 0x0, ['_DBGKD_SET_SPECIAL_CALL32']],
    'SetInternalBreakpoint' : [ 0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT32']],
    'GetInternalBreakpoint' : [ 0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT32']],
    'GetVersion32' : [ 0x0, ['_DBGKD_GET_VERSION32']],
    'BreakPointEx' : [ 0x0, ['_DBGKD_BREAKPOINTEX']],
    'ReadWriteMsr' : [ 0x0, ['_DBGKD_READ_WRITE_MSR']],
    'SearchMemory' : [ 0x0, ['_DBGKD_SEARCH_MEMORY']],
    'GetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
    'SetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
} ],
  '_DBGKD_MANIPULATE_STATE32' : [ 0x34, {
    'ApiNumber' : [ 0x0, ['unsigned long']],
    'ProcessorLevel' : [ 0x4, ['unsigned short']],
    'Processor' : [ 0x6, ['unsigned short']],
    'ReturnStatus' : [ 0x8, ['long']],
    'u' : [ 0xc, ['__unnamed_190e']],
} ],
  '_DBGKD_READ_WRITE_MSR' : [ 0xc, {
    'Msr' : [ 0x0, ['unsigned long']],
    'DataValueLow' : [ 0x4, ['unsigned long']],
    'DataValueHigh' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_BREAKPOINTEX' : [ 0x8, {
    'BreakPointCount' : [ 0x0, ['unsigned long']],
    'ContinueStatus' : [ 0x4, ['long']],
} ],
  '_DBGKD_SEARCH_MEMORY' : [ 0x18, {
    'SearchAddress' : [ 0x0, ['unsigned long long']],
    'FoundAddress' : [ 0x0, ['unsigned long long']],
    'SearchLength' : [ 0x8, ['unsigned long long']],
    'PatternLength' : [ 0x10, ['unsigned long']],
} ],
  '_DBGKD_RESTORE_BREAKPOINT' : [ 0x4, {
    'BreakPointHandle' : [ 0x0, ['unsigned long']],
} ],
  '_DBGKD_CONTINUE' : [ 0x4, {
    'ContinueStatus' : [ 0x0, ['long']],
} ],
  '_DBGKD_CONTINUE2' : [ 0x20, {
    'ContinueStatus' : [ 0x0, ['long']],
    'ControlSet' : [ 0x4, ['_X86_DBGKD_CONTROL_SET']],
    'AnyControlSet' : [ 0x4, ['_DBGKD_ANY_CONTROL_SET']],
} ],
  '_PEP_ACPI_RESOURCE' : [ 0x48, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'IoMemory' : [ 0x0, ['_PEP_ACPI_IO_MEMORY_RESOURCE']],
    'Interrupt' : [ 0x0, ['_PEP_ACPI_INTERRUPT_RESOURCE']],
    'Gpio' : [ 0x0, ['_PEP_ACPI_GPIO_RESOURCE']],
    'SpbI2c' : [ 0x0, ['_PEP_ACPI_SPB_I2C_RESOURCE']],
    'SpbSpi' : [ 0x0, ['_PEP_ACPI_SPB_SPI_RESOURCE']],
    'SpbUart' : [ 0x0, ['_PEP_ACPI_SPB_UART_RESOURCE']],
    'ExtendedAddress' : [ 0x0, ['_PEP_ACPI_EXTENDED_ADDRESS']],
} ],
  '_PEP_ACPI_IO_MEMORY_RESOURCE' : [ 0x20, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'Information' : [ 0x4, ['unsigned char']],
    'MinimumAddress' : [ 0x8, ['_LARGE_INTEGER']],
    'MaximumAddress' : [ 0x10, ['_LARGE_INTEGER']],
    'Alignment' : [ 0x18, ['unsigned long']],
    'Length' : [ 0x1c, ['unsigned long']],
} ],
  '_PEP_ACPI_INTERRUPT_RESOURCE' : [ 0x18, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'InterruptType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'LevelSensitive', 1: u'Latched'})]],
    'InterruptPolarity' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptPolarityUnknown', 1: u'InterruptRisingEdge', 2: u'InterruptFallingEdge', 3: u'InterruptActiveBothTriggerLow', 4: u'InterruptActiveBothTriggerHigh'})]],
    'Flags' : [ 0xc, ['_PEP_ACPI_RESOURCE_FLAGS']],
    'Count' : [ 0x10, ['unsigned char']],
    'Pins' : [ 0x14, ['pointer', ['unsigned long']]],
} ],
  '_PEP_ACPI_GPIO_RESOURCE' : [ 0x30, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'Flags' : [ 0x4, ['_PEP_ACPI_RESOURCE_FLAGS']],
    'InterruptType' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: u'LevelSensitive', 1: u'Latched'})]],
    'InterruptPolarity' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: u'InterruptPolarityUnknown', 1: u'InterruptRisingEdge', 2: u'InterruptFallingEdge', 3: u'InterruptActiveBothTriggerLow', 4: u'InterruptActiveBothTriggerHigh'})]],
    'PinConfig' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: u'PullDefault', 1: u'PullUp', 2: u'PullDown', 3: u'PullNone'})]],
    'IoRestrictionType' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: u'IoRestrictionNone', 1: u'IoRestrictionInputOnly', 2: u'IoRestrictionOutputOnly', 3: u'IoRestrictionNoneAndPreserve'})]],
    'DriveStrength' : [ 0x18, ['unsigned short']],
    'DebounceTimeout' : [ 0x1a, ['unsigned short']],
    'PinTable' : [ 0x1c, ['pointer', ['unsigned short']]],
    'PinCount' : [ 0x20, ['unsigned short']],
    'ResourceSourceIndex' : [ 0x22, ['unsigned char']],
    'ResourceSourceName' : [ 0x24, ['pointer', ['_UNICODE_STRING']]],
    'VendorData' : [ 0x28, ['pointer', ['unsigned char']]],
    'VendorDataLength' : [ 0x2c, ['unsigned short']],
} ],
  '_PEP_ACPI_SPB_I2C_RESOURCE' : [ 0x20, {
    'SpbCommon' : [ 0x0, ['_PEP_ACPI_SPB_RESOURCE']],
    'ConnectionSpeed' : [ 0x18, ['unsigned long']],
    'SlaveAddress' : [ 0x1c, ['unsigned short']],
} ],
  '_PEP_ACPI_SPB_UART_RESOURCE' : [ 0x24, {
    'SpbCommon' : [ 0x0, ['_PEP_ACPI_SPB_RESOURCE']],
    'BaudRate' : [ 0x18, ['unsigned long']],
    'RxBufferSize' : [ 0x1c, ['unsigned short']],
    'TxBufferSize' : [ 0x1e, ['unsigned short']],
    'Parity' : [ 0x20, ['unsigned char']],
    'LinesInUse' : [ 0x21, ['unsigned char']],
} ],
  '_PEP_ACPI_SPB_SPI_RESOURCE' : [ 0x24, {
    'SpbCommon' : [ 0x0, ['_PEP_ACPI_SPB_RESOURCE']],
    'ConnectionSpeed' : [ 0x18, ['unsigned long']],
    'DataBitLength' : [ 0x1c, ['unsigned char']],
    'Phase' : [ 0x1d, ['unsigned char']],
    'Polarity' : [ 0x1e, ['unsigned char']],
    'DeviceSelection' : [ 0x20, ['unsigned short']],
} ],
  '_PEP_ACPI_EXTENDED_ADDRESS' : [ 0x48, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'Flags' : [ 0x4, ['_PEP_ACPI_RESOURCE_FLAGS']],
    'ResourceFlags' : [ 0x8, ['unsigned char']],
    'GeneralFlags' : [ 0x9, ['unsigned char']],
    'TypeSpecificFlags' : [ 0xa, ['unsigned char']],
    'RevisionId' : [ 0xb, ['unsigned char']],
    'Reserved' : [ 0xc, ['unsigned char']],
    'Granularity' : [ 0x10, ['unsigned long long']],
    'MinimumAddress' : [ 0x18, ['unsigned long long']],
    'MaximumAddress' : [ 0x20, ['unsigned long long']],
    'TranslationAddress' : [ 0x28, ['unsigned long long']],
    'AddressLength' : [ 0x30, ['unsigned long long']],
    'TypeAttribute' : [ 0x38, ['unsigned long long']],
    'DescriptorName' : [ 0x40, ['pointer', ['_UNICODE_STRING']]],
} ],
  '_PPM_PLATFORM_STATES' : [ 0x100, {
    'StateCount' : [ 0x0, ['unsigned long']],
    'InterfaceVersion' : [ 0x4, ['unsigned long']],
    'ProcessorCount' : [ 0x8, ['unsigned long']],
    'CoordinatedInterface' : [ 0xc, ['unsigned char']],
    'IdleTest' : [ 0x10, ['pointer', ['void']]],
    'IdlePreExecute' : [ 0x14, ['pointer', ['void']]],
    'IdleComplete' : [ 0x18, ['pointer', ['void']]],
    'QueryPlatformStateResidency' : [ 0x1c, ['pointer', ['void']]],
    'Accounting' : [ 0x20, ['pointer', ['_PLATFORM_IDLE_ACCOUNTING']]],
    'State' : [ 0x40, ['array', 1, ['_PPM_PLATFORM_STATE']]],
} ],
  '_POP_CPU_INFO' : [ 0x10, {
    'Eax' : [ 0x0, ['unsigned long']],
    'Ebx' : [ 0x4, ['unsigned long']],
    'Ecx' : [ 0x8, ['unsigned long']],
    'Edx' : [ 0xc, ['unsigned long']],
} ],
  '_POP_PPM_PROFILE' : [ 0x1a8, {
    'Name' : [ 0x0, ['pointer', ['unsigned short']]],
    'Id' : [ 0x4, ['unsigned char']],
    'Guid' : [ 0x8, ['_GUID']],
    'Flags' : [ 0x18, ['unsigned long']],
    'Priority' : [ 0x1c, ['unsigned char']],
    'Settings' : [ 0x20, ['array', 2, ['_PPM_ENGINE_SETTINGS']]],
    'StartTime' : [ 0x180, ['unsigned long long']],
    'Count' : [ 0x188, ['unsigned long long']],
    'MaxDuration' : [ 0x190, ['unsigned long long']],
    'MinDuration' : [ 0x198, ['unsigned long long']],
    'TotalDuration' : [ 0x1a0, ['unsigned long long']],
} ],
  '_PPM_ENGINE_SETTINGS' : [ 0xb0, {
    'ExplicitSetting' : [ 0x0, ['array', 2, ['_PPM_POLICY_SETTINGS_MASK']]],
    'ThrottlingPolicy' : [ 0x10, ['unsigned char']],
    'PerfTimeCheck' : [ 0x14, ['unsigned long']],
    'PerfHistoryCount' : [ 0x18, ['array', 2, ['unsigned char']]],
    'PerfMinPolicy' : [ 0x1a, ['array', 2, ['unsigned char']]],
    'PerfMaxPolicy' : [ 0x1c, ['array', 2, ['unsigned char']]],
    'PerfDecreaseTime' : [ 0x1e, ['array', 2, ['unsigned char']]],
    'PerfIncreaseTime' : [ 0x20, ['array', 2, ['unsigned char']]],
    'PerfDecreasePolicy' : [ 0x22, ['array', 2, ['unsigned char']]],
    'PerfIncreasePolicy' : [ 0x24, ['array', 2, ['unsigned char']]],
    'PerfDecreaseThreshold' : [ 0x26, ['array', 2, ['unsigned char']]],
    'PerfIncreaseThreshold' : [ 0x28, ['array', 2, ['unsigned char']]],
    'PerfBoostPolicy' : [ 0x2c, ['unsigned long']],
    'PerfBoostMode' : [ 0x30, ['unsigned long']],
    'PerfReductionTolerance' : [ 0x34, ['unsigned long']],
    'EnergyPerfPreference' : [ 0x38, ['unsigned long']],
    'AutonomousActivityWindow' : [ 0x3c, ['unsigned long']],
    'AutonomousPreference' : [ 0x40, ['unsigned char']],
    'LatencyHintPerf' : [ 0x41, ['array', 2, ['unsigned char']]],
    'LatencyHintUnpark' : [ 0x43, ['array', 2, ['unsigned char']]],
    'DutyCycling' : [ 0x45, ['unsigned char']],
    'ParkingPerfState' : [ 0x46, ['array', 2, ['unsigned char']]],
    'DistributeUtility' : [ 0x48, ['unsigned char']],
    'CoreParkingOverUtilizationThreshold' : [ 0x49, ['unsigned char']],
    'CoreParkingConcurrencyThreshold' : [ 0x4a, ['unsigned char']],
    'CoreParkingHeadroomThreshold' : [ 0x4b, ['unsigned char']],
    'CoreParkingDistributionThreshold' : [ 0x4c, ['unsigned char']],
    'CoreParkingDecreasePolicy' : [ 0x4d, ['unsigned char']],
    'CoreParkingIncreasePolicy' : [ 0x4e, ['unsigned char']],
    'CoreParkingDecreaseTime' : [ 0x50, ['unsigned long']],
    'CoreParkingIncreaseTime' : [ 0x54, ['unsigned long']],
    'CoreParkingMinCores' : [ 0x58, ['array', 2, ['unsigned char']]],
    'CoreParkingMaxCores' : [ 0x5a, ['array', 2, ['unsigned char']]],
    'AllowScaling' : [ 0x5c, ['unsigned char']],
    'IdleDisabled' : [ 0x5d, ['unsigned char']],
    'IdleTimeCheck' : [ 0x60, ['unsigned long']],
    'IdleDemotePercent' : [ 0x64, ['unsigned char']],
    'IdlePromotePercent' : [ 0x65, ['unsigned char']],
    'HeteroDecreaseTime' : [ 0x66, ['unsigned char']],
    'HeteroIncreaseTime' : [ 0x67, ['unsigned char']],
    'HeteroDecreaseThreshold' : [ 0x68, ['array', 32, ['unsigned char']]],
    'HeteroIncreaseThreshold' : [ 0x88, ['array', 32, ['unsigned char']]],
    'Class0FloorPerformance' : [ 0xa8, ['unsigned char']],
    'Class1InitialPerformance' : [ 0xa9, ['unsigned char']],
} ],
  '_POP_FX_COMPONENT_FLAGS' : [ 0x8, {
    'Value' : [ 0x0, ['long']],
    'Value2' : [ 0x4, ['long']],
    'RefCount' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 30, native_type='unsigned long')]],
    'Idling' : [ 0x0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'Active' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'CriticalIdleOverride' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ResidentOverride' : [ 0x4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Reserved' : [ 0x4, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
} ],
  '_POP_FX_PERF_FLAGS' : [ 0x4, {
    'Value' : [ 0x0, ['long']],
    'Progress' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 27, native_type='unsigned long')]],
    'Synchronicity' : [ 0x0, ['BitField', dict(start_bit = 27, end_bit = 29, native_type='unsigned long')]],
    'RequestPepCompleted' : [ 0x0, ['BitField', dict(start_bit = 29, end_bit = 30, native_type='unsigned long')]],
    'RequestSucceeded' : [ 0x0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'NestedCallback' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
} ],
  '_POP_FX_DEVICE_STATUS' : [ 0x4, {
    'Value' : [ 0x0, ['long']],
    'SystemTransition' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PepD0Notify' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'IdleTimerOn' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'IgnoreIdleTimeout' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'IrpInUse' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'IrpPending' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DPNRDeviceNotified' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DPNRReceivedFromPep' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'IrpFirstPendingIndex' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'IrpLastPendingIndex' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 32, native_type='unsigned long')]],
} ],
  '_POP_RW_LOCK' : [ 0x8, {
    'Lock' : [ 0x0, ['_EX_PUSH_LOCK']],
    'Thread' : [ 0x4, ['pointer', ['_KTHREAD']]],
} ],
  '_VOLUME_CACHE_MAP' : [ 0x90, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteCode' : [ 0x2, ['short']],
    'UseCount' : [ 0x4, ['unsigned long']],
    'DeviceObject' : [ 0x8, ['pointer', ['_DEVICE_OBJECT']]],
    'VolumeCacheMapLinks' : [ 0xc, ['_LIST_ENTRY']],
    'DirtyPages' : [ 0x14, ['unsigned long']],
    'LogHandleContext' : [ 0x18, ['_LOG_HANDLE_CONTEXT']],
    'Flags' : [ 0x80, ['unsigned long']],
    'PagesQueuedToDisk' : [ 0x84, ['unsigned long']],
    'LoggedPagesQueuedToDisk' : [ 0x88, ['unsigned long']],
} ],
  '_SHARED_CACHE_MAP' : [ 0x178, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'OpenCount' : [ 0x4, ['unsigned long']],
    'FileSize' : [ 0x8, ['_LARGE_INTEGER']],
    'BcbList' : [ 0x10, ['_LIST_ENTRY']],
    'SectionSize' : [ 0x18, ['_LARGE_INTEGER']],
    'ValidDataLength' : [ 0x20, ['_LARGE_INTEGER']],
    'ValidDataGoal' : [ 0x28, ['_LARGE_INTEGER']],
    'InitialVacbs' : [ 0x30, ['array', 4, ['pointer', ['_VACB']]]],
    'Vacbs' : [ 0x40, ['pointer', ['pointer', ['_VACB']]]],
    'FileObjectFastRef' : [ 0x44, ['_EX_FAST_REF']],
    'VacbLock' : [ 0x48, ['_EX_PUSH_LOCK']],
    'DirtyPages' : [ 0x4c, ['unsigned long']],
    'LoggedStreamLinks' : [ 0x50, ['_LIST_ENTRY']],
    'SharedCacheMapLinks' : [ 0x58, ['_LIST_ENTRY']],
    'Flags' : [ 0x60, ['unsigned long']],
    'Status' : [ 0x64, ['long']],
    'Mbcb' : [ 0x68, ['pointer', ['_MBCB']]],
    'Section' : [ 0x6c, ['pointer', ['void']]],
    'CreateEvent' : [ 0x70, ['pointer', ['_KEVENT']]],
    'WaitOnActiveCount' : [ 0x74, ['pointer', ['_KEVENT']]],
    'PagesToWrite' : [ 0x78, ['unsigned long']],
    'BeyondLastFlush' : [ 0x80, ['long long']],
    'Callbacks' : [ 0x88, ['pointer', ['_CACHE_MANAGER_CALLBACKS']]],
    'LazyWriteContext' : [ 0x8c, ['pointer', ['void']]],
    'PrivateList' : [ 0x90, ['_LIST_ENTRY']],
    'V1' : [ 0x98, ['_LOGGED_STREAM_CALLBACK_V1']],
    'V2' : [ 0x98, ['_LOGGED_STREAM_CALLBACK_V2']],
    'LargestLSN' : [ 0xa0, ['_LARGE_INTEGER']],
    'DirtyPageThreshold' : [ 0xa8, ['unsigned long']],
    'LazyWritePassCount' : [ 0xac, ['unsigned long']],
    'UninitializeEvent' : [ 0xb0, ['pointer', ['_CACHE_UNINITIALIZE_EVENT']]],
    'BcbLock' : [ 0xb4, ['_FAST_MUTEX']],
    'LastUnmapBehindOffset' : [ 0xd8, ['_LARGE_INTEGER']],
    'Event' : [ 0xe0, ['_KEVENT']],
    'HighWaterMappingOffset' : [ 0xf0, ['_LARGE_INTEGER']],
    'PrivateCacheMap' : [ 0xf8, ['_PRIVATE_CACHE_MAP']],
    'WriteBehindWorkQueueEntry' : [ 0x160, ['pointer', ['void']]],
    'VolumeCacheMap' : [ 0x164, ['pointer', ['_VOLUME_CACHE_MAP']]],
    'ProcImagePathHash' : [ 0x168, ['unsigned long']],
    'WritesInProgress' : [ 0x16c, ['unsigned long']],
    'AsyncReadRequestCount' : [ 0x170, ['unsigned long']],
} ],
  '__unnamed_19f4' : [ 0x8, {
    'FileOffset' : [ 0x0, ['_LARGE_INTEGER']],
    'ActiveCount' : [ 0x0, ['unsigned short']],
    'Links' : [ 0x0, ['_LIST_ENTRY']],
} ],
  '_VACB' : [ 0x18, {
    'BaseAddress' : [ 0x0, ['pointer', ['void']]],
    'SharedCacheMap' : [ 0x4, ['pointer', ['_SHARED_CACHE_MAP']]],
    'Overlay' : [ 0x8, ['__unnamed_19f4']],
    'ArrayHead' : [ 0x10, ['pointer', ['_VACB_ARRAY_HEADER']]],
} ],
  '__unnamed_1a19' : [ 0x4, {
    'FileObject' : [ 0x0, ['pointer', ['_FILE_OBJECT']]],
} ],
  '__unnamed_1a1b' : [ 0x4, {
    'SharedCacheMap' : [ 0x0, ['pointer', ['_SHARED_CACHE_MAP']]],
} ],
  '__unnamed_1a1d' : [ 0x4, {
    'Event' : [ 0x0, ['pointer', ['_KEVENT']]],
} ],
  '__unnamed_1a1f' : [ 0x4, {
    'Reason' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_1a21' : [ 0x1c, {
    'SharedCacheMap' : [ 0x0, ['pointer', ['_SHARED_CACHE_MAP']]],
    'IoStatus' : [ 0x4, ['pointer', ['_IO_STATUS_BLOCK']]],
    'CallerWaitEvent' : [ 0x8, ['_KEVENT']],
    'IsLowPriWriteBehind' : [ 0x18, ['unsigned char']],
} ],
  '__unnamed_1a25' : [ 0x38, {
    'SharedCacheMap' : [ 0x0, ['pointer', ['_SHARED_CACHE_MAP']]],
    'FileOffset' : [ 0x8, ['_LARGE_INTEGER']],
    'FileObject' : [ 0x10, ['pointer', ['_FILE_OBJECT']]],
    'Length' : [ 0x14, ['unsigned long']],
    'PrefetchList' : [ 0x18, ['pointer', ['_SINGLE_LIST_ENTRY']]],
    'PrefetchPagePriority' : [ 0x1c, ['unsigned long']],
    'Mdl' : [ 0x20, ['pointer', ['_MDL']]],
    'IoStatusBlock' : [ 0x24, ['pointer', ['_IO_STATUS_BLOCK']]],
    'CallbackContext' : [ 0x28, ['pointer', ['_CC_ASYNC_READ_CONTEXT']]],
    'OriginatingProcess' : [ 0x2c, ['pointer', ['_EPROCESS']]],
    'RequestorMode' : [ 0x30, ['unsigned char']],
    'NestingLevel' : [ 0x34, ['unsigned long']],
} ],
  '__unnamed_1a27' : [ 0x38, {
    'Read' : [ 0x0, ['__unnamed_1a19']],
    'Write' : [ 0x0, ['__unnamed_1a1b']],
    'Event' : [ 0x0, ['__unnamed_1a1d']],
    'Notification' : [ 0x0, ['__unnamed_1a1f']],
    'LowPriWrite' : [ 0x0, ['__unnamed_1a21']],
    'AsyncRead' : [ 0x0, ['__unnamed_1a25']],
} ],
  '_WORK_QUEUE_ENTRY' : [ 0x48, {
    'WorkQueueLinks' : [ 0x0, ['_LIST_ENTRY']],
    'Parameters' : [ 0x8, ['__unnamed_1a27']],
    'Function' : [ 0x40, ['unsigned char']],
} ],
  '_CC_EXTERNAL_CACHE_INFO' : [ 0x18, {
    'Callback' : [ 0x0, ['pointer', ['void']]],
    'DirtyPageStatistics' : [ 0x4, ['_DIRTY_PAGE_STATISTICS']],
    'Links' : [ 0x10, ['_LIST_ENTRY']],
} ],
  '_LOG_HANDLE_CONTEXT' : [ 0x68, {
    'LogHandle' : [ 0x0, ['pointer', ['void']]],
    'FlushToLsnRoutine' : [ 0x4, ['pointer', ['void']]],
    'QueryLogHandleInfoRoutine' : [ 0x8, ['pointer', ['void']]],
    'DirtyPageStatistics' : [ 0xc, ['_DIRTY_PAGE_STATISTICS']],
    'DirtyPageThresholds' : [ 0x18, ['_DIRTY_PAGE_THRESHOLDS']],
    'AdditionalPagesToWrite' : [ 0x40, ['unsigned long']],
    'CcLWScanDPThreshold' : [ 0x44, ['unsigned long']],
    'LargestLsnForCurrentLWScan' : [ 0x48, ['_LARGE_INTEGER']],
    'RelatedFileObject' : [ 0x50, ['pointer', ['_FILE_OBJECT']]],
    'LargestLsnFileObjectKey' : [ 0x54, ['unsigned long']],
    'LastLWTimeStamp' : [ 0x58, ['_LARGE_INTEGER']],
    'Flags' : [ 0x60, ['unsigned long']],
} ],
  '_MBCB' : [ 0x88, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeIsInZone' : [ 0x2, ['short']],
    'PagesToWrite' : [ 0x4, ['unsigned long']],
    'DirtyPages' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'BitmapRanges' : [ 0x10, ['_LIST_ENTRY']],
    'ResumeWritePage' : [ 0x18, ['long long']],
    'MostRecentlyDirtiedPage' : [ 0x20, ['long long']],
    'BitmapRange1' : [ 0x28, ['_BITMAP_RANGE']],
    'BitmapRange2' : [ 0x48, ['_BITMAP_RANGE']],
    'BitmapRange3' : [ 0x68, ['_BITMAP_RANGE']],
} ],
  '_BITMAP_RANGE' : [ 0x20, {
    'Links' : [ 0x0, ['_LIST_ENTRY']],
    'BasePage' : [ 0x8, ['long long']],
    'FirstDirtyPage' : [ 0x10, ['unsigned long']],
    'LastDirtyPage' : [ 0x14, ['unsigned long']],
    'DirtyPages' : [ 0x18, ['unsigned long']],
    'Bitmap' : [ 0x1c, ['pointer', ['unsigned long']]],
} ],
  'VACB_LEVEL_ALLOCATION_LIST' : [ 0x10, {
    'VacbLevelList' : [ 0x0, ['_LIST_ENTRY']],
    'VacbLevelWithBcbListHeads' : [ 0x8, ['pointer', ['void']]],
    'VacbLevelsAllocated' : [ 0xc, ['unsigned long']],
} ],
  '_VACB_LEVEL_REFERENCE' : [ 0x8, {
    'Reference' : [ 0x0, ['long']],
    'SpecialReference' : [ 0x4, ['long']],
} ],
  '_CACHE_UNINITIALIZE_EVENT' : [ 0x14, {
    'Next' : [ 0x0, ['pointer', ['_CACHE_UNINITIALIZE_EVENT']]],
    'Event' : [ 0x4, ['_KEVENT']],
} ],
  '_HEAP_LIST_LOOKUP' : [ 0x24, {
    'ExtendedLookup' : [ 0x0, ['pointer', ['_HEAP_LIST_LOOKUP']]],
    'ArraySize' : [ 0x4, ['unsigned long']],
    'ExtraItem' : [ 0x8, ['unsigned long']],
    'ItemCount' : [ 0xc, ['unsigned long']],
    'OutOfRangeItems' : [ 0x10, ['unsigned long']],
    'BaseIndex' : [ 0x14, ['unsigned long']],
    'ListHead' : [ 0x18, ['pointer', ['_LIST_ENTRY']]],
    'ListsInUseUlong' : [ 0x1c, ['pointer', ['unsigned long']]],
    'ListHints' : [ 0x20, ['pointer', ['pointer', ['_LIST_ENTRY']]]],
} ],
  '_HEAP' : [ 0x248, {
    'Segment' : [ 0x0, ['_HEAP_SEGMENT']],
    'Entry' : [ 0x0, ['_HEAP_ENTRY']],
    'SegmentSignature' : [ 0x8, ['unsigned long']],
    'SegmentFlags' : [ 0xc, ['unsigned long']],
    'SegmentListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'Heap' : [ 0x18, ['pointer', ['_HEAP']]],
    'BaseAddress' : [ 0x1c, ['pointer', ['void']]],
    'NumberOfPages' : [ 0x20, ['unsigned long']],
    'FirstEntry' : [ 0x24, ['pointer', ['_HEAP_ENTRY']]],
    'LastValidEntry' : [ 0x28, ['pointer', ['_HEAP_ENTRY']]],
    'NumberOfUnCommittedPages' : [ 0x2c, ['unsigned long']],
    'NumberOfUnCommittedRanges' : [ 0x30, ['unsigned long']],
    'SegmentAllocatorBackTraceIndex' : [ 0x34, ['unsigned short']],
    'Reserved' : [ 0x36, ['unsigned short']],
    'UCRSegmentList' : [ 0x38, ['_LIST_ENTRY']],
    'Flags' : [ 0x40, ['unsigned long']],
    'ForceFlags' : [ 0x44, ['unsigned long']],
    'CompatibilityFlags' : [ 0x48, ['unsigned long']],
    'EncodeFlagMask' : [ 0x4c, ['unsigned long']],
    'Encoding' : [ 0x50, ['_HEAP_ENTRY']],
    'Interceptor' : [ 0x58, ['unsigned long']],
    'VirtualMemoryThreshold' : [ 0x5c, ['unsigned long']],
    'Signature' : [ 0x60, ['unsigned long']],
    'SegmentReserve' : [ 0x64, ['unsigned long']],
    'SegmentCommit' : [ 0x68, ['unsigned long']],
    'DeCommitFreeBlockThreshold' : [ 0x6c, ['unsigned long']],
    'DeCommitTotalFreeThreshold' : [ 0x70, ['unsigned long']],
    'TotalFreeSize' : [ 0x74, ['unsigned long']],
    'MaximumAllocationSize' : [ 0x78, ['unsigned long']],
    'ProcessHeapsListIndex' : [ 0x7c, ['unsigned short']],
    'HeaderValidateLength' : [ 0x7e, ['unsigned short']],
    'HeaderValidateCopy' : [ 0x80, ['pointer', ['void']]],
    'NextAvailableTagIndex' : [ 0x84, ['unsigned short']],
    'MaximumTagIndex' : [ 0x86, ['unsigned short']],
    'TagEntries' : [ 0x88, ['pointer', ['_HEAP_TAG_ENTRY']]],
    'UCRList' : [ 0x8c, ['_LIST_ENTRY']],
    'AlignRound' : [ 0x94, ['unsigned long']],
    'AlignMask' : [ 0x98, ['unsigned long']],
    'VirtualAllocdBlocks' : [ 0x9c, ['_LIST_ENTRY']],
    'SegmentList' : [ 0xa4, ['_LIST_ENTRY']],
    'AllocatorBackTraceIndex' : [ 0xac, ['unsigned short']],
    'NonDedicatedListLength' : [ 0xb0, ['unsigned long']],
    'BlocksIndex' : [ 0xb4, ['pointer', ['void']]],
    'UCRIndex' : [ 0xb8, ['pointer', ['void']]],
    'PseudoTagEntries' : [ 0xbc, ['pointer', ['_HEAP_PSEUDO_TAG_ENTRY']]],
    'FreeLists' : [ 0xc0, ['_LIST_ENTRY']],
    'LockVariable' : [ 0xc8, ['pointer', ['_HEAP_LOCK']]],
    'CommitRoutine' : [ 0xcc, ['pointer', ['void']]],
    'FrontEndHeap' : [ 0xd0, ['pointer', ['void']]],
    'FrontHeapLockCount' : [ 0xd4, ['unsigned short']],
    'FrontEndHeapType' : [ 0xd6, ['unsigned char']],
    'RequestedFrontEndHeapType' : [ 0xd7, ['unsigned char']],
    'FrontEndHeapUsageData' : [ 0xd8, ['pointer', ['unsigned short']]],
    'FrontEndHeapMaximumIndex' : [ 0xdc, ['unsigned short']],
    'FrontEndHeapStatusBitmap' : [ 0xde, ['array', 257, ['unsigned char']]],
    'Counters' : [ 0x1e0, ['_HEAP_COUNTERS']],
    'TuningParameters' : [ 0x23c, ['_HEAP_TUNING_PARAMETERS']],
} ],
  '__unnamed_1a92' : [ 0x38, {
    'CriticalSection' : [ 0x0, ['_RTL_CRITICAL_SECTION']],
    'Resource' : [ 0x0, ['_ERESOURCE']],
} ],
  '_HEAP_LOCK' : [ 0x38, {
    'Lock' : [ 0x0, ['__unnamed_1a92']],
} ],
  '_HEAP_ENTRY' : [ 0x8, {
    'UnpackedEntry' : [ 0x0, ['_HEAP_UNPACKED_ENTRY']],
    'Size' : [ 0x0, ['unsigned short']],
    'Flags' : [ 0x2, ['unsigned char']],
    'SmallTagIndex' : [ 0x3, ['unsigned char']],
    'SubSegmentCode' : [ 0x0, ['unsigned long']],
    'PreviousSize' : [ 0x4, ['unsigned short']],
    'SegmentOffset' : [ 0x6, ['unsigned char']],
    'LFHFlags' : [ 0x6, ['unsigned char']],
    'UnusedBytes' : [ 0x7, ['unsigned char']],
    'ExtendedEntry' : [ 0x0, ['_HEAP_EXTENDED_ENTRY']],
    'FunctionIndex' : [ 0x0, ['unsigned short']],
    'ContextValue' : [ 0x2, ['unsigned short']],
    'InterceptorValue' : [ 0x0, ['unsigned long']],
    'UnusedBytesLength' : [ 0x4, ['unsigned short']],
    'EntryOffset' : [ 0x6, ['unsigned char']],
    'ExtendedBlockSignature' : [ 0x7, ['unsigned char']],
    'Code1' : [ 0x0, ['unsigned long']],
    'Code2' : [ 0x4, ['unsigned short']],
    'Code3' : [ 0x6, ['unsigned char']],
    'Code4' : [ 0x7, ['unsigned char']],
    'Code234' : [ 0x4, ['unsigned long']],
    'AgregateCode' : [ 0x0, ['unsigned long long']],
} ],
  '_HEAP_SEGMENT' : [ 0x40, {
    'Entry' : [ 0x0, ['_HEAP_ENTRY']],
    'SegmentSignature' : [ 0x8, ['unsigned long']],
    'SegmentFlags' : [ 0xc, ['unsigned long']],
    'SegmentListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'Heap' : [ 0x18, ['pointer', ['_HEAP']]],
    'BaseAddress' : [ 0x1c, ['pointer', ['void']]],
    'NumberOfPages' : [ 0x20, ['unsigned long']],
    'FirstEntry' : [ 0x24, ['pointer', ['_HEAP_ENTRY']]],
    'LastValidEntry' : [ 0x28, ['pointer', ['_HEAP_ENTRY']]],
    'NumberOfUnCommittedPages' : [ 0x2c, ['unsigned long']],
    'NumberOfUnCommittedRanges' : [ 0x30, ['unsigned long']],
    'SegmentAllocatorBackTraceIndex' : [ 0x34, ['unsigned short']],
    'Reserved' : [ 0x36, ['unsigned short']],
    'UCRSegmentList' : [ 0x38, ['_LIST_ENTRY']],
} ],
  '_HEAP_VIRTUAL_ALLOC_ENTRY' : [ 0x20, {
    'Entry' : [ 0x0, ['_LIST_ENTRY']],
    'ExtraStuff' : [ 0x8, ['_HEAP_ENTRY_EXTRA']],
    'CommitSize' : [ 0x10, ['unsigned long']],
    'ReserveSize' : [ 0x14, ['unsigned long']],
    'BusyBlock' : [ 0x18, ['_HEAP_ENTRY']],
} ],
  '_HEAP_FREE_ENTRY' : [ 0x10, {
    'HeapEntry' : [ 0x0, ['_HEAP_ENTRY']],
    'UnpackedEntry' : [ 0x0, ['_HEAP_UNPACKED_ENTRY']],
    'Size' : [ 0x0, ['unsigned short']],
    'Flags' : [ 0x2, ['unsigned char']],
    'SmallTagIndex' : [ 0x3, ['unsigned char']],
    'SubSegmentCode' : [ 0x0, ['unsigned long']],
    'PreviousSize' : [ 0x4, ['unsigned short']],
    'SegmentOffset' : [ 0x6, ['unsigned char']],
    'LFHFlags' : [ 0x6, ['unsigned char']],
    'UnusedBytes' : [ 0x7, ['unsigned char']],
    'ExtendedEntry' : [ 0x0, ['_HEAP_EXTENDED_ENTRY']],
    'FunctionIndex' : [ 0x0, ['unsigned short']],
    'ContextValue' : [ 0x2, ['unsigned short']],
    'InterceptorValue' : [ 0x0, ['unsigned long']],
    'UnusedBytesLength' : [ 0x4, ['unsigned short']],
    'EntryOffset' : [ 0x6, ['unsigned char']],
    'ExtendedBlockSignature' : [ 0x7, ['unsigned char']],
    'Code1' : [ 0x0, ['unsigned long']],
    'Code2' : [ 0x4, ['unsigned short']],
    'Code3' : [ 0x6, ['unsigned char']],
    'Code4' : [ 0x7, ['unsigned char']],
    'Code234' : [ 0x4, ['unsigned long']],
    'AgregateCode' : [ 0x0, ['unsigned long long']],
    'FreeList' : [ 0x8, ['_LIST_ENTRY']],
} ],
  '__unnamed_1ae5' : [ 0x4, {
    'DataLength' : [ 0x0, ['short']],
    'TotalLength' : [ 0x2, ['short']],
} ],
  '__unnamed_1ae7' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1ae5']],
    'Length' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_1ae9' : [ 0x4, {
    'Type' : [ 0x0, ['short']],
    'DataInfoOffset' : [ 0x2, ['short']],
} ],
  '__unnamed_1aeb' : [ 0x4, {
    's2' : [ 0x0, ['__unnamed_1ae9']],
    'ZeroInit' : [ 0x0, ['unsigned long']],
} ],
  '_PORT_MESSAGE' : [ 0x18, {
    'u1' : [ 0x0, ['__unnamed_1ae7']],
    'u2' : [ 0x4, ['__unnamed_1aeb']],
    'ClientId' : [ 0x8, ['_CLIENT_ID']],
    'DoNotUseThisField' : [ 0x8, ['double']],
    'MessageId' : [ 0x10, ['unsigned long']],
    'ClientViewSize' : [ 0x14, ['unsigned long']],
    'CallbackId' : [ 0x14, ['unsigned long']],
} ],
  '_ALPC_MESSAGE_ATTRIBUTES' : [ 0x8, {
    'AllocatedAttributes' : [ 0x0, ['unsigned long']],
    'ValidAttributes' : [ 0x4, ['unsigned long']],
} ],
  '_ALPC_HANDLE_ENTRY' : [ 0x4, {
    'Object' : [ 0x0, ['pointer', ['void']]],
} ],
  '_BLOB_TYPE' : [ 0x20, {
    'ResourceId' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'BLOB_TYPE_UNKNOWN', 1: u'BLOB_TYPE_CONNECTION_INFO', 2: u'BLOB_TYPE_MESSAGE', 3: u'BLOB_TYPE_SECURITY_CONTEXT', 4: u'BLOB_TYPE_SECTION', 5: u'BLOB_TYPE_REGION', 6: u'BLOB_TYPE_VIEW', 7: u'BLOB_TYPE_RESERVE', 8: u'BLOB_TYPE_DIRECT_TRANSFER', 9: u'BLOB_TYPE_HANDLE_DATA', 10: u'BLOB_TYPE_MAX_ID'})]],
    'PoolTag' : [ 0x4, ['unsigned long']],
    'LookasideIndex' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['unsigned long']],
    'Counters' : [ 0x10, ['pointer', ['_BLOB_COUNTERS']]],
    'DeleteProcedure' : [ 0x14, ['pointer', ['void']]],
    'DestroyProcedure' : [ 0x18, ['pointer', ['void']]],
    'UsualSize' : [ 0x1c, ['unsigned long']],
} ],
  '__unnamed_1b08' : [ 0x1, {
    'ReferenceCache' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Lookaside' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Initializing' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Deleted' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
} ],
  '__unnamed_1b0a' : [ 0x1, {
    's1' : [ 0x0, ['__unnamed_1b08']],
    'Flags' : [ 0x0, ['unsigned char']],
} ],
  '_BLOB' : [ 0x18, {
    'ResourceList' : [ 0x0, ['_LIST_ENTRY']],
    'FreeListEntry' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'u1' : [ 0x8, ['__unnamed_1b0a']],
    'ResourceId' : [ 0x9, ['unsigned char']],
    'CachedReferences' : [ 0xa, ['short']],
    'ReferenceCount' : [ 0xc, ['long']],
    'Pad' : [ 0x10, ['unsigned long']],
    'Lock' : [ 0x14, ['_EX_PUSH_LOCK']],
} ],
  '__unnamed_1b1e' : [ 0x4, {
    'Internal' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Secure' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
} ],
  '__unnamed_1b20' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1b1e']],
} ],
  '_KALPC_SECTION' : [ 0x28, {
    'SectionObject' : [ 0x0, ['pointer', ['void']]],
    'Size' : [ 0x4, ['unsigned long']],
    'HandleTable' : [ 0x8, ['pointer', ['_ALPC_HANDLE_TABLE']]],
    'SectionHandle' : [ 0xc, ['pointer', ['void']]],
    'OwnerProcess' : [ 0x10, ['pointer', ['_EPROCESS']]],
    'OwnerPort' : [ 0x14, ['pointer', ['_ALPC_PORT']]],
    'u1' : [ 0x18, ['__unnamed_1b20']],
    'NumberOfRegions' : [ 0x1c, ['unsigned long']],
    'RegionListHead' : [ 0x20, ['_LIST_ENTRY']],
} ],
  '__unnamed_1b29' : [ 0x4, {
    'Secure' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
} ],
  '__unnamed_1b2b' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1b29']],
} ],
  '_KALPC_REGION' : [ 0x30, {
    'RegionListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Section' : [ 0x8, ['pointer', ['_KALPC_SECTION']]],
    'Offset' : [ 0xc, ['unsigned long']],
    'Size' : [ 0x10, ['unsigned long']],
    'ViewSize' : [ 0x14, ['unsigned long']],
    'u1' : [ 0x18, ['__unnamed_1b2b']],
    'NumberOfViews' : [ 0x1c, ['unsigned long']],
    'ViewListHead' : [ 0x20, ['_LIST_ENTRY']],
    'ReadOnlyView' : [ 0x28, ['pointer', ['_KALPC_VIEW']]],
    'ReadWriteView' : [ 0x2c, ['pointer', ['_KALPC_VIEW']]],
} ],
  '__unnamed_1b31' : [ 0x4, {
    'WriteAccess' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AutoRelease' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ForceUnlink' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
} ],
  '__unnamed_1b33' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1b31']],
} ],
  '_KALPC_VIEW' : [ 0x34, {
    'ViewListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Region' : [ 0x8, ['pointer', ['_KALPC_REGION']]],
    'OwnerPort' : [ 0xc, ['pointer', ['_ALPC_PORT']]],
    'OwnerProcess' : [ 0x10, ['pointer', ['_EPROCESS']]],
    'Address' : [ 0x14, ['pointer', ['void']]],
    'Size' : [ 0x18, ['unsigned long']],
    'SecureViewHandle' : [ 0x1c, ['pointer', ['void']]],
    'WriteAccessHandle' : [ 0x20, ['pointer', ['void']]],
    'u1' : [ 0x24, ['__unnamed_1b33']],
    'NumberOfOwnerMessages' : [ 0x28, ['unsigned long']],
    'ProcessViewListEntry' : [ 0x2c, ['_LIST_ENTRY']],
} ],
  '_ALPC_COMMUNICATION_INFO' : [ 0x28, {
    'ConnectionPort' : [ 0x0, ['pointer', ['_ALPC_PORT']]],
    'ServerCommunicationPort' : [ 0x4, ['pointer', ['_ALPC_PORT']]],
    'ClientCommunicationPort' : [ 0x8, ['pointer', ['_ALPC_PORT']]],
    'CommunicationList' : [ 0xc, ['_LIST_ENTRY']],
    'HandleTable' : [ 0x14, ['_ALPC_HANDLE_TABLE']],
    'CloseMessage' : [ 0x24, ['pointer', ['_KALPC_MESSAGE']]],
} ],
  '__unnamed_1b50' : [ 0x4, {
    'Initialized' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Type' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 3, native_type='unsigned long')]],
    'ConnectionPending' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ConnectionRefused' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Disconnected' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Closed' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'NoFlushOnClose' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ReturnExtendedInfo' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Waitable' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DynamicSecurity' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'Wow64CompletionList' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'Lpc' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'LpcToLpc' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'HasCompletionList' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'HadCompletionList' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'EnableCompletionList' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
} ],
  '__unnamed_1b52' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1b50']],
    'State' : [ 0x0, ['unsigned long']],
} ],
  '_ALPC_PORT' : [ 0x11c, {
    'PortListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'CommunicationInfo' : [ 0x8, ['pointer', ['_ALPC_COMMUNICATION_INFO']]],
    'OwnerProcess' : [ 0xc, ['pointer', ['_EPROCESS']]],
    'CompletionPort' : [ 0x10, ['pointer', ['void']]],
    'CompletionKey' : [ 0x14, ['pointer', ['void']]],
    'CompletionPacketLookaside' : [ 0x18, ['pointer', ['_ALPC_COMPLETION_PACKET_LOOKASIDE']]],
    'PortContext' : [ 0x1c, ['pointer', ['void']]],
    'StaticSecurity' : [ 0x20, ['_SECURITY_CLIENT_CONTEXT']],
    'IncomingQueueLock' : [ 0x5c, ['_EX_PUSH_LOCK']],
    'MainQueue' : [ 0x60, ['_LIST_ENTRY']],
    'LargeMessageQueue' : [ 0x68, ['_LIST_ENTRY']],
    'PendingQueueLock' : [ 0x70, ['_EX_PUSH_LOCK']],
    'PendingQueue' : [ 0x74, ['_LIST_ENTRY']],
    'DirectQueueLock' : [ 0x7c, ['_EX_PUSH_LOCK']],
    'DirectQueue' : [ 0x80, ['_LIST_ENTRY']],
    'WaitQueueLock' : [ 0x88, ['_EX_PUSH_LOCK']],
    'WaitQueue' : [ 0x8c, ['_LIST_ENTRY']],
    'Semaphore' : [ 0x94, ['pointer', ['_KSEMAPHORE']]],
    'DummyEvent' : [ 0x94, ['pointer', ['_KEVENT']]],
    'PortAttributes' : [ 0x98, ['_ALPC_PORT_ATTRIBUTES']],
    'ResourceListLock' : [ 0xc4, ['_EX_PUSH_LOCK']],
    'ResourceListHead' : [ 0xc8, ['_LIST_ENTRY']],
    'PortObjectLock' : [ 0xd0, ['_EX_PUSH_LOCK']],
    'CompletionList' : [ 0xd4, ['pointer', ['_ALPC_COMPLETION_LIST']]],
    'CallbackObject' : [ 0xd8, ['pointer', ['_CALLBACK_OBJECT']]],
    'CallbackContext' : [ 0xdc, ['pointer', ['void']]],
    'CanceledQueue' : [ 0xe0, ['_LIST_ENTRY']],
    'SequenceNo' : [ 0xe8, ['long']],
    'ReferenceNo' : [ 0xec, ['long']],
    'ReferenceNoWait' : [ 0xf0, ['pointer', ['_PALPC_PORT_REFERENCE_WAIT_BLOCK']]],
    'u1' : [ 0xf4, ['__unnamed_1b52']],
    'TargetQueuePort' : [ 0xf8, ['pointer', ['_ALPC_PORT']]],
    'TargetSequencePort' : [ 0xfc, ['pointer', ['_ALPC_PORT']]],
    'CachedMessage' : [ 0x100, ['pointer', ['_KALPC_MESSAGE']]],
    'MainQueueLength' : [ 0x104, ['unsigned long']],
    'LargeMessageQueueLength' : [ 0x108, ['unsigned long']],
    'PendingQueueLength' : [ 0x10c, ['unsigned long']],
    'DirectQueueLength' : [ 0x110, ['unsigned long']],
    'CanceledQueueLength' : [ 0x114, ['unsigned long']],
    'WaitQueueLength' : [ 0x118, ['unsigned long']],
} ],
  '_ALPC_COMPLETION_LIST' : [ 0x58, {
    'Entry' : [ 0x0, ['_LIST_ENTRY']],
    'OwnerProcess' : [ 0x8, ['pointer', ['_EPROCESS']]],
    'CompletionListLock' : [ 0xc, ['_EX_PUSH_LOCK']],
    'Mdl' : [ 0x10, ['pointer', ['_MDL']]],
    'UserVa' : [ 0x14, ['pointer', ['void']]],
    'UserLimit' : [ 0x18, ['pointer', ['void']]],
    'DataUserVa' : [ 0x1c, ['pointer', ['void']]],
    'SystemVa' : [ 0x20, ['pointer', ['void']]],
    'TotalSize' : [ 0x24, ['unsigned long']],
    'Header' : [ 0x28, ['pointer', ['_ALPC_COMPLETION_LIST_HEADER']]],
    'List' : [ 0x2c, ['pointer', ['void']]],
    'ListSize' : [ 0x30, ['unsigned long']],
    'Bitmap' : [ 0x34, ['pointer', ['void']]],
    'BitmapSize' : [ 0x38, ['unsigned long']],
    'Data' : [ 0x3c, ['pointer', ['void']]],
    'DataSize' : [ 0x40, ['unsigned long']],
    'BitmapLimit' : [ 0x44, ['unsigned long']],
    'BitmapNextHint' : [ 0x48, ['unsigned long']],
    'ConcurrencyCount' : [ 0x4c, ['unsigned long']],
    'AttributeFlags' : [ 0x50, ['unsigned long']],
    'AttributeSize' : [ 0x54, ['unsigned long']],
} ],
  '_OBJECT_ATTRIBUTES' : [ 0x18, {
    'Length' : [ 0x0, ['unsigned long']],
    'RootDirectory' : [ 0x4, ['pointer', ['void']]],
    'ObjectName' : [ 0x8, ['pointer', ['_UNICODE_STRING']]],
    'Attributes' : [ 0xc, ['unsigned long']],
    'SecurityDescriptor' : [ 0x10, ['pointer', ['void']]],
    'SecurityQualityOfService' : [ 0x14, ['pointer', ['void']]],
} ],
  '_OBJECT_TYPE' : [ 0x90, {
    'TypeList' : [ 0x0, ['_LIST_ENTRY']],
    'Name' : [ 0x8, ['_UNICODE_STRING']],
    'DefaultObject' : [ 0x10, ['pointer', ['void']]],
    'Index' : [ 0x14, ['unsigned char']],
    'TotalNumberOfObjects' : [ 0x18, ['unsigned long']],
    'TotalNumberOfHandles' : [ 0x1c, ['unsigned long']],
    'HighWaterNumberOfObjects' : [ 0x20, ['unsigned long']],
    'HighWaterNumberOfHandles' : [ 0x24, ['unsigned long']],
    'TypeInfo' : [ 0x28, ['_OBJECT_TYPE_INITIALIZER']],
    'TypeLock' : [ 0x80, ['_EX_PUSH_LOCK']],
    'Key' : [ 0x84, ['unsigned long']],
    'CallbackList' : [ 0x88, ['_LIST_ENTRY']],
} ],
  '_PALPC_PORT_REFERENCE_WAIT_BLOCK' : [ 0x14, {
    'DesiredReferenceNoEvent' : [ 0x0, ['_KEVENT']],
    'DesiredReferenceNo' : [ 0x10, ['long']],
} ],
  '__unnamed_1b75' : [ 0x4, {
    'QueueType' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'QueuePortType' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 7, native_type='unsigned long')]],
    'Canceled' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'Ready' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'ReleaseMessage' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'SharedQuota' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ReplyWaitReply' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'OwnerPortReference' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'ReserveReference' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'ReceiverReference' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'ViewAttributeRetrieved' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'InDispatch' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
} ],
  '__unnamed_1b77' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1b75']],
    'State' : [ 0x0, ['unsigned long']],
} ],
  '_KALPC_MESSAGE' : [ 0x90, {
    'Entry' : [ 0x0, ['_LIST_ENTRY']],
    'PortQueue' : [ 0x8, ['pointer', ['_ALPC_PORT']]],
    'OwnerPort' : [ 0xc, ['pointer', ['_ALPC_PORT']]],
    'WaitingThread' : [ 0x10, ['pointer', ['_ETHREAD']]],
    'u1' : [ 0x14, ['__unnamed_1b77']],
    'SequenceNo' : [ 0x18, ['long']],
    'QuotaProcess' : [ 0x1c, ['pointer', ['_EPROCESS']]],
    'QuotaBlock' : [ 0x1c, ['pointer', ['void']]],
    'CancelSequencePort' : [ 0x20, ['pointer', ['_ALPC_PORT']]],
    'CancelQueuePort' : [ 0x24, ['pointer', ['_ALPC_PORT']]],
    'CancelSequenceNo' : [ 0x28, ['long']],
    'CancelListEntry' : [ 0x2c, ['_LIST_ENTRY']],
    'Reserve' : [ 0x34, ['pointer', ['_KALPC_RESERVE']]],
    'MessageAttributes' : [ 0x38, ['_KALPC_MESSAGE_ATTRIBUTES']],
    'DataUserVa' : [ 0x58, ['pointer', ['void']]],
    'CommunicationInfo' : [ 0x5c, ['pointer', ['_ALPC_COMMUNICATION_INFO']]],
    'ConnectionPort' : [ 0x60, ['pointer', ['_ALPC_PORT']]],
    'ServerThread' : [ 0x64, ['pointer', ['_ETHREAD']]],
    'WakeReference' : [ 0x68, ['pointer', ['void']]],
    'ExtensionBuffer' : [ 0x6c, ['pointer', ['void']]],
    'ExtensionBufferSize' : [ 0x70, ['unsigned long']],
    'PortMessage' : [ 0x78, ['_PORT_MESSAGE']],
} ],
  '_ALPC_DISPATCH_CONTEXT' : [ 0x24, {
    'PortObject' : [ 0x0, ['pointer', ['_ALPC_PORT']]],
    'Message' : [ 0x4, ['pointer', ['_KALPC_MESSAGE']]],
    'CommunicationInfo' : [ 0x8, ['pointer', ['_ALPC_COMMUNICATION_INFO']]],
    'TargetThread' : [ 0xc, ['pointer', ['_ETHREAD']]],
    'TargetPort' : [ 0x10, ['pointer', ['_ALPC_PORT']]],
    'DirectEvent' : [ 0x14, ['_KALPC_DIRECT_EVENT']],
    'Flags' : [ 0x18, ['unsigned long']],
    'TotalLength' : [ 0x1c, ['unsigned short']],
    'Type' : [ 0x1e, ['unsigned short']],
    'DataInfoOffset' : [ 0x20, ['unsigned short']],
    'SignalCompletion' : [ 0x22, ['unsigned char']],
    'PostedToCompletionList' : [ 0x23, ['unsigned char']],
} ],
  '_REMOTE_PORT_VIEW' : [ 0xc, {
    'Length' : [ 0x0, ['unsigned long']],
    'ViewSize' : [ 0x4, ['unsigned long']],
    'ViewBase' : [ 0x8, ['pointer', ['void']]],
} ],
  '_KALPC_RESERVE' : [ 0x14, {
    'OwnerPort' : [ 0x0, ['pointer', ['_ALPC_PORT']]],
    'HandleTable' : [ 0x4, ['pointer', ['_ALPC_HANDLE_TABLE']]],
    'Handle' : [ 0x8, ['pointer', ['void']]],
    'Message' : [ 0xc, ['pointer', ['_KALPC_MESSAGE']]],
    'Active' : [ 0x10, ['long']],
} ],
  '_KALPC_HANDLE_DATA' : [ 0x20, {
    'Flags' : [ 0x0, ['unsigned long']],
    'ObjectType' : [ 0x4, ['unsigned long']],
    'DuplicateContext' : [ 0x8, ['_OB_DUPLICATE_OBJECT_STATE']],
} ],
  '_KALPC_MESSAGE_ATTRIBUTES' : [ 0x20, {
    'ClientContext' : [ 0x0, ['pointer', ['void']]],
    'ServerContext' : [ 0x4, ['pointer', ['void']]],
    'PortContext' : [ 0x8, ['pointer', ['void']]],
    'CancelPortContext' : [ 0xc, ['pointer', ['void']]],
    'SecurityData' : [ 0x10, ['pointer', ['_KALPC_SECURITY_DATA']]],
    'View' : [ 0x14, ['pointer', ['_KALPC_VIEW']]],
    'HandleData' : [ 0x18, ['pointer', ['_KALPC_HANDLE_DATA']]],
    'DirectEvent' : [ 0x1c, ['_KALPC_DIRECT_EVENT']],
} ],
  '__unnamed_1bba' : [ 0x4, {
    'Revoked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Impersonated' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
} ],
  '__unnamed_1bbc' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1bba']],
} ],
  '_KALPC_SECURITY_DATA' : [ 0x50, {
    'HandleTable' : [ 0x0, ['pointer', ['_ALPC_HANDLE_TABLE']]],
    'ContextHandle' : [ 0x4, ['pointer', ['void']]],
    'OwningProcess' : [ 0x8, ['pointer', ['_EPROCESS']]],
    'OwnerPort' : [ 0xc, ['pointer', ['_ALPC_PORT']]],
    'DynamicSecurity' : [ 0x10, ['_SECURITY_CLIENT_CONTEXT']],
    'u1' : [ 0x4c, ['__unnamed_1bbc']],
} ],
  '_KALPC_DIRECT_EVENT' : [ 0x4, {
    'Event' : [ 0x0, ['unsigned long']],
    'Referenced' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 32, native_type='unsigned long')]],
} ],
  '_IO_MINI_COMPLETION_PACKET_USER' : [ 0x28, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'PacketType' : [ 0x8, ['unsigned long']],
    'KeyContext' : [ 0xc, ['pointer', ['void']]],
    'ApcContext' : [ 0x10, ['pointer', ['void']]],
    'IoStatus' : [ 0x14, ['long']],
    'IoStatusInformation' : [ 0x18, ['unsigned long']],
    'MiniPacketCallback' : [ 0x1c, ['pointer', ['void']]],
    'Context' : [ 0x20, ['pointer', ['void']]],
    'Allocated' : [ 0x24, ['unsigned char']],
} ],
  '_IOP_IRP_EXTENSION' : [ 0x28, {
    'ExtensionFlags' : [ 0x0, ['unsigned short']],
    'Allocated' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'PropagateId' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'SpareBits' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 16, native_type='unsigned short')]],
    'TypesAllocated' : [ 0x2, ['unsigned short']],
    'GenericExtension' : [ 0x4, ['array', 4, ['unsigned char']]],
    'VerifierContext' : [ 0x8, ['pointer', ['void']]],
    'ActivityId' : [ 0xc, ['_GUID']],
    'Timestamp' : [ 0x1c, ['_LARGE_INTEGER']],
    'ZeroingOffset' : [ 0x1c, ['unsigned long']],
    'FsTrackOffsetBlob' : [ 0x1c, ['pointer', ['_IO_IRP_EXT_TRACK_OFFSET_HEADER']]],
    'FsTrackedOffset' : [ 0x20, ['long long']],
} ],
  '_DRIVER_OBJECT' : [ 0xa8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
    'Flags' : [ 0x8, ['unsigned long']],
    'DriverStart' : [ 0xc, ['pointer', ['void']]],
    'DriverSize' : [ 0x10, ['unsigned long']],
    'DriverSection' : [ 0x14, ['pointer', ['void']]],
    'DriverExtension' : [ 0x18, ['pointer', ['_DRIVER_EXTENSION']]],
    'DriverName' : [ 0x1c, ['_UNICODE_STRING']],
    'HardwareDatabase' : [ 0x24, ['pointer', ['_UNICODE_STRING']]],
    'FastIoDispatch' : [ 0x28, ['pointer', ['_FAST_IO_DISPATCH']]],
    'DriverInit' : [ 0x2c, ['pointer', ['void']]],
    'DriverStartIo' : [ 0x30, ['pointer', ['void']]],
    'DriverUnload' : [ 0x34, ['pointer', ['void']]],
    'MajorFunction' : [ 0x38, ['array', 28, ['pointer', ['void']]]],
} ],
  '_FILE_SEGMENT_ELEMENT' : [ 0x8, {
    'Buffer' : [ 0x0, ['pointer64', ['void']]],
    'Alignment' : [ 0x0, ['unsigned long long']],
} ],
  '_RELATIVE_SYMLINK_INFO' : [ 0x14, {
    'ExposedNamespaceLength' : [ 0x0, ['unsigned short']],
    'Flags' : [ 0x2, ['unsigned short']],
    'DeviceNameLength' : [ 0x4, ['unsigned short']],
    'Reserved' : [ 0x6, ['unsigned short']],
    'InteriorMountPoint' : [ 0x8, ['pointer', ['_RELATIVE_SYMLINK_INFO']]],
    'OpenedName' : [ 0xc, ['_UNICODE_STRING']],
} ],
  '_ECP_LIST' : [ 0x10, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'EcpList' : [ 0x8, ['_LIST_ENTRY']],
} ],
  '_IOP_FILE_OBJECT_EXTENSION' : [ 0x24, {
    'FoExtFlags' : [ 0x0, ['unsigned long']],
    'FoExtPerTypeExtension' : [ 0x4, ['array', 7, ['pointer', ['void']]]],
    'FoIoPriorityHint' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {0: u'IopIoPriorityNotSet', 1: u'IopIoPriorityVeryLow', 2: u'IopIoPriorityLow', 3: u'IopIoPriorityNormal', 4: u'IopIoPriorityHigh', 5: u'IopIoPriorityCritical', 6: u'MaxIopIoPriorityTypes'})]],
} ],
  '_OPEN_PACKET' : [ 0x70, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'FileObject' : [ 0x4, ['pointer', ['_FILE_OBJECT']]],
    'FinalStatus' : [ 0x8, ['long']],
    'Information' : [ 0xc, ['unsigned long']],
    'ParseCheck' : [ 0x10, ['unsigned long']],
    'RelatedFileObject' : [ 0x14, ['pointer', ['_FILE_OBJECT']]],
    'ReferencedDeviceObject' : [ 0x14, ['pointer', ['_DEVICE_OBJECT']]],
    'OriginalAttributes' : [ 0x18, ['pointer', ['_OBJECT_ATTRIBUTES']]],
    'AllocationSize' : [ 0x20, ['_LARGE_INTEGER']],
    'CreateOptions' : [ 0x28, ['unsigned long']],
    'FileAttributes' : [ 0x2c, ['unsigned short']],
    'ShareAccess' : [ 0x2e, ['unsigned short']],
    'EaBuffer' : [ 0x30, ['pointer', ['void']]],
    'EaLength' : [ 0x34, ['unsigned long']],
    'Options' : [ 0x38, ['unsigned long']],
    'Disposition' : [ 0x3c, ['unsigned long']],
    'BasicInformation' : [ 0x40, ['pointer', ['_FILE_BASIC_INFORMATION']]],
    'NetworkInformation' : [ 0x44, ['pointer', ['_FILE_NETWORK_OPEN_INFORMATION']]],
    'CreateFileType' : [ 0x48, ['Enumeration', dict(target = 'long', choices = {0: u'CreateFileTypeNone', 1: u'CreateFileTypeNamedPipe', 2: u'CreateFileTypeMailslot'})]],
    'MailslotOrPipeParameters' : [ 0x4c, ['pointer', ['void']]],
    'Override' : [ 0x50, ['unsigned char']],
    'QueryOnly' : [ 0x51, ['unsigned char']],
    'DeleteOnly' : [ 0x52, ['unsigned char']],
    'FullAttributes' : [ 0x53, ['unsigned char']],
    'LocalFileObject' : [ 0x54, ['pointer', ['_DUMMY_FILE_OBJECT']]],
    'InternalFlags' : [ 0x58, ['unsigned long']],
    'AccessMode' : [ 0x5c, ['unsigned char']],
    'DriverCreateContext' : [ 0x60, ['_IO_DRIVER_CREATE_CONTEXT']],
} ],
  '_ETW_SYSTEMTIME' : [ 0x10, {
    'Year' : [ 0x0, ['unsigned short']],
    'Month' : [ 0x2, ['unsigned short']],
    'DayOfWeek' : [ 0x4, ['unsigned short']],
    'Day' : [ 0x6, ['unsigned short']],
    'Hour' : [ 0x8, ['unsigned short']],
    'Minute' : [ 0xa, ['unsigned short']],
    'Second' : [ 0xc, ['unsigned short']],
    'Milliseconds' : [ 0xe, ['unsigned short']],
} ],
  '_TIME_FIELDS' : [ 0x10, {
    'Year' : [ 0x0, ['short']],
    'Month' : [ 0x2, ['short']],
    'Day' : [ 0x4, ['short']],
    'Hour' : [ 0x6, ['short']],
    'Minute' : [ 0x8, ['short']],
    'Second' : [ 0xa, ['short']],
    'Milliseconds' : [ 0xc, ['short']],
    'Weekday' : [ 0xe, ['short']],
} ],
  '__unnamed_1c87' : [ 0x4, {
    'MajorVersion' : [ 0x0, ['unsigned char']],
    'MinorVersion' : [ 0x1, ['unsigned char']],
    'SubVersion' : [ 0x2, ['unsigned char']],
    'SubMinorVersion' : [ 0x3, ['unsigned char']],
} ],
  '_TRACE_LOGFILE_HEADER' : [ 0x110, {
    'BufferSize' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'VersionDetail' : [ 0x4, ['__unnamed_1c87']],
    'ProviderVersion' : [ 0x8, ['unsigned long']],
    'NumberOfProcessors' : [ 0xc, ['unsigned long']],
    'EndTime' : [ 0x10, ['_LARGE_INTEGER']],
    'TimerResolution' : [ 0x18, ['unsigned long']],
    'MaximumFileSize' : [ 0x1c, ['unsigned long']],
    'LogFileMode' : [ 0x20, ['unsigned long']],
    'BuffersWritten' : [ 0x24, ['unsigned long']],
    'LogInstanceGuid' : [ 0x28, ['_GUID']],
    'StartBuffers' : [ 0x28, ['unsigned long']],
    'PointerSize' : [ 0x2c, ['unsigned long']],
    'EventsLost' : [ 0x30, ['unsigned long']],
    'CpuSpeedInMHz' : [ 0x34, ['unsigned long']],
    'LoggerName' : [ 0x38, ['pointer', ['unsigned short']]],
    'LogFileName' : [ 0x3c, ['pointer', ['unsigned short']]],
    'TimeZone' : [ 0x40, ['_RTL_TIME_ZONE_INFORMATION']],
    'BootTime' : [ 0xf0, ['_LARGE_INTEGER']],
    'PerfFreq' : [ 0xf8, ['_LARGE_INTEGER']],
    'StartTime' : [ 0x100, ['_LARGE_INTEGER']],
    'ReservedFlags' : [ 0x108, ['unsigned long']],
    'BuffersLost' : [ 0x10c, ['unsigned long']],
} ],
  '_WMI_LOGGER_CONTEXT' : [ 0x288, {
    'LoggerId' : [ 0x0, ['unsigned long']],
    'BufferSize' : [ 0x4, ['unsigned long']],
    'MaximumEventSize' : [ 0x8, ['unsigned long']],
    'LoggerMode' : [ 0xc, ['unsigned long']],
    'AcceptNewEvents' : [ 0x10, ['long']],
    'EventMarker' : [ 0x14, ['array', 1, ['unsigned long']]],
    'ErrorMarker' : [ 0x18, ['unsigned long']],
    'SizeMask' : [ 0x1c, ['unsigned long']],
    'GetCpuClock' : [ 0x20, ['pointer', ['void']]],
    'LoggerThread' : [ 0x24, ['pointer', ['_ETHREAD']]],
    'LoggerStatus' : [ 0x28, ['long']],
    'FailureReason' : [ 0x2c, ['unsigned long']],
    'BufferQueue' : [ 0x30, ['_ETW_BUFFER_QUEUE']],
    'OverflowQueue' : [ 0x3c, ['_ETW_BUFFER_QUEUE']],
    'GlobalList' : [ 0x48, ['_LIST_ENTRY']],
    'ProviderBinaryList' : [ 0x50, ['_LIST_ENTRY']],
    'BatchedBufferList' : [ 0x58, ['pointer', ['_WMI_BUFFER_HEADER']]],
    'CurrentBuffer' : [ 0x58, ['_EX_FAST_REF']],
    'LoggerName' : [ 0x5c, ['_UNICODE_STRING']],
    'LogFileName' : [ 0x64, ['_UNICODE_STRING']],
    'LogFilePattern' : [ 0x6c, ['_UNICODE_STRING']],
    'NewLogFileName' : [ 0x74, ['_UNICODE_STRING']],
    'ClockType' : [ 0x7c, ['unsigned long']],
    'LastFlushedBuffer' : [ 0x80, ['unsigned long']],
    'FlushTimer' : [ 0x84, ['unsigned long']],
    'FlushThreshold' : [ 0x88, ['unsigned long']],
    'ByteOffset' : [ 0x90, ['_LARGE_INTEGER']],
    'MinimumBuffers' : [ 0x98, ['unsigned long']],
    'BuffersAvailable' : [ 0x9c, ['long']],
    'NumberOfBuffers' : [ 0xa0, ['long']],
    'MaximumBuffers' : [ 0xa4, ['unsigned long']],
    'EventsLost' : [ 0xa8, ['unsigned long']],
    'PeakBuffersCount' : [ 0xac, ['long']],
    'BuffersWritten' : [ 0xb0, ['unsigned long']],
    'LogBuffersLost' : [ 0xb4, ['unsigned long']],
    'RealTimeBuffersDelivered' : [ 0xb8, ['unsigned long']],
    'RealTimeBuffersLost' : [ 0xbc, ['unsigned long']],
    'SequencePtr' : [ 0xc0, ['pointer', ['long']]],
    'LocalSequence' : [ 0xc4, ['unsigned long']],
    'InstanceGuid' : [ 0xc8, ['_GUID']],
    'MaximumFileSize' : [ 0xd8, ['unsigned long']],
    'FileCounter' : [ 0xdc, ['long']],
    'PoolType' : [ 0xe0, ['Enumeration', dict(target = 'long', choices = {0: u'NonPagedPoolBase', 1: u'PagedPool', 2: u'NonPagedPoolBaseMustSucceed', 3: u'DontUseThisType', 4: u'NonPagedPoolBaseCacheAligned', 5: u'PagedPoolCacheAligned', 6: u'NonPagedPoolBaseCacheAlignedMustS', 7: u'MaxPoolType', 34: u'NonPagedPoolMustSucceedSession', 516: u'NonPagedPoolNxCacheAligned', 35: u'DontUseThisTypeSession', 32: u'NonPagedPoolSession', 512: u'NonPagedPoolNx', 544: u'NonPagedPoolSessionNx', 36: u'NonPagedPoolCacheAlignedSession', 33: u'PagedPoolSession', 38: u'NonPagedPoolCacheAlignedMustSSession', 37: u'PagedPoolCacheAlignedSession'})]],
    'ReferenceTime' : [ 0xe8, ['_ETW_REF_CLOCK']],
    'CollectionOn' : [ 0xf8, ['long']],
    'ProviderInfoSize' : [ 0xfc, ['unsigned long']],
    'Consumers' : [ 0x100, ['_LIST_ENTRY']],
    'NumConsumers' : [ 0x108, ['unsigned long']],
    'TransitionConsumer' : [ 0x10c, ['pointer', ['_ETW_REALTIME_CONSUMER']]],
    'RealtimeLogfileHandle' : [ 0x110, ['pointer', ['void']]],
    'RealtimeLogfileName' : [ 0x114, ['_UNICODE_STRING']],
    'RealtimeWriteOffset' : [ 0x120, ['_LARGE_INTEGER']],
    'RealtimeReadOffset' : [ 0x128, ['_LARGE_INTEGER']],
    'RealtimeLogfileSize' : [ 0x130, ['_LARGE_INTEGER']],
    'RealtimeLogfileUsage' : [ 0x138, ['unsigned long long']],
    'RealtimeMaximumFileSize' : [ 0x140, ['unsigned long long']],
    'RealtimeBuffersSaved' : [ 0x148, ['unsigned long']],
    'RealtimeReferenceTime' : [ 0x150, ['_ETW_REF_CLOCK']],
    'NewRTEventsLost' : [ 0x160, ['Enumeration', dict(target = 'long', choices = {0: u'EtwRtEventNoLoss', 1: u'EtwRtEventLost', 2: u'EtwRtBufferLost', 3: u'EtwRtBackupLost', 4: u'EtwRtEventLossMax'})]],
    'LoggerEvent' : [ 0x164, ['_KEVENT']],
    'FlushEvent' : [ 0x174, ['_KEVENT']],
    'FlushTimeOutTimer' : [ 0x188, ['_KTIMER']],
    'LoggerDpc' : [ 0x1b0, ['_KDPC']],
    'LoggerMutex' : [ 0x1d0, ['_KMUTANT']],
    'LoggerLock' : [ 0x1f0, ['_EX_PUSH_LOCK']],
    'BufferListSpinLock' : [ 0x1f4, ['unsigned long']],
    'BufferListPushLock' : [ 0x1f4, ['_EX_PUSH_LOCK']],
    'ClientSecurityContext' : [ 0x1f8, ['_SECURITY_CLIENT_CONTEXT']],
    'TokenAccessInformation' : [ 0x234, ['pointer', ['_TOKEN_ACCESS_INFORMATION']]],
    'SecurityDescriptor' : [ 0x238, ['_EX_FAST_REF']],
    'StartTime' : [ 0x240, ['_LARGE_INTEGER']],
    'LogFileHandle' : [ 0x248, ['pointer', ['void']]],
    'BufferSequenceNumber' : [ 0x250, ['long long']],
    'Flags' : [ 0x258, ['unsigned long']],
    'Persistent' : [ 0x258, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AutoLogger' : [ 0x258, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'FsReady' : [ 0x258, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'RealTime' : [ 0x258, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Wow' : [ 0x258, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'KernelTrace' : [ 0x258, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'NoMoreEnable' : [ 0x258, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'StackTracing' : [ 0x258, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ErrorLogged' : [ 0x258, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'RealtimeLoggerContextFreed' : [ 0x258, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'PebsTracing' : [ 0x258, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'PmcCounters' : [ 0x258, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'PageAlignBuffers' : [ 0x258, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'StackLookasideListAllocated' : [ 0x258, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'SecurityTrace' : [ 0x258, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'SpareFlags1' : [ 0x258, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'SystemLoggerIndex' : [ 0x258, ['BitField', dict(start_bit = 16, end_bit = 24, native_type='unsigned long')]],
    'StackCaching' : [ 0x258, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'SpareFlags2' : [ 0x258, ['BitField', dict(start_bit = 25, end_bit = 32, native_type='unsigned long')]],
    'RequestFlag' : [ 0x25c, ['unsigned long']],
    'DbgRequestNewFile' : [ 0x25c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DbgRequestUpdateFile' : [ 0x25c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DbgRequestFlush' : [ 0x25c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DbgRequestDisableRealtime' : [ 0x25c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DbgRequestDisconnectConsumer' : [ 0x25c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DbgRequestConnectConsumer' : [ 0x25c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DbgRequestNotifyConsumer' : [ 0x25c, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DbgRequestUpdateHeader' : [ 0x25c, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'DbgRequestDeferredFlush' : [ 0x25c, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'DbgRequestDeferredFlushTimer' : [ 0x25c, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DbgRequestFlushTimer' : [ 0x25c, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'DbgRequestUpdateDebugger' : [ 0x25c, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DbgSpareRequestFlags' : [ 0x25c, ['BitField', dict(start_bit = 12, end_bit = 32, native_type='unsigned long')]],
    'HookIdMap' : [ 0x260, ['_RTL_BITMAP']],
    'StackCache' : [ 0x268, ['pointer', ['_ETW_STACK_CACHE']]],
    'PmcData' : [ 0x26c, ['pointer', ['_ETW_PMC_SUPPORT']]],
    'WinRtProviderBinaryList' : [ 0x270, ['_LIST_ENTRY']],
    'ScratchArray' : [ 0x278, ['pointer', ['pointer', ['_WMI_BUFFER_HEADER']]]],
    'DisallowedGuids' : [ 0x27c, ['_DISALLOWED_GUIDS']],
    'ServerSilo' : [ 0x284, ['pointer', ['_ESILO']]],
} ],
  '_ETW_PMC_SUPPORT' : [ 0x24, {
    'Source' : [ 0x0, ['array', 4, ['Enumeration', dict(target = 'long', choices = {0: u'ProfileTime', 1: u'ProfileAlignmentFixup', 2: u'ProfileTotalIssues', 3: u'ProfilePipelineDry', 4: u'ProfileLoadInstructions', 5: u'ProfilePipelineFrozen', 6: u'ProfileBranchInstructions', 7: u'ProfileTotalNonissues', 8: u'ProfileDcacheMisses', 9: u'ProfileIcacheMisses', 10: u'ProfileCacheMisses', 11: u'ProfileBranchMispredictions', 12: u'ProfileStoreInstructions', 13: u'ProfileFpInstructions', 14: u'ProfileIntegerInstructions', 15: u'Profile2Issue', 16: u'Profile3Issue', 17: u'Profile4Issue', 18: u'ProfileSpecialInstructions', 19: u'ProfileTotalCycles', 20: u'ProfileIcacheIssues', 21: u'ProfileDcacheAccesses', 22: u'ProfileMemoryBarrierCycles', 23: u'ProfileLoadLinkedIssues', 24: u'ProfileMaximum'})]]],
    'HookIdCount' : [ 0x10, ['unsigned long']],
    'HookId' : [ 0x14, ['array', 4, ['unsigned short']]],
    'CountersCount' : [ 0x1c, ['unsigned long']],
    'ProcessorCtrs' : [ 0x20, ['array', 1, ['pointer', ['_HAL_PMC_COUNTERS']]]],
} ],
  '_ETW_LOGGER_HANDLE' : [ 0x1, {
    'DereferenceAndLeave' : [ 0x0, ['unsigned char']],
} ],
  '_ETW_SILODRIVERSTATE' : [ 0x190, {
    'EtwpSecurityProviderPID' : [ 0x0, ['unsigned long']],
    'EtwpSecurityProviderGuidEntry' : [ 0x8, ['_ETW_GUID_ENTRY']],
    'AuditLoggerId' : [ 0x168, ['unsigned long']],
    'EtwPsProvRegHandle' : [ 0x170, ['unsigned long long']],
    'EtwpSecurityLoggers' : [ 0x178, ['array', 8, ['unsigned short']]],
    'EtwpSecurityProviderEnableMask' : [ 0x188, ['unsigned char']],
    'EtwpShutdownInProgress' : [ 0x189, ['unsigned char']],
} ],
  '_LUID_AND_ATTRIBUTES' : [ 0xc, {
    'Luid' : [ 0x0, ['_LUID']],
    'Attributes' : [ 0x8, ['unsigned long']],
} ],
  '_TOKEN' : [ 0x298, {
    'TokenSource' : [ 0x0, ['_TOKEN_SOURCE']],
    'TokenId' : [ 0x10, ['_LUID']],
    'AuthenticationId' : [ 0x18, ['_LUID']],
    'ParentTokenId' : [ 0x20, ['_LUID']],
    'ExpirationTime' : [ 0x28, ['_LARGE_INTEGER']],
    'TokenLock' : [ 0x30, ['pointer', ['_ERESOURCE']]],
    'ModifiedId' : [ 0x34, ['_LUID']],
    'Privileges' : [ 0x40, ['_SEP_TOKEN_PRIVILEGES']],
    'AuditPolicy' : [ 0x58, ['_SEP_AUDIT_POLICY']],
    'SessionId' : [ 0x78, ['unsigned long']],
    'UserAndGroupCount' : [ 0x7c, ['unsigned long']],
    'RestrictedSidCount' : [ 0x80, ['unsigned long']],
    'VariableLength' : [ 0x84, ['unsigned long']],
    'DynamicCharged' : [ 0x88, ['unsigned long']],
    'DynamicAvailable' : [ 0x8c, ['unsigned long']],
    'DefaultOwnerIndex' : [ 0x90, ['unsigned long']],
    'UserAndGroups' : [ 0x94, ['pointer', ['_SID_AND_ATTRIBUTES']]],
    'RestrictedSids' : [ 0x98, ['pointer', ['_SID_AND_ATTRIBUTES']]],
    'PrimaryGroup' : [ 0x9c, ['pointer', ['void']]],
    'DynamicPart' : [ 0xa0, ['pointer', ['unsigned long']]],
    'DefaultDacl' : [ 0xa4, ['pointer', ['_ACL']]],
    'TokenType' : [ 0xa8, ['Enumeration', dict(target = 'long', choices = {1: u'TokenPrimary', 2: u'TokenImpersonation'})]],
    'ImpersonationLevel' : [ 0xac, ['Enumeration', dict(target = 'long', choices = {0: u'SecurityAnonymous', 1: u'SecurityIdentification', 2: u'SecurityImpersonation', 3: u'SecurityDelegation'})]],
    'TokenFlags' : [ 0xb0, ['unsigned long']],
    'TokenInUse' : [ 0xb4, ['unsigned char']],
    'IntegrityLevelIndex' : [ 0xb8, ['unsigned long']],
    'MandatoryPolicy' : [ 0xbc, ['unsigned long']],
    'LogonSession' : [ 0xc0, ['pointer', ['_SEP_LOGON_SESSION_REFERENCES']]],
    'OriginatingLogonSession' : [ 0xc4, ['_LUID']],
    'SidHash' : [ 0xcc, ['_SID_AND_ATTRIBUTES_HASH']],
    'RestrictedSidHash' : [ 0x154, ['_SID_AND_ATTRIBUTES_HASH']],
    'pSecurityAttributes' : [ 0x1dc, ['pointer', ['_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION']]],
    'Package' : [ 0x1e0, ['pointer', ['void']]],
    'Capabilities' : [ 0x1e4, ['pointer', ['_SID_AND_ATTRIBUTES']]],
    'CapabilityCount' : [ 0x1e8, ['unsigned long']],
    'CapabilitiesHash' : [ 0x1ec, ['_SID_AND_ATTRIBUTES_HASH']],
    'LowboxNumberEntry' : [ 0x274, ['pointer', ['_SEP_LOWBOX_NUMBER_ENTRY']]],
    'LowboxHandlesEntry' : [ 0x278, ['pointer', ['_SEP_LOWBOX_HANDLES_ENTRY']]],
    'pClaimAttributes' : [ 0x27c, ['pointer', ['_AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION']]],
    'TrustLevelSid' : [ 0x280, ['pointer', ['void']]],
    'TrustLinkedToken' : [ 0x284, ['pointer', ['_TOKEN']]],
    'IntegrityLevelSidValue' : [ 0x288, ['pointer', ['void']]],
    'TokenSidValues' : [ 0x28c, ['pointer', ['_SEP_SID_VALUES_BLOCK']]],
    'SessionObject' : [ 0x290, ['pointer', ['void']]],
    'VariablePart' : [ 0x294, ['unsigned long']],
} ],
  '_SEP_LOGON_SESSION_REFERENCES' : [ 0x5c, {
    'Next' : [ 0x0, ['pointer', ['_SEP_LOGON_SESSION_REFERENCES']]],
    'LogonId' : [ 0x4, ['_LUID']],
    'BuddyLogonId' : [ 0xc, ['_LUID']],
    'ReferenceCount' : [ 0x14, ['long']],
    'Flags' : [ 0x18, ['unsigned long']],
    'pDeviceMap' : [ 0x1c, ['pointer', ['_DEVICE_MAP']]],
    'Token' : [ 0x20, ['pointer', ['void']]],
    'AccountName' : [ 0x24, ['_UNICODE_STRING']],
    'AuthorityName' : [ 0x2c, ['_UNICODE_STRING']],
    'LowBoxHandlesTable' : [ 0x34, ['_SEP_LOWBOX_HANDLES_TABLE']],
    'SharedDataLock' : [ 0x3c, ['_EX_PUSH_LOCK']],
    'SharedClaimAttributes' : [ 0x40, ['pointer', ['_AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION']]],
    'SharedSidValues' : [ 0x44, ['pointer', ['_SEP_SID_VALUES_BLOCK']]],
    'RevocationBlock' : [ 0x48, ['_OB_HANDLE_REVOCATION_BLOCK']],
    'ServerSilo' : [ 0x58, ['pointer', ['_ESILO']]],
} ],
  '_OBJECT_HEADER' : [ 0x20, {
    'PointerCount' : [ 0x0, ['long']],
    'HandleCount' : [ 0x4, ['long']],
    'NextToFree' : [ 0x4, ['pointer', ['void']]],
    'Lock' : [ 0x8, ['_EX_PUSH_LOCK']],
    'TypeIndex' : [ 0xc, ['unsigned char']],
    'TraceFlags' : [ 0xd, ['unsigned char']],
    'DbgRefTrace' : [ 0xd, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'DbgTracePermanent' : [ 0xd, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'InfoMask' : [ 0xe, ['unsigned char']],
    'Flags' : [ 0xf, ['unsigned char']],
    'NewObject' : [ 0xf, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'KernelObject' : [ 0xf, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'KernelOnlyAccess' : [ 0xf, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'ExclusiveObject' : [ 0xf, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'PermanentObject' : [ 0xf, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'DefaultSecurityQuota' : [ 0xf, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'SingleHandleEntry' : [ 0xf, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'DeletedInline' : [ 0xf, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'ObjectCreateInfo' : [ 0x10, ['pointer', ['_OBJECT_CREATE_INFORMATION']]],
    'QuotaBlockCharged' : [ 0x10, ['pointer', ['void']]],
    'SecurityDescriptor' : [ 0x14, ['pointer', ['void']]],
    'Body' : [ 0x18, ['_QUAD']],
} ],
  '_OBJECT_HEADER_QUOTA_INFO' : [ 0x10, {
    'PagedPoolCharge' : [ 0x0, ['unsigned long']],
    'NonPagedPoolCharge' : [ 0x4, ['unsigned long']],
    'SecurityDescriptorCharge' : [ 0x8, ['unsigned long']],
    'SecurityDescriptorQuotaBlock' : [ 0xc, ['pointer', ['void']]],
} ],
  '_OBJECT_HEADER_PROCESS_INFO' : [ 0x8, {
    'ExclusiveProcess' : [ 0x0, ['pointer', ['_EPROCESS']]],
    'Reserved' : [ 0x4, ['unsigned long']],
} ],
  '_OBJECT_HEADER_HANDLE_INFO' : [ 0x8, {
    'HandleCountDataBase' : [ 0x0, ['pointer', ['_OBJECT_HANDLE_COUNT_DATABASE']]],
    'SingleEntry' : [ 0x0, ['_OBJECT_HANDLE_COUNT_ENTRY']],
} ],
  '_OBJECT_HEADER_NAME_INFO' : [ 0x10, {
    'Directory' : [ 0x0, ['pointer', ['_OBJECT_DIRECTORY']]],
    'Name' : [ 0x4, ['_UNICODE_STRING']],
    'ReferenceCount' : [ 0xc, ['long']],
} ],
  '_OBJECT_HEADER_CREATOR_INFO' : [ 0x10, {
    'TypeList' : [ 0x0, ['_LIST_ENTRY']],
    'CreatorUniqueProcess' : [ 0x8, ['pointer', ['void']]],
    'CreatorBackTraceIndex' : [ 0xc, ['unsigned short']],
    'Reserved' : [ 0xe, ['unsigned short']],
} ],
  '_OBJECT_HEADER_AUDIT_INFO' : [ 0x8, {
    'SecurityDescriptor' : [ 0x0, ['pointer', ['void']]],
    'Reserved' : [ 0x4, ['unsigned long']],
} ],
  '_OBJECT_HEADER_HANDLE_REVOCATION_INFO' : [ 0x10, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'RevocationBlock' : [ 0x8, ['pointer', ['_OB_HANDLE_REVOCATION_BLOCK']]],
    'Padding1' : [ 0xc, ['array', 4, ['unsigned char']]],
} ],
  '_OBP_LOOKUP_CONTEXT' : [ 0x18, {
    'Directory' : [ 0x0, ['pointer', ['_OBJECT_DIRECTORY']]],
    'Object' : [ 0x4, ['pointer', ['void']]],
    'EntryLink' : [ 0x8, ['pointer', ['pointer', ['_OBJECT_DIRECTORY_ENTRY']]]],
    'HashValue' : [ 0xc, ['unsigned long']],
    'HashIndex' : [ 0x10, ['unsigned short']],
    'DirectoryLocked' : [ 0x12, ['unsigned char']],
    'LockedExclusive' : [ 0x13, ['unsigned char']],
    'LockStateSignature' : [ 0x14, ['unsigned long']],
} ],
  '_OBJECT_DIRECTORY' : [ 0xb0, {
    'HashBuckets' : [ 0x0, ['array', 37, ['pointer', ['_OBJECT_DIRECTORY_ENTRY']]]],
    'Lock' : [ 0x94, ['_EX_PUSH_LOCK']],
    'DeviceMap' : [ 0x98, ['pointer', ['_DEVICE_MAP']]],
    'ShadowDirectory' : [ 0x9c, ['pointer', ['_OBJECT_DIRECTORY']]],
    'SessionId' : [ 0xa0, ['unsigned long']],
    'NamespaceEntry' : [ 0xa4, ['pointer', ['void']]],
    'SessionObject' : [ 0xa8, ['pointer', ['void']]],
    'Flags' : [ 0xac, ['unsigned long']],
} ],
  '_OBP_SILODRIVERSTATE' : [ 0x74, {
    'SystemDeviceMap' : [ 0x0, ['pointer', ['_DEVICE_MAP']]],
    'SystemDosDeviceState' : [ 0x4, ['_OBP_SYSTEM_DOS_DEVICE_STATE']],
    'DeviceMapLock' : [ 0x70, ['_EX_PUSH_LOCK']],
} ],
  '_DEVICE_MAP' : [ 0x34, {
    'DosDevicesDirectory' : [ 0x0, ['pointer', ['_OBJECT_DIRECTORY']]],
    'GlobalDosDevicesDirectory' : [ 0x4, ['pointer', ['_OBJECT_DIRECTORY']]],
    'DosDevicesDirectoryHandle' : [ 0x8, ['pointer', ['void']]],
    'ReferenceCount' : [ 0xc, ['long']],
    'DriveMap' : [ 0x10, ['unsigned long']],
    'DriveType' : [ 0x14, ['array', 32, ['unsigned char']]],
} ],
  '_WHEAP_INFO_BLOCK' : [ 0xc, {
    'ErrorSourceCount' : [ 0x0, ['unsigned long']],
    'ErrorSourceTable' : [ 0x4, ['pointer', ['_WHEAP_ERROR_SOURCE_TABLE']]],
    'WorkQueue' : [ 0x8, ['pointer', ['_WHEAP_WORK_QUEUE']]],
} ],
  '_WHEAP_ERROR_SOURCE' : [ 0x418, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'FailedAllocations' : [ 0x8, ['unsigned long']],
    'PlatformErrorSourceId' : [ 0xc, ['unsigned long']],
    'ErrorCount' : [ 0x10, ['long']],
    'RecordCount' : [ 0x14, ['unsigned long']],
    'RecordLength' : [ 0x18, ['unsigned long']],
    'PoolTag' : [ 0x1c, ['unsigned long']],
    'Type' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {0: u'WheaErrSrcTypeMCE', 1: u'WheaErrSrcTypeCMC', 2: u'WheaErrSrcTypeCPE', 3: u'WheaErrSrcTypeNMI', 4: u'WheaErrSrcTypePCIe', 5: u'WheaErrSrcTypeGeneric', 6: u'WheaErrSrcTypeINIT', 7: u'WheaErrSrcTypeBOOT', 8: u'WheaErrSrcTypeSCIGeneric', 9: u'WheaErrSrcTypeIPFMCA', 10: u'WheaErrSrcTypeIPFCMC', 11: u'WheaErrSrcTypeIPFCPE', 12: u'WheaErrSrcTypeMax'})]],
    'Records' : [ 0x24, ['pointer', ['_WHEAP_ERROR_RECORD_WRAPPER']]],
    'Context' : [ 0x28, ['pointer', ['void']]],
    'SectionCount' : [ 0x2c, ['unsigned long']],
    'SectionLength' : [ 0x30, ['unsigned long']],
    'TickCountAtLastError' : [ 0x38, ['_LARGE_INTEGER']],
    'AccumulatedErrors' : [ 0x40, ['unsigned long']],
    'TotalErrors' : [ 0x44, ['unsigned long']],
    'Deferred' : [ 0x48, ['unsigned char']],
    'Descriptor' : [ 0x49, ['_WHEA_ERROR_SOURCE_DESCRIPTOR']],
} ],
  '_WHEAP_ERROR_RECORD_WRAPPER' : [ 0xe4, {
    'WorkEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Length' : [ 0x8, ['unsigned long']],
    'ProcessorNumber' : [ 0xc, ['unsigned long']],
    'Flags' : [ 0x10, ['_WHEAP_ERROR_RECORD_WRAPPER_FLAGS']],
    'InUse' : [ 0x14, ['long']],
    'ErrorSource' : [ 0x18, ['pointer', ['_WHEAP_ERROR_SOURCE']]],
    'ErrorRecord' : [ 0x1c, ['_WHEA_ERROR_RECORD']],
} ],
  '_KSECONDARY_IDT_ENTRY' : [ 0x1c, {
    'SpinLock' : [ 0x0, ['unsigned long']],
    'ConnectLock' : [ 0x4, ['_KEVENT']],
    'LineMasked' : [ 0x14, ['unsigned char']],
    'InterruptList' : [ 0x18, ['pointer', ['_KINTERRUPT']]],
} ],
  '_WNF_STATE_NAME' : [ 0x8, {
    'Data' : [ 0x0, ['array', 2, ['unsigned long']]],
} ],
  '_PS_CLIENT_SECURITY_CONTEXT' : [ 0x4, {
    'ImpersonationData' : [ 0x0, ['unsigned long']],
    'ImpersonationToken' : [ 0x0, ['pointer', ['void']]],
    'ImpersonationLevel' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned long')]],
    'EffectiveOnly' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
} ],
  '_DBGKD_ANY_CONTROL_SET' : [ 0x1c, {
    'X86ControlSet' : [ 0x0, ['_X86_DBGKD_CONTROL_SET']],
    'AlphaControlSet' : [ 0x0, ['unsigned long']],
    'IA64ControlSet' : [ 0x0, ['_IA64_DBGKD_CONTROL_SET']],
    'Amd64ControlSet' : [ 0x0, ['_AMD64_DBGKD_CONTROL_SET']],
    'ArmControlSet' : [ 0x0, ['_ARM_DBGKD_CONTROL_SET']],
    'Arm64ControlSet' : [ 0x0, ['_ARM64_DBGKD_CONTROL_SET']],
    'ArmCeControlSet' : [ 0x0, ['_ARMCE_DBGKD_CONTROL_SET']],
    'PpcControlSet' : [ 0x0, ['_PPC_DBGKD_CONTROL_SET']],
} ],
  '_MI_VERIFIER_POOL_HEADER' : [ 0x4, {
    'VerifierPoolEntry' : [ 0x0, ['pointer', ['_VI_POOL_ENTRY']]],
} ],
  '_POP_FX_PLUGIN' : [ 0x70, {
    'Link' : [ 0x0, ['_LIST_ENTRY']],
    'Version' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0x10, ['unsigned long long']],
    'WorkQueue' : [ 0x18, ['_KQUEUE']],
    'AcceptDeviceNotification' : [ 0x40, ['pointer', ['void']]],
    'AcceptProcessorNotification' : [ 0x44, ['pointer', ['void']]],
    'AcceptAcpiNotification' : [ 0x48, ['pointer', ['void']]],
    'WorkOrderCount' : [ 0x4c, ['unsigned long']],
    'WorkOrders' : [ 0x50, ['array', 1, ['_POP_FX_WORK_ORDER']]],
} ],
  '_ARM_DBGKD_CONTROL_SET' : [ 0xc, {
    'Continue' : [ 0x0, ['unsigned long']],
    'CurrentSymbolStart' : [ 0x4, ['unsigned long']],
    'CurrentSymbolEnd' : [ 0x8, ['unsigned long']],
} ],
  '_LPCP_MESSAGE' : [ 0x30, {
    'Entry' : [ 0x0, ['_LIST_ENTRY']],
    'FreeEntry' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Reserved0' : [ 0x4, ['unsigned long']],
    'SenderPort' : [ 0x8, ['pointer', ['void']]],
    'RepliedToThread' : [ 0xc, ['pointer', ['_ETHREAD']]],
    'PortContext' : [ 0x10, ['pointer', ['void']]],
    'Request' : [ 0x18, ['_PORT_MESSAGE']],
} ],
  '_HARDWARE_PTE' : [ 0x8, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Write' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Owner' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'WriteThrough' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'CacheDisable' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'Accessed' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
    'Dirty' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long long')]],
    'LargePage' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long long')]],
    'Global' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'CopyOnWrite' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'Prototype' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'reserved0' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'PageFrameNumber' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 38, native_type='unsigned long long')]],
    'reserved1' : [ 0x0, ['BitField', dict(start_bit = 38, end_bit = 64, native_type='unsigned long long')]],
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
} ],
  '_ALPC_PORT_ATTRIBUTES' : [ 0x2c, {
    'Flags' : [ 0x0, ['unsigned long']],
    'SecurityQos' : [ 0x4, ['_SECURITY_QUALITY_OF_SERVICE']],
    'MaxMessageLength' : [ 0x10, ['unsigned long']],
    'MemoryBandwidth' : [ 0x14, ['unsigned long']],
    'MaxPoolUsage' : [ 0x18, ['unsigned long']],
    'MaxSectionSize' : [ 0x1c, ['unsigned long']],
    'MaxViewSize' : [ 0x20, ['unsigned long']],
    'MaxTotalSectionSize' : [ 0x24, ['unsigned long']],
    'DupObjectTypes' : [ 0x28, ['unsigned long']],
} ],
  '_MI_PARTITION_SEGMENTS' : [ 0xa8, {
    'DeleteSubsectionCleanup' : [ 0x0, ['_KEVENT']],
    'UnusedSegmentCleanup' : [ 0x10, ['_KEVENT']],
    'SubsectionDeletePtes' : [ 0x20, ['unsigned long']],
    'DereferenceSegmentHeader' : [ 0x24, ['_MMDEREFERENCE_SEGMENT_HEADER']],
    'DeleteOnCloseList' : [ 0x40, ['_LIST_ENTRY']],
    'DeleteOnCloseTimer' : [ 0x48, ['_KTIMER']],
    'DeleteOnCloseTimerActive' : [ 0x70, ['unsigned char']],
    'DeleteOnCloseCount' : [ 0x74, ['unsigned long']],
    'UnusedSegmentList' : [ 0x78, ['_LIST_ENTRY']],
    'UnusedSubsectionList' : [ 0x80, ['_LIST_ENTRY']],
    'DeleteSubsectionList' : [ 0x88, ['_LIST_ENTRY']],
    'ControlAreaDeleteEvent' : [ 0x90, ['_KEVENT']],
    'ControlAreaDeleteList' : [ 0xa0, ['_SINGLE_LIST_ENTRY']],
} ],
  '_KSTACK_COUNT' : [ 0x4, {
    'Value' : [ 0x0, ['long']],
    'State' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'StackCount' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
} ],
  '_KENTROPY_TIMING_STATE' : [ 0x128, {
    'EntropyCount' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x4, ['array', 64, ['unsigned long']]],
    'Dpc' : [ 0x104, ['_KDPC']],
    'LastDeliveredBuffer' : [ 0x124, ['unsigned long']],
} ],
  '_HEAP_UNPACKED_ENTRY' : [ 0x8, {
    'Size' : [ 0x0, ['unsigned short']],
    'Flags' : [ 0x2, ['unsigned char']],
    'SmallTagIndex' : [ 0x3, ['unsigned char']],
    'SubSegmentCode' : [ 0x0, ['unsigned long']],
    'PreviousSize' : [ 0x4, ['unsigned short']],
    'SegmentOffset' : [ 0x6, ['unsigned char']],
    'LFHFlags' : [ 0x6, ['unsigned char']],
    'UnusedBytes' : [ 0x7, ['unsigned char']],
} ],
  '_PEP_ACPI_SPB_RESOURCE' : [ 0x18, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: u'PepAcpiMemory', 1: u'PepAcpiIoPort', 2: u'PepAcpiInterrupt', 3: u'PepAcpiGpioIo', 4: u'PepAcpiGpioInt', 5: u'PepAcpiSpbI2c', 6: u'PepAcpiSpbSpi', 7: u'PepAcpiSpbUart', 8: u'PepAcpiExtendedMemory', 9: u'PepAcpiExtendedIo'})]],
    'Flags' : [ 0x4, ['_PEP_ACPI_RESOURCE_FLAGS']],
    'TypeSpecificFlags' : [ 0x8, ['unsigned short']],
    'ResourceSourceIndex' : [ 0xa, ['unsigned char']],
    'ResourceSourceName' : [ 0xc, ['pointer', ['_UNICODE_STRING']]],
    'VendorData' : [ 0x10, ['pointer', ['unsigned char']]],
    'VendorDataLength' : [ 0x14, ['unsigned short']],
} ],
  '_DISPATCHER_HEADER' : [ 0x10, {
    'Lock' : [ 0x0, ['long']],
    'LockNV' : [ 0x0, ['long']],
    'Type' : [ 0x0, ['unsigned char']],
    'Signalling' : [ 0x1, ['unsigned char']],
    'Size' : [ 0x2, ['unsigned char']],
    'Reserved1' : [ 0x3, ['unsigned char']],
    'TimerType' : [ 0x0, ['unsigned char']],
    'TimerControlFlags' : [ 0x1, ['unsigned char']],
    'Absolute' : [ 0x1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Wake' : [ 0x1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'EncodedTolerableDelay' : [ 0x1, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'Hand' : [ 0x2, ['unsigned char']],
    'TimerMiscFlags' : [ 0x3, ['unsigned char']],
    'Index' : [ 0x3, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Processor' : [ 0x3, ['BitField', dict(start_bit = 1, end_bit = 6, native_type='unsigned char')]],
    'Inserted' : [ 0x3, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'Expired' : [ 0x3, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'Timer2Type' : [ 0x0, ['unsigned char']],
    'Timer2Flags' : [ 0x1, ['unsigned char']],
    'Timer2Inserted' : [ 0x1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Timer2Expiring' : [ 0x1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Timer2CancelPending' : [ 0x1, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Timer2SetPending' : [ 0x1, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Timer2Running' : [ 0x1, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'Timer2Disabled' : [ 0x1, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'Timer2ReservedFlags' : [ 0x1, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'Timer2Reserved1' : [ 0x2, ['unsigned char']],
    'Timer2Reserved2' : [ 0x3, ['unsigned char']],
    'QueueType' : [ 0x0, ['unsigned char']],
    'QueueControlFlags' : [ 0x1, ['unsigned char']],
    'Abandoned' : [ 0x1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'DisableIncrement' : [ 0x1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'QueueReservedControlFlags' : [ 0x1, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'QueueSize' : [ 0x2, ['unsigned char']],
    'QueueReserved' : [ 0x3, ['unsigned char']],
    'ThreadType' : [ 0x0, ['unsigned char']],
    'ThreadSpecControl' : [ 0x1, ['unsigned char']],
    'SpecControlIbrs' : [ 0x1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'SpecControlStibp' : [ 0x1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'SpecControlReserved' : [ 0x1, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'ThreadControlFlags' : [ 0x2, ['unsigned char']],
    'CycleProfiling' : [ 0x2, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'CounterProfiling' : [ 0x2, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'GroupScheduling' : [ 0x2, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'AffinitySet' : [ 0x2, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Tagged' : [ 0x2, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'EnergyProfiling' : [ 0x2, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'Instrumented' : [ 0x2, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'ThreadReservedControlFlags' : [ 0x2, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'DebugActive' : [ 0x3, ['unsigned char']],
    'MutantType' : [ 0x0, ['unsigned char']],
    'MutantSize' : [ 0x1, ['unsigned char']],
    'DpcActive' : [ 0x2, ['unsigned char']],
    'MutantReserved' : [ 0x3, ['unsigned char']],
    'SignalState' : [ 0x4, ['long']],
    'WaitListHead' : [ 0x8, ['_LIST_ENTRY']],
} ],
  '_ETW_GUID_ENTRY' : [ 0x160, {
    'GuidList' : [ 0x0, ['_LIST_ENTRY']],
    'RefCount' : [ 0x8, ['long']],
    'Guid' : [ 0xc, ['_GUID']],
    'RegListHead' : [ 0x1c, ['_LIST_ENTRY']],
    'SecurityDescriptor' : [ 0x24, ['pointer', ['void']]],
    'LastEnable' : [ 0x28, ['_ETW_LAST_ENABLE_INFO']],
    'MatchId' : [ 0x28, ['unsigned long long']],
    'ProviderEnableInfo' : [ 0x38, ['_TRACE_ENABLE_INFO']],
    'EnableInfo' : [ 0x58, ['array', 8, ['_TRACE_ENABLE_INFO']]],
    'FilterData' : [ 0x158, ['pointer', ['_ETW_FILTER_HEADER']]],
    'ServerSilo' : [ 0x15c, ['pointer', ['_ESILO']]],
} ],
  '_VI_POOL_ENTRY' : [ 0x10, {
    'PageHeader' : [ 0x0, ['_VI_POOL_PAGE_HEADER']],
    'InUse' : [ 0x0, ['_VI_POOL_ENTRY_INUSE']],
    'NextFree' : [ 0x0, ['pointer', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_MM_PAGE_ACCESS_INFO' : [ 0x8, {
    'Flags' : [ 0x0, ['_MM_PAGE_ACCESS_INFO_FLAGS']],
    'FileOffset' : [ 0x0, ['unsigned long long']],
    'VirtualAddress' : [ 0x0, ['pointer', ['void']]],
    'DontUse0' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'Spare0' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'PointerProtoPte' : [ 0x4, ['pointer', ['void']]],
} ],
  '_MI_CONTROL_AREA_WAIT_BLOCK' : [ 0x1c, {
    'Next' : [ 0x0, ['pointer', ['_MI_CONTROL_AREA_WAIT_BLOCK']]],
    'WaitReason' : [ 0x4, ['unsigned long']],
    'WaitResponse' : [ 0x8, ['unsigned long']],
    'Gate' : [ 0xc, ['_KGATE']],
} ],
  '_HEAP_COUNTERS' : [ 0x5c, {
    'TotalMemoryReserved' : [ 0x0, ['unsigned long']],
    'TotalMemoryCommitted' : [ 0x4, ['unsigned long']],
    'TotalMemoryLargeUCR' : [ 0x8, ['unsigned long']],
    'TotalSizeInVirtualBlocks' : [ 0xc, ['unsigned long']],
    'TotalSegments' : [ 0x10, ['unsigned long']],
    'TotalUCRs' : [ 0x14, ['unsigned long']],
    'CommittOps' : [ 0x18, ['unsigned long']],
    'DeCommitOps' : [ 0x1c, ['unsigned long']],
    'LockAcquires' : [ 0x20, ['unsigned long']],
    'LockCollisions' : [ 0x24, ['unsigned long']],
    'CommitRate' : [ 0x28, ['unsigned long']],
    'DecommittRate' : [ 0x2c, ['unsigned long']],
    'CommitFailures' : [ 0x30, ['unsigned long']],
    'InBlockCommitFailures' : [ 0x34, ['unsigned long']],
    'PollIntervalCounter' : [ 0x38, ['unsigned long']],
    'DecommitsSinceLastCheck' : [ 0x3c, ['unsigned long']],
    'HeapPollInterval' : [ 0x40, ['unsigned long']],
    'AllocAndFreeOps' : [ 0x44, ['unsigned long']],
    'AllocationIndicesActive' : [ 0x48, ['unsigned long']],
    'InBlockDeccommits' : [ 0x4c, ['unsigned long']],
    'InBlockDeccomitSize' : [ 0x50, ['unsigned long']],
    'HighWatermarkSize' : [ 0x54, ['unsigned long']],
    'LastPolledSize' : [ 0x58, ['unsigned long']],
} ],
  '_TraceLoggingMetadata_t' : [ 0x10, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Size' : [ 0x4, ['unsigned short']],
    'Version' : [ 0x6, ['unsigned char']],
    'Flags' : [ 0x7, ['unsigned char']],
    'Magic' : [ 0x8, ['unsigned long long']],
} ],
  '_MI_VISIBLE_PARTITION' : [ 0xb80, {
    'LowestPhysicalPage' : [ 0x0, ['unsigned long']],
    'HighestPhysicalPage' : [ 0x4, ['unsigned long']],
    'NumberOfPhysicalPages' : [ 0x8, ['unsigned long']],
    'NumberOfPagingFiles' : [ 0xc, ['unsigned long']],
    'PagingFile' : [ 0x10, ['array', 16, ['pointer', ['_MMPAGING_FILE']]]],
    'AvailablePages' : [ 0x80, ['unsigned long']],
    'ResidentAvailablePages' : [ 0xc0, ['unsigned long']],
    'TotalCommittedPages' : [ 0xc4, ['unsigned long']],
    'ModifiedPageListHead' : [ 0x100, ['_MMPFNLIST']],
    'ModifiedNoWritePageListHead' : [ 0x140, ['_MMPFNLIST']],
    'TotalCommitLimit' : [ 0x154, ['unsigned long']],
    'TotalPagesForPagingFile' : [ 0x158, ['unsigned long']],
    'VadPhysicalPages' : [ 0x15c, ['unsigned long']],
    'ProcessLockedFilePages' : [ 0x160, ['unsigned long']],
    'ChargeCommitmentFailures' : [ 0x164, ['array', 4, ['unsigned long']]],
    'PageFileTraceIndex' : [ 0x174, ['long']],
    'PageFileTraces' : [ 0x178, ['array', 32, ['_MI_PAGEFILE_TRACES']]],
} ],
  '_OB_HANDLE_REVOCATION_BLOCK' : [ 0x10, {
    'RevocationInfos' : [ 0x0, ['_LIST_ENTRY']],
    'Lock' : [ 0x8, ['_EX_PUSH_LOCK']],
    'Rundown' : [ 0xc, ['_EX_RUNDOWN_REF']],
} ],
  '_SYSPTES_HEADER' : [ 0x8c, {
    'ListHead' : [ 0x0, ['array', 16, ['_LIST_ENTRY']]],
    'Count' : [ 0x80, ['unsigned long']],
    'NumberOfEntries' : [ 0x84, ['unsigned long']],
    'NumberOfEntriesPeak' : [ 0x88, ['unsigned long']],
} ],
  '_EXCEPTION_RECORD' : [ 0x50, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['pointer', ['_EXCEPTION_RECORD']]],
    'ExceptionAddress' : [ 0xc, ['pointer', ['void']]],
    'NumberParameters' : [ 0x10, ['unsigned long']],
    'ExceptionInformation' : [ 0x14, ['array', 15, ['unsigned long']]],
} ],
  '_MI_ACTIVE_WSLE_LISTHEAD' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long']],
    'Blink' : [ 0x4, ['unsigned long']],
} ],
  '_PENDING_RELATIONS_LIST_ENTRY' : [ 0x44, {
    'Link' : [ 0x0, ['_LIST_ENTRY']],
    'WorkItem' : [ 0x8, ['_WORK_QUEUE_ITEM']],
    'DeviceEvent' : [ 0x18, ['pointer', ['_PNP_DEVICE_EVENT_ENTRY']]],
    'DeviceObject' : [ 0x1c, ['pointer', ['_DEVICE_OBJECT']]],
    'RelationsList' : [ 0x20, ['pointer', ['_RELATION_LIST']]],
    'EjectIrp' : [ 0x24, ['pointer', ['_IRP']]],
    'Lock' : [ 0x28, ['Enumeration', dict(target = 'long', choices = {0: u'IRPLOCK_CANCELABLE', 1: u'IRPLOCK_CANCEL_STARTED', 2: u'IRPLOCK_CANCEL_COMPLETE', 3: u'IRPLOCK_COMPLETED'})]],
    'Problem' : [ 0x2c, ['unsigned long']],
    'ProfileChangingEject' : [ 0x30, ['unsigned char']],
    'DisplaySafeRemovalDialog' : [ 0x31, ['unsigned char']],
    'LightestSleepState' : [ 0x34, ['Enumeration', dict(target = 'long', choices = {0: u'PowerSystemUnspecified', 1: u'PowerSystemWorking', 2: u'PowerSystemSleeping1', 3: u'PowerSystemSleeping2', 4: u'PowerSystemSleeping3', 5: u'PowerSystemHibernate', 6: u'PowerSystemShutdown', 7: u'PowerSystemMaximum'})]],
    'DockInterface' : [ 0x38, ['pointer', ['DOCK_INTERFACE']]],
    'DequeuePending' : [ 0x3c, ['unsigned char']],
    'DeleteType' : [ 0x40, ['Enumeration', dict(target = 'long', choices = {0: u'QueryRemoveDevice', 1: u'CancelRemoveDevice', 2: u'RemoveDevice', 3: u'SurpriseRemoveDevice', 4: u'EjectDevice', 5: u'RemoveFailedDevice', 6: u'RemoveUnstartedFailedDevice', 7: u'MaxDeviceDeleteType'})]],
} ],
  '_PPM_PLATFORM_STATE' : [ 0xc0, {
    'Latency' : [ 0x0, ['unsigned long']],
    'BreakEvenDuration' : [ 0x4, ['unsigned long']],
    'VetoAccounting' : [ 0x8, ['_PPM_VETO_ACCOUNTING']],
    'TransitionDebugger' : [ 0x1c, ['unsigned char']],
    'Platform' : [ 0x1d, ['unsigned char']],
    'DependencyListCount' : [ 0x20, ['unsigned long']],
    'Processors' : [ 0x24, ['_KAFFINITY_EX']],
    'Name' : [ 0x30, ['_UNICODE_STRING']],
    'DependencyLists' : [ 0x38, ['pointer', ['_PPM_SELECTION_DEPENDENCY']]],
    'Synchronization' : [ 0x3c, ['_PPM_COORDINATED_SYNCHRONIZATION']],
    'EnterTime' : [ 0x40, ['unsigned long long']],
    'RefCount' : [ 0x80, ['long']],
    'CacheAlign0' : [ 0x80, ['array', 64, ['unsigned char']]],
} ],
  '_MI_SECTION_IMAGE_INFORMATION' : [ 0x38, {
    'ExportedImageInformation' : [ 0x0, ['_SECTION_IMAGE_INFORMATION']],
    'InternalImageInformation' : [ 0x30, ['_MI_EXTRA_IMAGE_INFORMATION']],
} ],
  '_TOKEN_ACCESS_INFORMATION' : [ 0x38, {
    'SidHash' : [ 0x0, ['pointer', ['_SID_AND_ATTRIBUTES_HASH']]],
    'RestrictedSidHash' : [ 0x4, ['pointer', ['_SID_AND_ATTRIBUTES_HASH']]],
    'Privileges' : [ 0x8, ['pointer', ['_TOKEN_PRIVILEGES']]],
    'AuthenticationId' : [ 0xc, ['_LUID']],
    'TokenType' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {1: u'TokenPrimary', 2: u'TokenImpersonation'})]],
    'ImpersonationLevel' : [ 0x18, ['Enumeration', dict(target = 'long', choices = {0: u'SecurityAnonymous', 1: u'SecurityIdentification', 2: u'SecurityImpersonation', 3: u'SecurityDelegation'})]],
    'MandatoryPolicy' : [ 0x1c, ['_TOKEN_MANDATORY_POLICY']],
    'Flags' : [ 0x20, ['unsigned long']],
    'AppContainerNumber' : [ 0x24, ['unsigned long']],
    'PackageSid' : [ 0x28, ['pointer', ['void']]],
    'CapabilitiesHash' : [ 0x2c, ['pointer', ['_SID_AND_ATTRIBUTES_HASH']]],
    'TrustLevelSid' : [ 0x30, ['pointer', ['void']]],
    'SecurityAttributes' : [ 0x34, ['pointer', ['void']]],
} ],
  '_CELL_DATA' : [ 0x50, {
    'u' : [ 0x0, ['_u']],
} ],
  '_INITIAL_PRIVILEGE_SET' : [ 0x2c, {
    'PrivilegeCount' : [ 0x0, ['unsigned long']],
    'Control' : [ 0x4, ['unsigned long']],
    'Privilege' : [ 0x8, ['array', 3, ['_LUID_AND_ATTRIBUTES']]],
} ],
  '_HEAP_TUNING_PARAMETERS' : [ 0x8, {
    'CommittThresholdShift' : [ 0x0, ['unsigned long']],
    'MaxPreCommittThreshold' : [ 0x4, ['unsigned long']],
} ],
  '_MMWSLE_NONDIRECT_HASH' : [ 0x8, {
    'Key' : [ 0x0, ['pointer', ['void']]],
    'Index' : [ 0x4, ['unsigned long']],
} ],
  '_POP_FX_WORK_ORDER' : [ 0x1c, {
    'WorkItem' : [ 0x0, ['_WORK_QUEUE_ITEM']],
    'WorkCount' : [ 0x10, ['long']],
    'Context' : [ 0x14, ['pointer', ['void']]],
    'WatchdogTimerInfo' : [ 0x18, ['pointer', ['_POP_FX_WORK_ORDER_WATCHDOG_INFO']]],
} ],
  '_SEGMENT_FLAGS' : [ 0x4, {
    'TotalNumberOfPtes4132' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 10, native_type='unsigned short')]],
    'Spare0' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned short')]],
    'LargePages' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned short')]],
    'DebugSymbolsLoaded' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned short')]],
    'WriteCombined' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned short')]],
    'NoCache' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned short')]],
    'Short0' : [ 0x0, ['unsigned short']],
    'FloppyMedia' : [ 0x2, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'DefaultProtectionMask' : [ 0x2, ['BitField', dict(start_bit = 1, end_bit = 6, native_type='unsigned char')]],
    'Binary32' : [ 0x2, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'ContainsDebug' : [ 0x2, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'UChar1' : [ 0x2, ['unsigned char']],
    'ForceCollision' : [ 0x3, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'ImageSigningType' : [ 0x3, ['BitField', dict(start_bit = 1, end_bit = 4, native_type='unsigned char')]],
    'ImageSigningLevel' : [ 0x3, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'UChar2' : [ 0x3, ['unsigned char']],
} ],
  '_KTIMER_EXPIRATION_TRACE' : [ 0x10, {
    'InterruptTime' : [ 0x0, ['unsigned long long']],
    'PerformanceCounter' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '_POOL_TRACKER_BIG_PAGES' : [ 0x10, {
    'Va' : [ 0x0, ['unsigned long']],
    'Key' : [ 0x4, ['unsigned long']],
    'Pattern' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
    'PoolType' : [ 0x8, ['BitField', dict(start_bit = 8, end_bit = 20, native_type='unsigned long')]],
    'SlushSize' : [ 0x8, ['BitField', dict(start_bit = 20, end_bit = 32, native_type='unsigned long')]],
    'NumberOfBytes' : [ 0xc, ['unsigned long']],
} ],
  'tagSWITCH_CONTEXT_DATA' : [ 0x50, {
    'ullOsMaxVersionTested' : [ 0x0, ['unsigned long long']],
    'ulTargetPlatform' : [ 0x8, ['unsigned long']],
    'ullContextMinimum' : [ 0x10, ['unsigned long long']],
    'guPlatform' : [ 0x18, ['_GUID']],
    'guMinPlatform' : [ 0x28, ['_GUID']],
    'ulContextSource' : [ 0x38, ['unsigned long']],
    'ulElementCount' : [ 0x3c, ['unsigned long']],
    'guElements' : [ 0x40, ['array', 1, ['_GUID']]],
} ],
  '_WHEAP_ERROR_SOURCE_TABLE' : [ 0x20, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Count' : [ 0x4, ['long']],
    'Items' : [ 0x8, ['_LIST_ENTRY']],
    'InsertLock' : [ 0x10, ['_KEVENT']],
} ],
  '_TEB_ACTIVE_FRAME' : [ 0xc, {
    'Flags' : [ 0x0, ['unsigned long']],
    'Previous' : [ 0x4, ['pointer', ['_TEB_ACTIVE_FRAME']]],
    'Context' : [ 0x8, ['pointer', ['_TEB_ACTIVE_FRAME_CONTEXT']]],
} ],
  '_FILE_GET_QUOTA_INFORMATION' : [ 0x14, {
    'NextEntryOffset' : [ 0x0, ['unsigned long']],
    'SidLength' : [ 0x4, ['unsigned long']],
    'Sid' : [ 0x8, ['_SID']],
} ],
  '_ACCESS_REASONS' : [ 0x80, {
    'Data' : [ 0x0, ['array', 32, ['unsigned long']]],
} ],
  '_CM_KEY_BODY' : [ 0x2c, {
    'Type' : [ 0x0, ['unsigned long']],
    'KeyControlBlock' : [ 0x4, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'NotifyBlock' : [ 0x8, ['pointer', ['_CM_NOTIFY_BLOCK']]],
    'ProcessID' : [ 0xc, ['pointer', ['void']]],
    'KeyBodyList' : [ 0x10, ['_LIST_ENTRY']],
    'Flags' : [ 0x18, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'HandleTags' : [ 0x18, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
    'KtmTrans' : [ 0x1c, ['pointer', ['void']]],
    'KtmUow' : [ 0x20, ['pointer', ['_GUID']]],
    'ContextListHead' : [ 0x24, ['_LIST_ENTRY']],
} ],
  '_KWAIT_BLOCK' : [ 0x18, {
    'WaitListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'WaitType' : [ 0x8, ['unsigned char']],
    'BlockState' : [ 0x9, ['unsigned char']],
    'WaitKey' : [ 0xa, ['unsigned short']],
    'Thread' : [ 0xc, ['pointer', ['_KTHREAD']]],
    'NotificationQueue' : [ 0xc, ['pointer', ['_KQUEUE']]],
    'Object' : [ 0x10, ['pointer', ['void']]],
    'SparePtr' : [ 0x14, ['pointer', ['void']]],
} ],
  '_ARM64_DBGKD_CONTROL_SET' : [ 0x18, {
    'Continue' : [ 0x0, ['unsigned long']],
    'TraceFlag' : [ 0x4, ['unsigned long']],
    'CurrentSymbolStart' : [ 0x8, ['unsigned long long']],
    'CurrentSymbolEnd' : [ 0x10, ['unsigned long long']],
} ],
  '_MMPTE_PROTOTYPE' : [ 0x8, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'DemandFillProto' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'HiberVerifyConverted' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'Unused1' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned long long')]],
    'ReadOnly' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'Combined' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'Prototype' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'Protection' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 16, native_type='unsigned long long')]],
    'Unused' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long long')]],
    'ProtoAddress' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_WHEA_ERROR_PACKET_FLAGS' : [ 0x4, {
    'PreviousError' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'HypervisorError' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Simulated' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'PlatformPfaControl' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'PlatformDirectedOffline' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_THERMAL_INFORMATION_EX' : [ 0x58, {
    'ThermalStamp' : [ 0x0, ['unsigned long']],
    'ThermalConstant1' : [ 0x4, ['unsigned long']],
    'ThermalConstant2' : [ 0x8, ['unsigned long']],
    'SamplingPeriod' : [ 0xc, ['unsigned long']],
    'CurrentTemperature' : [ 0x10, ['unsigned long']],
    'PassiveTripPoint' : [ 0x14, ['unsigned long']],
    'ThermalStandbyTripPoint' : [ 0x18, ['unsigned long']],
    'CriticalTripPoint' : [ 0x1c, ['unsigned long']],
    'ActiveTripPointCount' : [ 0x20, ['unsigned char']],
    'ActiveTripPoint' : [ 0x24, ['array', 10, ['unsigned long']]],
    'S4TransitionTripPoint' : [ 0x4c, ['unsigned long']],
    'MinimumThrottle' : [ 0x50, ['unsigned long']],
    'OverThrottleThreshold' : [ 0x54, ['unsigned long']],
} ],
  '__unnamed_1e59' : [ 0x4, {
    'FilePointerIndex' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 9, native_type='unsigned long')]],
    'HardFault' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'Image' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'Spare0' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
} ],
  '__unnamed_1e5b' : [ 0x4, {
    'FilePointerIndex' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 9, native_type='unsigned long')]],
    'HardFault' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'Spare1' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
} ],
  '_MM_PAGE_ACCESS_INFO_FLAGS' : [ 0x4, {
    'File' : [ 0x0, ['__unnamed_1e59']],
    'Private' : [ 0x0, ['__unnamed_1e5b']],
} ],
  '_KTIMER2' : [ 0x58, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'RbNodes' : [ 0x10, ['array', 2, ['_RTL_BALANCED_NODE']]],
    'ListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'DueTime' : [ 0x28, ['unsigned long long']],
    'MaximumDueTime' : [ 0x30, ['unsigned long long']],
    'Period' : [ 0x38, ['long long']],
    'Callback' : [ 0x40, ['pointer', ['void']]],
    'CallbackContext' : [ 0x44, ['pointer', ['void']]],
    'DisableCallback' : [ 0x48, ['pointer', ['void']]],
    'DisableContext' : [ 0x4c, ['pointer', ['void']]],
    'AbsoluteSystemTime' : [ 0x50, ['unsigned char']],
    'TypeFlags' : [ 0x51, ['unsigned char']],
    'Plain' : [ 0x51, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'IdleResilient' : [ 0x51, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'HighResolution' : [ 0x51, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'NoWake' : [ 0x51, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'NoWakeFinite' : [ 0x51, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'Unused' : [ 0x51, ['BitField', dict(start_bit = 5, end_bit = 8, native_type='unsigned char')]],
} ],
  '_VI_VERIFIER_ISSUE' : [ 0x10, {
    'IssueType' : [ 0x0, ['unsigned long']],
    'Address' : [ 0x4, ['pointer', ['void']]],
    'Parameters' : [ 0x8, ['array', 2, ['unsigned long']]],
} ],
  '_MMSUBSECTION_FLAGS' : [ 0x4, {
    'SubsectionAccessed' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'Protection' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 6, native_type='unsigned short')]],
    'StartingSector4132' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 16, native_type='unsigned short')]],
    'SubsectionStatic' : [ 0x2, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'GlobalMemory' : [ 0x2, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'DirtyPages' : [ 0x2, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'OnDereferenceList' : [ 0x2, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'SectorEndOffset' : [ 0x2, ['BitField', dict(start_bit = 4, end_bit = 16, native_type='unsigned short')]],
} ],
  '_EXCEPTION_POINTERS' : [ 0x8, {
    'ExceptionRecord' : [ 0x0, ['pointer', ['_EXCEPTION_RECORD']]],
    'ContextRecord' : [ 0x4, ['pointer', ['_CONTEXT']]],
} ],
  '_KMUTANT' : [ 0x20, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'MutantListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'OwnerThread' : [ 0x18, ['pointer', ['_KTHREAD']]],
    'Abandoned' : [ 0x1c, ['unsigned char']],
    'ApcDisable' : [ 0x1d, ['unsigned char']],
} ],
  '_OBJECT_REF_INFO' : [ 0x1c, {
    'ObjectHeader' : [ 0x0, ['pointer', ['_OBJECT_HEADER']]],
    'NextRef' : [ 0x4, ['pointer', ['void']]],
    'ImageFileName' : [ 0x8, ['array', 16, ['unsigned char']]],
    'NextPos' : [ 0x18, ['unsigned short']],
    'MaxStacks' : [ 0x1a, ['unsigned short']],
    'StackInfo' : [ 0x1c, ['array', 0, ['_OBJECT_REF_STACK_INFO']]],
} ],
  '_HBIN' : [ 0x20, {
    'Signature' : [ 0x0, ['unsigned long']],
    'FileOffset' : [ 0x4, ['unsigned long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Reserved1' : [ 0xc, ['array', 2, ['unsigned long']]],
    'TimeStamp' : [ 0x14, ['_LARGE_INTEGER']],
    'Spare' : [ 0x1c, ['unsigned long']],
} ],
  '_MI_IMAGE_SECURITY_REFERENCE' : [ 0xc, {
    'DynamicRelocations' : [ 0x0, ['pointer', ['void']]],
    'SecurityContext' : [ 0x4, ['_IMAGE_SECURITY_CONTEXT']],
    'StrongImageReference' : [ 0x8, ['unsigned long']],
} ],
  '_AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION' : [ 0x130, {
    'DeviceGroupsCount' : [ 0x0, ['unsigned long']],
    'pDeviceGroups' : [ 0x4, ['pointer', ['_SID_AND_ATTRIBUTES']]],
    'RestrictedDeviceGroupsCount' : [ 0x8, ['unsigned long']],
    'pRestrictedDeviceGroups' : [ 0xc, ['pointer', ['_SID_AND_ATTRIBUTES']]],
    'DeviceGroupsHash' : [ 0x10, ['_SID_AND_ATTRIBUTES_HASH']],
    'RestrictedDeviceGroupsHash' : [ 0x98, ['_SID_AND_ATTRIBUTES_HASH']],
    'pUserSecurityAttributes' : [ 0x120, ['pointer', ['_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION']]],
    'pDeviceSecurityAttributes' : [ 0x124, ['pointer', ['_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION']]],
    'pRestrictedUserSecurityAttributes' : [ 0x128, ['pointer', ['_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION']]],
    'pRestrictedDeviceSecurityAttributes' : [ 0x12c, ['pointer', ['_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION']]],
} ],
  '_HEAP_TAG_ENTRY' : [ 0x40, {
    'Allocs' : [ 0x0, ['unsigned long']],
    'Frees' : [ 0x4, ['unsigned long']],
    'Size' : [ 0x8, ['unsigned long']],
    'TagIndex' : [ 0xc, ['unsigned short']],
    'CreatorBackTraceIndex' : [ 0xe, ['unsigned short']],
    'TagName' : [ 0x10, ['array', 24, ['wchar']]],
} ],
  '_MMPTE_HIGHLOW' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
} ],
  '_SECURITY_QUALITY_OF_SERVICE' : [ 0xc, {
    'Length' : [ 0x0, ['unsigned long']],
    'ImpersonationLevel' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: u'SecurityAnonymous', 1: u'SecurityIdentification', 2: u'SecurityImpersonation', 3: u'SecurityDelegation'})]],
    'ContextTrackingMode' : [ 0x8, ['unsigned char']],
    'EffectiveOnly' : [ 0x9, ['unsigned char']],
} ],
  '_MMWSLE_FREE_ENTRY' : [ 0x4, {
    'MustBeZero' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PreviousFree' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 12, native_type='unsigned long')]],
    'NextFree' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 32, native_type='unsigned long')]],
} ],
  '_NT_TIB' : [ 0x1c, {
    'ExceptionList' : [ 0x0, ['pointer', ['_EXCEPTION_REGISTRATION_RECORD']]],
    'StackBase' : [ 0x4, ['pointer', ['void']]],
    'StackLimit' : [ 0x8, ['pointer', ['void']]],
    'SubSystemTib' : [ 0xc, ['pointer', ['void']]],
    'FiberData' : [ 0x10, ['pointer', ['void']]],
    'Version' : [ 0x10, ['unsigned long']],
    'ArbitraryUserPointer' : [ 0x14, ['pointer', ['void']]],
    'Self' : [ 0x18, ['pointer', ['_NT_TIB']]],
} ],
  '_LEARNING_MODE_DATA' : [ 0x8, {
    'Settings' : [ 0x0, ['unsigned long']],
    'Enabled' : [ 0x4, ['unsigned char']],
    'PermissiveModeEnabled' : [ 0x5, ['unsigned char']],
} ],
  '_WHEA_REVISION' : [ 0x2, {
    'MinorRevision' : [ 0x0, ['unsigned char']],
    'MajorRevision' : [ 0x1, ['unsigned char']],
    'AsUSHORT' : [ 0x0, ['unsigned short']],
} ],
  '_EJOB' : [ 0x2f8, {
    'Event' : [ 0x0, ['_KEVENT']],
    'JobLinks' : [ 0x10, ['_LIST_ENTRY']],
    'ProcessListHead' : [ 0x18, ['_LIST_ENTRY']],
    'JobLock' : [ 0x20, ['_ERESOURCE']],
    'TotalUserTime' : [ 0x58, ['_LARGE_INTEGER']],
    'TotalKernelTime' : [ 0x60, ['_LARGE_INTEGER']],
