ntkrnlmp_types_additions = {
  'EX_QUEUE_WORKER_INFO': [ 0x4, {
    'QueueDisabled': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'MakeThreadsAsNecessary': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'WaitMode': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'WorkerCount': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 3}]],
    'QueueWorkerInfo': [0x0, ['long']],
   }],
  'POWER_ACTION_POLICY': [ 0xc, {
    'Action': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerActionNone', 1: 'PowerActionReserved', 2: 'PowerActionSleep', 3: 'PowerActionHibernate', 4: 'PowerActionShutdown', 5: 'PowerActionShutdownReset', 6: 'PowerActionShutdownOff', 7: 'PowerActionWarmEject'}}]],
    'Flags': [0x4, ['unsigned long']],
    'EventCode': [0x8, ['unsigned long']],
   }],
  'SYSTEM_POWER_CAPABILITIES': [ 0x4c, {
    'PowerButtonPresent': [0x0, ['unsigned char']],
    'SleepButtonPresent': [0x1, ['unsigned char']],
    'LidPresent': [0x2, ['unsigned char']],
    'SystemS1': [0x3, ['unsigned char']],
    'SystemS2': [0x4, ['unsigned char']],
    'SystemS3': [0x5, ['unsigned char']],
    'SystemS4': [0x6, ['unsigned char']],
    'SystemS5': [0x7, ['unsigned char']],
    'HiberFilePresent': [0x8, ['unsigned char']],
    'FullWake': [0x9, ['unsigned char']],
    'VideoDimPresent': [0xa, ['unsigned char']],
    'ApmPresent': [0xb, ['unsigned char']],
    'UpsPresent': [0xc, ['unsigned char']],
    'ThermalControl': [0xd, ['unsigned char']],
    'ProcessorThrottle': [0xe, ['unsigned char']],
    'ProcessorMinThrottle': [0xf, ['unsigned char']],
    'ProcessorMaxThrottle': [0x10, ['unsigned char']],
    'FastSystemS4': [0x11, ['unsigned char']],
    'spare2': [0x12, ['array', 3, ['unsigned char']]],
    'DiskSpinDown': [0x15, ['unsigned char']],
    'spare3': [0x16, ['array', 8, ['unsigned char']]],
    'SystemBatteriesPresent': [0x1e, ['unsigned char']],
    'BatteriesAreShortTerm': [0x1f, ['unsigned char']],
    'BatteryScale': [0x20, ['array', 3, ['BATTERY_REPORTING_SCALE']]],
    'AcOnLineWake': [0x38, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'SoftLidWake': [0x3c, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'RtcWake': [0x40, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'MinDeviceWakeState': [0x44, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'DefaultLowLatencyWake': [0x48, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
   }],
  'SYSTEM_POWER_LEVEL': [ 0x18, {
    'Enable': [0x0, ['unsigned char']],
    'Spare': [0x1, ['array', 3, ['unsigned char']]],
    'BatteryLevel': [0x4, ['unsigned long']],
    'PowerPolicy': [0x8, ['POWER_ACTION_POLICY']],
    'MinSystemState': [0x14, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
   }],
  '_ARBITER_LIST_ENTRY': [ 0x38, {
    'ListEntry': [0x0, ['_LIST_ENTRY']],
    'AlternativeCount': [0x8, ['unsigned long']],
    'Alternatives': [0xc, ['pointer', ['_IO_RESOURCE_DESCRIPTOR']]],
    'PhysicalDeviceObject': [0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'RequestSource': [0x14, ['Enumeration', {'target': 'long', 'choices': {0: 'ArbiterRequestLegacyReported', 1: 'ArbiterRequestHalReported', 2: 'ArbiterRequestLegacyAssigned', 3: 'ArbiterRequestPnpDetected', 4: 'ArbiterRequestPnpEnumerated', -1: 'ArbiterRequestUndefined'}}]],
    'Flags': [0x18, ['unsigned long']],
    'WorkSpace': [0x1c, ['long']],
    'InterfaceType': [0x20, ['Enumeration', {'target': 'long', 'choices': {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'}}]],
    'SlotNumber': [0x24, ['unsigned long']],
    'BusNumber': [0x28, ['unsigned long']],
    'Assignment': [0x2c, ['pointer', ['_CM_PARTIAL_RESOURCE_DESCRIPTOR']]],
    'SelectedAlternative': [0x30, ['pointer', ['_IO_RESOURCE_DESCRIPTOR']]],
    'Result': [0x34, ['Enumeration', {'target': 'long', 'choices': {0: 'ArbiterResultSuccess', 1: 'ArbiterResultExternalConflict', 2: 'ArbiterResultNullRequest', -1: 'ArbiterResultUndefined'}}]],
   }],
  '_BLOB_TYPE': [ 0x24, {
    'ResourceId': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'BLOB_TYPE_UNKNOWN', 1: 'BLOB_TYPE_CONNECTION_INFO', 2: 'BLOB_TYPE_MESSAGE', 3: 'BLOB_TYPE_SECURITY_CONTEXT', 4: 'BLOB_TYPE_SECTION', 5: 'BLOB_TYPE_REGION', 6: 'BLOB_TYPE_VIEW', 7: 'BLOB_TYPE_RESERVE', 8: 'BLOB_TYPE_DIRECT_TRANSFER', 9: 'BLOB_TYPE_HANDLE_DATA', 10: 'BLOB_TYPE_MAX_ID'}}]],
    'PoolTag': [0x4, ['unsigned long']],
    'Flags': [0x8, ['unsigned long']],
    'CreatedObjects': [0xc, ['unsigned long']],
    'DeletedObjects': [0x10, ['unsigned long']],
    'DeleteProcedure': [0x14, ['pointer', ['void']]],
    'DestroyProcedure': [0x18, ['pointer', ['void']]],
    'UsualSize': [0x1c, ['unsigned long']],
    'LookasideIndex': [0x20, ['unsigned long']],
   }],
  '_CACHE_DESCRIPTOR': [ 0xc, {
    'Level': [0x0, ['unsigned char']],
    'Associativity': [0x1, ['unsigned char']],
    'LineSize': [0x2, ['unsigned short']],
    'Size': [0x4, ['unsigned long']],
    'Type': [0x8, ['Enumeration', {'target': 'long', 'choices': {0: 'CacheUnified', 1: 'CacheInstruction', 2: 'CacheData', 3: 'CacheTrace'}}]],
   }],
  '_CM_FULL_RESOURCE_DESCRIPTOR': [ 0x20, {
    'InterfaceType': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'}}]],
    'BusNumber': [0x4, ['unsigned long']],
    'PartialResourceList': [0x8, ['_CM_PARTIAL_RESOURCE_LIST']],
   }],
  '_CM_KCB_UOW': [ 0x38, {
    'TransactionListEntry': [0x0, ['_LIST_ENTRY']],
    'KCBLock': [0x8, ['pointer', ['_CM_INTENT_LOCK']]],
    'KeyLock': [0xc, ['pointer', ['_CM_INTENT_LOCK']]],
    'KCBListEntry': [0x10, ['_LIST_ENTRY']],
    'KeyControlBlock': [0x18, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'Transaction': [0x1c, ['pointer', ['_CM_TRANS']]],
    'UoWState': [0x20, ['unsigned long']],
    'ActionType': [0x24, ['Enumeration', {'target': 'long', 'choices': {0: 'UoWAddThisKey', 1: 'UoWAddChildKey', 2: 'UoWDeleteThisKey', 3: 'UoWDeleteChildKey', 4: 'UoWSetValueNew', 5: 'UoWSetValueExisting', 6: 'UoWDeleteValue', 7: 'UoWSetKeyUserFlags', 8: 'UoWSetLastWriteTime', 9: 'UoWSetSecurityDescriptor', 10: 'UoWRenameSubKey', 11: 'UoWRenameOldSubKey', 12: 'UoWRenameNewSubKey', 13: 'UoWIsolation', 14: 'UoWInvalid'}}]],
    'StorageType': [0x28, ['Enumeration', {'target': 'long', 'choices': {0: 'Stable', 1: 'Volatile', 2: 'InvalidStorage'}}]],
    'TxSecurityCell': [0x30, ['unsigned long']],
    'LastWriteTime': [0x30, ['_LARGE_INTEGER']],
    'OldChildKCB': [0x30, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'OtherChildKCB': [0x30, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'OldValueCell': [0x30, ['unsigned long']],
    'ChildKCB': [0x30, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'UserFlags': [0x30, ['unsigned long']],
    'VolatileKeyCell': [0x30, ['unsigned long']],
    'NewChildKCB': [0x34, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'ThisVolatileKeyCell': [0x34, ['unsigned long']],
    'NewValueCell': [0x34, ['unsigned long']],
   }],
  '_CM_KEY_CONTROL_BLOCK': [ 0x90, {
    'RefCount': [0x0, ['unsigned long']],
    'ExtFlags': [0x4, ['BitField', {'end_bit': 9, 'start_bit': 0}]],
    'DelayedCloseIndex': [0x4, ['BitField', {'end_bit': 22, 'start_bit': 11}]],
    'PrivateAlloc': [0x4, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'Delete': [0x4, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'TotalLevels': [0x4, ['BitField', {'end_bit': 32, 'start_bit': 22}]],
    'ConvKey': [0x8, ['unsigned long']],
    'KeyHash': [0x8, ['_CM_KEY_HASH']],
    'NextHash': [0xc, ['pointer', ['_CM_KEY_HASH']]],
    'KeyHive': [0x10, ['pointer', ['_HHIVE']]],
    'KeyCell': [0x14, ['unsigned long']],
    'ParentKcb': [0x18, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'NameBlock': [0x1c, ['pointer', ['_CM_NAME_CONTROL_BLOCK']]],
    'CachedSecurity': [0x20, ['pointer', ['_CM_KEY_SECURITY_CACHE']]],
    'ValueCache': [0x24, ['_CACHED_CHILD_LIST']],
    'SubKeyCount': [0x2c, ['unsigned long']],
    'HashKey': [0x2c, ['unsigned long']],
    'IndexHint': [0x2c, ['pointer', ['_CM_INDEX_HINT_BLOCK']]],
    'KeyBodyListHead': [0x30, ['_LIST_ENTRY']],
    'FreeListEntry': [0x30, ['_LIST_ENTRY']],
    'KeyBodyArray': [0x38, ['array', 4, ['pointer', ['_CM_KEY_BODY']]]],
    'DelayCloseEntry': [0x48, ['pointer', ['void']]],
    'KcbLastWriteTime': [0x50, ['_LARGE_INTEGER']],
    'KcbMaxNameLen': [0x58, ['unsigned short']],
    'KcbMaxValueNameLen': [0x5a, ['unsigned short']],
    'KcbMaxValueDataLen': [0x5c, ['unsigned long']],
    'Flags': [0x60, ['BitField', {'end_bit': 32, 'start_bit': 16}]],
    'KcbVirtControlFlags': [0x60, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'KcbDebug': [0x60, ['BitField', {'end_bit': 16, 'start_bit': 8}]],
    'KcbUserFlags': [0x60, ['BitField', {'end_bit': 4, 'start_bit': 0}]],
    'KCBUoWListHead': [0x64, ['_LIST_ENTRY']],
    'TransKCBOwner': [0x6c, ['pointer', ['_CM_TRANS']]],
    'KCBLock': [0x70, ['_CM_INTENT_LOCK']],
    'KeyLock': [0x78, ['_CM_INTENT_LOCK']],
    'TransValueCache': [0x80, ['_CHILD_LIST']],
    'TransValueListOwner': [0x88, ['pointer', ['_CM_TRANS']]],
    'FullKCBName': [0x8c, ['pointer', ['_UNICODE_STRING']]],
   }],
  '_CM_KEY_NODE': [ 0x50, {
    'Signature': [0x0, ['unsigned short']],
    'Flags': [0x2, ['unsigned short']],
    'LastWriteTime': [0x4, ['_LARGE_INTEGER']],
    'Spare': [0xc, ['unsigned long']],
    'Parent': [0x10, ['unsigned long']],
    'SubKeyCounts': [0x14, ['array', 2, ['unsigned long']]],
    'SubKeyLists': [0x1c, ['array', 2, ['unsigned long']]],
    'ChildHiveReference': [0x1c, ['_CM_KEY_REFERENCE']],
    'ValueList': [0x24, ['_CHILD_LIST']],
    'Security': [0x2c, ['unsigned long']],
    'Class': [0x30, ['unsigned long']],
    'UserFlags': [0x34, ['BitField', {'end_bit': 20, 'start_bit': 16}]],
    'VirtControlFlags': [0x34, ['BitField', {'end_bit': 24, 'start_bit': 20}]],
    'Debug': [0x34, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'MaxNameLen': [0x34, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'MaxClassLen': [0x38, ['unsigned long']],
    'MaxValueNameLen': [0x3c, ['unsigned long']],
    'MaxValueDataLen': [0x40, ['unsigned long']],
    'WorkVar': [0x44, ['unsigned long']],
    'NameLength': [0x48, ['unsigned short']],
    'ClassLength': [0x4a, ['unsigned short']],
    'Name': [0x4c, ['array', 1, ['wchar']]],
   }],
  '_CM_NOTIFY_BLOCK': [ 0x2c, {
    'HiveList': [0x0, ['_LIST_ENTRY']],
    'PostList': [0x8, ['_LIST_ENTRY']],
    'KeyControlBlock': [0x10, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'KeyBody': [0x14, ['pointer', ['_CM_KEY_BODY']]],
    'Filter': [0x18, ['BitField', {'end_bit': 30, 'start_bit': 0}]],
    'WatchTree': [0x18, ['BitField', {'end_bit': 31, 'start_bit': 30}]],
    'NotifyPending': [0x18, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
    'SubjectContext': [0x1c, ['_SECURITY_SUBJECT_CONTEXT']],
   }],
  '_CONFIGURATION_COMPONENT': [ 0x24, {
    'Class': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'SystemClass', 1: 'ProcessorClass', 2: 'CacheClass', 3: 'AdapterClass', 4: 'ControllerClass', 5: 'PeripheralClass', 6: 'MemoryClass', 7: 'MaximumClass'}}]],
    'Type': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'ArcSystem', 1: 'CentralProcessor', 2: 'FloatingPointProcessor', 3: 'PrimaryIcache', 4: 'PrimaryDcache', 5: 'SecondaryIcache', 6: 'SecondaryDcache', 7: 'SecondaryCache', 8: 'EisaAdapter', 9: 'TcAdapter', 10: 'ScsiAdapter', 11: 'DtiAdapter', 12: 'MultiFunctionAdapter', 13: 'DiskController', 14: 'TapeController', 15: 'CdromController', 16: 'WormController', 17: 'SerialController', 18: 'NetworkController', 19: 'DisplayController', 20: 'ParallelController', 21: 'PointerController', 22: 'KeyboardController', 23: 'AudioController', 24: 'OtherController', 25: 'DiskPeripheral', 26: 'FloppyDiskPeripheral', 27: 'TapePeripheral', 28: 'ModemPeripheral', 29: 'MonitorPeripheral', 30: 'PrinterPeripheral', 31: 'PointerPeripheral', 32: 'KeyboardPeripheral', 33: 'TerminalPeripheral', 34: 'OtherPeripheral', 35: 'LinePeripheral', 36: 'NetworkPeripheral', 37: 'SystemMemory', 38: 'DockingInformation', 39: 'RealModeIrqRoutingTable', 40: 'RealModePCIEnumeration', 41: 'MaximumType'}}]],
    'Flags': [0x8, ['_DEVICE_FLAGS']],
    'Version': [0xc, ['unsigned short']],
    'Revision': [0xe, ['unsigned short']],
    'Key': [0x10, ['unsigned long']],
    'AffinityMask': [0x14, ['unsigned long']],
    'ConfigurationDataLength': [0x18, ['unsigned long']],
    'IdentifierLength': [0x1c, ['unsigned long']],
    'Identifier': [0x20, ['pointer', ['unsigned char']]],
   }],
  '_DEVICE_CAPABILITIES': [ 0x40, {
    'Size': [0x0, ['unsigned short']],
    'Version': [0x2, ['unsigned short']],
    'WarmEjectSupported': [0x4, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'NoDisplayInUI': [0x4, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'Removable': [0x4, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'HardwareDisabled': [0x4, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'NonDynamic': [0x4, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'RawDeviceOK': [0x4, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'SilentInstall': [0x4, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'DeviceD2': [0x4, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'DeviceD1': [0x4, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'EjectSupported': [0x4, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Reserved': [0x4, ['BitField', {'end_bit': 32, 'start_bit': 18}]],
    'DockDevice': [0x4, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'WakeFromD2': [0x4, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'WakeFromD3': [0x4, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'WakeFromD0': [0x4, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'WakeFromD1': [0x4, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'LockSupported': [0x4, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'UniqueID': [0x4, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'SurpriseRemovalOK': [0x4, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'Address': [0x8, ['unsigned long']],
    'UINumber': [0xc, ['unsigned long']],
    'DeviceState': [0x10, ['array', -28, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerDeviceUnspecified', 1: 'PowerDeviceD0', 2: 'PowerDeviceD1', 3: 'PowerDeviceD2', 4: 'PowerDeviceD3', 5: 'PowerDeviceMaximum'}}]]],
    'SystemWake': [0x2c, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'DeviceWake': [0x30, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerDeviceUnspecified', 1: 'PowerDeviceD0', 2: 'PowerDeviceD1', 3: 'PowerDeviceD2', 4: 'PowerDeviceD3', 5: 'PowerDeviceMaximum'}}]],
    'D1Latency': [0x34, ['unsigned long']],
    'D2Latency': [0x38, ['unsigned long']],
    'D3Latency': [0x3c, ['unsigned long']],
   }],
  '_DEVICE_FLAGS': [ 0x4, {
    'ConsoleIn': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'ConsoleOut': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'Failed': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ReadOnly': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Removable': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Output': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'Input': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
   }],
  '_DEVICE_NODE': [ 0x158, {
    'Sibling': [0x0, ['pointer', ['_DEVICE_NODE']]],
    'Child': [0x4, ['pointer', ['_DEVICE_NODE']]],
    'Parent': [0x8, ['pointer', ['_DEVICE_NODE']]],
    'LastChild': [0xc, ['pointer', ['_DEVICE_NODE']]],
    'Level': [0x10, ['unsigned long']],
    'Notify': [0x14, ['_PO_DEVICE_NOTIFY']],
    'PoIrpManager': [0x38, ['_PO_IRP_MANAGER']],
    'State': [0x48, ['Enumeration', {'target': 'long', 'choices': {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'}}]],
    'PreviousState': [0x4c, ['Enumeration', {'target': 'long', 'choices': {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'}}]],
    'StateHistory': [0x50, ['array', -80, ['Enumeration', {'target': 'long', 'choices': {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'}}]]],
    'StateHistoryEntry': [0xa0, ['unsigned long']],
    'CompletionStatus': [0xa4, ['long']],
    'PendingIrp': [0xa8, ['pointer', ['_IRP']]],
    'Flags': [0xac, ['unsigned long']],
    'UserFlags': [0xb0, ['unsigned long']],
    'Problem': [0xb4, ['unsigned long']],
    'PhysicalDeviceObject': [0xb8, ['pointer', ['_DEVICE_OBJECT']]],
    'ResourceList': [0xbc, ['pointer', ['_CM_RESOURCE_LIST']]],
    'ResourceListTranslated': [0xc0, ['pointer', ['_CM_RESOURCE_LIST']]],
    'InstancePath': [0xc4, ['_UNICODE_STRING']],
    'ServiceName': [0xcc, ['_UNICODE_STRING']],
    'DuplicatePDO': [0xd4, ['pointer', ['_DEVICE_OBJECT']]],
    'ResourceRequirements': [0xd8, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'InterfaceType': [0xdc, ['Enumeration', {'target': 'long', 'choices': {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'}}]],
    'BusNumber': [0xe0, ['unsigned long']],
    'ChildInterfaceType': [0xe4, ['Enumeration', {'target': 'long', 'choices': {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'}}]],
    'ChildBusNumber': [0xe8, ['unsigned long']],
    'ChildBusTypeIndex': [0xec, ['unsigned short']],
    'RemovalPolicy': [0xee, ['unsigned char']],
    'HardwareRemovalPolicy': [0xef, ['unsigned char']],
    'TargetDeviceNotify': [0xf0, ['_LIST_ENTRY']],
    'DeviceArbiterList': [0xf8, ['_LIST_ENTRY']],
    'DeviceTranslatorList': [0x100, ['_LIST_ENTRY']],
    'NoTranslatorMask': [0x108, ['unsigned short']],
    'QueryTranslatorMask': [0x10a, ['unsigned short']],
    'NoArbiterMask': [0x10c, ['unsigned short']],
    'QueryArbiterMask': [0x10e, ['unsigned short']],
    'OverUsed1': [0x110, ['__unnamed_15fa']],
    'OverUsed2': [0x114, ['__unnamed_15fc']],
    'BootResources': [0x118, ['pointer', ['_CM_RESOURCE_LIST']]],
    'BootResourcesTranslated': [0x11c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'CapabilityFlags': [0x120, ['unsigned long']],
    'DockInfo': [0x124, ['__unnamed_1600']],
    'DisableableDepends': [0x134, ['unsigned long']],
    'PendedSetInterfaceState': [0x138, ['_LIST_ENTRY']],
    'LegacyBusListEntry': [0x140, ['_LIST_ENTRY']],
    'DriverUnloadRetryCount': [0x148, ['unsigned long']],
    'PreviousParent': [0x14c, ['pointer', ['_DEVICE_NODE']]],
    'DeletedChildren': [0x150, ['unsigned long']],
    'NumaNodeIndex': [0x154, ['unsigned long']],
   }],
  '_DEVICE_OBJECT_POWER_EXTENSION': [ 0x60, {
    'IdleCount': [0x0, ['unsigned long']],
    'BusyCount': [0x4, ['unsigned long']],
    'TotalBusyCount': [0x8, ['unsigned long']],
    'ConservationIdleTime': [0xc, ['unsigned long']],
    'PerformanceIdleTime': [0x10, ['unsigned long']],
    'DeviceObject': [0x14, ['pointer', ['_DEVICE_OBJECT']]],
    'IdleList': [0x18, ['_LIST_ENTRY']],
    'DeviceType': [0x20, ['unsigned char']],
    'IdleState': [0x24, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerDeviceUnspecified', 1: 'PowerDeviceD0', 2: 'PowerDeviceD1', 3: 'PowerDeviceD2', 4: 'PowerDeviceD3', 5: 'PowerDeviceMaximum'}}]],
    'CurrentState': [0x28, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerDeviceUnspecified', 1: 'PowerDeviceD0', 2: 'PowerDeviceD1', 3: 'PowerDeviceD2', 4: 'PowerDeviceD3', 5: 'PowerDeviceMaximum'}}]],
    'NotifySourceList': [0x2c, ['_LIST_ENTRY']],
    'NotifyTargetList': [0x34, ['_LIST_ENTRY']],
    'PowerChannelSummary': [0x3c, ['_POWER_CHANNEL_SUMMARY']],
    'Volume': [0x50, ['_LIST_ENTRY']],
    'Specific': [0x58, ['__unnamed_1d03']],
   }],
  '_DUMP_STACK_CONTEXT': [ 0xb0, {
    'Init': [0x0, ['_DUMP_INITIALIZATION_CONTEXT']],
    'PartitionOffset': [0x70, ['_LARGE_INTEGER']],
    'DumpPointers': [0x78, ['pointer', ['void']]],
    'PointersLength': [0x7c, ['unsigned long']],
    'ModulePrefix': [0x80, ['pointer', ['unsigned short']]],
    'DriverList': [0x84, ['_LIST_ENTRY']],
    'InitMsg': [0x8c, ['_STRING']],
    'ProgMsg': [0x94, ['_STRING']],
    'DoneMsg': [0x9c, ['_STRING']],
    'FileObject': [0xa4, ['pointer', ['void']]],
    'UsageType': [0xa8, ['Enumeration', {'target': 'long', 'choices': {0: 'DeviceUsageTypeUndefined', 1: 'DeviceUsageTypePaging', 2: 'DeviceUsageTypeHibernation', 3: 'DeviceUsageTypeDumpFile'}}]],
   }],
  '_EPROCESS': [ 0x270, {
    'Pcb': [0x0, ['_KPROCESS']],
    'ProcessLock': [0x80, ['_EX_PUSH_LOCK']],
    'CreateTime': [0x88, ['_LARGE_INTEGER']],
    'ExitTime': [0x90, ['_LARGE_INTEGER']],
    'RundownProtect': [0x98, ['_EX_RUNDOWN_REF']],
    'UniqueProcessId': [0x9c, ['pointer', ['void']]],
    'ActiveProcessLinks': [0xa0, ['_LIST_ENTRY']],
    'QuotaUsage': [0xa8, ['array', 3, ['unsigned long']]],
    'QuotaPeak': [0xb4, ['array', 3, ['unsigned long']]],
    'CommitCharge': [0xc0, ['unsigned long']],
    'PeakVirtualSize': [0xc4, ['unsigned long']],
    'VirtualSize': [0xc8, ['unsigned long']],
    'SessionProcessLinks': [0xcc, ['_LIST_ENTRY']],
    'DebugPort': [0xd4, ['pointer', ['void']]],
    'ExceptionPortValue': [0xd8, ['unsigned long']],
    'ExceptionPortState': [0xd8, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    'ExceptionPortData': [0xd8, ['pointer', ['void']]],
    'ObjectTable': [0xdc, ['pointer', ['_HANDLE_TABLE']]],
    'Token': [0xe0, ['_EX_FAST_REF']],
    'WorkingSetPage': [0xe4, ['unsigned long']],
    'AddressCreationLock': [0xe8, ['_EX_PUSH_LOCK']],
    'RotateInProgress': [0xec, ['pointer', ['_ETHREAD']]],
    'ForkInProgress': [0xf0, ['pointer', ['_ETHREAD']]],
    'HardwareTrigger': [0xf4, ['unsigned long']],
    'PhysicalVadRoot': [0xf8, ['pointer', ['_MM_AVL_TABLE']]],
    'CloneRoot': [0xfc, ['pointer', ['void']]],
    'NumberOfPrivatePages': [0x100, ['unsigned long']],
    'NumberOfLockedPages': [0x104, ['unsigned long']],
    'Win32Process': [0x108, ['pointer', ['void']]],
    'Job': [0x10c, ['pointer', ['_EJOB']]],
    'SectionObject': [0x110, ['pointer', ['void']]],
    'SectionBaseAddress': [0x114, ['pointer', ['void']]],
    'QuotaBlock': [0x118, ['pointer', ['_EPROCESS_QUOTA_BLOCK']]],
    'WorkingSetWatch': [0x11c, ['pointer', ['_PAGEFAULT_HISTORY']]],
    'Win32WindowStation': [0x120, ['pointer', ['void']]],
    'InheritedFromUniqueProcessId': [0x124, ['pointer', ['void']]],
    'LdtInformation': [0x128, ['pointer', ['void']]],
    'Spare': [0x12c, ['pointer', ['void']]],
    'VdmObjects': [0x130, ['pointer', ['void']]],
    'DeviceMap': [0x134, ['pointer', ['void']]],
    'EtwDataSource': [0x138, ['pointer', ['void']]],
    'FreeTebHint': [0x13c, ['pointer', ['void']]],
    'Filler': [0x140, ['unsigned long long']],
    'PageDirectoryPte': [0x140, ['_HARDWARE_PTE']],
    'Session': [0x148, ['pointer', ['void']]],
    'ImageFileName': [0x14c, ['array', 16, ['unsigned char']]],
    'JobLinks': [0x15c, ['_LIST_ENTRY']],
    'LockedPagesList': [0x164, ['pointer', ['void']]],
    'ThreadListHead': [0x168, ['_LIST_ENTRY']],
    'SecurityPort': [0x170, ['pointer', ['void']]],
    'PaeTop': [0x174, ['pointer', ['void']]],
    'ActiveThreads': [0x178, ['unsigned long']],
    'ImagePathHash': [0x17c, ['unsigned long']],
    'DefaultHardErrorProcessing': [0x180, ['unsigned long']],
    'LastThreadExitStatus': [0x184, ['long']],
    'Peb': [0x188, ['pointer', ['_PEB']]],
    'PrefetchTrace': [0x18c, ['_EX_FAST_REF']],
    'ReadOperationCount': [0x190, ['_LARGE_INTEGER']],
    'WriteOperationCount': [0x198, ['_LARGE_INTEGER']],
    'OtherOperationCount': [0x1a0, ['_LARGE_INTEGER']],
    'ReadTransferCount': [0x1a8, ['_LARGE_INTEGER']],
    'WriteTransferCount': [0x1b0, ['_LARGE_INTEGER']],
    'OtherTransferCount': [0x1b8, ['_LARGE_INTEGER']],
    'CommitChargeLimit': [0x1c0, ['unsigned long']],
    'CommitChargePeak': [0x1c4, ['unsigned long']],
    'AweInfo': [0x1c8, ['pointer', ['void']]],
    'SeAuditProcessCreationInfo': [0x1cc, ['_SE_AUDIT_PROCESS_CREATION_INFO']],
    'Vm': [0x1d0, ['_MMSUPPORT']],
    'MmProcessLinks': [0x218, ['_LIST_ENTRY']],
    'ModifiedPageCount': [0x220, ['unsigned long']],
    'Flags2': [0x224, ['unsigned long']],
    'DefaultPagePriority': [0x224, ['BitField', {'end_bit': 15, 'start_bit': 12}]],
    'ReportCommitChanges': [0x224, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'AccountingFolded': [0x224, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'NumaAware': [0x224, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'NewProcessReported': [0x224, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'PrimaryTokenFrozen': [0x224, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'ExitProcessReported': [0x224, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'ProcessVerifierTarget': [0x224, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'ProtectedProcess': [0x224, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'AffinityPermanent': [0x224, ['BitField', {'end_bit': 19, 'start_bit': 18}]],
    'AffinityUpdateEnable': [0x224, ['BitField', {'end_bit': 20, 'start_bit': 19}]],
    'RefTraceEnabled': [0x224, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'HandleTableRundown': [0x224, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'StackRandomizationDisabled': [0x224, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'LastReportMemory': [0x224, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'JobNotReallyActive': [0x224, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'NeedsHandleRundown': [0x224, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'ReportPhysicalPageChanges': [0x224, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'CrossSessionCreate': [0x224, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'OutswapEnabled': [0x228, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'OverrideAddressSpace': [0x228, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'HasAddressSpace': [0x228, ['BitField', {'end_bit': 19, 'start_bit': 18}]],
    'WriteWatch': [0x228, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'ProcessInserted': [0x228, ['BitField', {'end_bit': 27, 'start_bit': 26}]],
    'Outswapped': [0x228, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'Wow64SplitPages': [0x228, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'CreateReported': [0x228, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'InjectInpageErrors': [0x228, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'Wow64VaSpace4Gb': [0x228, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'VmDeleted': [0x228, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'ProcessExiting': [0x228, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'ForkFailed': [0x228, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'ProcessDelete': [0x228, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'VdmAllowed': [0x228, ['BitField', {'end_bit': 25, 'start_bit': 24}]],
    'SmapAllowed': [0x228, ['BitField', {'end_bit': 26, 'start_bit': 25}]],
    'PdeUpdateNeeded': [0x228, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'VmTopDown': [0x228, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'ProcessInSession': [0x228, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'SetTimerResolution': [0x228, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'SpareProcessFlags': [0x228, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
    'BreakOnTermination': [0x228, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'DefaultIoPriority': [0x228, ['BitField', {'end_bit': 30, 'start_bit': 27}]],
    'ImageNotifyDone': [0x228, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'Flags': [0x228, ['unsigned long']],
    'ProcessSelfDelete': [0x228, ['BitField', {'end_bit': 31, 'start_bit': 30}]],
    'LaunchPrefetched': [0x228, ['BitField', {'end_bit': 20, 'start_bit': 19}]],
    'DeprioritizeViews': [0x228, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'AddressSpaceInitialized': [0x228, ['BitField', {'end_bit': 12, 'start_bit': 10}]],
    'NoDebugInherit': [0x228, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'ExitStatus': [0x22c, ['long']],
    'Spare7': [0x230, ['unsigned short']],
    'SubSystemMinorVersion': [0x232, ['unsigned char']],
    'SubSystemVersion': [0x232, ['unsigned short']],
    'SubSystemMajorVersion': [0x233, ['unsigned char']],
    'PriorityClass': [0x234, ['unsigned char']],
    'VadRoot': [0x238, ['_MM_AVL_TABLE']],
    'Cookie': [0x258, ['unsigned long']],
    'AlpcContext': [0x25c, ['_ALPC_PROCESS_CONTEXT']],
   }],
  '_ETHREAD': [ 0x288, {
    'Tcb': [0x0, ['_KTHREAD']],
    'CreateTime': [0x1e0, ['_LARGE_INTEGER']],
    'KeyedWaitChain': [0x1e8, ['_LIST_ENTRY']],
    'ExitTime': [0x1e8, ['_LARGE_INTEGER']],
    'OfsChain': [0x1f0, ['pointer', ['void']]],
    'ExitStatus': [0x1f0, ['long']],
    'PostBlockList': [0x1f4, ['_LIST_ENTRY']],
    'ForwardLinkShadow': [0x1f4, ['pointer', ['void']]],
    'StartAddress': [0x1f8, ['pointer', ['void']]],
    'Win32StartParameter': [0x1fc, ['pointer', ['void']]],
    'TerminationPort': [0x1fc, ['pointer', ['_TERMINATION_PORT']]],
    'KeyedWaitValue': [0x1fc, ['pointer', ['void']]],
    'ReaperLink': [0x1fc, ['pointer', ['_ETHREAD']]],
    'ActiveTimerListLock': [0x200, ['unsigned long']],
    'ActiveTimerListHead': [0x204, ['_LIST_ENTRY']],
    'Cid': [0x20c, ['_CLIENT_ID']],
    'KeyedWaitSemaphore': [0x214, ['_KSEMAPHORE']],
    'AlpcWaitSemaphore': [0x214, ['_KSEMAPHORE']],
    'ClientSecurity': [0x228, ['_PS_CLIENT_SECURITY_CONTEXT']],
    'IrpList': [0x22c, ['_LIST_ENTRY']],
    'TopLevelIrp': [0x234, ['unsigned long']],
    'DeviceToVerify': [0x238, ['pointer', ['_DEVICE_OBJECT']]],
    'RateControlApc': [0x23c, ['pointer', ['_PSP_RATE_APC']]],
    'Win32StartAddress': [0x240, ['pointer', ['void']]],
    'SparePtr0': [0x244, ['pointer', ['void']]],
    'ThreadListEntry': [0x248, ['_LIST_ENTRY']],
    'RundownProtect': [0x250, ['_EX_RUNDOWN_REF']],
    'ThreadLock': [0x254, ['_EX_PUSH_LOCK']],
    'ReadClusterSize': [0x258, ['unsigned long']],
    'MmLockOrdering': [0x25c, ['long']],
    'Terminated': [0x260, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ThreadIoPriority': [0x260, ['BitField', {'end_bit': 13, 'start_bit': 10}]],
    'ActiveImpersonationInfo': [0x260, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'CrossThreadFlags': [0x260, ['unsigned long']],
    'CopyTokenOnOpen': [0x260, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'SkipCreationMsg': [0x260, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'ThreadPagePriority': [0x260, ['BitField', {'end_bit': 16, 'start_bit': 13}]],
    'BreakOnTermination': [0x260, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'RundownFail': [0x260, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'SkipTerminationMsg': [0x260, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'HardErrorsAreDisabled': [0x260, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'ThreadInserted': [0x260, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'SystemThread': [0x260, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'HideFromDebugger': [0x260, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'RateApcState': [0x264, ['BitField', {'end_bit': 7, 'start_bit': 5}]],
    'MemoryMaker': [0x264, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'ActiveExWorker': [0x264, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ExWorkerCanWaitUser': [0x264, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'SelfTerminate': [0x264, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'ClonedThread': [0x264, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'KeyedEventInUse': [0x264, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'SameThreadPassiveFlags': [0x264, ['unsigned long']],
    'Spare': [0x268, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'OwnsProcessWorkingSetShared': [0x268, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'OwnsProcessWorkingSetExclusive': [0x268, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'EtwPageFaultCalloutActive': [0x268, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'OwnsSystemWorkingSetShared': [0x268, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'SameThreadApcFlags': [0x268, ['unsigned long']],
    'OwnsSystemWorkingSetExclusive': [0x268, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'StartAddressInvalid': [0x268, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'OwnsSessionWorkingSetExclusive': [0x268, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'OwnsSessionWorkingSetShared': [0x269, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Prefetching': [0x269, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'OwnsProcessAddressSpaceExclusive': [0x269, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'OwnsChangeControlAreaShared': [0x269, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'SuppressSymbolLoad': [0x269, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'OwnsChangeControlAreaExclusive': [0x269, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'OwnsProcessAddressSpaceShared': [0x269, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'OwnsDynamicMemoryShared': [0x269, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'Spare1': [0x26a, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'PriorityRegionActive': [0x26b, ['unsigned char']],
    'CacheManagerActive': [0x26c, ['unsigned char']],
    'DisablePageFaultClustering': [0x26d, ['unsigned char']],
    'ActiveFaultCount': [0x26e, ['unsigned char']],
    'AlpcMessageId': [0x270, ['unsigned long']],
    'AlpcMessage': [0x274, ['pointer', ['void']]],
    'AlpcReceiveAttributeSet': [0x274, ['unsigned long']],
    'AlpcWaitListEntry': [0x278, ['_LIST_ENTRY']],
    'CacheManagerCount': [0x280, ['unsigned long']],
   }],
  '_ETW_LAST_ENABLE_INFO': [ 0x10, {
    'EnableFlags': [0x0, ['_LARGE_INTEGER']],
    'LoggerId': [0x8, ['unsigned short']],
    'Level': [0xa, ['unsigned char']],
    'Enabled': [0xb, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'InternalFlag': [0xb, ['BitField', {'end_bit': 8, 'start_bit': 1}]],
   }],
  '_ETW_PROVIDER_TABLE_ENTRY': [ 0x10, {
    'RefCount': [0x0, ['long']],
    'State': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'EtwProviderStateFree', 1: 'EtwProviderStateTransition', 2: 'EtwProviderStateActive', 3: 'EtwProviderStateMax'}}]],
    'RegEntry': [0x8, ['pointer', ['_ETW_REG_ENTRY']]],
    'Caller': [0xc, ['pointer', ['void']]],
   }],
  '_EX_FAST_REF': [ 0x4, {
    'Object': [0x0, ['pointer', ['void']]],
    'Value': [0x0, ['unsigned long']],
    'RefCnt': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
   }],
  '_EX_PUSH_LOCK': [ 0x4, {
    'Locked': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'MultipleShared': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Value': [0x0, ['unsigned long']],
    'Waking': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Waiting': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Shared': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 4}]],
    'Ptr': [0x0, ['pointer', ['void']]],
   }],
  '_FIRMWARE_INFORMATION_LOADER_BLOCK': [ 0x14, {
    'FirmwareTypeEfi': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 1}]],
    'u': [0x4, ['__unnamed_19f4']],
   }],
  '_GENERAL_LOOKASIDE': [ 0x80, {
    'SingleListHead': [0x0, ['_SINGLE_LIST_ENTRY']],
    'ListHead': [0x0, ['_SLIST_HEADER']],
    'Depth': [0x8, ['unsigned short']],
    'MaximumDepth': [0xa, ['unsigned short']],
    'TotalAllocates': [0xc, ['unsigned long']],
    'AllocateHits': [0x10, ['unsigned long']],
    'AllocateMisses': [0x10, ['unsigned long']],
    'TotalFrees': [0x14, ['unsigned long']],
    'FreeMisses': [0x18, ['unsigned long']],
    'FreeHits': [0x18, ['unsigned long']],
    'Type': [0x1c, ['Enumeration', {'target': 'long', 'choices': {0: 'NonPagedPool', 1: 'PagedPool', 2: 'NonPagedPoolMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolCacheAlignedMustS', 7: 'MaxPoolType', 32: 'NonPagedPoolSession', 33: 'PagedPoolSession', 34: 'NonPagedPoolMustSucceedSession', 35: 'DontUseThisTypeSession', 36: 'NonPagedPoolCacheAlignedSession', 37: 'PagedPoolCacheAlignedSession', 38: 'NonPagedPoolCacheAlignedMustSSession'}}]],
    'Tag': [0x20, ['unsigned long']],
    'Size': [0x24, ['unsigned long']],
    'AllocateEx': [0x28, ['pointer', ['void']]],
    'Allocate': [0x28, ['pointer', ['void']]],
    'FreeEx': [0x2c, ['pointer', ['void']]],
    'Free': [0x2c, ['pointer', ['void']]],
    'ListEntry': [0x30, ['_LIST_ENTRY']],
    'LastTotalAllocates': [0x38, ['unsigned long']],
    'LastAllocateHits': [0x3c, ['unsigned long']],
    'LastAllocateMisses': [0x3c, ['unsigned long']],
    'Future': [0x40, ['array', 2, ['unsigned long']]],
   }],
  '_GENERAL_LOOKASIDE_POOL': [ 0x48, {
    'SingleListHead': [0x0, ['_SINGLE_LIST_ENTRY']],
    'ListHead': [0x0, ['_SLIST_HEADER']],
    'Depth': [0x8, ['unsigned short']],
    'MaximumDepth': [0xa, ['unsigned short']],
    'TotalAllocates': [0xc, ['unsigned long']],
    'AllocateHits': [0x10, ['unsigned long']],
    'AllocateMisses': [0x10, ['unsigned long']],
    'TotalFrees': [0x14, ['unsigned long']],
    'FreeMisses': [0x18, ['unsigned long']],
    'FreeHits': [0x18, ['unsigned long']],
    'Type': [0x1c, ['Enumeration', {'target': 'long', 'choices': {0: 'NonPagedPool', 1: 'PagedPool', 2: 'NonPagedPoolMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolCacheAlignedMustS', 7: 'MaxPoolType', 32: 'NonPagedPoolSession', 33: 'PagedPoolSession', 34: 'NonPagedPoolMustSucceedSession', 35: 'DontUseThisTypeSession', 36: 'NonPagedPoolCacheAlignedSession', 37: 'PagedPoolCacheAlignedSession', 38: 'NonPagedPoolCacheAlignedMustSSession'}}]],
    'Tag': [0x20, ['unsigned long']],
    'Size': [0x24, ['unsigned long']],
    'AllocateEx': [0x28, ['pointer', ['void']]],
    'Allocate': [0x28, ['pointer', ['void']]],
    'FreeEx': [0x2c, ['pointer', ['void']]],
    'Free': [0x2c, ['pointer', ['void']]],
    'ListEntry': [0x30, ['_LIST_ENTRY']],
    'LastTotalAllocates': [0x38, ['unsigned long']],
    'LastAllocateHits': [0x3c, ['unsigned long']],
    'LastAllocateMisses': [0x3c, ['unsigned long']],
    'Future': [0x40, ['array', 2, ['unsigned long']]],
   }],
  '_HANDLE_TABLE': [ 0x38, {
    'TableCode': [0x0, ['unsigned long']],
    'QuotaProcess': [0x4, ['pointer', ['_EPROCESS']]],
    'UniqueProcessId': [0x8, ['pointer', ['void']]],
    'HandleLock': [0xc, ['_EX_PUSH_LOCK']],
    'HandleTableList': [0x10, ['_LIST_ENTRY']],
    'HandleContentionEvent': [0x18, ['_EX_PUSH_LOCK']],
    'DebugInfo': [0x1c, ['pointer', ['_HANDLE_TRACE_DEBUG_INFO']]],
    'ExtraInfoPages': [0x20, ['long']],
    'Flags': [0x24, ['unsigned long']],
    'StrictFIFO': [0x24, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'FirstFreeHandle': [0x28, ['long']],
    'LastFreeHandleEntry': [0x2c, ['pointer', ['_HANDLE_TABLE_ENTRY']]],
    'HandleCount': [0x30, ['long']],
    'NextHandleNeedingPool': [0x34, ['unsigned long']],
   }],
  '_HARDWARE_PTE': [ 0x4, {
    'reserved': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'LargePage': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'CopyOnWrite': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'CacheDisable': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'Write': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Valid': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Dirty': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'Accessed': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'Prototype': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'PageFrameNumber': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
    'Global': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'WriteThrough': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Owner': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
   }],
  '_IMAGE_SECURITY_CONTEXT': [ 0x4, {
    'PageHashes': [0x0, ['pointer', ['void']]],
    'SecurityBeingCreated': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Value': [0x0, ['unsigned long']],
    'PageHashPointer': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 3}]],
    'Unused': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'SecurityMandatory': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
   }],
  '_IO_PRIORITY_INFO': [ 0x10, {
    'Size': [0x0, ['unsigned long']],
    'ThreadPriority': [0x4, ['unsigned long']],
    'PagePriority': [0x8, ['unsigned long']],
    'IoPriority': [0xc, ['Enumeration', {'target': 'long', 'choices': {0: 'IoPriorityVeryLow', 1: 'IoPriorityLow', 2: 'IoPriorityNormal', 3: 'IoPriorityHigh', 4: 'IoPriorityCritical', 5: 'MaxIoPriorityTypes'}}]],
   }],
  '_IO_RESOURCE_REQUIREMENTS_LIST': [ 0x48, {
    'ListSize': [0x0, ['unsigned long']],
    'InterfaceType': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'}}]],
    'BusNumber': [0x8, ['unsigned long']],
    'SlotNumber': [0xc, ['unsigned long']],
    'Reserved': [0x10, ['array', 3, ['unsigned long']]],
    'AlternativeLists': [0x1c, ['unsigned long']],
    'List': [0x20, ['array', 1, ['_IO_RESOURCE_LIST']]],
   }],
  '_KENLISTMENT': [ 0x168, {
    'cookie': [0x0, ['unsigned long']],
    'NamespaceLink': [0x4, ['_KTMOBJECT_NAMESPACE_LINK']],
    'EnlistmentId': [0x18, ['_GUID']],
    'Mutex': [0x28, ['_KMUTANT']],
    'NextSameTx': [0x48, ['_LIST_ENTRY']],
    'NextSameRm': [0x50, ['_LIST_ENTRY']],
    'ResourceManager': [0x58, ['pointer', ['_KRESOURCEMANAGER']]],
    'Transaction': [0x5c, ['pointer', ['_KTRANSACTION']]],
    'State': [0x60, ['Enumeration', {'target': 'long', 'choices': {0: 'KEnlistmentUninitialized', 256: 'KEnlistmentActive', 258: 'KEnlistmentPrepared', 259: 'KEnlistmentInDoubt', 260: 'KEnlistmentCommitted', 261: 'KEnlistmentCommittedNotify', 262: 'KEnlistmentCommitRequested', 257: 'KEnlistmentPreparing', 264: 'KEnlistmentDelegated', 265: 'KEnlistmentDelegatedDisconnected', 266: 'KEnlistmentPrePreparing', 263: 'KEnlistmentAborted', 268: 'KEnlistmentRecovering', 269: 'KEnlistmentAborting', 270: 'KEnlistmentReadOnly', 271: 'KEnlistmentOutcomeUnavailable', 272: 'KEnlistmentOffline', 273: 'KEnlistmentPrePrepared', 274: 'KEnlistmentInitialized', 267: 'KEnlistmentForgotten'}}]],
    'Flags': [0x64, ['unsigned long']],
    'NotificationMask': [0x68, ['unsigned long']],
    'Key': [0x6c, ['pointer', ['void']]],
    'KeyRefCount': [0x70, ['unsigned long']],
    'RecoveryInformation': [0x74, ['pointer', ['void']]],
    'RecoveryInformationLength': [0x78, ['unsigned long']],
    'DynamicNameInformation': [0x7c, ['pointer', ['void']]],
    'DynamicNameInformationLength': [0x80, ['unsigned long']],
    'FinalNotification': [0x84, ['pointer', ['_KTMNOTIFICATION_PACKET']]],
    'SupSubEnlistment': [0x88, ['pointer', ['_KENLISTMENT']]],
    'SupSubEnlHandle': [0x8c, ['pointer', ['void']]],
    'SubordinateTxHandle': [0x90, ['pointer', ['void']]],
    'CrmEnlistmentEnId': [0x94, ['_GUID']],
    'CrmEnlistmentTmId': [0xa4, ['_GUID']],
    'CrmEnlistmentRmId': [0xb4, ['_GUID']],
    'NextHistory': [0xc4, ['unsigned long']],
    'History': [0xc8, ['array', 20, ['_KENLISTMENT_HISTORY']]],
   }],
  '_KENLISTMENT_HISTORY': [ 0x8, {
    'Notification': [0x0, ['unsigned long']],
    'NewState': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'KEnlistmentUninitialized', 256: 'KEnlistmentActive', 258: 'KEnlistmentPrepared', 259: 'KEnlistmentInDoubt', 260: 'KEnlistmentCommitted', 261: 'KEnlistmentCommittedNotify', 262: 'KEnlistmentCommitRequested', 257: 'KEnlistmentPreparing', 264: 'KEnlistmentDelegated', 265: 'KEnlistmentDelegatedDisconnected', 266: 'KEnlistmentPrePreparing', 263: 'KEnlistmentAborted', 268: 'KEnlistmentRecovering', 269: 'KEnlistmentAborting', 270: 'KEnlistmentReadOnly', 271: 'KEnlistmentOutcomeUnavailable', 272: 'KEnlistmentOffline', 273: 'KEnlistmentPrePrepared', 274: 'KEnlistmentInitialized', 267: 'KEnlistmentForgotten'}}]],
   }],
  '_KERNEL_STACK_CONTROL': [ 0x1c, {
    'PreviousTrapFrame': [0x0, ['pointer', ['_KTRAP_FRAME']]],
    'PreviousExceptionList': [0x0, ['pointer', ['void']]],
    'PreviousSegmentsPresent': [0x4, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'PreviousLargeStack': [0x4, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'StackControlFlags': [0x4, ['unsigned long']],
    'ExpandCalloutStack': [0x4, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Previous': [0x8, ['_KERNEL_STACK_SEGMENT']],
   }],
  '_KEXECUTE_OPTIONS': [ 0x1, {
    'DisableExceptionChainValidation': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'DisableThunkEmulation': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Permanent': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Spare': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'ExecuteDisable': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ImageDispatchEnable': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'ExecuteDispatchEnable': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'ExecuteEnable': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
   }],
  '_KINTERRUPT': [ 0x270, {
    'Type': [0x0, ['short']],
    'Size': [0x2, ['short']],
    'InterruptListEntry': [0x4, ['_LIST_ENTRY']],
    'ServiceRoutine': [0xc, ['pointer', ['void']]],
    'MessageServiceRoutine': [0x10, ['pointer', ['void']]],
    'MessageIndex': [0x14, ['unsigned long']],
    'ServiceContext': [0x18, ['pointer', ['void']]],
    'SpinLock': [0x1c, ['unsigned long']],
    'TickCount': [0x20, ['unsigned long']],
    'ActualLock': [0x24, ['pointer', ['unsigned long']]],
    'DispatchAddress': [0x28, ['pointer', ['void']]],
    'Vector': [0x2c, ['unsigned long']],
    'Irql': [0x30, ['unsigned char']],
    'SynchronizeIrql': [0x31, ['unsigned char']],
    'FloatingSave': [0x32, ['unsigned char']],
    'Connected': [0x33, ['unsigned char']],
    'Number': [0x34, ['unsigned char']],
    'ShareVector': [0x35, ['unsigned char']],
    'Mode': [0x38, ['Enumeration', {'target': 'long', 'choices': {0: 'LevelSensitive', 1: 'Latched'}}]],
    'Polarity': [0x3c, ['Enumeration', {'target': 'long', 'choices': {0: 'InterruptPolarityUnknown', 1: 'InterruptActiveHigh', 2: 'InterruptActiveLow'}}]],
    'ServiceCount': [0x40, ['unsigned long']],
    'DispatchCount': [0x44, ['unsigned long']],
    'Rsvd1': [0x48, ['unsigned long long']],
    'DispatchCode': [0x50, ['array', 135, ['unsigned long']]],
   }],
  '_KPROCESS': [ 0x80, {
    'Header': [0x0, ['_DISPATCHER_HEADER']],
    'ProfileListHead': [0x10, ['_LIST_ENTRY']],
    'DirectoryTableBase': [0x18, ['unsigned long']],
    'Unused0': [0x1c, ['unsigned long']],
    'LdtDescriptor': [0x20, ['_KGDTENTRY']],
    'Int21Descriptor': [0x28, ['_KIDTENTRY']],
    'IopmOffset': [0x30, ['unsigned short']],
    'Unused1': [0x32, ['unsigned char']],
    'Unused2': [0x33, ['unsigned char']],
    'ActiveProcessors': [0x34, ['unsigned long']],
    'KernelTime': [0x38, ['unsigned long']],
    'UserTime': [0x3c, ['unsigned long']],
    'ReadyListHead': [0x40, ['_LIST_ENTRY']],
    'SwapListEntry': [0x48, ['_SINGLE_LIST_ENTRY']],
    'VdmTrapcHandler': [0x4c, ['pointer', ['void']]],
    'ThreadListHead': [0x50, ['_LIST_ENTRY']],
    'ProcessLock': [0x58, ['unsigned long']],
    'Affinity': [0x5c, ['unsigned long']],
    'ReservedFlags': [0x60, ['BitField', {'end_bit': 32, 'start_bit': 3}]],
    'DisableBoost': [0x60, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'DisableQuantum': [0x60, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'ProcessFlags': [0x60, ['long']],
    'AutoAlignment': [0x60, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'BasePriority': [0x64, ['unsigned char']],
    'QuantumReset': [0x65, ['unsigned char']],
    'State': [0x66, ['unsigned char']],
    'ThreadSeed': [0x67, ['unsigned char']],
    'PowerState': [0x68, ['unsigned char']],
    'IdealNode': [0x69, ['unsigned char']],
    'Visited': [0x6a, ['unsigned char']],
    'ExecuteOptions': [0x6b, ['unsigned char']],
    'Flags': [0x6b, ['_KEXECUTE_OPTIONS']],
    'StackCount': [0x6c, ['unsigned long']],
    'ProcessListEntry': [0x70, ['_LIST_ENTRY']],
    'CycleTime': [0x78, ['unsigned long long']],
   }],
  '_KRESOURCEMANAGER': [ 0x154, {
    'NotificationAvailable': [0x0, ['_KEVENT']],
    'cookie': [0x10, ['unsigned long']],
    'State': [0x14, ['Enumeration', {'target': 'long', 'choices': {0: 'KResourceManagerUninitialized', 1: 'KResourceManagerOffline', 2: 'KResourceManagerOnline'}}]],
    'Flags': [0x18, ['unsigned long']],
    'Mutex': [0x1c, ['_KMUTANT']],
    'NamespaceLink': [0x3c, ['_KTMOBJECT_NAMESPACE_LINK']],
    'RmId': [0x50, ['_GUID']],
    'NotificationQueue': [0x60, ['_KQUEUE']],
    'NotificationMutex': [0x88, ['_KMUTANT']],
    'EnlistmentHead': [0xa8, ['_LIST_ENTRY']],
    'EnlistmentCount': [0xb0, ['unsigned long']],
    'NotificationRoutine': [0xb4, ['pointer', ['void']]],
    'Key': [0xb8, ['pointer', ['void']]],
    'ProtocolListHead': [0xbc, ['_LIST_ENTRY']],
    'PendingPropReqListHead': [0xc4, ['_LIST_ENTRY']],
    'CRMListEntry': [0xcc, ['_LIST_ENTRY']],
    'Tm': [0xd4, ['pointer', ['_KTM']]],
    'Description': [0xd8, ['_UNICODE_STRING']],
    'Enlistments': [0xe0, ['_KTMOBJECT_NAMESPACE']],
    'CompletionBinding': [0x140, ['_KRESOURCEMANAGER_COMPLETION_BINDING']],
   }],
  '_KTHREAD': [ 0x1e0, {
    'Header': [0x0, ['_DISPATCHER_HEADER']],
    'CycleTime': [0x10, ['unsigned long long']],
    'HighCycleTime': [0x18, ['unsigned long']],
    'QuantumTarget': [0x20, ['unsigned long long']],
    'InitialStack': [0x28, ['pointer', ['void']]],
    'StackLimit': [0x2c, ['pointer', ['void']]],
    'KernelStack': [0x30, ['pointer', ['void']]],
    'ThreadLock': [0x34, ['unsigned long']],
    'ApcStateFill': [0x38, ['array', 23, ['unsigned char']]],
    'ApcState': [0x38, ['_KAPC_STATE']],
    'Priority': [0x4f, ['unsigned char']],
    'NextProcessor': [0x50, ['unsigned short']],
    'DeferredProcessor': [0x52, ['unsigned short']],
    'ApcQueueLock': [0x54, ['unsigned long']],
    'ContextSwitches': [0x58, ['unsigned long']],
    'State': [0x5c, ['unsigned char']],
    'NpxState': [0x5d, ['unsigned char']],
    'WaitIrql': [0x5e, ['unsigned char']],
    'WaitMode': [0x5f, ['unsigned char']],
    'WaitStatus': [0x60, ['long']],
    'WaitBlockList': [0x64, ['pointer', ['_KWAIT_BLOCK']]],
    'GateObject': [0x64, ['pointer', ['_KGATE']]],
    'ProcessReadyQueue': [0x68, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'MiscFlags': [0x68, ['long']],
    'GdiFlushActive': [0x68, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'UserStackWalkActive': [0x68, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'ReadyTransition': [0x68, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'SystemAffinityActive': [0x68, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'Alertable': [0x68, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'KernelStackResident': [0x68, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Reserved': [0x68, ['BitField', {'end_bit': 32, 'start_bit': 8}]],
    'WaitNext': [0x68, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'WaitReason': [0x6c, ['unsigned char']],
    'SwapBusy': [0x6d, ['unsigned char']],
    'Alerted': [0x6e, ['array', 2, ['unsigned char']]],
    'WaitListEntry': [0x70, ['_LIST_ENTRY']],
    'SwapListEntry': [0x70, ['_SINGLE_LIST_ENTRY']],
    'Queue': [0x78, ['pointer', ['_KQUEUE']]],
    'WaitTime': [0x7c, ['unsigned long']],
    'KernelApcDisable': [0x80, ['short']],
    'CombinedApcDisable': [0x80, ['unsigned long']],
    'SpecialApcDisable': [0x82, ['short']],
    'Teb': [0x84, ['pointer', ['void']]],
    'Timer': [0x88, ['_KTIMER']],
    'TimerFill': [0x88, ['array', 40, ['unsigned char']]],
    'ReservedFlags': [0xb0, ['BitField', {'end_bit': 32, 'start_bit': 9}]],
    'DisableBoost': [0xb0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'GuiThread': [0xb0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'CycleChargePending': [0xb0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'EtwStackTraceApc2Inserted': [0xb0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'EtwStackTraceApc1Inserted': [0xb0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'CalloutActive': [0xb0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'ThreadFlags': [0xb0, ['long']],
    'ApcQueueable': [0xb0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'EnableStackSwap': [0xb0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'AutoAlignment': [0xb0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'WaitBlockFill1': [0xb8, ['array', 47, ['unsigned char']]],
    'WaitBlockFill0': [0xb8, ['array', 23, ['unsigned char']]],
    'WaitBlockFill3': [0xb8, ['array', 95, ['unsigned char']]],
    'WaitBlockFill2': [0xb8, ['array', 71, ['unsigned char']]],
    'WaitBlock': [0xb8, ['array', 4, ['_KWAIT_BLOCK']]],
    'IdealProcessor': [0xcf, ['unsigned char']],
    'PreviousMode': [0xe7, ['unsigned char']],
    'ResourceIndex': [0xff, ['unsigned char']],
    'LargeStack': [0x117, ['unsigned char']],
    'QueueListEntry': [0x118, ['_LIST_ENTRY']],
    'TrapFrame': [0x120, ['pointer', ['_KTRAP_FRAME']]],
    'FirstArgument': [0x124, ['pointer', ['void']]],
    'CallbackDepth': [0x128, ['unsigned long']],
    'CallbackStack': [0x128, ['pointer', ['void']]],
    'ServiceTable': [0x12c, ['pointer', ['void']]],
    'ApcStateIndex': [0x130, ['unsigned char']],
    'BasePriority': [0x131, ['unsigned char']],
    'PriorityDecrement': [0x132, ['unsigned char']],
    'Preempted': [0x133, ['unsigned char']],
    'AdjustReason': [0x134, ['unsigned char']],
    'AdjustIncrement': [0x135, ['unsigned char']],
    'Spare01': [0x136, ['unsigned char']],
    'Saturation': [0x137, ['unsigned char']],
    'SystemCallNumber': [0x138, ['unsigned long']],
    'FreezeCount': [0x13c, ['unsigned long']],
    'UserAffinity': [0x140, ['unsigned long']],
    'Process': [0x144, ['pointer', ['_KPROCESS']]],
    'Affinity': [0x148, ['unsigned long']],
    'ApcStatePointer': [0x14c, ['array', 2, ['pointer', ['_KAPC_STATE']]]],
    'SavedApcState': [0x154, ['_KAPC_STATE']],
    'SavedApcStateFill': [0x154, ['array', 23, ['unsigned char']]],
    'Spare02': [0x16b, ['unsigned char']],
    'SuspendCount': [0x16c, ['unsigned char']],
    'UserIdealProcessor': [0x16d, ['unsigned char']],
    'Spare03': [0x16e, ['unsigned char']],
    'OtherPlatformFill': [0x16f, ['unsigned char']],
    'Win32Thread': [0x170, ['pointer', ['void']]],
    'StackBase': [0x174, ['pointer', ['void']]],
    'SuspendApcFill0': [0x178, ['array', 1, ['unsigned char']]],
    'SuspendApcFill1': [0x178, ['array', 3, ['unsigned char']]],
    'SuspendApcFill3': [0x178, ['array', 36, ['unsigned char']]],
    'SuspendApcFill4': [0x178, ['array', 40, ['unsigned char']]],
    'SuspendApcFill5': [0x178, ['array', 47, ['unsigned char']]],
    'SuspendApcFill2': [0x178, ['array', 4, ['unsigned char']]],
    'SuspendApc': [0x178, ['_KAPC']],
    'Spare04': [0x179, ['unsigned char']],
    'QuantumReset': [0x17b, ['unsigned char']],
    'KernelTime': [0x17c, ['unsigned long']],
    'WaitPrcb': [0x19c, ['pointer', ['_KPRCB']]],
    'LegoData': [0x1a0, ['pointer', ['void']]],
    'PowerState': [0x1a7, ['unsigned char']],
    'UserTime': [0x1a8, ['unsigned long']],
    'SuspendSemaphorefill': [0x1ac, ['array', 20, ['unsigned char']]],
    'SuspendSemaphore': [0x1ac, ['_KSEMAPHORE']],
    'SListFaultCount': [0x1c0, ['unsigned long']],
    'ThreadListEntry': [0x1c4, ['_LIST_ENTRY']],
    'MutantListHead': [0x1cc, ['_LIST_ENTRY']],
    'SListFaultAddress': [0x1d4, ['pointer', ['void']]],
    'MdlForLockedTeb': [0x1d8, ['pointer', ['void']]],
   }],
  '_KTM': [ 0x228, {
    'cookie': [0x0, ['unsigned long']],
    'Mutex': [0x4, ['_KMUTANT']],
    'State': [0x24, ['Enumeration', {'target': 'long', 'choices': {0: 'KKtmUninitialized', 1: 'KKtmInitialized', 2: 'KKtmRecovering', 3: 'KKtmOnline', 4: 'KKtmRecoveryFailed', 5: 'KKtmOffline'}}]],
    'NamespaceLink': [0x28, ['_KTMOBJECT_NAMESPACE_LINK']],
    'TmIdentity': [0x3c, ['_GUID']],
    'Flags': [0x4c, ['unsigned long']],
    'VolatileFlags': [0x50, ['unsigned long']],
    'LogFileName': [0x54, ['_UNICODE_STRING']],
    'LogFileObject': [0x5c, ['pointer', ['_FILE_OBJECT']]],
    'MarshallingContext': [0x60, ['pointer', ['void']]],
    'LogManagementContext': [0x64, ['pointer', ['void']]],
    'Transactions': [0x68, ['_KTMOBJECT_NAMESPACE']],
    'ResourceManagers': [0xc8, ['_KTMOBJECT_NAMESPACE']],
    'LsnOrderedMutex': [0x128, ['_KMUTANT']],
    'LsnOrderedList': [0x148, ['_LIST_ENTRY']],
    'CommitVirtualClock': [0x150, ['_LARGE_INTEGER']],
    'CommitVirtualClockMutex': [0x158, ['_FAST_MUTEX']],
    'BaseLsn': [0x178, ['_CLS_LSN']],
    'CurrentReadLsn': [0x180, ['_CLS_LSN']],
    'LastRecoveredLsn': [0x188, ['_CLS_LSN']],
    'TmRmHandle': [0x190, ['pointer', ['void']]],
    'TmRm': [0x194, ['pointer', ['_KRESOURCEMANAGER']]],
    'LogFullNotifyEvent': [0x198, ['_KEVENT']],
    'CheckpointWorkItem': [0x1a8, ['_WORK_QUEUE_ITEM']],
    'CheckpointTargetLsn': [0x1b8, ['_CLS_LSN']],
    'LogFullCompletedWorkItem': [0x1c0, ['_WORK_QUEUE_ITEM']],
    'LogWriteResource': [0x1d0, ['_ERESOURCE']],
    'LogFlags': [0x208, ['unsigned long']],
    'LogFullStatus': [0x20c, ['long']],
    'RecoveryStatus': [0x210, ['long']],
    'LastCheckBaseLsn': [0x218, ['_CLS_LSN']],
    'RestartOrderedList': [0x220, ['_LIST_ENTRY']],
   }],
  '_KTRANSACTION': [ 0x1e0, {
    'OutcomeEvent': [0x0, ['_KEVENT']],
    'cookie': [0x10, ['unsigned long']],
    'Mutex': [0x14, ['_KMUTANT']],
    'TreeTx': [0x34, ['pointer', ['_KTRANSACTION']]],
    'GlobalNamespaceLink': [0x38, ['_KTMOBJECT_NAMESPACE_LINK']],
    'TmNamespaceLink': [0x4c, ['_KTMOBJECT_NAMESPACE_LINK']],
    'UOW': [0x60, ['_GUID']],
    'State': [0x70, ['Enumeration', {'target': 'long', 'choices': {0: 'KTransactionUninitialized', 1: 'KTransactionActive', 2: 'KTransactionPreparing', 3: 'KTransactionPrepared', 4: 'KTransactionInDoubt', 5: 'KTransactionCommitted', 6: 'KTransactionAborted', 7: 'KTransactionDelegated', 8: 'KTransactionPrePreparing', 9: 'KTransactionForgotten', 10: 'KTransactionRecovering', 11: 'KTransactionPrePrepared'}}]],
    'Flags': [0x74, ['unsigned long']],
    'EnlistmentHead': [0x78, ['_LIST_ENTRY']],
    'EnlistmentCount': [0x80, ['unsigned long']],
    'RecoverableEnlistmentCount': [0x84, ['unsigned long']],
    'PrePrepareRequiredEnlistmentCount': [0x88, ['unsigned long']],
    'PrepareRequiredEnlistmentCount': [0x8c, ['unsigned long']],
    'OutcomeRequiredEnlistmentCount': [0x90, ['unsigned long']],
    'PendingResponses': [0x94, ['unsigned long']],
    'SuperiorEnlistment': [0x98, ['pointer', ['_KENLISTMENT']]],
    'LastLsn': [0xa0, ['_CLS_LSN']],
    'PromotedEntry': [0xa8, ['_LIST_ENTRY']],
    'PromoterTransaction': [0xb0, ['pointer', ['_KTRANSACTION']]],
    'PromotePropagation': [0xb4, ['pointer', ['void']]],
    'IsolationLevel': [0xb8, ['unsigned long']],
    'IsolationFlags': [0xbc, ['unsigned long']],
    'Timeout': [0xc0, ['_LARGE_INTEGER']],
    'Description': [0xc8, ['_UNICODE_STRING']],
    'RollbackThread': [0xd0, ['pointer', ['_KTHREAD']]],
    'RollbackWorkItem': [0xd4, ['_WORK_QUEUE_ITEM']],
    'RollbackDpc': [0xe4, ['_KDPC']],
    'RollbackTimer': [0x108, ['_KTIMER']],
    'LsnOrderedEntry': [0x130, ['_LIST_ENTRY']],
    'Outcome': [0x138, ['Enumeration', {'target': 'long', 'choices': {0: 'KTxOutcomeUninitialized', 1: 'KTxOutcomeUndetermined', 2: 'KTxOutcomeCommitted', 3: 'KTxOutcomeAborted', 4: 'KTxOutcomeUnavailable'}}]],
    'Tm': [0x13c, ['pointer', ['_KTM']]],
    'CommitReservation': [0x140, ['long long']],
    'TransactionHistory': [0x148, ['array', 10, ['_KTRANSACTION_HISTORY']]],
    'TransactionHistoryCount': [0x198, ['unsigned long']],
    'DTCPrivateInformation': [0x19c, ['pointer', ['void']]],
    'DTCPrivateInformationLength': [0x1a0, ['unsigned long']],
    'DTCPrivateInformationMutex': [0x1a4, ['_KMUTANT']],
    'PromotedTxSelfHandle': [0x1c4, ['pointer', ['void']]],
    'PendingPromotionCount': [0x1c8, ['unsigned long']],
    'PromotionCompletedEvent': [0x1cc, ['_KEVENT']],
   }],
  '_KTRANSACTION_HISTORY': [ 0x8, {
    'RecordType': [0x0, ['Enumeration', {'target': 'long', 'choices': {1: 'KTMOH_CommitTransaction_Result', 2: 'KTMOH_RollbackTransaction_Result'}}]],
    'Payload': [0x4, ['unsigned long']],
   }],
  '_KUSER_SHARED_DATA': [ 0x3b8, {
    'TickCountLowDeprecated': [0x0, ['unsigned long']],
    'TickCountMultiplier': [0x4, ['unsigned long']],
    'InterruptTime': [0x8, ['_KSYSTEM_TIME']],
    'SystemTime': [0x14, ['_KSYSTEM_TIME']],
    'TimeZoneBias': [0x20, ['_KSYSTEM_TIME']],
    'ImageNumberLow': [0x2c, ['unsigned short']],
    'ImageNumberHigh': [0x2e, ['unsigned short']],
    'NtSystemRoot': [0x30, ['array', 260, ['wchar']]],
    'MaxStackTraceDepth': [0x238, ['unsigned long']],
    'CryptoExponent': [0x23c, ['unsigned long']],
    'TimeZoneId': [0x240, ['unsigned long']],
    'LargePageMinimum': [0x244, ['unsigned long']],
    'Reserved2': [0x248, ['array', 7, ['unsigned long']]],
    'NtProductType': [0x264, ['Enumeration', {'target': 'long', 'choices': {1: 'NtProductWinNt', 2: 'NtProductLanManNt', 3: 'NtProductServer'}}]],
    'ProductTypeIsValid': [0x268, ['unsigned char']],
    'NtMajorVersion': [0x26c, ['unsigned long']],
    'NtMinorVersion': [0x270, ['unsigned long']],
    'ProcessorFeatures': [0x274, ['array', 64, ['unsigned char']]],
    'Reserved1': [0x2b4, ['unsigned long']],
    'Reserved3': [0x2b8, ['unsigned long']],
    'TimeSlip': [0x2bc, ['unsigned long']],
    'AlternativeArchitecture': [0x2c0, ['Enumeration', {'target': 'long', 'choices': {0: 'StandardDesign', 1: 'NEC98x86', 2: 'EndAlternatives'}}]],
    'SystemExpirationDate': [0x2c8, ['_LARGE_INTEGER']],
    'SuiteMask': [0x2d0, ['unsigned long']],
    'KdDebuggerEnabled': [0x2d4, ['unsigned char']],
    'NXSupportPolicy': [0x2d5, ['unsigned char']],
    'ActiveConsoleId': [0x2d8, ['unsigned long']],
    'DismountCount': [0x2dc, ['unsigned long']],
    'ComPlusPackage': [0x2e0, ['unsigned long']],
    'LastSystemRITEventTickCount': [0x2e4, ['unsigned long']],
    'NumberOfPhysicalPages': [0x2e8, ['unsigned long']],
    'SafeBootMode': [0x2ec, ['unsigned char']],
    'DbgInstallerDetectEnabled': [0x2f0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'DbgSEHValidationEnabled': [0x2f0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'DbgErrorPortPresent': [0x2f0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'DbgDynProcessorEnabled': [0x2f0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'SharedDataFlags': [0x2f0, ['unsigned long']],
    'DbgVirtEnabled': [0x2f0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'DbgSystemDllRelocated': [0x2f0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'SpareBits': [0x2f0, ['BitField', {'end_bit': 32, 'start_bit': 7}]],
    'DbgElevationEnabled': [0x2f0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'TestRetInstruction': [0x2f8, ['unsigned long long']],
    'SystemCall': [0x300, ['unsigned long']],
    'SystemCallReturn': [0x304, ['unsigned long']],
    'SystemCallPad': [0x308, ['array', 3, ['unsigned long long']]],
    'TickCount': [0x320, ['_KSYSTEM_TIME']],
    'TickCountQuad': [0x320, ['unsigned long long']],
    'Cookie': [0x330, ['unsigned long']],
    'ConsoleSessionForegroundProcessId': [0x338, ['long long']],
    'Wow64SharedInformation': [0x340, ['array', 16, ['unsigned long']]],
    'UserModeGlobalLogger': [0x380, ['array', 8, ['unsigned short']]],
    'HeapTracingPid': [0x390, ['array', 2, ['unsigned long']]],
    'CritSecTracingPid': [0x398, ['array', 2, ['unsigned long']]],
    'ImageFileExecutionOptions': [0x3a0, ['unsigned long']],
    'LangGenerationCount': [0x3a4, ['unsigned long']],
    'ActiveProcessorAffinity': [0x3a8, ['unsigned long']],
    'AffinityPad': [0x3a8, ['unsigned long long']],
    'InterruptTimeBias': [0x3b0, ['unsigned long long']],
   }],
  '_LOADER_PARAMETER_EXTENSION': [ 0x84, {
    'Size': [0x0, ['unsigned long']],
    'Profile': [0x4, ['_PROFILE_PARAMETER_BLOCK']],
    'MajorVersion': [0x14, ['unsigned long']],
    'MinorVersion': [0x18, ['unsigned long']],
    'EmInfFileImage': [0x1c, ['pointer', ['void']]],
    'EmInfFileSize': [0x20, ['unsigned long']],
    'TriageDumpBlock': [0x24, ['pointer', ['void']]],
    'LoaderPagesSpanned': [0x28, ['unsigned long']],
    'HeadlessLoaderBlock': [0x2c, ['pointer', ['_HEADLESS_LOADER_BLOCK']]],
    'SMBiosEPSHeader': [0x30, ['pointer', ['_SMBIOS_TABLE_HEADER']]],
    'DrvDBImage': [0x34, ['pointer', ['void']]],
    'DrvDBSize': [0x38, ['unsigned long']],
    'NetworkLoaderBlock': [0x3c, ['pointer', ['_NETWORK_LOADER_BLOCK']]],
    'HalpIRQLToTPR': [0x40, ['pointer', ['unsigned char']]],
    'HalpVectorToIRQL': [0x44, ['pointer', ['unsigned char']]],
    'FirmwareDescriptorListHead': [0x48, ['_LIST_ENTRY']],
    'AcpiTable': [0x50, ['pointer', ['void']]],
    'AcpiTableSize': [0x54, ['unsigned long']],
    'BootViaWinload': [0x58, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Reserved': [0x58, ['BitField', {'end_bit': 32, 'start_bit': 1}]],
    'LoaderPerformanceData': [0x5c, ['pointer', ['_LOADER_PERFORMANCE_DATA']]],
    'BootApplicationPersistentData': [0x60, ['_LIST_ENTRY']],
    'WmdTestResult': [0x68, ['pointer', ['void']]],
    'BootIdentifier': [0x6c, ['_GUID']],
    'ResumePages': [0x7c, ['unsigned long']],
    'DumpHeader': [0x80, ['pointer', ['void']]],
   }],
  '_MEMORY_ALLOCATION_DESCRIPTOR': [ 0x14, {
    'ListEntry': [0x0, ['_LIST_ENTRY']],
    'MemoryType': [0x8, ['Enumeration', {'target': 'long', 'choices': {0: 'LoaderExceptionBlock', 1: 'LoaderSystemBlock', 2: 'LoaderFree', 3: 'LoaderBad', 4: 'LoaderLoadedProgram', 5: 'LoaderFirmwareTemporary', 6: 'LoaderFirmwarePermanent', 7: 'LoaderOsloaderHeap', 8: 'LoaderOsloaderStack', 9: 'LoaderSystemCode', 10: 'LoaderHalCode', 11: 'LoaderBootDriver', 12: 'LoaderConsoleInDriver', 13: 'LoaderConsoleOutDriver', 14: 'LoaderStartupDpcStack', 15: 'LoaderStartupKernelStack', 16: 'LoaderStartupPanicStack', 17: 'LoaderStartupPcrPage', 18: 'LoaderStartupPdrPage', 19: 'LoaderRegistryData', 20: 'LoaderMemoryData', 21: 'LoaderNlsData', 22: 'LoaderSpecialMemory', 23: 'LoaderBBTMemory', 24: 'LoaderReserve', 25: 'LoaderXIPRom', 26: 'LoaderHALCachedMemory', 27: 'LoaderLargePageFiller', 28: 'LoaderErrorLogMemory', 29: 'LoaderMaximum'}}]],
    'BasePage': [0xc, ['unsigned long']],
    'PageCount': [0x10, ['unsigned long']],
   }],
  '_MMPAGING_FILE': [ 0x50, {
    'Size': [0x0, ['unsigned long']],
    'MaximumSize': [0x4, ['unsigned long']],
    'MinimumSize': [0x8, ['unsigned long']],
    'FreeSpace': [0xc, ['unsigned long']],
    'PeakUsage': [0x10, ['unsigned long']],
    'HighestPage': [0x14, ['unsigned long']],
    'File': [0x18, ['pointer', ['_FILE_OBJECT']]],
    'Entry': [0x1c, ['array', 2, ['pointer', ['_MMMOD_WRITER_MDL_ENTRY']]]],
    'PageFileName': [0x24, ['_UNICODE_STRING']],
    'Bitmap': [0x2c, ['pointer', ['_RTL_BITMAP']]],
    'BitmapHint': [0x30, ['unsigned long']],
    'LastAllocationSize': [0x34, ['unsigned long']],
    'Spare0': [0x38, ['BitField', {'end_bit': 16, 'start_bit': 5}]],
    'BootPartition': [0x38, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'PageFileNumber': [0x38, ['BitField', {'end_bit': 4, 'start_bit': 0}]],
    'AdriftMdls': [0x3a, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Spare1': [0x3a, ['BitField', {'end_bit': 16, 'start_bit': 1}]],
    'FileHandle': [0x3c, ['pointer', ['void']]],
    'AvailableList': [0x40, ['_SLIST_HEADER']],
    'NeedProcessingList': [0x48, ['_SLIST_HEADER']],
   }],
  '_MMPFNENTRY': [ 0x2, {
    'Modified': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'ReadInProgress': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'PageLocation': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    'WriteInProgress': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'CacheAttribute': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 6}]],
    'ParityError': [0x1, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'KernelStack': [0x1, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'Priority': [0x1, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    'InPageError': [0x1, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'RemovalRequested': [0x1, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'Rom': [0x1, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
   }],
  '_MMPFNLIST': [ 0x10, {
    'Total': [0x0, ['unsigned long']],
    'ListName': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'ZeroedPageList', 1: 'FreePageList', 2: 'StandbyPageList', 3: 'ModifiedPageList', 4: 'ModifiedNoWritePageList', 5: 'BadPageList', 6: 'ActiveAndValid', 7: 'TransitionPage'}}]],
    'Flink': [0x8, ['unsigned long']],
    'Blink': [0xc, ['unsigned long']],
   }],
  '_MMPTE_HARDWARE': [ 0x4, {
    'LargePage': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'CopyOnWrite': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'Dirty1': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'CacheDisable': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'Write': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'Valid': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Dirty': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'Accessed': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'Prototype': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'PageFrameNumber': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
    'Global': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'WriteThrough': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Owner': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
   }],
  '_MMPTE_LIST': [ 0x4, {
    'filler1': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'OneEntry': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Valid': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Prototype': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'NextEntry': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
    'filler0': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 2}]],
   }],
  '_MMPTE_PROTOTYPE': [ 0x4, {
    'Prototype': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'ReadOnly': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'Valid': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ProtoAddressHigh': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 11}]],
    'ProtoAddressLow': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 1}]],
   }],
  '_MMPTE_SOFTWARE': [ 0x4, {
    'PageFileLow': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 1}]],
    'PageFileHigh': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
    'Transition': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'Protection': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 5}]],
    'Valid': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Prototype': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
   }],
  '_MMPTE_SUBSECTION': [ 0x4, {
    'Prototype': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'SubsectionAddressHigh': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 11}]],
    'Valid': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'SubsectionAddressLow': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 1}]],
   }],
  '_MMPTE_TIMESTAMP': [ 0x4, {
    'PageFileLow': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 1}]],
    'GlobalTimeStamp': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
    'Transition': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'Protection': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 5}]],
    'MustBeZero': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Prototype': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
   }],
  '_MMPTE_TRANSITION': [ 0x4, {
    'Write': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'WriteThrough': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Valid': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'PageFrameNumber': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
    'Transition': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'Owner': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Protection': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 5}]],
    'CacheDisable': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'Prototype': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
   }],
  '_MMSECTION_FLAGS': [ 0x4, {
    'Based': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'CopyOnWrite': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'PreferredNode': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 26}]],
    'Commit': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'Networked': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'NoChange': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'FailAllIo': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'UserReference': [0x0, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'FilePointerNull': [0x0, ['BitField', {'end_bit': 20, 'start_bit': 19}]],
    'DeleteOnClose': [0x0, ['BitField', {'end_bit': 19, 'start_bit': 18}]],
    'UserWritable': [0x0, ['BitField', {'end_bit': 26, 'start_bit': 25}]],
    'Spare': [0x0, ['BitField', {'end_bit': 25, 'start_bit': 24}]],
    'NoModifiedWriting': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'GlobalMemory': [0x0, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'CollidedFlush': [0x0, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'WasPurged': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'BeingCreated': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'BeingDeleted': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'SetMappedFileIoComplete': [0x0, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'Accessed': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'BeingPurged': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Reserve': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'PhysicalMemory': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'Rom': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'GlobalOnlyPerSession': [0x0, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'Image': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'File': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
   }],
  '_MMSECURE_FLAGS': [ 0x4, {
    'NoWrite': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'ReadOnly': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Spare': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 2}]],
   }],
  '_MMSUBSECTION_FLAGS': [ 0x4, {
    'StartingSector4132': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 6}]],
    'Protection': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 1}]],
    'SubsectionAccessed': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'SubsectionStatic': [0x2, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'SectorEndOffset': [0x2, ['BitField', {'end_bit': 16, 'start_bit': 4}]],
    'Spare': [0x2, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'GlobalMemory': [0x2, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'DirtyPages': [0x2, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
   }],
  '_MMSUPPORT_FLAGS': [ 0x4, {
    'ForceTrim': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'SessionMaster': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'ModwriterAttached': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'MaximumWorkingSetHard': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'MinimumWorkingSetHard': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'SessionSpace': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'TrimmerAttached': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'TrimHard': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'PageStealers': [0x1, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'Reserved': [0x1, ['BitField', {'end_bit': 4, 'start_bit': 1}]],
    'TrimmerDetaching': [0x1, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'MemoryPriority': [0x2, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'Available': [0x3, ['BitField', {'end_bit': 8, 'start_bit': 3}]],
    'VmExiting': [0x3, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'ExpansionFailed': [0x3, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'WsleDeleted': [0x3, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '_MMVAD_FLAGS': [ 0x4, {
    'NoChange': [0x0, ['BitField', {'end_bit': 20, 'start_bit': 19}]],
    'PrivateMemory': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
    'CommitCharge': [0x0, ['BitField', {'end_bit': 19, 'start_bit': 0}]],
    'MemCommit': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'VadType': [0x0, ['BitField', {'end_bit': 23, 'start_bit': 20}]],
    'Protection': [0x0, ['BitField', {'end_bit': 29, 'start_bit': 24}]],
    'Spare': [0x0, ['BitField', {'end_bit': 31, 'start_bit': 29}]],
   }],
  '_MMVAD_FLAGS2': [ 0x4, {
    'FileOffset': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 0}]],
    'Spare': [0x0, ['BitField', {'end_bit': 28, 'start_bit': 27}]],
    'Inherit': [0x0, ['BitField', {'end_bit': 31, 'start_bit': 30}]],
    'CopyOnWrite': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
    'SecNoChange': [0x0, ['BitField', {'end_bit': 25, 'start_bit': 24}]],
    'LongVad': [0x0, ['BitField', {'end_bit': 29, 'start_bit': 28}]],
    'ExtendableFile': [0x0, ['BitField', {'end_bit': 30, 'start_bit': 29}]],
    'OneSecured': [0x0, ['BitField', {'end_bit': 26, 'start_bit': 25}]],
    'MultipleSecured': [0x0, ['BitField', {'end_bit': 27, 'start_bit': 26}]],
   }],
  '_MMVAD_FLAGS3': [ 0x4, {
    'Spare2': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'Teb': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'SequentialAccess': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'PreferredNode': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 0}]],
    'LastSequentialTrim': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 9}]],
    'Spare': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
   }],
  '_MMVIEW': [ 0x8, {
    'Entry': [0x0, ['unsigned long']],
    'Writable': [0x4, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ControlArea': [0x4, ['pointer', ['_CONTROL_AREA']]],
   }],
  '_MMWSLENTRY': [ 0x4, {
    'LockedInWs': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Valid': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'VirtualPageNumber': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
    'LockedInMemory': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Protection': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 3}]],
    'Age': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 10}]],
    'Hashed': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'Direct': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
   }],
  '_MMWSLE_FREE_ENTRY': [ 0x4, {
    'MustBeZero': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'PreviousFree': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 1}]],
    'NextFree': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 12}]],
   }],
  '_MM_AVL_TABLE': [ 0x20, {
    'BalancedRoot': [0x0, ['_MMADDRESS_NODE']],
    'DepthOfTree': [0x14, ['BitField', {'end_bit': 5, 'start_bit': 0}]],
    'Unused': [0x14, ['BitField', {'end_bit': 8, 'start_bit': 5}]],
    'NumberGenericTableElements': [0x14, ['BitField', {'end_bit': 32, 'start_bit': 8}]],
    'NodeHint': [0x18, ['pointer', ['void']]],
    'NodeFreeHint': [0x1c, ['pointer', ['void']]],
   }],
  '_MM_PAGE_ACCESS_INFO': [ 0x8, {
    'FileOffset': [0x0, ['unsigned long long']],
    'Spare0': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 3}]],
    'Flags': [0x0, ['_MM_PAGE_ACCESS_INFO_FLAGS']],
    'DontUse0': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    'VirtualAddress': [0x0, ['pointer', ['void']]],
    'PointerProtoPte': [0x4, ['pointer', ['void']]],
   }],
  '_MM_PAGE_ACCESS_INFO_HEADER': [ 0x38, {
    'Link': [0x0, ['_SINGLE_LIST_ENTRY']],
    'Type': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'MmPteAccessType', 1: 'MmCcReadAheadType', 2: 'MmPfnRepurposeType', 3: 'MmMaximumPageAccessType'}}]],
    'CurrentFileIndex': [0x8, ['unsigned long']],
    'EmptySequenceNumber': [0x8, ['unsigned long']],
    'CreateTime': [0x10, ['unsigned long long']],
    'TempEntry': [0x18, ['pointer', ['_MM_PAGE_ACCESS_INFO']]],
    'EmptyTime': [0x18, ['unsigned long long']],
    'PageFrameEntry': [0x20, ['pointer', ['unsigned long']]],
    'PageEntry': [0x20, ['pointer', ['_MM_PAGE_ACCESS_INFO']]],
    'LastPageFrameEntry': [0x24, ['pointer', ['unsigned long']]],
    'FileEntry': [0x24, ['pointer', ['unsigned long']]],
    'FirstFileEntry': [0x28, ['pointer', ['unsigned long']]],
    'Process': [0x2c, ['pointer', ['_EPROCESS']]],
    'SessionId': [0x30, ['unsigned long']],
   }],
  '_MM_SESSION_SPACE_FLAGS': [ 0x4, {
    'WsInitialized': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'DynamicVaInitialized': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'DeletePending': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'PoolDestroyed': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'ObjectInitialized': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'Initialized': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Filler': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 7}]],
    'PoolInitialized': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
   }],
  '_MM_SUBSECTION_AVL_TABLE': [ 0x20, {
    'BalancedRoot': [0x0, ['_MMSUBSECTION_NODE']],
    'Unused': [0x18, ['BitField', {'end_bit': 8, 'start_bit': 5}]],
    'NumberGenericTableElements': [0x18, ['BitField', {'end_bit': 32, 'start_bit': 8}]],
    'DepthOfTree': [0x18, ['BitField', {'end_bit': 5, 'start_bit': 0}]],
    'NodeHint': [0x1c, ['pointer', ['void']]],
   }],
  '_OBJECT_HANDLE_COUNT_ENTRY': [ 0x8, {
    'Process': [0x0, ['pointer', ['_EPROCESS']]],
    'LockCount': [0x4, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'HandleCount': [0x4, ['BitField', {'end_bit': 24, 'start_bit': 0}]],
   }],
  '_OBJECT_TYPE_INITIALIZER': [ 0x50, {
    'Length': [0x0, ['unsigned short']],
    'UseDefaultObject': [0x2, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'CaseInsensitive': [0x2, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'SecurityRequired': [0x2, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'ObjectTypeFlags': [0x2, ['unsigned char']],
    'UnnamedObjectsOnly': [0x2, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'SupportsObjectCallbacks': [0x2, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'MaintainTypeList': [0x2, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'MaintainHandleCount': [0x2, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'ObjectTypeCode': [0x4, ['unsigned long']],
    'InvalidAttributes': [0x8, ['unsigned long']],
    'GenericMapping': [0xc, ['_GENERIC_MAPPING']],
    'ValidAccessMask': [0x1c, ['unsigned long']],
    'RetainAccess': [0x20, ['unsigned long']],
    'PoolType': [0x24, ['Enumeration', {'target': 'long', 'choices': {0: 'NonPagedPool', 1: 'PagedPool', 2: 'NonPagedPoolMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolCacheAlignedMustS', 7: 'MaxPoolType', 32: 'NonPagedPoolSession', 33: 'PagedPoolSession', 34: 'NonPagedPoolMustSucceedSession', 35: 'DontUseThisTypeSession', 36: 'NonPagedPoolCacheAlignedSession', 37: 'PagedPoolCacheAlignedSession', 38: 'NonPagedPoolCacheAlignedMustSSession'}}]],
    'DefaultPagedPoolCharge': [0x28, ['unsigned long']],
    'DefaultNonPagedPoolCharge': [0x2c, ['unsigned long']],
    'DumpProcedure': [0x30, ['pointer', ['void']]],
    'OpenProcedure': [0x34, ['pointer', ['void']]],
    'CloseProcedure': [0x38, ['pointer', ['void']]],
    'DeleteProcedure': [0x3c, ['pointer', ['void']]],
    'ParseProcedure': [0x40, ['pointer', ['void']]],
    'SecurityProcedure': [0x44, ['pointer', ['void']]],
    'QueryNameProcedure': [0x48, ['pointer', ['void']]],
    'OkayToCloseProcedure': [0x4c, ['pointer', ['void']]],
   }],
  '_PEB': [ 0x238, {
    'InheritedAddressSpace': [0x0, ['unsigned char']],
    'ReadImageFileExecOptions': [0x1, ['unsigned char']],
    'BeingDebugged': [0x2, ['unsigned char']],
    'BitField': [0x3, ['unsigned char']],
    'IsImageDynamicallyRelocated': [0x3, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'SkipPatchingUser32Forwarders': [0x3, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'ImageUsesLargePages': [0x3, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'IsLegacyProcess': [0x3, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'IsProtectedProcess': [0x3, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'SpareBits': [0x3, ['BitField', {'end_bit': 8, 'start_bit': 5}]],
    'Mutant': [0x4, ['pointer', ['void']]],
    'ImageBaseAddress': [0x8, ['pointer', ['void']]],
    'Ldr': [0xc, ['pointer', ['_PEB_LDR_DATA']]],
    'ProcessParameters': [0x10, ['pointer', ['_RTL_USER_PROCESS_PARAMETERS']]],
    'SubSystemData': [0x14, ['pointer', ['void']]],
    'ProcessHeap': [0x18, ['pointer', ['void']]],
    'FastPebLock': [0x1c, ['pointer', ['_RTL_CRITICAL_SECTION']]],
    'AtlThunkSListPtr': [0x20, ['pointer', ['void']]],
    'IFEOKey': [0x24, ['pointer', ['void']]],
    'ProcessUsingVCH': [0x28, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'ProcessInitializing': [0x28, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'CrossProcessFlags': [0x28, ['unsigned long']],
    'ReservedBits0': [0x28, ['BitField', {'end_bit': 32, 'start_bit': 4}]],
    'ProcessInJob': [0x28, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ProcessUsingVEH': [0x28, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'UserSharedInfoPtr': [0x2c, ['pointer', ['void']]],
    'KernelCallbackTable': [0x2c, ['pointer', ['void']]],
    'SystemReserved': [0x30, ['array', 1, ['unsigned long']]],
    'SpareUlong': [0x34, ['unsigned long']],
    'SparePebPtr0': [0x38, ['unsigned long']],
    'TlsExpansionCounter': [0x3c, ['unsigned long']],
    'TlsBitmap': [0x40, ['pointer', ['void']]],
    'TlsBitmapBits': [0x44, ['array', 2, ['unsigned long']]],
    'ReadOnlySharedMemoryBase': [0x4c, ['pointer', ['void']]],
    'HotpatchInformation': [0x50, ['pointer', ['void']]],
    'ReadOnlyStaticServerData': [0x54, ['pointer', ['pointer', ['void']]]],
    'AnsiCodePageData': [0x58, ['pointer', ['void']]],
    'OemCodePageData': [0x5c, ['pointer', ['void']]],
    'UnicodeCaseTableData': [0x60, ['pointer', ['void']]],
    'NumberOfProcessors': [0x64, ['unsigned long']],
    'NtGlobalFlag': [0x68, ['unsigned long']],
    'CriticalSectionTimeout': [0x70, ['_LARGE_INTEGER']],
    'HeapSegmentReserve': [0x78, ['unsigned long']],
    'HeapSegmentCommit': [0x7c, ['unsigned long']],
    'HeapDeCommitTotalFreeThreshold': [0x80, ['unsigned long']],
    'HeapDeCommitFreeBlockThreshold': [0x84, ['unsigned long']],
    'NumberOfHeaps': [0x88, ['unsigned long']],
    'MaximumNumberOfHeaps': [0x8c, ['unsigned long']],
    'ProcessHeaps': [0x90, ['pointer', ['pointer', ['void']]]],
    'GdiSharedHandleTable': [0x94, ['pointer', ['void']]],
    'ProcessStarterHelper': [0x98, ['pointer', ['void']]],
    'GdiDCAttributeList': [0x9c, ['unsigned long']],
    'LoaderLock': [0xa0, ['pointer', ['_RTL_CRITICAL_SECTION']]],
    'OSMajorVersion': [0xa4, ['unsigned long']],
    'OSMinorVersion': [0xa8, ['unsigned long']],
    'OSBuildNumber': [0xac, ['unsigned short']],
    'OSCSDVersion': [0xae, ['unsigned short']],
    'OSPlatformId': [0xb0, ['unsigned long']],
    'ImageSubsystem': [0xb4, ['unsigned long']],
    'ImageSubsystemMajorVersion': [0xb8, ['unsigned long']],
    'ImageSubsystemMinorVersion': [0xbc, ['unsigned long']],
    'ActiveProcessAffinityMask': [0xc0, ['unsigned long']],
    'GdiHandleBuffer': [0xc4, ['array', 34, ['unsigned long']]],
    'PostProcessInitRoutine': [0x14c, ['pointer', ['void']]],
    'TlsExpansionBitmap': [0x150, ['pointer', ['void']]],
    'TlsExpansionBitmapBits': [0x154, ['array', 32, ['unsigned long']]],
    'SessionId': [0x1d4, ['unsigned long']],
    'AppCompatFlags': [0x1d8, ['_ULARGE_INTEGER']],
    'AppCompatFlagsUser': [0x1e0, ['_ULARGE_INTEGER']],
    'pShimData': [0x1e8, ['pointer', ['void']]],
    'AppCompatInfo': [0x1ec, ['pointer', ['void']]],
    'CSDVersion': [0x1f0, ['_UNICODE_STRING']],
    'ActivationContextData': [0x1f8, ['pointer', ['_ACTIVATION_CONTEXT_DATA']]],
    'ProcessAssemblyStorageMap': [0x1fc, ['pointer', ['_ASSEMBLY_STORAGE_MAP']]],
    'SystemDefaultActivationContextData': [0x200, ['pointer', ['_ACTIVATION_CONTEXT_DATA']]],
    'SystemAssemblyStorageMap': [0x204, ['pointer', ['_ASSEMBLY_STORAGE_MAP']]],
    'MinimumStackCommit': [0x208, ['unsigned long']],
    'FlsCallback': [0x20c, ['pointer', ['_FLS_CALLBACK_INFO']]],
    'FlsListHead': [0x210, ['_LIST_ENTRY']],
    'FlsBitmap': [0x218, ['pointer', ['void']]],
    'FlsBitmapBits': [0x21c, ['array', 4, ['unsigned long']]],
    'FlsHighIndex': [0x22c, ['unsigned long']],
    'WerRegistrationData': [0x230, ['pointer', ['void']]],
    'WerShipAssertPtr': [0x234, ['pointer', ['void']]],
   }],
  '_PI_BUS_EXTENSION': [ 0x44, {
    'Flags': [0x0, ['unsigned long']],
    'NumberCSNs': [0x4, ['unsigned char']],
    'ReadDataPort': [0x8, ['pointer', ['unsigned char']]],
    'DataPortMapped': [0xc, ['unsigned char']],
    'AddressPort': [0x10, ['pointer', ['unsigned char']]],
    'AddrPortMapped': [0x14, ['unsigned char']],
    'CommandPort': [0x18, ['pointer', ['unsigned char']]],
    'CmdPortMapped': [0x1c, ['unsigned char']],
    'NextSlotNumber': [0x20, ['unsigned long']],
    'DeviceList': [0x24, ['_SINGLE_LIST_ENTRY']],
    'CardList': [0x28, ['_SINGLE_LIST_ENTRY']],
    'PhysicalBusDevice': [0x2c, ['pointer', ['_DEVICE_OBJECT']]],
    'FunctionalBusDevice': [0x30, ['pointer', ['_DEVICE_OBJECT']]],
    'AttachedDevice': [0x34, ['pointer', ['_DEVICE_OBJECT']]],
    'BusNumber': [0x38, ['unsigned long']],
    'SystemPowerState': [0x3c, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'DevicePowerState': [0x40, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerDeviceUnspecified', 1: 'PowerDeviceD0', 2: 'PowerDeviceD1', 3: 'PowerDeviceD2', 4: 'PowerDeviceD3', 5: 'PowerDeviceMaximum'}}]],
   }],
  '_PLUGPLAY_EVENT_BLOCK': [ 0x40, {
    'EventGuid': [0x0, ['_GUID']],
    'EventCategory': [0x10, ['Enumeration', {'target': 'long', 'choices': {0: 'HardwareProfileChangeEvent', 1: 'TargetDeviceChangeEvent', 2: 'DeviceClassChangeEvent', 3: 'CustomDeviceEvent', 4: 'DeviceInstallEvent', 5: 'DeviceArrivalEvent', 6: 'PowerEvent', 7: 'VetoEvent', 8: 'BlockedDriverEvent', 9: 'InvalidIDEvent', 10: 'PowerSettingChange', 11: 'MaxPlugEventCategory'}}]],
    'Result': [0x14, ['pointer', ['unsigned long']]],
    'Flags': [0x18, ['unsigned long']],
    'TotalSize': [0x1c, ['unsigned long']],
    'DeviceObject': [0x20, ['pointer', ['void']]],
    'u': [0x24, ['__unnamed_20a7']],
   }],
  '_PNP_DEVICE_EVENT_ENTRY': [ 0x60, {
    'ListEntry': [0x0, ['_LIST_ENTRY']],
    'Argument': [0x8, ['unsigned long']],
    'CallerEvent': [0xc, ['pointer', ['_KEVENT']]],
    'Callback': [0x10, ['pointer', ['void']]],
    'Context': [0x14, ['pointer', ['void']]],
    'VetoType': [0x18, ['pointer', ['Enumeration', {'target': 'long', 'choices': {0: 'PNP_VetoTypeUnknown', 1: 'PNP_VetoLegacyDevice', 2: 'PNP_VetoPendingClose', 3: 'PNP_VetoWindowsApp', 4: 'PNP_VetoWindowsService', 5: 'PNP_VetoOutstandingOpen', 6: 'PNP_VetoDevice', 7: 'PNP_VetoDriver', 8: 'PNP_VetoIllegalDeviceRequest', 9: 'PNP_VetoInsufficientPower', 10: 'PNP_VetoNonDisableable', 11: 'PNP_VetoLegacyDriver', 12: 'PNP_VetoInsufficientRights'}}]]],
    'VetoName': [0x1c, ['pointer', ['_UNICODE_STRING']]],
    'Data': [0x20, ['_PLUGPLAY_EVENT_BLOCK']],
   }],
  '_PNP_RESOURCE_REQUEST': [ 0x28, {
    'PhysicalDevice': [0x0, ['pointer', ['_DEVICE_OBJECT']]],
    'Flags': [0x4, ['unsigned long']],
    'AllocationType': [0x8, ['Enumeration', {'target': 'long', 'choices': {0: 'ArbiterRequestLegacyReported', 1: 'ArbiterRequestHalReported', 2: 'ArbiterRequestLegacyAssigned', 3: 'ArbiterRequestPnpDetected', 4: 'ArbiterRequestPnpEnumerated', -1: 'ArbiterRequestUndefined'}}]],
    'Priority': [0xc, ['unsigned long']],
    'Position': [0x10, ['unsigned long']],
    'ResourceRequirements': [0x14, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'ReqList': [0x18, ['pointer', ['void']]],
    'ResourceAssignment': [0x1c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'TranslatedResourceAssignment': [0x20, ['pointer', ['_CM_RESOURCE_LIST']]],
    'Status': [0x24, ['long']],
   }],
  '_POOL_DESCRIPTOR': [ 0x1034, {
    'PoolType': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'NonPagedPool', 1: 'PagedPool', 2: 'NonPagedPoolMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolCacheAlignedMustS', 7: 'MaxPoolType', 32: 'NonPagedPoolSession', 33: 'PagedPoolSession', 34: 'NonPagedPoolMustSucceedSession', 35: 'DontUseThisTypeSession', 36: 'NonPagedPoolCacheAlignedSession', 37: 'PagedPoolCacheAlignedSession', 38: 'NonPagedPoolCacheAlignedMustSSession'}}]],
    'PoolIndex': [0x4, ['unsigned long']],
    'RunningAllocs': [0x8, ['long']],
    'RunningDeAllocs': [0xc, ['long']],
    'TotalPages': [0x10, ['long']],
    'TotalBigPages': [0x14, ['long']],
    'Threshold': [0x18, ['unsigned long']],
    'LockAddress': [0x1c, ['pointer', ['void']]],
    'PendingFrees': [0x20, ['pointer', ['pointer', ['void']]]],
    'ThreadsProcessingDeferrals': [0x24, ['long']],
    'PendingFreeDepth': [0x28, ['long']],
    'TotalBytes': [0x2c, ['unsigned long']],
    'Spare0': [0x30, ['unsigned long']],
    'ListHeads': [0x34, ['array', 512, ['_LIST_ENTRY']]],
   }],
  '_POOL_HEADER': [ 0x8, {
    'PreviousSize': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 0}]],
    'Ulong1': [0x0, ['unsigned long']],
    'PoolIndex': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 9}]],
    'PoolType': [0x2, ['BitField', {'end_bit': 16, 'start_bit': 9}]],
    'BlockSize': [0x2, ['BitField', {'end_bit': 9, 'start_bit': 0}]],
    'AllocatorBackTraceIndex': [0x4, ['unsigned short']],
    'PoolTag': [0x4, ['unsigned long']],
    'PoolTagHash': [0x6, ['unsigned short']],
   }],
  '_POP_ACTION_TRIGGER': [ 0x10, {
    'Type': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'PolicyDeviceSystemButton', 1: 'PolicyDeviceThermalZone', 2: 'PolicyDeviceBattery', 3: 'PolicyDeviceMemory', 4: 'PolicyInitiatePowerActionAPI', 5: 'PolicySetPowerStateAPI', 6: 'PolicyImmediateDozeS4', 7: 'PolicySystemIdle', 8: 'PolicyDeviceMax'}}]],
    'Flags': [0x4, ['unsigned long']],
    'Wait': [0x8, ['pointer', ['_POP_TRIGGER_WAIT']]],
    'Battery': [0xc, ['__unnamed_1dcb']],
    'Button': [0xc, ['__unnamed_1dcd']],
   }],
  '_POP_DEVICE_SYS_STATE': [ 0x188, {
    'IrpMinor': [0x0, ['unsigned char']],
    'SystemState': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'SpinLock': [0x8, ['unsigned long']],
    'Thread': [0xc, ['pointer', ['_KTHREAD']]],
    'AbortEvent': [0x10, ['pointer', ['_KEVENT']]],
    'ReadySemaphore': [0x14, ['pointer', ['_KSEMAPHORE']]],
    'FinishedSemaphore': [0x18, ['pointer', ['_KSEMAPHORE']]],
    'GetNewDeviceList': [0x1c, ['unsigned char']],
    'Order': [0x20, ['_PO_DEVICE_NOTIFY_ORDER']],
    'NotifyGdiLevelForPowerOn': [0x168, ['long']],
    'NotifyGdiLevelForResumeUI': [0x16c, ['long']],
    'Pending': [0x170, ['_LIST_ENTRY']],
    'Status': [0x178, ['long']],
    'FailedDevice': [0x17c, ['pointer', ['_DEVICE_OBJECT']]],
    'Waking': [0x180, ['unsigned char']],
    'Cancelled': [0x181, ['unsigned char']],
    'IgnoreErrors': [0x182, ['unsigned char']],
    'IgnoreNotImplemented': [0x183, ['unsigned char']],
    'TimeRefreshLockAcquired': [0x184, ['unsigned char']],
   }],
  '_POP_POWER_ACTION': [ 0xa0, {
    'Updates': [0x0, ['unsigned char']],
    'State': [0x1, ['unsigned char']],
    'Shutdown': [0x2, ['unsigned char']],
    'Action': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerActionNone', 1: 'PowerActionReserved', 2: 'PowerActionSleep', 3: 'PowerActionHibernate', 4: 'PowerActionShutdown', 5: 'PowerActionShutdownReset', 6: 'PowerActionShutdownOff', 7: 'PowerActionWarmEject'}}]],
    'LightestState': [0x8, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'Flags': [0xc, ['unsigned long']],
    'Status': [0x10, ['long']],
    'DeviceType': [0x14, ['Enumeration', {'target': 'long', 'choices': {0: 'PolicyDeviceSystemButton', 1: 'PolicyDeviceThermalZone', 2: 'PolicyDeviceBattery', 3: 'PolicyDeviceMemory', 4: 'PolicyInitiatePowerActionAPI', 5: 'PolicySetPowerStateAPI', 6: 'PolicyImmediateDozeS4', 7: 'PolicySystemIdle', 8: 'PolicyDeviceMax'}}]],
    'DeviceTypeFlags': [0x18, ['unsigned long']],
    'IrpMinor': [0x1c, ['unsigned char']],
    'Waking': [0x1d, ['unsigned char']],
    'SystemState': [0x20, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'NextSystemState': [0x24, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'EffectiveSystemState': [0x28, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'CurrentSystemState': [0x2c, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'ShutdownBugCode': [0x30, ['pointer', ['_POP_SHUTDOWN_BUG_CHECK']]],
    'DevState': [0x34, ['pointer', ['_POP_DEVICE_SYS_STATE']]],
    'DisplayResumeContext': [0x38, ['pointer', ['_POP_DISPLAY_RESUME_CONTEXT']]],
    'HiberContext': [0x3c, ['pointer', ['_POP_HIBER_CONTEXT']]],
    'WakeTime': [0x40, ['unsigned long long']],
    'SleepTime': [0x48, ['unsigned long long']],
    'FilteredCapabilities': [0x50, ['SYSTEM_POWER_CAPABILITIES']],
   }],
  '_POWER_STATE': [ 0x4, {
    'SystemState': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'DeviceState': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerDeviceUnspecified', 1: 'PowerDeviceD0', 2: 'PowerDeviceD1', 3: 'PowerDeviceD2', 4: 'PowerDeviceD3', 5: 'PowerDeviceMaximum'}}]],
   }],
  '_PRIVATE_CACHE_MAP_FLAGS': [ 0x4, {
    'Available': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 21}]],
    'DontUse': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'ReadAheadActive': [0x0, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'ReadAheadEnabled': [0x0, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'PagePriority': [0x0, ['BitField', {'end_bit': 21, 'start_bit': 18}]],
   }],
  '_PS_CLIENT_SECURITY_CONTEXT': [ 0x4, {
    'EffectiveOnly': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'ImpersonationToken': [0x0, ['pointer', ['void']]],
    'ImpersonationLevel': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'ImpersonationData': [0x0, ['unsigned long']],
   }],
  '_PTE_TRACKER': [ 0x30, {
    'ListEntry': [0x0, ['_LIST_ENTRY']],
    'Mdl': [0x8, ['pointer', ['_MDL']]],
    'Count': [0xc, ['unsigned long']],
    'SystemVa': [0x10, ['pointer', ['void']]],
    'StartVa': [0x14, ['pointer', ['void']]],
    'Offset': [0x18, ['unsigned long']],
    'Length': [0x1c, ['unsigned long']],
    'Page': [0x20, ['unsigned long']],
    'IoMapping': [0x24, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Spare': [0x24, ['BitField', {'end_bit': 32, 'start_bit': 4}]],
    'CacheAttribute': [0x24, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    'Matched': [0x24, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'CallingAddress': [0x28, ['pointer', ['void']]],
    'CallersCaller': [0x2c, ['pointer', ['void']]],
   }],
  '_RTL_SRWLOCK': [ 0x4, {
    'Locked': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'MultipleShared': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Value': [0x0, ['unsigned long']],
    'Waking': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Waiting': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Shared': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 4}]],
    'Ptr': [0x0, ['pointer', ['void']]],
   }],
  '_SECTION_IMAGE_INFORMATION': [ 0x30, {
    'TransferAddress': [0x0, ['pointer', ['void']]],
    'ZeroBits': [0x4, ['unsigned long']],
    'MaximumStackSize': [0x8, ['unsigned long']],
    'CommittedStackSize': [0xc, ['unsigned long']],
    'SubSystemType': [0x10, ['unsigned long']],
    'SubSystemMinorVersion': [0x14, ['unsigned short']],
    'SubSystemVersion': [0x14, ['unsigned long']],
    'SubSystemMajorVersion': [0x16, ['unsigned short']],
    'GpValue': [0x18, ['unsigned long']],
    'ImageCharacteristics': [0x1c, ['unsigned short']],
    'DllCharacteristics': [0x1e, ['unsigned short']],
    'Machine': [0x20, ['unsigned short']],
    'ImageContainsCode': [0x22, ['unsigned char']],
    'ComPlusILOnly': [0x23, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'ImageDynamicallyRelocated': [0x23, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'ImageMappedFlat': [0x23, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Reserved': [0x23, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'ImageFlags': [0x23, ['unsigned char']],
    'ComPlusNativeReady': [0x23, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'LoaderFlags': [0x24, ['unsigned long']],
    'ImageFileSize': [0x28, ['unsigned long']],
    'CheckSum': [0x2c, ['unsigned long']],
   }],
  '_SECURITY_QUALITY_OF_SERVICE': [ 0xc, {
    'Length': [0x0, ['unsigned long']],
    'ImpersonationLevel': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'SecurityAnonymous', 1: 'SecurityIdentification', 2: 'SecurityImpersonation', 3: 'SecurityDelegation'}}]],
    'ContextTrackingMode': [0x8, ['unsigned char']],
    'EffectiveOnly': [0x9, ['unsigned char']],
   }],
  '_SECURITY_SUBJECT_CONTEXT': [ 0x10, {
    'ClientToken': [0x0, ['pointer', ['void']]],
    'ImpersonationLevel': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'SecurityAnonymous', 1: 'SecurityIdentification', 2: 'SecurityImpersonation', 3: 'SecurityDelegation'}}]],
    'PrimaryToken': [0x8, ['pointer', ['void']]],
    'ProcessAuditId': [0xc, ['pointer', ['void']]],
   }],
  '_SECURITY_TOKEN_PROXY_DATA': [ 0x18, {
    'Length': [0x0, ['unsigned long']],
    'ProxyClass': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'ProxyFull', 1: 'ProxyService', 2: 'ProxyTree', 3: 'ProxyDirectory'}}]],
    'PathInfo': [0x8, ['_UNICODE_STRING']],
    'ContainerMask': [0x10, ['unsigned long']],
    'ObjectMask': [0x14, ['unsigned long']],
   }],
  '_SEGMENT_FLAGS': [ 0x4, {
    'TotalNumberOfPtes4132': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 0}]],
    'ContainsPxeSubsection': [0x0, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'Binary32': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'ExtraSharedWowSubsections': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'WriteCombined': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'DefaultProtectionMask': [0x0, ['BitField', {'end_bit': 22, 'start_bit': 17}]],
    'LargePages': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'DebugSymbolsLoaded': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'NoCache': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'WatchProto': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'Spare': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'FloppyMedia': [0x0, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
   }],
  '_SYSTEM_POWER_POLICY': [ 0xe8, {
    'Revision': [0x0, ['unsigned long']],
    'PowerButton': [0x4, ['POWER_ACTION_POLICY']],
    'SleepButton': [0x10, ['POWER_ACTION_POLICY']],
    'LidClose': [0x1c, ['POWER_ACTION_POLICY']],
    'LidOpenWake': [0x28, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'Reserved': [0x2c, ['unsigned long']],
    'Idle': [0x30, ['POWER_ACTION_POLICY']],
    'IdleTimeout': [0x3c, ['unsigned long']],
    'IdleSensitivity': [0x40, ['unsigned char']],
    'DynamicThrottle': [0x41, ['unsigned char']],
    'Spare2': [0x42, ['array', 2, ['unsigned char']]],
    'MinSleep': [0x44, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'MaxSleep': [0x48, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'ReducedLatencySleep': [0x4c, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
    'WinLogonFlags': [0x50, ['unsigned long']],
    'Spare3': [0x54, ['unsigned long']],
    'DozeS4Timeout': [0x58, ['unsigned long']],
    'BroadcastCapacityResolution': [0x5c, ['unsigned long']],
    'DischargePolicy': [0x60, ['array', 4, ['SYSTEM_POWER_LEVEL']]],
    'VideoTimeout': [0xc0, ['unsigned long']],
    'VideoDimDisplay': [0xc4, ['unsigned char']],
    'VideoReserved': [0xc8, ['array', 3, ['unsigned long']]],
    'SpindownTimeout': [0xd4, ['unsigned long']],
    'OptimizeForPower': [0xd8, ['unsigned char']],
    'FanThrottleTolerance': [0xd9, ['unsigned char']],
    'ForcedThrottle': [0xda, ['unsigned char']],
    'MinThrottle': [0xdb, ['unsigned char']],
    'OverThrottled': [0xdc, ['POWER_ACTION_POLICY']],
   }],
  '_SYSTEM_POWER_STATE_CONTEXT': [ 0x4, {
    'ContextAsUlong': [0x0, ['unsigned long']],
    'EffectiveSystemState': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 12}]],
    'CurrentSystemState': [0x0, ['BitField', {'end_bit': 20, 'start_bit': 16}]],
    'IgnoreHibernationPath': [0x0, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'Reserved1': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'PseudoTransition': [0x0, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'TargetSystemState': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 8}]],
    'Reserved2': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 22}]],
   }],
  '_TEB': [ 0xff8, {
    'NtTib': [0x0, ['_NT_TIB']],
    'EnvironmentPointer': [0x1c, ['pointer', ['void']]],
    'ClientId': [0x20, ['_CLIENT_ID']],
    'ActiveRpcHandle': [0x28, ['pointer', ['void']]],
    'ThreadLocalStoragePointer': [0x2c, ['pointer', ['void']]],
    'ProcessEnvironmentBlock': [0x30, ['pointer', ['_PEB']]],
    'LastErrorValue': [0x34, ['unsigned long']],
    'CountOfOwnedCriticalSections': [0x38, ['unsigned long']],
    'CsrClientThread': [0x3c, ['pointer', ['void']]],
    'Win32ThreadInfo': [0x40, ['pointer', ['void']]],
    'User32Reserved': [0x44, ['array', 26, ['unsigned long']]],
    'UserReserved': [0xac, ['array', 5, ['unsigned long']]],
    'WOW32Reserved': [0xc0, ['pointer', ['void']]],
    'CurrentLocale': [0xc4, ['unsigned long']],
    'FpSoftwareStatusRegister': [0xc8, ['unsigned long']],
    'SystemReserved1': [0xcc, ['array', 54, ['pointer', ['void']]]],
    'ExceptionCode': [0x1a4, ['long']],
    'ActivationContextStackPointer': [0x1a8, ['pointer', ['_ACTIVATION_CONTEXT_STACK']]],
    'SpareBytes1': [0x1ac, ['array', 36, ['unsigned char']]],
    'TxFsContext': [0x1d0, ['unsigned long']],
    'GdiTebBatch': [0x1d4, ['_GDI_TEB_BATCH']],
    'RealClientId': [0x6b4, ['_CLIENT_ID']],
    'GdiCachedProcessHandle': [0x6bc, ['pointer', ['void']]],
    'GdiClientPID': [0x6c0, ['unsigned long']],
    'GdiClientTID': [0x6c4, ['unsigned long']],
    'GdiThreadLocalInfo': [0x6c8, ['pointer', ['void']]],
    'Win32ClientInfo': [0x6cc, ['array', 62, ['unsigned long']]],
    'glDispatchTable': [0x7c4, ['array', 233, ['pointer', ['void']]]],
    'glReserved1': [0xb68, ['array', 29, ['unsigned long']]],
    'glReserved2': [0xbdc, ['pointer', ['void']]],
    'glSectionInfo': [0xbe0, ['pointer', ['void']]],
    'glSection': [0xbe4, ['pointer', ['void']]],
    'glTable': [0xbe8, ['pointer', ['void']]],
    'glCurrentRC': [0xbec, ['pointer', ['void']]],
    'glContext': [0xbf0, ['pointer', ['void']]],
    'LastStatusValue': [0xbf4, ['unsigned long']],
    'StaticUnicodeString': [0xbf8, ['_UNICODE_STRING']],
    'StaticUnicodeBuffer': [0xc00, ['array', 261, ['wchar']]],
    'DeallocationStack': [0xe0c, ['pointer', ['void']]],
    'TlsSlots': [0xe10, ['array', 64, ['pointer', ['void']]]],
    'TlsLinks': [0xf10, ['_LIST_ENTRY']],
    'Vdm': [0xf18, ['pointer', ['void']]],
    'ReservedForNtRpc': [0xf1c, ['pointer', ['void']]],
    'DbgSsReserved': [0xf20, ['array', 2, ['pointer', ['void']]]],
    'HardErrorMode': [0xf28, ['unsigned long']],
    'Instrumentation': [0xf2c, ['array', 9, ['pointer', ['void']]]],
    'ActivityId': [0xf50, ['_GUID']],
    'SubProcessTag': [0xf60, ['pointer', ['void']]],
    'EtwLocalData': [0xf64, ['pointer', ['void']]],
    'EtwTraceData': [0xf68, ['pointer', ['void']]],
    'WinSockData': [0xf6c, ['pointer', ['void']]],
    'GdiBatchCount': [0xf70, ['unsigned long']],
    'SpareBool0': [0xf74, ['unsigned char']],
    'SpareBool1': [0xf75, ['unsigned char']],
    'SpareBool2': [0xf76, ['unsigned char']],
    'IdealProcessor': [0xf77, ['unsigned char']],
    'GuaranteedStackBytes': [0xf78, ['unsigned long']],
    'ReservedForPerf': [0xf7c, ['pointer', ['void']]],
    'ReservedForOle': [0xf80, ['pointer', ['void']]],
    'WaitingOnLoaderLock': [0xf84, ['unsigned long']],
    'SavedPriorityState': [0xf88, ['pointer', ['void']]],
    'SoftPatchPtr1': [0xf8c, ['unsigned long']],
    'ThreadPoolData': [0xf90, ['pointer', ['void']]],
    'TlsExpansionSlots': [0xf94, ['pointer', ['pointer', ['void']]]],
    'ImpersonationLocale': [0xf98, ['unsigned long']],
    'IsImpersonating': [0xf9c, ['unsigned long']],
    'NlsCache': [0xfa0, ['pointer', ['void']]],
    'pShimData': [0xfa4, ['pointer', ['void']]],
    'HeapVirtualAffinity': [0xfa8, ['unsigned long']],
    'CurrentTransactionHandle': [0xfac, ['pointer', ['void']]],
    'ActiveFrame': [0xfb0, ['pointer', ['_TEB_ACTIVE_FRAME']]],
    'FlsData': [0xfb4, ['pointer', ['void']]],
    'PreferredLanguages': [0xfb8, ['pointer', ['void']]],
    'UserPrefLanguages': [0xfbc, ['pointer', ['void']]],
    'MergedPrefLanguages': [0xfc0, ['pointer', ['void']]],
    'MuiImpersonation': [0xfc4, ['unsigned long']],
    'CrossTebFlags': [0xfc8, ['unsigned short']],
    'SpareCrossTebBits': [0xfc8, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'DbgInDebugPrint': [0xfca, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'DbgSafeThunkCall': [0xfca, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'RtlDisableUserStackWalk': [0xfca, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'SpareSameTebBits': [0xfca, ['BitField', {'end_bit': 16, 'start_bit': 10}]],
    'DbgWerInShipAssertCode': [0xfca, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'SameTebFlags': [0xfca, ['unsigned short']],
    'DbgSkipThreadAttach': [0xfca, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'DbgHasFiberData': [0xfca, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'DbgSuppressDebugMsg': [0xfca, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'RtlExceptionAttached': [0xfca, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'DbgRanProcessInit': [0xfca, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'DbgClonedThread': [0xfca, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'TxnScopeEnterCallback': [0xfcc, ['pointer', ['void']]],
    'TxnScopeExitCallback': [0xfd0, ['pointer', ['void']]],
    'TxnScopeContext': [0xfd4, ['pointer', ['void']]],
    'LockCount': [0xfd8, ['unsigned long']],
    'ProcessRundown': [0xfdc, ['unsigned long']],
    'LastSwitchTime': [0xfe0, ['unsigned long long']],
    'TotalSwitchOutTime': [0xfe8, ['unsigned long long']],
    'WaitReasonBitMap': [0xff0, ['_LARGE_INTEGER']],
   }],
  '_TOKEN': [ 0x1e8, {
    'TokenSource': [0x0, ['_TOKEN_SOURCE']],
    'TokenId': [0x10, ['_LUID']],
    'AuthenticationId': [0x18, ['_LUID']],
    'ParentTokenId': [0x20, ['_LUID']],
    'ExpirationTime': [0x28, ['_LARGE_INTEGER']],
    'TokenLock': [0x30, ['pointer', ['_ERESOURCE']]],
    'ModifiedId': [0x34, ['_LUID']],
    'Privileges': [0x40, ['_SEP_TOKEN_PRIVILEGES']],
    'AuditPolicy': [0x58, ['_SEP_AUDIT_POLICY']],
    'SessionId': [0x74, ['unsigned long']],
    'UserAndGroupCount': [0x78, ['unsigned long']],
    'RestrictedSidCount': [0x7c, ['unsigned long']],
    'VariableLength': [0x80, ['unsigned long']],
    'DynamicCharged': [0x84, ['unsigned long']],
    'DynamicAvailable': [0x88, ['unsigned long']],
    'DefaultOwnerIndex': [0x8c, ['unsigned long']],
    'UserAndGroups': [0x90, ['pointer', ['_SID_AND_ATTRIBUTES']]],
    'RestrictedSids': [0x94, ['pointer', ['_SID_AND_ATTRIBUTES']]],
    'PrimaryGroup': [0x98, ['pointer', ['void']]],
    'DynamicPart': [0x9c, ['pointer', ['unsigned long']]],
    'DefaultDacl': [0xa0, ['pointer', ['_ACL']]],
    'TokenType': [0xa4, ['Enumeration', {'target': 'long', 'choices': {1: 'TokenPrimary', 2: 'TokenImpersonation'}}]],
    'ImpersonationLevel': [0xa8, ['Enumeration', {'target': 'long', 'choices': {0: 'SecurityAnonymous', 1: 'SecurityIdentification', 2: 'SecurityImpersonation', 3: 'SecurityDelegation'}}]],
    'TokenFlags': [0xac, ['unsigned long']],
    'TokenInUse': [0xb0, ['unsigned char']],
    'IntegrityLevelIndex': [0xb4, ['unsigned long']],
    'MandatoryPolicy': [0xb8, ['unsigned long']],
    'ProxyData': [0xbc, ['pointer', ['_SECURITY_TOKEN_PROXY_DATA']]],
    'AuditData': [0xc0, ['pointer', ['_SECURITY_TOKEN_AUDIT_DATA']]],
    'LogonSession': [0xc4, ['pointer', ['_SEP_LOGON_SESSION_REFERENCES']]],
    'OriginatingLogonSession': [0xc8, ['_LUID']],
    'SidHash': [0xd0, ['_SID_AND_ATTRIBUTES_HASH']],
    'RestrictedSidHash': [0x158, ['_SID_AND_ATTRIBUTES_HASH']],
    'VariablePart': [0x1e0, ['unsigned long']],
   }],
  '_VF_BTS_RECORD': [ 0xc, {
    'JumpedFrom': [0x0, ['pointer', ['void']]],
    'JumpedTo': [0x4, ['pointer', ['void']]],
    'Unused1': [0x8, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    'Unused2': [0x8, ['BitField', {'end_bit': 32, 'start_bit': 7}]],
    'Predicted': [0x8, ['BitField', {'end_bit': 7, 'start_bit': 3}]],
   }],
  '_VF_TRACKER_STAMP': [ 0x8, {
    'Thread': [0x0, ['pointer', ['void']]],
    'Flags': [0x4, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'OldIrql': [0x5, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'NewIrql': [0x6, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'Processor': [0x7, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
   }],
  '_VI_DEADLOCK_RESOURCE': [ 0x80, {
    'Type': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'VfDeadlockUnknown', 1: 'VfDeadlockMutex', 2: 'VfDeadlockMutexAbandoned', 3: 'VfDeadlockFastMutex', 4: 'VfDeadlockFastMutexUnsafe', 5: 'VfDeadlockSpinLock', 6: 'VfDeadlockTypeMaximum'}}]],
    'RecursionCount': [0x4, ['BitField', {'end_bit': 32, 'start_bit': 16}]],
    'NodeCount': [0x4, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'ResourceAddress': [0x8, ['pointer', ['void']]],
    'ThreadOwner': [0xc, ['pointer', ['_VI_DEADLOCK_THREAD']]],
    'ResourceList': [0x10, ['_LIST_ENTRY']],
    'FreeListEntry': [0x18, ['_LIST_ENTRY']],
    'HashChainList': [0x18, ['_LIST_ENTRY']],
    'StackTrace': [0x20, ['array', 8, ['pointer', ['void']]]],
    'LastAcquireTrace': [0x40, ['array', 8, ['pointer', ['void']]]],
    'LastReleaseTrace': [0x60, ['array', 8, ['pointer', ['void']]]],
   }],
  '_WHEA_ERROR_PACKET': [ 0x119, {
    'Signature': [0x0, ['unsigned long']],
    'Flags': [0x4, ['_WHEA_ERROR_PACKET_FLAGS']],
    'Size': [0x8, ['unsigned long']],
    'RawDataLength': [0xc, ['unsigned long']],
    'Reserved1': [0x10, ['unsigned long long']],
    'Context': [0x18, ['unsigned long long']],
    'ErrorType': [0x20, ['Enumeration', {'target': 'long', 'choices': {0: 'WheaErrTypeProcessor', 1: 'WheaErrTypeMemory', 2: 'WheaErrTypePCIExpress', 3: 'WheaErrTypeNMI', 4: 'WheaErrTypePCIXBus', 5: 'WheaErrTypePCIXDevice', 6: 'WheaErrTypeGeneric'}}]],
    'ErrorSeverity': [0x24, ['Enumeration', {'target': 'long', 'choices': {0: 'WheaErrSevRecoverable', 1: 'WheaErrSevFatal', 2: 'WheaErrSevCorrected', 3: 'WheaErrSevNone'}}]],
    'ErrorSourceId': [0x28, ['unsigned long']],
    'ErrorSourceType': [0x2c, ['Enumeration', {'target': 'long', 'choices': {0: 'WheaErrSrcTypeMCE', 1: 'WheaErrSrcTypeCMC', 2: 'WheaErrSrcTypeCPE', 3: 'WheaErrSrcTypeNMI', 4: 'WheaErrSrcTypePCIe', 5: 'WheaErrSrcTypeGeneric', 6: 'WheaErrSrcTypeINIT', 7: 'WheaErrSrcTypeBOOT', 8: 'WheaErrSrcTypeSCIGeneric', 9: 'WheaErrSrcTypeIPFMCA', 10: 'WheaErrSrcTypeIPFCMC', 11: 'WheaErrSrcTypeIPFCPE', 12: 'WheaErrSrcTypeMax'}}]],
    'Reserved2': [0x30, ['unsigned long']],
    'Version': [0x34, ['unsigned long']],
    'Cpu': [0x38, ['unsigned long long']],
    'u': [0x40, ['__unnamed_1320']],
    'RawDataFormat': [0x110, ['Enumeration', {'target': 'long', 'choices': {0: 'WheaRawDataFormatIPFSalRecord', 1: 'WheaRawDataFormatIA32MCA', 2: 'WheaRawDataFormatIntel64MCA', 3: 'WheaRawDataFormatAMD64MCA', 4: 'WheaRawDataFormatMemory', 5: 'WheaRawDataFormatPCIExpress', 6: 'WheaRawDataFormatNMIPort', 7: 'WheaRawDataFormatPCIXBus', 8: 'WheaRawDataFormatPCIXDevice', 9: 'WheaRawDataFormatGeneric', 10: 'WheaRawDataFormatMax'}}]],
    'RawDataOffset': [0x114, ['unsigned long']],
    'RawData': [0x118, ['array', 1, ['unsigned char']]],
   }],
  '_WHEA_ERROR_PACKET_FLAGS': [ 0x4, {
    'HypervisorError': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 4}]],
    'CpuValid': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'AsULONG': [0x0, ['unsigned long']],
    'PreviousError': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Simulated': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
   }],
  '_WHEA_ERROR_RECORD_HEADER': [ 0x80, {
    'Signature': [0x0, ['unsigned long']],
    'Revision': [0x4, ['_WHEA_REVISION']],
    'SignatureEnd': [0x6, ['unsigned long']],
    'SectionCount': [0xa, ['unsigned short']],
    'Severity': [0xc, ['Enumeration', {'target': 'long', 'choices': {0: 'WheaErrSevRecoverable', 1: 'WheaErrSevFatal', 2: 'WheaErrSevCorrected', 3: 'WheaErrSevNone'}}]],
    'ValidBits': [0x10, ['_WHEA_ERROR_RECORD_HEADER_VALIDBITS']],
    'Length': [0x14, ['unsigned long']],
    'Timestamp': [0x18, ['_WHEA_TIMESTAMP']],
    'PlatformId': [0x20, ['_GUID']],
    'PartitionId': [0x30, ['_GUID']],
    'CreatorId': [0x40, ['_GUID']],
    'NotifyType': [0x50, ['_GUID']],
    'RecordId': [0x60, ['unsigned long long']],
    'Flags': [0x68, ['_WHEA_ERROR_RECORD_HEADER_FLAGS']],
    'PersistenceInfo': [0x6c, ['_WHEA_PERSISTENCE_INFO']],
    'Reserved': [0x74, ['array', 12, ['unsigned char']]],
   }],
  '_WHEA_ERROR_RECORD_HEADER_FLAGS': [ 0x4, {
    'AsULONG': [0x0, ['unsigned long']],
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 3}]],
    'PreviousError': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Recovered': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Simulated': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
   }],
  '_WHEA_ERROR_RECORD_HEADER_VALIDBITS': [ 0x4, {
    'PlatformId': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Timestamp': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'PartitionId': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 3}]],
    'AsULONG': [0x0, ['unsigned long']],
   }],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR': [ 0x48, {
    'SectionOffset': [0x0, ['unsigned long']],
    'SectionLength': [0x4, ['unsigned long']],
    'Revision': [0x8, ['_WHEA_REVISION']],
    'ValidBits': [0xa, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS']],
    'Reserved': [0xb, ['unsigned char']],
    'Flags': [0xc, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS']],
    'SectionType': [0x10, ['_GUID']],
    'FRUId': [0x20, ['_GUID']],
    'SectionSeverity': [0x30, ['Enumeration', {'target': 'long', 'choices': {0: 'WheaErrSevRecoverable', 1: 'WheaErrSevFatal', 2: 'WheaErrSevCorrected', 3: 'WheaErrSevNone'}}]],
    'FRUText': [0x34, ['array', 20, ['unsigned char']]],
   }],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS': [ 0x4, {
    'Reset': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'ThresholdExceeded': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 6}]],
    'AsULONG': [0x0, ['unsigned long']],
    'ContainmentWarning': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'LatentError': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'ResourceNotAvailable': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'Primary': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS': [ 0x1, {
    'AsUCHAR': [0x0, ['unsigned char']],
    'FRUId': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 2}]],
    'FRUText': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
   }],
  '_WHEA_ERROR_STATUS': [ 0x8, {
    'Responder': [0x0, ['BitField', {'end_bit': 20, 'start_bit': 19}]],
    'Address': [0x0, ['BitField', {'end_bit': 17, 'start_bit': 16}]],
    'FirstError': [0x0, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'Control': [0x0, ['BitField', {'end_bit': 18, 'start_bit': 17}]],
    'Reserved1': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'ErrorType': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 8}]],
    'ErrorStatus': [0x0, ['unsigned long long']],
    'Requester': [0x0, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'Overflow': [0x0, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'Data': [0x0, ['BitField', {'end_bit': 19, 'start_bit': 18}]],
    'Reserved2': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 23}]],
   }],
  '_WHEA_GENERIC_PROCESSOR_ERROR_VALIDBITS': [ 0x8, {
    'ResponderId': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'Level': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'Flags': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'ValidBits': [0x0, ['unsigned long long']],
    'TargetAddress': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 13}]],
    'CPUBrandString': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'InstructionPointer': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'ErrorType': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'InstructionSet': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'ProcessorId': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'ProcessorType': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'RequesterId': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'CPUVersion': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'Operation': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
   }],
  '_WHEA_MEMORY_ERROR_VALIDBITS': [ 0x8, {
    'Node': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'ResponderId': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'BitPosition': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 15}]],
    'Card': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'Bank': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'Column': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'ErrorType': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'TargetId': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'Module': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'ErrorStatus': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'PhysicalAddressMask': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'RequesterId': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'ValidBits': [0x0, ['unsigned long long']],
    'Device': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'PhysicalAddress': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Row': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
   }],
  '_WHEA_NMI_ERROR_FLAGS': [ 0x4, {
    'HypervisorError': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'AsULONG': [0x0, ['unsigned long']],
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 1}]],
   }],
  '_WHEA_PCIEXPRESS_DEVICE_ID': [ 0x10, {
    'VendorID': [0x0, ['unsigned short']],
    'DeviceID': [0x2, ['unsigned short']],
    'ClassCode': [0x4, ['BitField', {'end_bit': 24, 'start_bit': 0}]],
    'FunctionNumber': [0x4, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'PrimaryBusNumber': [0x8, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'Segment': [0x8, ['BitField', {'end_bit': 24, 'start_bit': 8}]],
    'DeviceNumber': [0x8, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'SecondaryBusNumber': [0xc, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'SlotNumber': [0xc, ['BitField', {'end_bit': 24, 'start_bit': 10}]],
    'Reserved1': [0xc, ['BitField', {'end_bit': 10, 'start_bit': 8}]],
    'Reserved2': [0xc, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
   }],
  '_WHEA_PCIEXPRESS_ERROR': [ 0xd0, {
    'ValidBits': [0x0, ['_WHEA_PCIEXPRESS_ERROR_VALIDBITS']],
    'PortType': [0x8, ['Enumeration', {'target': 'long', 'choices': {0: 'WheaPciExpressEndpoint', 1: 'WheaPciExpressLegacyEndpoint', 4: 'WheaPciExpressRootPort', 5: 'WheaPciExpressUpstreamSwitchPort', 6: 'WheaPciExpressDownstreamSwitchPort', 7: 'WheaPciExpressToPciXBridge', 8: 'WheaPciXToExpressBridge', 9: 'WheaPciExpressRootComplexIntegratedEndpoint', 10: 'WheaPciExpressRootComplexEventCollector'}}]],
    'Version': [0xc, ['_WHEA_PCIEXPRESS_VERSION']],
    'CommandStatus': [0x10, ['_WHEA_PCIEXPRESS_COMMAND_STATUS']],
    'Reserved': [0x14, ['unsigned long']],
    'DeviceId': [0x18, ['_WHEA_PCIEXPRESS_DEVICE_ID']],
    'DeviceSerialNumber': [0x28, ['unsigned long long']],
    'BridgeControlStatus': [0x30, ['_WHEA_PCIEXPRESS_BRIDGE_CONTROL_STATUS']],
    'ExpressCapability': [0x34, ['array', 60, ['unsigned char']]],
    'AerInfo': [0x70, ['array', 96, ['unsigned char']]],
   }],
  '_WHEA_PCIEXPRESS_ERROR_VALIDBITS': [ 0x8, {
    'Reserved': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 8}]],
    'Version': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'CommandStatus': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'DeviceId': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'ExpressCapability': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'ValidBits': [0x0, ['unsigned long long']],
    'PortType': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'DeviceSerialNumber': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'AerInfo': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'BridgeControlStatus': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
   }],
  '_WHEA_PCIXBUS_COMMAND': [ 0x8, {
    'PCIXCommand': [0x0, ['BitField', {'end_bit': 57, 'start_bit': 56}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 57}]],
    'Command': [0x0, ['BitField', {'end_bit': 56, 'start_bit': 0}]],
    'AsULONGLONG': [0x0, ['unsigned long long']],
   }],
  '_WHEA_PCIXBUS_ERROR_VALIDBITS': [ 0x8, {
    'BusId': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'BusAddress': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'BusData': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'ValidBits': [0x0, ['unsigned long long']],
    'Reserved': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 9}]],
    'ErrorType': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'TargetId': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'CompleterId': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'ErrorStatus': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'RequesterId': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'BusCommand': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
   }],
  '_WHEA_PCIXDEVICE_ERROR_VALIDBITS': [ 0x8, {
    'Reserved': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 5}]],
    'IoNumber': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'ErrorStatus': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ValidBits': [0x0, ['unsigned long long']],
    'RegisterDataPairs': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'IdInfo': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'MemoryNumber': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
   }],
  '_WHEA_PCIXDEVICE_ID': [ 0x10, {
    'VendorId': [0x0, ['unsigned short']],
    'DeviceId': [0x2, ['unsigned short']],
    'ClassCode': [0x4, ['BitField', {'end_bit': 24, 'start_bit': 0}]],
    'FunctionNumber': [0x4, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'BusNumber': [0x8, ['BitField', {'end_bit': 16, 'start_bit': 8}]],
    'DeviceNumber': [0x8, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'SegmentNumber': [0x8, ['BitField', {'end_bit': 24, 'start_bit': 16}]],
    'Reserved1': [0x8, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'Reserved2': [0xc, ['unsigned long']],
   }],
  '_WHEA_PERSISTENCE_INFO': [ 0x8, {
    'Reserved': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 59}]],
    'Length': [0x0, ['BitField', {'end_bit': 40, 'start_bit': 16}]],
    'DoNotLog': [0x0, ['BitField', {'end_bit': 59, 'start_bit': 58}]],
    'AsULONGLONG': [0x0, ['unsigned long long']],
    'Signature': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'Attributes': [0x0, ['BitField', {'end_bit': 58, 'start_bit': 56}]],
    'Identifier': [0x0, ['BitField', {'end_bit': 56, 'start_bit': 40}]],
   }],
  '_WHEA_TIMESTAMP': [ 0x8, {
    'Hours': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 16}]],
    'AsLARGE_INTEGER': [0x0, ['_LARGE_INTEGER']],
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'Year': [0x0, ['BitField', {'end_bit': 56, 'start_bit': 48}]],
    'Seconds': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'Century': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 56}]],
    'Minutes': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 8}]],
    'Day': [0x0, ['BitField', {'end_bit': 40, 'start_bit': 32}]],
    'Month': [0x0, ['BitField', {'end_bit': 48, 'start_bit': 40}]],
   }],
  '_WMI_BUFFER_HEADER': [ 0x48, {
    'Wnode': [0x0, ['_WNODE_HEADER']],
    'BufferSize': [0x0, ['unsigned long']],
    'SavedOffset': [0x4, ['unsigned long']],
    'CurrentOffset': [0x8, ['unsigned long']],
    'ReferenceCount': [0xc, ['long']],
    'TimeStamp': [0x10, ['_LARGE_INTEGER']],
    'StartPerfClock': [0x10, ['_LARGE_INTEGER']],
    'SequenceNumber': [0x18, ['long long']],
    'Padding0': [0x20, ['array', 2, ['unsigned long']]],
    'NextBuffer': [0x20, ['pointer', ['_WMI_BUFFER_HEADER']]],
    'SlistEntry': [0x20, ['_SINGLE_LIST_ENTRY']],
    'ClientContext': [0x28, ['_ETW_BUFFER_CONTEXT']],
    'State': [0x2c, ['Enumeration', {'target': 'long', 'choices': {0: 'EtwBufferStateFree', 1: 'EtwBufferStateGeneralLogging', 2: 'EtwBufferStateCSwitch', 3: 'EtwBufferStateFlush', 4: 'EtwBufferStateMaximum'}}]],
    'Flags': [0x2c, ['unsigned long']],
    'Offset': [0x30, ['unsigned long']],
    'BufferFlag': [0x34, ['unsigned short']],
    'BufferType': [0x36, ['unsigned short']],
    'Pointer0': [0x38, ['pointer', ['void']]],
    'Entry': [0x38, ['_LIST_ENTRY']],
    'Padding1': [0x38, ['array', 4, ['unsigned long']]],
    'Padding2': [0x38, ['pointer', ['void']]],
    'StartTime': [0x38, ['_LARGE_INTEGER']],
    'Pointer1': [0x3c, ['pointer', ['void']]],
    'GlobalEntry': [0x3c, ['_SINGLE_LIST_ENTRY']],
   }],
  '_WMI_LOGGER_CONTEXT': [ 0x280, {
    'StartTime': [0x0, ['_LARGE_INTEGER']],
    'LogFileHandle': [0x8, ['pointer', ['void']]],
    'LoggerThread': [0xc, ['pointer', ['_ETHREAD']]],
    'LoggerStatus': [0x10, ['long']],
    'LoggerId': [0x14, ['unsigned long']],
    'NBQHead': [0x18, ['pointer', ['void']]],
    'OverflowNBQHead': [0x1c, ['pointer', ['void']]],
    'QueueBlockFreeList': [0x20, ['_SLIST_HEADER']],
    'GlobalList': [0x28, ['_SLIST_HEADER']],
    'BatchedBufferList': [0x30, ['pointer', ['_WMI_BUFFER_HEADER']]],
    'LoggerName': [0x34, ['_UNICODE_STRING']],
    'LogFileName': [0x3c, ['_UNICODE_STRING']],
    'LogFilePattern': [0x44, ['_UNICODE_STRING']],
    'NewLogFileName': [0x4c, ['_UNICODE_STRING']],
    'ClockType': [0x54, ['unsigned long']],
    'CollectionOn': [0x58, ['long']],
    'MaximumFileSize': [0x5c, ['unsigned long']],
    'LoggerMode': [0x60, ['unsigned long']],
    'LastFlushedBuffer': [0x64, ['unsigned long']],
    'FlushTimer': [0x68, ['unsigned long']],
    'FlushThreshold': [0x6c, ['unsigned long']],
    'ByteOffset': [0x70, ['_LARGE_INTEGER']],
    'FlushTimeStamp': [0x78, ['_LARGE_INTEGER']],
    'MinimumBuffers': [0x80, ['unsigned long']],
    'BuffersAvailable': [0x84, ['long']],
    'NumberOfBuffers': [0x88, ['long']],
    'MaximumBuffers': [0x8c, ['unsigned long']],
    'EventsLost': [0x90, ['unsigned long']],
    'BuffersWritten': [0x94, ['unsigned long']],
    'LogBuffersLost': [0x98, ['unsigned long']],
    'RealTimeBuffersDelivered': [0x9c, ['unsigned long']],
    'RealTimeBuffersLost': [0xa0, ['unsigned long']],
    'BufferSize': [0xa4, ['unsigned long']],
    'MaximumEventSize': [0xa8, ['unsigned long']],
    'SequencePtr': [0xac, ['pointer', ['long']]],
    'LocalSequence': [0xb0, ['unsigned long']],
    'InstanceGuid': [0xb4, ['_GUID']],
    'GetCpuClock': [0xc4, ['pointer', ['void']]],
    'FileCounter': [0xc8, ['long']],
    'BufferCallback': [0xcc, ['pointer', ['void']]],
    'PoolType': [0xd0, ['Enumeration', {'target': 'long', 'choices': {0: 'NonPagedPool', 1: 'PagedPool', 2: 'NonPagedPoolMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolCacheAlignedMustS', 7: 'MaxPoolType', 32: 'NonPagedPoolSession', 33: 'PagedPoolSession', 34: 'NonPagedPoolMustSucceedSession', 35: 'DontUseThisTypeSession', 36: 'NonPagedPoolCacheAlignedSession', 37: 'PagedPoolCacheAlignedSession', 38: 'NonPagedPoolCacheAlignedMustSSession'}}]],
    'ReferenceTime': [0xd8, ['_ETW_REF_CLOCK']],
    'RealtimeLoggerContextFreed': [0xe8, ['unsigned char']],
    'Consumers': [0xec, ['_LIST_ENTRY']],
    'NumConsumers': [0xf4, ['unsigned long']],
    'Connecting': [0xf8, ['_LIST_ENTRY']],
    'NewConsumer': [0x100, ['unsigned char']],
    'RealtimeLogfileHandle': [0x104, ['pointer', ['void']]],
    'RealtimeLogfileName': [0x108, ['_UNICODE_STRING']],
    'RealtimeWriteOffset': [0x110, ['_LARGE_INTEGER']],
    'RealtimeReadOffset': [0x118, ['_LARGE_INTEGER']],
    'RealtimeLogfileSize': [0x120, ['_LARGE_INTEGER']],
    'RealtimeLogfileUsage': [0x128, ['unsigned long long']],
    'RealtimeMaximumFileSize': [0x130, ['unsigned long long']],
    'RealtimeBuffersSaved': [0x138, ['unsigned long']],
    'RealtimeReferenceTime': [0x140, ['_ETW_REF_CLOCK']],
    'RealtimeDisconnectProcessId': [0x150, ['unsigned long']],
    'RealtimeDisconnectConsumerId': [0x154, ['unsigned long']],
    'NewRTEventsLost': [0x158, ['Enumeration', {'target': 'long', 'choices': {0: 'EtwRtEventNoLoss', 1: 'EtwRtEventLost', 2: 'EtwRtBufferLost', 3: 'EtwRtBackupLost', 4: 'EtwRtEventLossMax'}}]],
    'LoggerEvent': [0x15c, ['_KEVENT']],
    'FlushEvent': [0x16c, ['_KEVENT']],
    'FlushDpc': [0x17c, ['_KDPC']],
    'LoggerMutex': [0x19c, ['_KMUTANT']],
    'LoggerLock': [0x1bc, ['_EX_PUSH_LOCK']],
    'ClientSecurityContext': [0x1c0, ['_SECURITY_CLIENT_CONTEXT']],
    'SecurityDescriptor': [0x1fc, ['_EX_FAST_REF']],
    'DummyBufferForMarker': [0x200, ['_WMI_BUFFER_HEADER']],
    'BufferSequenceNumber': [0x248, ['long long']],
    'AcceptNewEvents': [0x250, ['long']],
    'Wow': [0x254, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'Persistent': [0x254, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'NoMoreEnable': [0x254, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'RealTime': [0x254, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'AutoLogger': [0x254, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'KernelTrace': [0x254, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'FsReady': [0x254, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'Flags': [0x254, ['unsigned long']],
    'RequestFlush': [0x258, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'RequestDisableRealtime': [0x258, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'RequestNewFie': [0x258, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'RequestUpdateFile': [0x258, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'RequestDisconnectConsumer': [0x258, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'RequestFlag': [0x258, ['unsigned long']],
    'StackTraceFilterHookCount': [0x25c, ['unsigned short']],
    'StackTraceFilter': [0x25e, ['array', 16, ['unsigned short']]],
   }],
  '__unnamed_1037': [ 0x4, {
    'LongFunction': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Private': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 1}]],
   }],
  '__unnamed_120e': [ 0x10, {
    'Length': [0x0, ['unsigned long']],
    'FileName': [0x4, ['pointer', ['_UNICODE_STRING']]],
    'FileInformationClass': [0x8, ['Enumeration', {'target': 'long', 'choices': {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileMaximumInformation'}}]],
    'FileIndex': [0xc, ['unsigned long']],
   }],
  '__unnamed_1212': [ 0x8, {
    'Length': [0x0, ['unsigned long']],
    'FileInformationClass': [0x4, ['Enumeration', {'target': 'long', 'choices': {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileMaximumInformation'}}]],
   }],
  '__unnamed_1214': [ 0x10, {
    'Length': [0x0, ['unsigned long']],
    'FileInformationClass': [0x4, ['Enumeration', {'target': 'long', 'choices': {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileMaximumInformation'}}]],
    'FileObject': [0x8, ['pointer', ['_FILE_OBJECT']]],
    'ClusterCount': [0xc, ['unsigned long']],
    'DeleteHandle': [0xc, ['pointer', ['void']]],
    'ReplaceIfExists': [0xc, ['unsigned char']],
    'AdvanceOnly': [0xd, ['unsigned char']],
   }],
  '__unnamed_121c': [ 0x8, {
    'Length': [0x0, ['unsigned long']],
    'FsInformationClass': [0x4, ['Enumeration', {'target': 'long', 'choices': {1: 'FileFsVolumeInformation', 2: 'FileFsLabelInformation', 3: 'FileFsSizeInformation', 4: 'FileFsDeviceInformation', 5: 'FileFsAttributeInformation', 6: 'FileFsControlInformation', 7: 'FileFsFullSizeInformation', 8: 'FileFsObjectIdInformation', 9: 'FileFsDriverPathInformation', 10: 'FileFsVolumeFlagsInformation', 11: 'FileFsMaximumInformation'}}]],
   }],
  '__unnamed_1237': [ 0x4, {
    'Type': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'BusRelations', 1: 'EjectionRelations', 2: 'PowerRelations', 3: 'RemovalRelations', 4: 'TargetDeviceRelation', 5: 'SingleBusRelations'}}]],
   }],
  '__unnamed_124e': [ 0x4, {
    'IdType': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'BusQueryDeviceID', 1: 'BusQueryHardwareIDs', 2: 'BusQueryCompatibleIDs', 3: 'BusQueryInstanceID', 4: 'BusQueryDeviceSerialNumber'}}]],
   }],
  '__unnamed_1252': [ 0x8, {
    'DeviceTextType': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'DeviceTextDescription', 1: 'DeviceTextLocationInformation'}}]],
    'LocaleId': [0x4, ['unsigned long']],
   }],
  '__unnamed_1256': [ 0x8, {
    'InPath': [0x0, ['unsigned char']],
    'Reserved': [0x1, ['array', 3, ['unsigned char']]],
    'Type': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'DeviceUsageTypeUndefined', 1: 'DeviceUsageTypePaging', 2: 'DeviceUsageTypeHibernation', 3: 'DeviceUsageTypeDumpFile'}}]],
   }],
  '__unnamed_125a': [ 0x4, {
    'PowerState': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'}}]],
   }],
  '__unnamed_1266': [ 0x10, {
    'SystemContext': [0x0, ['unsigned long']],
    'SystemPowerStateContext': [0x0, ['_SYSTEM_POWER_STATE_CONTEXT']],
    'Type': [0x4, ['Enumeration', {'target': 'long', 'choices': {0: 'SystemPowerState', 1: 'DevicePowerState'}}]],
    'State': [0x8, ['_POWER_STATE']],
    'ShutdownType': [0xc, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerActionNone', 1: 'PowerActionReserved', 2: 'PowerActionSleep', 3: 'PowerActionHibernate', 4: 'PowerActionShutdown', 5: 'PowerActionShutdownReset', 6: 'PowerActionShutdownOff', 7: 'PowerActionWarmEject'}}]],
   }],
  '__unnamed_1432': [ 0x4, {
    'PteFrame': [0x0, ['BitField', {'end_bit': 25, 'start_bit': 0}]],
    'PrototypePte': [0x0, ['BitField', {'end_bit': 28, 'start_bit': 27}]],
    'AweAllocation': [0x0, ['BitField', {'end_bit': 27, 'start_bit': 26}]],
    'PfnImageVerified': [0x0, ['BitField', {'end_bit': 26, 'start_bit': 25}]],
    'PageColor': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 28}]],
   }],
  '__unnamed_1462': [ 0xc, {
    'ImageRelocationStartBit': [0x0, ['unsigned long']],
    'NumberOfSystemCacheViews': [0x0, ['unsigned long']],
    'Unused': [0x4, ['BitField', {'end_bit': 30, 'start_bit': 16}]],
    'BitMap64': [0x4, ['BitField', {'end_bit': 31, 'start_bit': 30}]],
    'WritableUserReferences': [0x4, ['long']],
    'ImageActive': [0x4, ['BitField', {'end_bit': 32, 'start_bit': 31}]],
    'ImageRelocationSizeIn64k': [0x4, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'SubsectionRoot': [0x8, ['pointer', ['_MM_SUBSECTION_AVL_TABLE']]],
    'SeImageStub': [0x8, ['pointer', ['_MI_IMAGE_SECURITY_REFERENCE']]],
   }],
  '__unnamed_149d': [ 0x4, {
    'Balance': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'Parent': [0x0, ['pointer', ['_MMVAD']]],
   }],
  '__unnamed_14bc': [ 0x4, {
    'Balance': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'Parent': [0x0, ['pointer', ['_MMADDRESS_NODE']]],
   }],
  '__unnamed_14c7': [ 0x4, {
    'NextToFree': [0x0, ['pointer', ['_MI_PER_SESSION_PROTOS']]],
    'Balance': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'Parent': [0x0, ['pointer', ['_MMADDRESS_NODE']]],
   }],
  '__unnamed_15b8': [ 0x2, {
    'PStateDomainIdleAccounting': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 2}]],
    'AsUSHORT': [0x0, ['unsigned short']],
    'PStateDomain': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '__unnamed_1600': [ 0x10, {
    'DockStatus': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'DOCK_NOTDOCKDEVICE', 1: 'DOCK_QUIESCENT', 2: 'DOCK_ARRIVING', 3: 'DOCK_DEPARTING', 4: 'DOCK_EJECTIRP_COMPLETED'}}]],
    'ListEntry': [0x4, ['_LIST_ENTRY']],
    'SerialNumber': [0xc, ['pointer', ['unsigned short']]],
   }],
  '__unnamed_1812': [ 0x1, {
    'Deleted': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'ReferenceCache': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Lookaside': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Initializing': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
   }],
  '__unnamed_181c': [ 0x4, {
    'Internal': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Secure': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
   }],
  '__unnamed_182b': [ 0x4, {
    'Secure': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '__unnamed_1833': [ 0x4, {
    'ForceUnlink': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'WriteAccess': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'AutoRelease': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
   }],
  '__unnamed_184d': [ 0x4, {
    'ConnectionRefused': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'Disconnected': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'HasCompletionList': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'DynamicSecurity': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'Closed': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'Type': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 1}]],
    'ConnectionPending': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Waitable': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'ReturnExtendedInfo': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'Lpc': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'Wow64CompletionList': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'LpcToLpc': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'HadCompletionList': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'NoFlushOnClose': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'Initialized': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '__unnamed_1866': [ 0x4, {
    'Canceled': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'ReplyWaitReply': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'QueueType': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'SharedQuota': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'ReserveReference': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'Ready': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'ReleaseMessage': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'ReceiverReference': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'QueuePortType': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 2}]],
    'OwnerPortReference': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
   }],
  '__unnamed_18a6': [ 0x4, {
    'Revoked': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Impersonated': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
   }],
  '__unnamed_1995': [ 0x4, {
    'Image': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'HardFault': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'Spare0': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'FilePointerIndex': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 0}]],
   }],
  '__unnamed_1997': [ 0x4, {
    'Spare1': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 10}]],
    'HardFault': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'FilePointerIndex': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 0}]],
   }],
  '__unnamed_19dc': [ 0x4, {
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 8}]],
    'Hypervisor': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    'Disabled': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'HvMaxCState': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'AsULONG': [0x0, ['unsigned long']],
    'AllowScaling': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '__unnamed_1a01': [ 0x4, {
    'BaseMid': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'Sys': [0x0, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'Reserved_0': [0x0, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'Granularity': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'BaseHi': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'Default_Big': [0x0, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'Dpl': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 13}]],
    'Type': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 8}]],
    'Pres': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'LimitHi': [0x0, ['BitField', {'end_bit': 20, 'start_bit': 16}]],
   }],
  '__unnamed_1bda': [ 0x14, {
    'MinimumVector': [0x0, ['unsigned long']],
    'MaximumVector': [0x4, ['unsigned long']],
    'AffinityPolicy': [0x8, ['Enumeration', {'target': 'long', 'choices': {0: 'IrqPolicyMachineDefault', 1: 'IrqPolicyAllCloseProcessors', 2: 'IrqPolicyOneCloseProcessor', 3: 'IrqPolicyAllProcessorsInMachine', 4: 'IrqPolicySpecifiedProcessors', 5: 'IrqPolicySpreadMessagesAcrossAllProcessors'}}]],
    'PriorityPolicy': [0xc, ['Enumeration', {'target': 'long', 'choices': {0: 'IrqPriorityUndefined', 1: 'IrqPriorityLow', 2: 'IrqPriorityNormal', 3: 'IrqPriorityHigh'}}]],
    'TargetedProcessors': [0x10, ['unsigned long']],
   }],
  '__unnamed_1c2f': [ 0x1, {
    'IncreasePolicy': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 1}]],
    'DecreasePolicy': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 3}]],
    'AsUCHAR': [0x0, ['unsigned char']],
    'NoDomainAccounting': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 5}]],
   }],
  '__unnamed_1cfb': [ 0x4, {
    'Balance': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'Parent': [0x0, ['pointer', ['_MMSUBSECTION_NODE']]],
   }],
  '__unnamed_1d78': [ 0x4, {
    'DecreasePolicy': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 4}]],
    'NoDomainAccounting': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'IncreasePolicy': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    'AsULONG': [0x0, ['unsigned long']],
    'UsingHypervisor': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 6}]],
   }],
  '__unnamed_1eed': [ 0x2, {
    'Disabled': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 2}]],
    'AsUSHORT': [0x0, ['unsigned short']],
    'AllowScaling': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '__unnamed_1fd5': [ 0x8, {
    'Head': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 0}]],
    'Tail': [0x0, ['BitField', {'end_bit': 48, 'start_bit': 24}]],
    'ActiveThreadCount': [0x0, ['BitField', {'end_bit': 64, 'start_bit': 48}]],
   }],
  '__unnamed_1fe9': [ 0x4, {
    'Active': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'OnlyTryAcquireUsed': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Whole': [0x0, ['unsigned long']],
    'ReleasedOutOfOrder': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'SequenceNumber': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 3}]],
   }],
  '__unnamed_2045': [ 0x8, {
    'SyncType': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'SyncTypeOther', 1: 'SyncTypeCreateSection'}}]],
    'PageProtection': [0x4, ['unsigned long']],
   }],
  '__unnamed_2049': [ 0x8, {
    'NotificationType': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'NotifyTypeCreate', 1: 'NotifyTypeRetired'}}]],
    'SafeToRecurse': [0x4, ['unsigned char']],
   }],
  '__unnamed_209f': [ 0x8, {
    'VetoType': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'PNP_VetoTypeUnknown', 1: 'PNP_VetoLegacyDevice', 2: 'PNP_VetoPendingClose', 3: 'PNP_VetoWindowsApp', 4: 'PNP_VetoWindowsService', 5: 'PNP_VetoOutstandingOpen', 6: 'PNP_VetoDevice', 7: 'PNP_VetoDriver', 8: 'PNP_VetoIllegalDeviceRequest', 9: 'PNP_VetoInsufficientPower', 10: 'PNP_VetoNonDisableable', 11: 'PNP_VetoLegacyDriver', 12: 'PNP_VetoInsufficientRights'}}]],
    'DeviceIdVetoNameBuffer': [0x4, ['array', 1, ['wchar']]],
   }],
  '_flags': [ 0x1, {
    'Removable': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Fill': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 1}]],
   }],
}

# We must use deepcopy to avoid overlays affecting multiple profiles
import copy
import vista_sp1_x86_vtypes
ntkrnlmp_types = copy.deepcopy(vista_sp1_x86_vtypes.ntkrnlmp_types)
ntkrnlmp_types.update(ntkrnlmp_types_additions)

