ntkrnlmp_types_additions = {
  'PO_MEMORY_IMAGE': [ 0xf0, {
    'Signature': [0x0, ['unsigned long']],
    'ImageType': [0x4, ['unsigned long']],
    'CheckSum': [0x8, ['unsigned long']],
    'LengthSelf': [0xc, ['unsigned long']],
    'PageSelf': [0x10, ['unsigned long']],
    'PageSize': [0x14, ['unsigned long']],
    'SystemTime': [0x18, ['_LARGE_INTEGER']],
    'InterruptTime': [0x20, ['unsigned long long']],
    'FeatureFlags': [0x28, ['unsigned long']],
    'HiberFlags': [0x2c, ['unsigned char']],
    'spare': [0x2d, ['array', 3, ['unsigned char']]],
    'NoHiberPtes': [0x30, ['unsigned long']],
    'HiberVa': [0x34, ['unsigned long']],
    'HiberPte': [0x38, ['_LARGE_INTEGER']],
    'NoFreePages': [0x40, ['unsigned long']],
    'FreeMapCheck': [0x44, ['unsigned long']],
    'WakeCheck': [0x48, ['unsigned long']],
    'TotalPages': [0x4c, ['unsigned long']],
    'FirstTablePage': [0x50, ['unsigned long']],
    'PerfInfo': [0x58, ['_PO_HIBER_PERF']],
    'FirmwareRuntimeInformationPages': [0xb8, ['unsigned long']],
    'FirmwareRuntimeInformation': [0xbc, ['array', 1, ['unsigned long']]],
    'NoBootLoaderLogPages': [0xc0, ['unsigned long']],
    'BootLoaderLogPages': [0xc4, ['array', 8, ['unsigned long']]],
    'NotUsed': [0xe4, ['unsigned long']],
    'ResumeContextCheck': [0xe8, ['unsigned long']],
    'ResumeContextPages': [0xec, ['unsigned long']],
   }],
  'PROCESSOR_PERFSTATE_POLICY': [ 0x1c, {
    'Revision': [0x0, ['unsigned long']],
    'MaxThrottle': [0x4, ['unsigned char']],
    'MinThrottle': [0x5, ['unsigned char']],
    'BusyAdjThreshold': [0x6, ['unsigned char']],
    'Flags': [0x7, ['__unnamed_1c2b']],
    'Spare': [0x7, ['unsigned char']],
    'TimeCheck': [0x8, ['unsigned long']],
    'IncreaseTime': [0xc, ['unsigned long']],
    'DecreaseTime': [0x10, ['unsigned long']],
    'IncreasePercent': [0x14, ['unsigned long']],
    'DecreasePercent': [0x18, ['unsigned long']],
   }],
  '_ALPC_PORT': [ 0xf4, {
    'PortListEntry': [0x0, ['_LIST_ENTRY']],
    'CommunicationInfo': [0x8, ['pointer', ['_ALPC_COMMUNICATION_INFO']]],
    'OwnerProcess': [0xc, ['pointer', ['_EPROCESS']]],
    'SequenceNo': [0x10, ['unsigned long']],
    'CompletionPort': [0x14, ['pointer', ['void']]],
    'CompletionKey': [0x18, ['pointer', ['void']]],
    'CompletionPacketLookaside': [0x1c, ['pointer', ['_ALPC_COMPLETION_PACKET_LOOKASIDE']]],
    'PortContext': [0x20, ['pointer', ['void']]],
    'StaticSecurity': [0x24, ['_SECURITY_CLIENT_CONTEXT']],
    'MainQueue': [0x60, ['_LIST_ENTRY']],
    'PendingQueue': [0x68, ['_LIST_ENTRY']],
    'LargeMessageQueue': [0x70, ['_LIST_ENTRY']],
    'WaitQueue': [0x78, ['_LIST_ENTRY']],
    'Semaphore': [0x80, ['pointer', ['_KSEMAPHORE']]],
    'DummyEvent': [0x80, ['pointer', ['_KEVENT']]],
    'Lock': [0x84, ['_EX_PUSH_LOCK']],
    'PortAttributes': [0x88, ['_ALPC_PORT_ATTRIBUTES']],
    'ResourceListLock': [0xb4, ['_EX_PUSH_LOCK']],
    'ResourceListHead': [0xb8, ['_LIST_ENTRY']],
    'CompletionList': [0xc0, ['pointer', ['_ALPC_COMPLETION_LIST']]],
    'MessageZone': [0xc4, ['pointer', ['_ALPC_MESSAGE_ZONE']]],
    'CanceledQueue': [0xc8, ['_LIST_ENTRY']],
    'u1': [0xd0, ['__unnamed_184b']],
    'TargetQueuePort': [0xd4, ['pointer', ['_ALPC_PORT']]],
    'TargetSequencePort': [0xd8, ['pointer', ['_ALPC_PORT']]],
    'Message': [0xdc, ['pointer', ['_KALPC_MESSAGE']]],
    'MainQueueLength': [0xe0, ['unsigned long']],
    'PendingQueueLength': [0xe4, ['unsigned long']],
    'LargeMessageQueueLength': [0xe8, ['unsigned long']],
    'CanceledQueueLength': [0xec, ['unsigned long']],
    'WaitQueueLength': [0xf0, ['unsigned long']],
   }],
  '_BLOB': [ 0x18, {
    'FreeListEntry': [0x0, ['_SINGLE_LIST_ENTRY']],
    'ResourceList': [0x0, ['_LIST_ENTRY']],
    'u1': [0x8, ['__unnamed_1810']],
    'ResourceId': [0x9, ['unsigned char']],
    'CachedReferences': [0xa, ['short']],
    'ReferenceCount': [0xc, ['long']],
    'Lock': [0x10, ['_EX_PUSH_LOCK']],
    'Pad': [0x14, ['unsigned long']],
   }],
  '_CM_CACHED_VALUE_INDEX': [ 0x54, {
    'CellIndex': [0x0, ['unsigned long']],
    'Data': [0x4, ['__unnamed_1ced']],
   }],
  '_CM_PARTIAL_RESOURCE_DESCRIPTOR': [ 0x10, {
    'Type': [0x0, ['unsigned char']],
    'ShareDisposition': [0x1, ['unsigned char']],
    'Flags': [0x2, ['unsigned short']],
    'u': [0x4, ['__unnamed_1cd2']],
   }],
  '_DBGKD_MANIPULATE_STATE32': [ 0x34, {
    'ApiNumber': [0x0, ['unsigned long']],
    'ProcessorLevel': [0x4, ['unsigned short']],
    'Processor': [0x6, ['unsigned short']],
    'ReturnStatus': [0x8, ['long']],
    'u': [0xc, ['__unnamed_16a8']],
   }],
  '_DBGKD_MANIPULATE_STATE64': [ 0x38, {
    'ApiNumber': [0x0, ['unsigned long']],
    'ProcessorLevel': [0x4, ['unsigned short']],
    'Processor': [0x6, ['unsigned short']],
    'ReturnStatus': [0x8, ['long']],
    'u': [0x10, ['__unnamed_16a1']],
   }],
  '_DEVICE_MAP': [ 0x34, {
    'DosDevicesDirectory': [0x0, ['pointer', ['_OBJECT_DIRECTORY']]],
    'GlobalDosDevicesDirectory': [0x4, ['pointer', ['_OBJECT_DIRECTORY']]],
    'DosDevicesDirectoryHandle': [0x8, ['pointer', ['void']]],
    'ReferenceCount': [0xc, ['unsigned long']],
    'DriveMap': [0x10, ['unsigned long']],
    'DriveType': [0x14, ['array', 32, ['unsigned char']]],
   }],
  '_DEVICE_NODE': [ 0x158, {
    'Sibling': [0x0, ['pointer', ['_DEVICE_NODE']]],
    'Child': [0x4, ['pointer', ['_DEVICE_NODE']]],
    'Parent': [0x8, ['pointer', ['_DEVICE_NODE']]],
    'LastChild': [0xc, ['pointer', ['_DEVICE_NODE']]],
    'Level': [0x10, ['unsigned long']],
    'Notify': [0x14, ['_PO_DEVICE_NOTIFY']],
    'PoIrpManager': [0x38, ['_PO_IRP_MANAGER']],
    'State': [0x48, ['Enumeration', {'target': 'long', 'choices': {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'}}]],
    'PreviousState': [0x4c, ['Enumeration', {'target': 'long', 'choices': {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'}}]],
    'StateHistory': [0x50, ['array', -80, ['Enumeration', {'target': 'long', 'choices': {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'}}]]],
    'StateHistoryEntry': [0xa0, ['unsigned long']],
    'CompletionStatus': [0xa4, ['long']],
    'PendingIrp': [0xa8, ['pointer', ['_IRP']]],
    'Flags': [0xac, ['unsigned long']],
    'UserFlags': [0xb0, ['unsigned long']],
    'Problem': [0xb4, ['unsigned long']],
    'PhysicalDeviceObject': [0xb8, ['pointer', ['_DEVICE_OBJECT']]],
    'ResourceList': [0xbc, ['pointer', ['_CM_RESOURCE_LIST']]],
    'ResourceListTranslated': [0xc0, ['pointer', ['_CM_RESOURCE_LIST']]],
    'InstancePath': [0xc4, ['_UNICODE_STRING']],
    'ServiceName': [0xcc, ['_UNICODE_STRING']],
    'DuplicatePDO': [0xd4, ['pointer', ['_DEVICE_OBJECT']]],
    'ResourceRequirements': [0xd8, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'InterfaceType': [0xdc, ['Enumeration', {'target': 'long', 'choices': {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'}}]],
    'BusNumber': [0xe0, ['unsigned long']],
    'ChildInterfaceType': [0xe4, ['Enumeration', {'target': 'long', 'choices': {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'}}]],
    'ChildBusNumber': [0xe8, ['unsigned long']],
    'ChildBusTypeIndex': [0xec, ['unsigned short']],
    'RemovalPolicy': [0xee, ['unsigned char']],
    'HardwareRemovalPolicy': [0xef, ['unsigned char']],
    'TargetDeviceNotify': [0xf0, ['_LIST_ENTRY']],
    'DeviceArbiterList': [0xf8, ['_LIST_ENTRY']],
    'DeviceTranslatorList': [0x100, ['_LIST_ENTRY']],
    'NoTranslatorMask': [0x108, ['unsigned short']],
    'QueryTranslatorMask': [0x10a, ['unsigned short']],
    'NoArbiterMask': [0x10c, ['unsigned short']],
    'QueryArbiterMask': [0x10e, ['unsigned short']],
    'OverUsed1': [0x110, ['__unnamed_15f6']],
    'OverUsed2': [0x114, ['__unnamed_15f8']],
    'BootResources': [0x118, ['pointer', ['_CM_RESOURCE_LIST']]],
    'BootResourcesTranslated': [0x11c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'CapabilityFlags': [0x120, ['unsigned long']],
    'DockInfo': [0x124, ['__unnamed_15fc']],
    'DisableableDepends': [0x134, ['unsigned long']],
    'PendedSetInterfaceState': [0x138, ['_LIST_ENTRY']],
    'LegacyBusListEntry': [0x140, ['_LIST_ENTRY']],
    'DriverUnloadRetryCount': [0x148, ['unsigned long']],
    'PreviousParent': [0x14c, ['pointer', ['_DEVICE_NODE']]],
    'DeletedChildren': [0x150, ['unsigned long']],
    'NumaNodeIndex': [0x154, ['unsigned long']],
   }],
  '_DEVICE_OBJECT': [ 0xb8, {
    'Type': [0x0, ['short']],
    'Size': [0x2, ['unsigned short']],
    'ReferenceCount': [0x4, ['long']],
    'DriverObject': [0x8, ['pointer', ['_DRIVER_OBJECT']]],
    'NextDevice': [0xc, ['pointer', ['_DEVICE_OBJECT']]],
    'AttachedDevice': [0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'CurrentIrp': [0x14, ['pointer', ['_IRP']]],
    'Timer': [0x18, ['pointer', ['_IO_TIMER']]],
    'Flags': [0x1c, ['unsigned long']],
    'Characteristics': [0x20, ['unsigned long']],
    'Vpb': [0x24, ['pointer', ['_VPB']]],
    'DeviceExtension': [0x28, ['pointer', ['void']]],
    'DeviceType': [0x2c, ['unsigned long']],
    'StackSize': [0x30, ['unsigned char']],
    'Queue': [0x34, ['__unnamed_15e4']],
    'AlignmentRequirement': [0x5c, ['unsigned long']],
    'DeviceQueue': [0x60, ['_KDEVICE_QUEUE']],
    'Dpc': [0x74, ['_KDPC']],
    'ActiveThreadCount': [0x94, ['unsigned long']],
    'SecurityDescriptor': [0x98, ['pointer', ['void']]],
    'DeviceLock': [0x9c, ['_KEVENT']],
    'SectorSize': [0xac, ['unsigned short']],
    'Spare1': [0xae, ['unsigned short']],
    'DeviceObjectExtension': [0xb0, ['pointer', ['_DEVOBJ_EXTENSION']]],
    'Reserved': [0xb4, ['pointer', ['void']]],
   }],
  '_DEVICE_OBJECT_POWER_EXTENSION': [ 0x60, {
    'IdleCount': [0x0, ['unsigned long']],
    'BusyCount': [0x4, ['unsigned long']],
    'TotalBusyCount': [0x8, ['unsigned long']],
    'ConservationIdleTime': [0xc, ['unsigned long']],
    'PerformanceIdleTime': [0x10, ['unsigned long']],
    'DeviceObject': [0x14, ['pointer', ['_DEVICE_OBJECT']]],
    'IdleList': [0x18, ['_LIST_ENTRY']],
    'DeviceType': [0x20, ['unsigned char']],
    'IdleState': [0x24, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerDeviceUnspecified', 1: 'PowerDeviceD0', 2: 'PowerDeviceD1', 3: 'PowerDeviceD2', 4: 'PowerDeviceD3', 5: 'PowerDeviceMaximum'}}]],
    'CurrentState': [0x28, ['Enumeration', {'target': 'long', 'choices': {0: 'PowerDeviceUnspecified', 1: 'PowerDeviceD0', 2: 'PowerDeviceD1', 3: 'PowerDeviceD2', 4: 'PowerDeviceD3', 5: 'PowerDeviceMaximum'}}]],
    'NotifySourceList': [0x2c, ['_LIST_ENTRY']],
    'NotifyTargetList': [0x34, ['_LIST_ENTRY']],
    'PowerChannelSummary': [0x3c, ['_POWER_CHANNEL_SUMMARY']],
    'Volume': [0x50, ['_LIST_ENTRY']],
    'Specific': [0x58, ['__unnamed_1cff']],
   }],
  '_DUMP_INITIALIZATION_CONTEXT': [ 0x70, {
    'Length': [0x0, ['unsigned long']],
    'Reserved': [0x4, ['unsigned long']],
    'MemoryBlock': [0x8, ['pointer', ['void']]],
    'CommonBuffer': [0xc, ['array', 2, ['pointer', ['void']]]],
    'PhysicalAddress': [0x18, ['array', 2, ['_LARGE_INTEGER']]],
    'StallRoutine': [0x28, ['pointer', ['void']]],
    'OpenRoutine': [0x2c, ['pointer', ['void']]],
    'WriteRoutine': [0x30, ['pointer', ['void']]],
    'FinishRoutine': [0x34, ['pointer', ['void']]],
    'AdapterObject': [0x38, ['pointer', ['_ADAPTER_OBJECT']]],
    'MappedRegisterBase': [0x3c, ['pointer', ['void']]],
    'PortConfiguration': [0x40, ['pointer', ['void']]],
    'CrashDump': [0x44, ['unsigned char']],
    'MaximumTransferSize': [0x48, ['unsigned long']],
    'CommonBufferSize': [0x4c, ['unsigned long']],
    'TargetAddress': [0x50, ['pointer', ['void']]],
    'WritePendingRoutine': [0x54, ['pointer', ['void']]],
    'PartitionStyle': [0x58, ['unsigned long']],
    'DiskInfo': [0x5c, ['__unnamed_20be']],
   }],
  '_FIRMWARE_INFORMATION_LOADER_BLOCK': [ 0x14, {
    'FirmwareTypeEfi': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 1}]],
    'u': [0x4, ['__unnamed_19f0']],
   }],
  '_FX_SAVE_AREA': [ 0x210, {
    'U': [0x0, ['__unnamed_15bb']],
    'NpxSavedCpu': [0x208, ['unsigned long']],
    'Cr0NpxState': [0x20c, ['unsigned long']],
   }],
  '_HEAP_LOCK': [ 0x18, {
    'Lock': [0x0, ['__unnamed_1a7e']],
   }],
  '_IMAGE_SECTION_HEADER': [ 0x28, {
    'Name': [0x0, ['array', 8, ['unsigned char']]],
    'Misc': [0x8, ['__unnamed_1cd9']],
    'VirtualAddress': [0xc, ['unsigned long']],
    'SizeOfRawData': [0x10, ['unsigned long']],
    'PointerToRawData': [0x14, ['unsigned long']],
    'PointerToRelocations': [0x18, ['unsigned long']],
    'PointerToLinenumbers': [0x1c, ['unsigned long']],
    'NumberOfRelocations': [0x20, ['unsigned short']],
    'NumberOfLinenumbers': [0x22, ['unsigned short']],
    'Characteristics': [0x24, ['unsigned long']],
   }],
  '_IO_RESOURCE_DESCRIPTOR': [ 0x20, {
    'Option': [0x0, ['unsigned char']],
    'Type': [0x1, ['unsigned char']],
    'ShareDisposition': [0x2, ['unsigned char']],
    'Spare1': [0x3, ['unsigned char']],
    'Flags': [0x4, ['unsigned short']],
    'Spare2': [0x6, ['unsigned short']],
    'u': [0x8, ['__unnamed_1be6']],
   }],
  '_KALPC_MESSAGE': [ 0x90, {
    'Entry': [0x0, ['_LIST_ENTRY']],
    'ExtensionBuffer': [0x8, ['pointer', ['void']]],
    'ExtensionBufferSize': [0xc, ['unsigned long']],
    'QuotaBlock': [0x10, ['pointer', ['void']]],
    'QuotaProcess': [0x10, ['pointer', ['_EPROCESS']]],
    'SequenceNo': [0x14, ['long']],
    'u1': [0x18, ['__unnamed_1864']],
    'CancelSequencePort': [0x1c, ['pointer', ['_ALPC_PORT']]],
    'CancelQueuePort': [0x20, ['pointer', ['_ALPC_PORT']]],
    'CancelSequenceNo': [0x24, ['long']],
    'CancelListEntry': [0x28, ['_LIST_ENTRY']],
    'WaitingThread': [0x30, ['pointer', ['_ETHREAD']]],
    'Reserve': [0x34, ['pointer', ['_KALPC_RESERVE']]],
    'PortQueue': [0x38, ['pointer', ['_ALPC_PORT']]],
    'OwnerPort': [0x3c, ['pointer', ['_ALPC_PORT']]],
    'UniqueTableEntry': [0x40, ['pointer', ['_HANDLE_TABLE_ENTRY']]],
    'MessageAttributes': [0x44, ['_KALPC_MESSAGE_ATTRIBUTES']],
    'DataUserVa': [0x60, ['pointer', ['void']]],
    'DataSystemVa': [0x64, ['pointer', ['void']]],
    'CommunicationInfo': [0x68, ['pointer', ['_ALPC_COMMUNICATION_INFO']]],
    'ConnectionPort': [0x6c, ['pointer', ['_ALPC_PORT']]],
    'ServerThread': [0x70, ['pointer', ['_ETHREAD']]],
    'PortMessage': [0x78, ['_PORT_MESSAGE']],
   }],
  '_KALPC_REGION': [ 0x30, {
    'u1': [0x0, ['__unnamed_1829']],
    'RegionListEntry': [0x4, ['_LIST_ENTRY']],
    'Section': [0xc, ['pointer', ['_KALPC_SECTION']]],
    'Offset': [0x10, ['unsigned long']],
    'Size': [0x14, ['unsigned long']],
    'ViewSize': [0x18, ['unsigned long']],
    'ReadOnlyView': [0x1c, ['pointer', ['_KALPC_VIEW']]],
    'ReadWriteView': [0x20, ['pointer', ['_KALPC_VIEW']]],
    'NumberOfViews': [0x24, ['unsigned long']],
    'ViewListHead': [0x28, ['_LIST_ENTRY']],
   }],
  '_KALPC_SECTION': [ 0x28, {
    'u1': [0x0, ['__unnamed_181a']],
    'SectionObject': [0x4, ['pointer', ['void']]],
    'Size': [0x8, ['unsigned long']],
    'HandleTable': [0xc, ['pointer', ['_ALPC_HANDLE_TABLE']]],
    'SectionHandle': [0x10, ['pointer', ['void']]],
    'OwnerProcess': [0x14, ['pointer', ['_EPROCESS']]],
    'OwnerPort': [0x18, ['pointer', ['_ALPC_PORT']]],
    'NumberOfRegions': [0x1c, ['unsigned long']],
    'RegionListHead': [0x20, ['_LIST_ENTRY']],
   }],
  '_KALPC_SECURITY_DATA': [ 0x50, {
    'HandleTable': [0x0, ['pointer', ['_ALPC_HANDLE_TABLE']]],
    'ContextHandle': [0x4, ['pointer', ['void']]],
    'OwningProcess': [0x8, ['pointer', ['_EPROCESS']]],
    'OwnerPort': [0xc, ['pointer', ['_ALPC_PORT']]],
    'DynamicSecurity': [0x10, ['_SECURITY_CLIENT_CONTEXT']],
    'u1': [0x4c, ['__unnamed_18a4']],
   }],
  '_KALPC_VIEW': [ 0x34, {
    'ViewListEntry': [0x0, ['_LIST_ENTRY']],
    'u1': [0x8, ['__unnamed_1831']],
    'Region': [0xc, ['pointer', ['_KALPC_REGION']]],
    'OwnerPort': [0x10, ['pointer', ['_ALPC_PORT']]],
    'OwnerProcess': [0x14, ['pointer', ['_EPROCESS']]],
    'Address': [0x18, ['pointer', ['void']]],
    'Size': [0x1c, ['unsigned long']],
    'SecureViewHandle': [0x20, ['pointer', ['void']]],
    'WriteAccessHandle': [0x24, ['pointer', ['void']]],
    'NumberOfOwnerMessages': [0x28, ['unsigned long']],
    'ProcessViewListEntry': [0x2c, ['_LIST_ENTRY']],
   }],
  '_KGDTENTRY': [ 0x8, {
    'LimitLow': [0x0, ['unsigned short']],
    'BaseLow': [0x2, ['unsigned short']],
    'HighWord': [0x4, ['__unnamed_19ff']],
   }],
  '_MI_PAGEFILE_TRACES': [ 0x40, {
    'Status': [0x0, ['long']],
    'Priority': [0x4, ['unsigned char']],
    'IrpPriority': [0x5, ['unsigned char']],
    'CurrentTime': [0x8, ['_LARGE_INTEGER']],
    'AvailablePages': [0x10, ['unsigned long']],
    'ModifiedPagesTotal': [0x14, ['unsigned long']],
    'ModifiedPagefilePages': [0x18, ['unsigned long']],
    'ModifiedNoWritePages': [0x1c, ['unsigned long']],
    'MdlHack': [0x20, ['__unnamed_14d9']],
   }],
  '_MI_PER_SESSION_PROTOS': [ 0x1c, {
    'u1': [0x0, ['__unnamed_14be']],
    'LeftChild': [0x4, ['pointer', ['_MMADDRESS_NODE']]],
    'RightChild': [0x8, ['pointer', ['_MMADDRESS_NODE']]],
    'SessionId': [0xc, ['unsigned long']],
    'Subsection': [0xc, ['pointer', ['_SUBSECTION']]],
    'StartingVpn': [0xc, ['unsigned long']],
    'EndingVpn': [0x10, ['unsigned long']],
    'SubsectionBase': [0x14, ['pointer', ['_MMPTE']]],
    'u2': [0x18, ['__unnamed_14c0']],
   }],
  '_MMADDRESS_LIST': [ 0x8, {
    'u1': [0x0, ['__unnamed_1b64']],
    'EndVa': [0x4, ['pointer', ['void']]],
   }],
  '_MMADDRESS_NODE': [ 0x14, {
    'u1': [0x0, ['__unnamed_1e33']],
    'LeftChild': [0x4, ['pointer', ['_MMADDRESS_NODE']]],
    'RightChild': [0x8, ['pointer', ['_MMADDRESS_NODE']]],
    'StartingVpn': [0xc, ['unsigned long']],
    'EndingVpn': [0x10, ['unsigned long']],
   }],
  '_MMMOD_WRITER_MDL_ENTRY': [ 0x60, {
    'Links': [0x0, ['_LIST_ENTRY']],
    'u': [0x8, ['__unnamed_14ce']],
    'Irp': [0x10, ['pointer', ['_IRP']]],
    'u1': [0x14, ['__unnamed_14d0']],
    'PagingFile': [0x18, ['pointer', ['_MMPAGING_FILE']]],
    'File': [0x1c, ['pointer', ['_FILE_OBJECT']]],
    'ControlArea': [0x20, ['pointer', ['_CONTROL_AREA']]],
    'FileResource': [0x24, ['pointer', ['_ERESOURCE']]],
    'WriteOffset': [0x28, ['_LARGE_INTEGER']],
    'IssueTime': [0x30, ['_LARGE_INTEGER']],
    'PointerMdl': [0x38, ['pointer', ['_MDL']]],
    'Mdl': [0x3c, ['_MDL']],
    'Page': [0x58, ['array', 1, ['unsigned long']]],
   }],
  '_MMSUBSECTION_NODE': [ 0x18, {
    'u': [0x0, ['__unnamed_14c5']],
    'StartingSector': [0x4, ['unsigned long']],
    'NumberOfFullSectors': [0x8, ['unsigned long']],
    'u1': [0xc, ['__unnamed_1cf7']],
    'LeftChild': [0x10, ['pointer', ['_MMSUBSECTION_NODE']]],
    'RightChild': [0x14, ['pointer', ['_MMSUBSECTION_NODE']]],
   }],
  '_MMVAD_LONG': [ 0x3c, {
    'u1': [0x0, ['__unnamed_149d']],
    'LeftChild': [0x4, ['pointer', ['_MMVAD']]],
    'RightChild': [0x8, ['pointer', ['_MMVAD']]],
    'StartingVpn': [0xc, ['unsigned long']],
    'EndingVpn': [0x10, ['unsigned long']],
    'u': [0x14, ['__unnamed_14a0']],
    'PushLock': [0x18, ['_EX_PUSH_LOCK']],
    'u5': [0x1c, ['__unnamed_14a3']],
    'u2': [0x20, ['__unnamed_14ac']],
    'Subsection': [0x24, ['pointer', ['_SUBSECTION']]],
    'FirstPrototypePte': [0x28, ['pointer', ['_MMPTE']]],
    'LastContiguousPte': [0x2c, ['pointer', ['_MMPTE']]],
    'u3': [0x30, ['__unnamed_19c2']],
    'u4': [0x38, ['__unnamed_19c8']],
   }],
  '_MM_PAGE_ACCESS_INFO_FLAGS': [ 0x4, {
    'File': [0x0, ['__unnamed_1991']],
    'Private': [0x0, ['__unnamed_1993']],
   }],
  '_MSUBSECTION': [ 0x38, {
    'ControlArea': [0x0, ['pointer', ['_CONTROL_AREA']]],
    'SubsectionBase': [0x4, ['pointer', ['_MMPTE']]],
    'NextSubsection': [0x8, ['pointer', ['_SUBSECTION']]],
    'NextMappedSubsection': [0x8, ['pointer', ['_MSUBSECTION']]],
    'PtesInSubsection': [0xc, ['unsigned long']],
    'UnusedPtes': [0x10, ['unsigned long']],
    'GlobalPerSessionHead': [0x10, ['pointer', ['_MM_AVL_TABLE']]],
    'u': [0x14, ['__unnamed_14c5']],
    'StartingSector': [0x18, ['unsigned long']],
    'NumberOfFullSectors': [0x1c, ['unsigned long']],
    'u1': [0x20, ['__unnamed_1cf7']],
    'LeftChild': [0x24, ['pointer', ['_MMSUBSECTION_NODE']]],
    'RightChild': [0x28, ['pointer', ['_MMSUBSECTION_NODE']]],
    'DereferenceList': [0x2c, ['_LIST_ENTRY']],
    'NumberOfMappedViews': [0x34, ['unsigned long']],
   }],
  '_POP_ACTION_TRIGGER': [ 0x10, {
    'Type': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'PolicyDeviceSystemButton', 1: 'PolicyDeviceThermalZone', 2: 'PolicyDeviceBattery', 3: 'PolicyDeviceMemory', 4: 'PolicyInitiatePowerActionAPI', 5: 'PolicySetPowerStateAPI', 6: 'PolicyImmediateDozeS4', 7: 'PolicySystemIdle', 8: 'PolicyDeviceMax'}}]],
    'Flags': [0x4, ['unsigned long']],
    'Wait': [0x8, ['pointer', ['_POP_TRIGGER_WAIT']]],
    'Battery': [0xc, ['__unnamed_1dc7']],
    'Button': [0xc, ['__unnamed_1dc9']],
   }],
  '_POP_HIBER_CONTEXT': [ 0x100, {
    'WriteToFile': [0x0, ['unsigned char']],
    'ReserveLoaderMemory': [0x1, ['unsigned char']],
    'ReserveFreeMemory': [0x2, ['unsigned char']],
    'VerifyOnWake': [0x3, ['unsigned char']],
    'Reset': [0x4, ['unsigned char']],
    'HiberFlags': [0x5, ['unsigned char']],
    'WroteHiberFile': [0x6, ['unsigned char']],
    'Lock': [0x8, ['unsigned long']],
    'MapFrozen': [0xc, ['unsigned char']],
    'MemoryMap': [0x10, ['_RTL_BITMAP']],
    'DiscardedMemoryPages': [0x18, ['_RTL_BITMAP']],
    'ClonedRanges': [0x20, ['_LIST_ENTRY']],
    'ClonedRangeCount': [0x28, ['unsigned long']],
    'NextCloneRange': [0x2c, ['pointer', ['_LIST_ENTRY']]],
    'NextPreserve': [0x30, ['unsigned long']],
    'LoaderMdl': [0x34, ['pointer', ['_MDL']]],
    'AllocatedMdl': [0x38, ['pointer', ['_MDL']]],
    'PagesOut': [0x40, ['unsigned long long']],
    'IoPages': [0x48, ['pointer', ['void']]],
    'IoPagesCount': [0x4c, ['unsigned long']],
    'CurrentMcb': [0x50, ['pointer', ['void']]],
    'DumpStack': [0x54, ['pointer', ['_DUMP_STACK_CONTEXT']]],
    'WakeState': [0x58, ['pointer', ['_KPROCESSOR_STATE']]],
    'HiberVa': [0x5c, ['unsigned long']],
    'HiberPte': [0x60, ['_LARGE_INTEGER']],
    'Status': [0x68, ['long']],
    'MemoryImage': [0x6c, ['pointer', ['PO_MEMORY_IMAGE']]],
    'TableHead': [0x70, ['pointer', ['_PO_MEMORY_RANGE_TABLE']]],
    'CompressionWorkspace': [0x74, ['pointer', ['unsigned char']]],
    'CompressedWriteBuffer': [0x78, ['pointer', ['unsigned char']]],
    'PerformanceStats': [0x7c, ['pointer', ['unsigned long']]],
    'CompressionBlock': [0x80, ['pointer', ['void']]],
    'DmaIO': [0x84, ['pointer', ['void']]],
    'TemporaryHeap': [0x88, ['pointer', ['void']]],
    'PerfInfo': [0x90, ['_PO_HIBER_PERF']],
    'BootLoaderLogMdl': [0xf0, ['pointer', ['_MDL']]],
    'FirmwareRuntimeInformationMdl': [0xf4, ['pointer', ['_MDL']]],
    'ResumeContext': [0xf8, ['pointer', ['void']]],
    'ResumeContextPages': [0xfc, ['unsigned long']],
   }],
  '_PORT_MESSAGE': [ 0x18, {
    'u1': [0x0, ['__unnamed_17f3']],
    'u2': [0x4, ['__unnamed_17f7']],
    'DoNotUseThisField': [0x8, ['double']],
    'ClientId': [0x8, ['_CLIENT_ID']],
    'MessageId': [0x10, ['unsigned long']],
    'CallbackId': [0x14, ['unsigned long']],
    'ClientViewSize': [0x14, ['unsigned long']],
   }],
  '_PO_MEMORY_RANGE': [ 0x8, {
    'StartPage': [0x0, ['unsigned long']],
    'EndPage': [0x4, ['unsigned long']],
   }],
  '_PO_MEMORY_RANGE_TABLE': [ 0x14, {
    'Next': [0x0, ['pointer', ['_PO_MEMORY_RANGE_TABLE']]],
    'NextTable': [0x4, ['unsigned long']],
    'EntryCount': [0x8, ['unsigned long']],
    'Range': [0xc, ['array', 1, ['_PO_MEMORY_RANGE']]],
   }],
  '_PPM_IDLE_STATES': [ 0x3c, {
    'Type': [0x0, ['unsigned long']],
    'Count': [0x4, ['unsigned long']],
    'Flags': [0x8, ['__unnamed_19d8']],
    'TargetState': [0xc, ['unsigned long']],
    'ActualState': [0x10, ['unsigned long']],
    'OldState': [0x14, ['unsigned long']],
    'TargetProcessors': [0x18, ['unsigned long']],
    'State': [0x1c, ['array', 1, ['_PPM_IDLE_STATE']]],
   }],
  '_PPM_PERF_STATES': [ 0x78, {
    'Count': [0x0, ['unsigned long']],
    'MaxFrequency': [0x4, ['unsigned long']],
    'PStateCap': [0x8, ['unsigned long']],
    'TStateCap': [0xc, ['unsigned long']],
    'MaxPerfState': [0x10, ['unsigned long']],
    'MinPerfState': [0x14, ['unsigned long']],
    'LowestPState': [0x18, ['unsigned long']],
    'IncreaseTime': [0x1c, ['unsigned long']],
    'DecreaseTime': [0x20, ['unsigned long']],
    'BusyAdjThreshold': [0x24, ['unsigned char']],
    'Reserved': [0x25, ['unsigned char']],
    'ThrottleStatesOnly': [0x26, ['unsigned char']],
    'PolicyType': [0x27, ['unsigned char']],
    'TimerInterval': [0x28, ['unsigned long']],
    'Flags': [0x2c, ['__unnamed_1d74']],
    'TargetProcessors': [0x30, ['unsigned long']],
    'PStateHandler': [0x34, ['pointer', ['void']]],
    'PStateContext': [0x38, ['unsigned long']],
    'TStateHandler': [0x3c, ['pointer', ['void']]],
    'TStateContext': [0x40, ['unsigned long']],
    'FeedbackHandler': [0x44, ['pointer', ['void']]],
    'DiaStats': [0x48, ['pointer', ['_PPM_DIA_STATS']]],
    'DiaStatsCount': [0x4c, ['unsigned long']],
    'State': [0x50, ['array', 1, ['_PPM_PERF_STATE']]],
   }],
  '_PROCESSOR_POWER_STATE': [ 0xc8, {
    'IdleStates': [0x0, ['pointer', ['_PPM_IDLE_STATES']]],
    'LastTimeCheck': [0x8, ['unsigned long long']],
    'IdleTimeAccumulated': [0x10, ['unsigned long long']],
    'Hv': [0x18, ['__unnamed_15ad']],
    'Native': [0x18, ['__unnamed_15ab']],
    'IdleAccounting': [0x20, ['pointer', ['PPM_IDLE_ACCOUNTING']]],
    'PerfStates': [0x24, ['pointer', ['_PPM_PERF_STATES']]],
    'LastKernelUserTime': [0x28, ['unsigned long']],
    'LastIdleThreadKTime': [0x2c, ['unsigned long']],
    'LastGlobalTimeHv': [0x30, ['unsigned long long']],
    'LastProcessorTimeHv': [0x38, ['unsigned long long']],
    'ThermalConstraint': [0x40, ['unsigned char']],
    'LastBusyPercentage': [0x41, ['unsigned char']],
    'Flags': [0x42, ['__unnamed_15b4']],
    'PerfTimer': [0x48, ['_KTIMER']],
    'PerfDpc': [0x70, ['_KDPC']],
    'LastSysTime': [0x90, ['unsigned long']],
    'PStateMaster': [0x94, ['pointer', ['_KPRCB']]],
    'PStateSet': [0x98, ['unsigned long']],
    'CurrentPState': [0x9c, ['unsigned long']],
    'DesiredPState': [0xa0, ['unsigned long']],
    'PStateIdleStartTime': [0xa4, ['unsigned long']],
    'PStateIdleTime': [0xa8, ['unsigned long']],
    'LastPStateIdleTime': [0xac, ['unsigned long']],
    'PStateStartTime': [0xb0, ['unsigned long']],
    'DiaIndex': [0xb4, ['unsigned long']],
    'Reserved0': [0xb8, ['unsigned long']],
    'WmiDispatchPtr': [0xbc, ['unsigned long']],
    'WmiInterfaceEnabled': [0xc0, ['long']],
   }],
  '_SUBSECTION': [ 0x20, {
    'ControlArea': [0x0, ['pointer', ['_CONTROL_AREA']]],
    'SubsectionBase': [0x4, ['pointer', ['_MMPTE']]],
    'NextSubsection': [0x8, ['pointer', ['_SUBSECTION']]],
    'PtesInSubsection': [0xc, ['unsigned long']],
    'UnusedPtes': [0x10, ['unsigned long']],
    'GlobalPerSessionHead': [0x10, ['pointer', ['_MM_AVL_TABLE']]],
    'u': [0x14, ['__unnamed_14c5']],
    'StartingSector': [0x18, ['unsigned long']],
    'NumberOfFullSectors': [0x1c, ['unsigned long']],
   }],
  '_VACB': [ 0x20, {
    'BaseAddress': [0x0, ['pointer', ['void']]],
    'SharedCacheMap': [0x4, ['pointer', ['_SHARED_CACHE_MAP']]],
    'Overlay': [0x8, ['__unnamed_16f0']],
    'LruList': [0x10, ['_LIST_ENTRY']],
    'ArrayHead': [0x18, ['pointer', ['_VACB_ARRAY_HEADER']]],
   }],
  '_WORK_QUEUE_ENTRY': [ 0x18, {
    'WorkQueueLinks': [0x0, ['_LIST_ENTRY']],
    'CoalescedWorkQueueLinks': [0x8, ['_LIST_ENTRY']],
    'Parameters': [0x10, ['__unnamed_1706']],
    'Function': [0x14, ['unsigned char']],
   }],
  '__unnamed_14be': [ 0x4, {
    'NextToFree': [0x0, ['pointer', ['_MI_PER_SESSION_PROTOS']]],
    'Balance': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'Parent': [0x0, ['pointer', ['_MMADDRESS_NODE']]],
   }],
  '__unnamed_14c0': [ 0x4, {
    'ReferenceCount': [0x0, ['unsigned long']],
    'NumberOfPtesToFree': [0x0, ['unsigned long']],
   }],
  '__unnamed_14c5': [ 0x4, {
    'LongFlags': [0x0, ['unsigned long']],
    'SubsectionFlags': [0x0, ['_MMSUBSECTION_FLAGS']],
   }],
  '__unnamed_14ce': [ 0x8, {
    'IoStatus': [0x0, ['_IO_STATUS_BLOCK']],
   }],
  '__unnamed_14d0': [ 0x4, {
    'KeepForever': [0x0, ['unsigned long']],
   }],
  '__unnamed_14d9': [ 0x20, {
    'Mdl': [0x0, ['_MDL']],
    'Page': [0x1c, ['array', 1, ['unsigned long']]],
   }],
  '__unnamed_15ab': [ 0x8, {
    'IdleTransitionTime': [0x0, ['unsigned long long']],
   }],
  '__unnamed_15ad': [ 0x8, {
    'LastIdleCheck': [0x0, ['unsigned long long']],
   }],
  '__unnamed_15b4': [ 0x2, {
    'PStateDomainIdleAccounting': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 2}]],
    'AsUSHORT': [0x0, ['unsigned short']],
    'PStateDomain': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '__unnamed_15bb': [ 0x208, {
    'FnArea': [0x0, ['_FNSAVE_FORMAT']],
    'FxArea': [0x0, ['_FXSAVE_FORMAT']],
   }],
  '__unnamed_15e4': [ 0x28, {
    'Wcb': [0x0, ['_WAIT_CONTEXT_BLOCK']],
    'ListEntry': [0x0, ['_LIST_ENTRY']],
   }],
  '__unnamed_15f6': [ 0x4, {
    'PendingDeviceRelations': [0x0, ['pointer', ['_DEVICE_RELATIONS']]],
    'Information': [0x0, ['pointer', ['void']]],
    'LegacyDeviceNode': [0x0, ['pointer', ['_DEVICE_NODE']]],
   }],
  '__unnamed_15f8': [ 0x4, {
    'NextResourceDeviceNode': [0x0, ['pointer', ['_DEVICE_NODE']]],
   }],
  '__unnamed_15fc': [ 0x10, {
    'DockStatus': [0x0, ['Enumeration', {'target': 'long', 'choices': {0: 'DOCK_NOTDOCKDEVICE', 1: 'DOCK_QUIESCENT', 2: 'DOCK_ARRIVING', 3: 'DOCK_DEPARTING', 4: 'DOCK_EJECTIRP_COMPLETED'}}]],
    'ListEntry': [0x4, ['_LIST_ENTRY']],
    'SerialNumber': [0xc, ['pointer', ['unsigned short']]],
   }],
  '__unnamed_16a1': [ 0x28, {
    'BreakPointEx': [0x0, ['_DBGKD_BREAKPOINTEX']],
    'WriteBreakPoint': [0x0, ['_DBGKD_WRITE_BREAKPOINT64']],
    'GetVersion64': [0x0, ['_DBGKD_GET_VERSION64']],
    'GetSetBusData': [0x0, ['_DBGKD_GET_SET_BUS_DATA']],
    'QuerySpecialCalls': [0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
    'RestoreBreakPoint': [0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'ReadMemory': [0x0, ['_DBGKD_READ_MEMORY64']],
    'SearchMemory': [0x0, ['_DBGKD_SEARCH_MEMORY']],
    'ReadWriteIo': [0x0, ['_DBGKD_READ_WRITE_IO64']],
    'QueryMemory': [0x0, ['_DBGKD_QUERY_MEMORY']],
    'GetContext': [0x0, ['_DBGKD_GET_CONTEXT']],
    'WriteMemory': [0x0, ['_DBGKD_WRITE_MEMORY64']],
    'FillMemory': [0x0, ['_DBGKD_FILL_MEMORY']],
    'SetSpecialCall': [0x0, ['_DBGKD_SET_SPECIAL_CALL64']],
    'ReadWriteIoExtended': [0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED64']],
    'GetInternalBreakpoint': [0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT64']],
    'Continue': [0x0, ['_DBGKD_CONTINUE']],
    'ReadWriteMsr': [0x0, ['_DBGKD_READ_WRITE_MSR']],
    'SetContext': [0x0, ['_DBGKD_SET_CONTEXT']],
    'Continue2': [0x0, ['_DBGKD_CONTINUE2']],
    'SwitchPartition': [0x0, ['_DBGKD_SWITCH_PARTITION']],
    'SetInternalBreakpoint': [0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT64']],
   }],
  '__unnamed_16a8': [ 0x28, {
    'SearchMemory': [0x0, ['_DBGKD_SEARCH_MEMORY']],
    'BreakPointEx': [0x0, ['_DBGKD_BREAKPOINTEX']],
    'WriteMemory64': [0x0, ['_DBGKD_WRITE_MEMORY64']],
    'ReadWriteMsr': [0x0, ['_DBGKD_READ_WRITE_MSR']],
    'Continue2': [0x0, ['_DBGKD_CONTINUE2']],
    'GetVersion32': [0x0, ['_DBGKD_GET_VERSION32']],
    'ReadMemory': [0x0, ['_DBGKD_READ_MEMORY32']],
    'ReadWriteIoExtended': [0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED32']],
    'Continue': [0x0, ['_DBGKD_CONTINUE']],
    'GetInternalBreakpoint': [0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT32']],
    'WriteBreakPoint': [0x0, ['_DBGKD_WRITE_BREAKPOINT32']],
    'GetContext': [0x0, ['_DBGKD_GET_CONTEXT']],
    'RestoreBreakPoint': [0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'SetSpecialCall': [0x0, ['_DBGKD_SET_SPECIAL_CALL32']],
    'SetContext': [0x0, ['_DBGKD_SET_CONTEXT']],
    'ReadWriteIo': [0x0, ['_DBGKD_READ_WRITE_IO32']],
    'SetInternalBreakpoint': [0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT32']],
    'ReadMemory64': [0x0, ['_DBGKD_READ_MEMORY64']],
    'WriteMemory': [0x0, ['_DBGKD_WRITE_MEMORY32']],
    'QuerySpecialCalls': [0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
   }],
  '__unnamed_16f0': [ 0x8, {
    'ActiveCount': [0x0, ['unsigned short']],
    'FileOffset': [0x0, ['_LARGE_INTEGER']],
   }],
  '__unnamed_16fe': [ 0x4, {
    'FileObject': [0x0, ['pointer', ['_FILE_OBJECT']]],
   }],
  '__unnamed_1700': [ 0x4, {
    'SharedCacheMap': [0x0, ['pointer', ['_SHARED_CACHE_MAP']]],
   }],
  '__unnamed_1702': [ 0x4, {
    'Event': [0x0, ['pointer', ['_KEVENT']]],
   }],
  '__unnamed_1704': [ 0x4, {
    'Reason': [0x0, ['unsigned long']],
   }],
  '__unnamed_1706': [ 0x4, {
    'Read': [0x0, ['__unnamed_16fe']],
    'Write': [0x0, ['__unnamed_1700']],
    'Event': [0x0, ['__unnamed_1702']],
    'Notification': [0x0, ['__unnamed_1704']],
   }],
  '__unnamed_17f1': [ 0x4, {
    'DataLength': [0x0, ['short']],
    'TotalLength': [0x2, ['short']],
   }],
  '__unnamed_17f3': [ 0x4, {
    's1': [0x0, ['__unnamed_17f1']],
    'Length': [0x0, ['unsigned long']],
   }],
  '__unnamed_17f5': [ 0x4, {
    'Type': [0x0, ['short']],
    'DataInfoOffset': [0x2, ['short']],
   }],
  '__unnamed_17f7': [ 0x4, {
    'ZeroInit': [0x0, ['unsigned long']],
    's2': [0x0, ['__unnamed_17f5']],
   }],
  '__unnamed_180e': [ 0x1, {
    'Deleted': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'ReferenceCache': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Lookaside': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'Initializing': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
   }],
  '__unnamed_1810': [ 0x1, {
    's1': [0x0, ['__unnamed_180e']],
    'Flags': [0x0, ['unsigned char']],
   }],
  '__unnamed_1818': [ 0x4, {
    'Internal': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Secure': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
   }],
  '__unnamed_181a': [ 0x4, {
    's1': [0x0, ['__unnamed_1818']],
   }],
  '__unnamed_1827': [ 0x4, {
    'Secure': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '__unnamed_1829': [ 0x4, {
    's1': [0x0, ['__unnamed_1827']],
   }],
  '__unnamed_182f': [ 0x4, {
    'AutoRelease': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'WriteAccess': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'ForceUnlink': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
   }],
  '__unnamed_1831': [ 0x4, {
    's1': [0x0, ['__unnamed_182f']],
   }],
  '__unnamed_1849': [ 0x4, {
    'ConnectionRefused': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'Disconnected': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'HasCompletionList': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 14}]],
    'DynamicSecurity': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'Closed': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'Lpc': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'ConnectionPending': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'Waitable': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'ReturnExtendedInfo': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'Type': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 1}]],
    'Wow64CompletionList': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'LpcToLpc': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'HadCompletionList': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'NoFlushOnClose': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'Initialized': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '__unnamed_184b': [ 0x4, {
    's1': [0x0, ['__unnamed_1849']],
    'State': [0x0, ['unsigned long']],
   }],
  '__unnamed_1862': [ 0x4, {
    'OwnerPortReference': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'Canceled': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'ReplyWaitReply': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'QueueType': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'ReserveReference': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'Ready': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'SharedQuota': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'ReceiverReference': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'ReleaseMessage': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'QueuePortType': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 2}]],
   }],
  '__unnamed_1864': [ 0x4, {
    's1': [0x0, ['__unnamed_1862']],
    'State': [0x0, ['unsigned long']],
   }],
  '__unnamed_18a2': [ 0x4, {
    'Revoked': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'Impersonated': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
   }],
  '__unnamed_18a4': [ 0x4, {
    's1': [0x0, ['__unnamed_18a2']],
   }],
  '__unnamed_1991': [ 0x4, {
    'Image': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'HardFault': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'Spare0': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'FilePointerIndex': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 0}]],
   }],
  '__unnamed_1993': [ 0x4, {
    'HardFault': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'Spare1': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 10}]],
    'FilePointerIndex': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 0}]],
   }],
  '__unnamed_19c2': [ 0x8, {
    'Secured': [0x0, ['_MMADDRESS_LIST']],
    'List': [0x0, ['_LIST_ENTRY']],
   }],
  '__unnamed_19c8': [ 0x4, {
    'Banked': [0x0, ['pointer', ['_MMBANKED_SECTION']]],
    'ExtendedInfo': [0x0, ['pointer', ['_MMEXTEND_INFO']]],
   }],
  '__unnamed_19d8': [ 0x4, {
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 8}]],
    'Hypervisor': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    'Disabled': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'HvMaxCState': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'AsULONG': [0x0, ['unsigned long']],
    'AllowScaling': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
   }],
  '__unnamed_19f0': [ 0x10, {
    'PcatInformation': [0x0, ['_PCAT_FIRMWARE_INFORMATION']],
    'EfiInformation': [0x0, ['_EFI_FIRMWARE_INFORMATION']],
   }],
  '__unnamed_19f7': [ 0x4, {
    'BaseMid': [0x0, ['unsigned char']],
    'Flags1': [0x1, ['unsigned char']],
    'Flags2': [0x2, ['unsigned char']],
    'BaseHi': [0x3, ['unsigned char']],
   }],
  '__unnamed_19fd': [ 0x4, {
    'BaseMid': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    'Sys': [0x0, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'Dpl': [0x0, ['BitField', {'end_bit': 15, 'start_bit': 13}]],
    'Default_Big': [0x0, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
    'Granularity': [0x0, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'BaseHi': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'Reserved_0': [0x0, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'Type': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 8}]],
    'Pres': [0x0, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'LimitHi': [0x0, ['BitField', {'end_bit': 20, 'start_bit': 16}]],
   }],
  '__unnamed_19ff': [ 0x4, {
    'Bytes': [0x0, ['__unnamed_19f7']],
    'Bits': [0x0, ['__unnamed_19fd']],
   }],
  '__unnamed_1a7e': [ 0x18, {
    'CriticalSection': [0x0, ['_RTL_CRITICAL_SECTION']],
   }],
  '__unnamed_1b64': [ 0x4, {
    'StartVa': [0x0, ['pointer', ['void']]],
    'Flags': [0x0, ['_MMSECURE_FLAGS']],
   }],
  '__unnamed_1bd0': [ 0x18, {
    'Length': [0x0, ['unsigned long']],
    'Alignment': [0x4, ['unsigned long']],
    'MinimumAddress': [0x8, ['_LARGE_INTEGER']],
    'MaximumAddress': [0x10, ['_LARGE_INTEGER']],
   }],
  '__unnamed_1bd6': [ 0x14, {
    'MinimumVector': [0x0, ['unsigned long']],
    'MaximumVector': [0x4, ['unsigned long']],
    'AffinityPolicy': [0x8, ['Enumeration', {'target': 'long', 'choices': {0: 'IrqPolicyMachineDefault', 1: 'IrqPolicyAllCloseProcessors', 2: 'IrqPolicyOneCloseProcessor', 3: 'IrqPolicyAllProcessorsInMachine', 4: 'IrqPolicySpecifiedProcessors', 5: 'IrqPolicySpreadMessagesAcrossAllProcessors'}}]],
    'PriorityPolicy': [0xc, ['Enumeration', {'target': 'long', 'choices': {0: 'IrqPriorityUndefined', 1: 'IrqPriorityLow', 2: 'IrqPriorityNormal', 3: 'IrqPriorityHigh'}}]],
    'TargetedProcessors': [0x10, ['unsigned long']],
   }],
  '__unnamed_1bd8': [ 0x8, {
    'MinimumChannel': [0x0, ['unsigned long']],
    'MaximumChannel': [0x4, ['unsigned long']],
   }],
  '__unnamed_1bda': [ 0xc, {
    'Data': [0x0, ['array', 3, ['unsigned long']]],
   }],
  '__unnamed_1bdc': [ 0x10, {
    'Length': [0x0, ['unsigned long']],
    'MinBusNumber': [0x4, ['unsigned long']],
    'MaxBusNumber': [0x8, ['unsigned long']],
    'Reserved': [0xc, ['unsigned long']],
   }],
  '__unnamed_1bde': [ 0xc, {
    'Priority': [0x0, ['unsigned long']],
    'Reserved1': [0x4, ['unsigned long']],
    'Reserved2': [0x8, ['unsigned long']],
   }],
  '__unnamed_1be0': [ 0x18, {
    'Length40': [0x0, ['unsigned long']],
    'Alignment40': [0x4, ['unsigned long']],
    'MinimumAddress': [0x8, ['_LARGE_INTEGER']],
    'MaximumAddress': [0x10, ['_LARGE_INTEGER']],
   }],
  '__unnamed_1be2': [ 0x18, {
    'Length48': [0x0, ['unsigned long']],
    'Alignment48': [0x4, ['unsigned long']],
    'MinimumAddress': [0x8, ['_LARGE_INTEGER']],
    'MaximumAddress': [0x10, ['_LARGE_INTEGER']],
   }],
  '__unnamed_1be4': [ 0x18, {
    'Length64': [0x0, ['unsigned long']],
    'Alignment64': [0x4, ['unsigned long']],
    'MinimumAddress': [0x8, ['_LARGE_INTEGER']],
    'MaximumAddress': [0x10, ['_LARGE_INTEGER']],
   }],
  '__unnamed_1be6': [ 0x18, {
    'BusNumber': [0x0, ['__unnamed_1bdc']],
    'Dma': [0x0, ['__unnamed_1bd8']],
    'Memory48': [0x0, ['__unnamed_1be2']],
    'Generic': [0x0, ['__unnamed_1bd0']],
    'Memory40': [0x0, ['__unnamed_1be0']],
    'DevicePrivate': [0x0, ['__unnamed_1bda']],
    'ConfigData': [0x0, ['__unnamed_1bde']],
    'Memory64': [0x0, ['__unnamed_1be4']],
    'Memory': [0x0, ['__unnamed_1bd0']],
    'Interrupt': [0x0, ['__unnamed_1bd6']],
    'Port': [0x0, ['__unnamed_1bd0']],
   }],
  '__unnamed_1c2b': [ 0x1, {
    'IncreasePolicy': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 1}]],
    'NoDomainAccounting': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'AsUCHAR': [0x0, ['unsigned char']],
    'DecreasePolicy': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 3}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 5}]],
   }],
  '__unnamed_1cbe': [ 0xc, {
    'Start': [0x0, ['_LARGE_INTEGER']],
    'Length': [0x8, ['unsigned long']],
   }],
  '__unnamed_1cc0': [ 0xc, {
    'Level': [0x0, ['unsigned long']],
    'Vector': [0x4, ['unsigned long']],
    'Affinity': [0x8, ['unsigned long']],
   }],
  '__unnamed_1cc2': [ 0xc, {
    'Reserved': [0x0, ['unsigned short']],
    'MessageCount': [0x2, ['unsigned short']],
    'Vector': [0x4, ['unsigned long']],
    'Affinity': [0x8, ['unsigned long']],
   }],
  '__unnamed_1cc4': [ 0xc, {
    'Translated': [0x0, ['__unnamed_1cc0']],
    'Raw': [0x0, ['__unnamed_1cc2']],
   }],
  '__unnamed_1cc6': [ 0xc, {
    'Channel': [0x0, ['unsigned long']],
    'Port': [0x4, ['unsigned long']],
    'Reserved1': [0x8, ['unsigned long']],
   }],
  '__unnamed_1cc8': [ 0xc, {
    'Start': [0x0, ['unsigned long']],
    'Length': [0x4, ['unsigned long']],
    'Reserved': [0x8, ['unsigned long']],
   }],
  '__unnamed_1cca': [ 0xc, {
    'DataSize': [0x0, ['unsigned long']],
    'Reserved1': [0x4, ['unsigned long']],
    'Reserved2': [0x8, ['unsigned long']],
   }],
  '__unnamed_1ccc': [ 0xc, {
    'Start': [0x0, ['_LARGE_INTEGER']],
    'Length40': [0x8, ['unsigned long']],
   }],
  '__unnamed_1cce': [ 0xc, {
    'Start': [0x0, ['_LARGE_INTEGER']],
    'Length48': [0x8, ['unsigned long']],
   }],
  '__unnamed_1cd0': [ 0xc, {
    'Start': [0x0, ['_LARGE_INTEGER']],
    'Length64': [0x8, ['unsigned long']],
   }],
  '__unnamed_1cd2': [ 0xc, {
    'BusNumber': [0x0, ['__unnamed_1cc8']],
    'Dma': [0x0, ['__unnamed_1cc6']],
    'DeviceSpecificData': [0x0, ['__unnamed_1cca']],
    'Memory48': [0x0, ['__unnamed_1cce']],
    'MessageInterrupt': [0x0, ['__unnamed_1cc4']],
    'Generic': [0x0, ['__unnamed_1cbe']],
    'Memory40': [0x0, ['__unnamed_1ccc']],
    'DevicePrivate': [0x0, ['__unnamed_1bda']],
    'Memory64': [0x0, ['__unnamed_1cd0']],
    'Memory': [0x0, ['__unnamed_1cbe']],
    'Interrupt': [0x0, ['__unnamed_1cc0']],
    'Port': [0x0, ['__unnamed_1cbe']],
   }],
  '__unnamed_1cd9': [ 0x4, {
    'VirtualSize': [0x0, ['unsigned long']],
    'PhysicalAddress': [0x0, ['unsigned long']],
   }],
  '__unnamed_1ced': [ 0x50, {
    'CellData': [0x0, ['_CELL_DATA']],
    'List': [0x0, ['array', 1, ['unsigned long']]],
   }],
  '__unnamed_1cf7': [ 0x4, {
    'Balance': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'Parent': [0x0, ['pointer', ['_MMSUBSECTION_NODE']]],
   }],
  '__unnamed_1cfd': [ 0x8, {
    'IdleTime': [0x0, ['unsigned long']],
    'NonIdleTime': [0x4, ['unsigned long']],
   }],
  '__unnamed_1cff': [ 0x8, {
    'Disk': [0x0, ['__unnamed_1cfd']],
   }],
  '__unnamed_1d74': [ 0x4, {
    'DecreasePolicy': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 4}]],
    'NoDomainAccounting': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'UsingHypervisor': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'AsULONG': [0x0, ['unsigned long']],
    'IncreasePolicy': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    'Reserved': [0x0, ['BitField', {'end_bit': 32, 'start_bit': 6}]],
   }],
  '__unnamed_1dc7': [ 0x4, {
    'Level': [0x0, ['unsigned long']],
   }],
  '__unnamed_1dc9': [ 0x4, {
    'Type': [0x0, ['unsigned long']],
   }],
  '__unnamed_1e33': [ 0x4, {
    'Balance': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'Parent': [0x0, ['pointer', ['_MMADDRESS_NODE']]],
   }],
  '__unnamed_20ba': [ 0x8, {
    'Signature': [0x0, ['unsigned long']],
    'CheckSum': [0x4, ['unsigned long']],
   }],
  '__unnamed_20bc': [ 0x10, {
    'DiskId': [0x0, ['_GUID']],
   }],
  '__unnamed_20be': [ 0x10, {
    'Gpt': [0x0, ['__unnamed_20bc']],
    'Mbr': [0x0, ['__unnamed_20ba']],
   }],
}

# We must use deepcopy to avoid overlays affecting multiple profiles
import copy
import win2k8_sp1_x86_vtypes
ntkrnlmp_types = copy.deepcopy(win2k8_sp1_x86_vtypes.ntkrnlmp_types)
del ntkrnlmp_types['__unnamed_1a82']
del ntkrnlmp_types['__unnamed_15fa']
del ntkrnlmp_types['_PO_MEMORY_RANGE_ARRAY_LINK']
del ntkrnlmp_types['__unnamed_19f4']
del ntkrnlmp_types['__unnamed_19fb']
del ntkrnlmp_types['__unnamed_1866']
del ntkrnlmp_types['__unnamed_1868']
del ntkrnlmp_types['__unnamed_1cd4']
del ntkrnlmp_types['_PO_MEMORY_RANGE_ARRAY_RANGE']
del ntkrnlmp_types['__unnamed_15af']
del ntkrnlmp_types['__unnamed_1cdd']
del ntkrnlmp_types['__unnamed_16f4']
del ntkrnlmp_types['__unnamed_1cd6']
del ntkrnlmp_types['__unnamed_15e8']
del ntkrnlmp_types['__unnamed_1dcb']
del ntkrnlmp_types['__unnamed_1dcd']
del ntkrnlmp_types['__unnamed_1835']
del ntkrnlmp_types['__unnamed_1833']
del ntkrnlmp_types['__unnamed_14bc']
del ntkrnlmp_types['__unnamed_1a01']
del ntkrnlmp_types['__unnamed_20c2']
del ntkrnlmp_types['__unnamed_18a6']
del ntkrnlmp_types['__unnamed_1c2f']
del ntkrnlmp_types['__unnamed_18a8']
del ntkrnlmp_types['__unnamed_19dc']
del ntkrnlmp_types['__unnamed_20c0']
del ntkrnlmp_types['__unnamed_17f9']
del ntkrnlmp_types['__unnamed_1708']
del ntkrnlmp_types['__unnamed_1cfb']
del ntkrnlmp_types['__unnamed_14c9']
del ntkrnlmp_types['__unnamed_14c1']
del ntkrnlmp_types['__unnamed_14c7']
del ntkrnlmp_types['__unnamed_170a']
del ntkrnlmp_types['__unnamed_1cf1']
del ntkrnlmp_types['__unnamed_1600']
del ntkrnlmp_types['__unnamed_181e']
del ntkrnlmp_types['__unnamed_184f']
del ntkrnlmp_types['__unnamed_1d78']
del ntkrnlmp_types['__unnamed_1bd4']
del ntkrnlmp_types['__unnamed_14d4']
del ntkrnlmp_types['__unnamed_16ac']
del ntkrnlmp_types['__unnamed_16a5']
del ntkrnlmp_types['__unnamed_14dd']
del ntkrnlmp_types['__unnamed_17fb']
del ntkrnlmp_types['__unnamed_1b68']
del ntkrnlmp_types['_PO_MEMORY_RANGE_ARRAY']
del ntkrnlmp_types['__unnamed_181c']
del ntkrnlmp_types['__unnamed_1814']
del ntkrnlmp_types['__unnamed_1812']
del ntkrnlmp_types['__unnamed_1a03']
del ntkrnlmp_types['__unnamed_19cc']
del ntkrnlmp_types['__unnamed_19c6']
del ntkrnlmp_types['__unnamed_1be8']
del ntkrnlmp_types['__unnamed_15bf']
del ntkrnlmp_types['__unnamed_1d01']
del ntkrnlmp_types['__unnamed_1d03']
del ntkrnlmp_types['__unnamed_15b1']
del ntkrnlmp_types['__unnamed_15b8']
del ntkrnlmp_types['__unnamed_14d2']
del ntkrnlmp_types['__unnamed_184d']
del ntkrnlmp_types['__unnamed_1997']
del ntkrnlmp_types['__unnamed_1995']
del ntkrnlmp_types['__unnamed_1bea']
del ntkrnlmp_types['__unnamed_182d']
del ntkrnlmp_types['__unnamed_182b']
ntkrnlmp_types.update(ntkrnlmp_types_additions)

