ntkrnlmp_types = {
  '_CONFIGURATION_COMPONENT_DATA' : [ 0x34, {
    'Parent' : [ 0x0, ['pointer', ['_CONFIGURATION_COMPONENT_DATA']]],
    'Child' : [ 0x4, ['pointer', ['_CONFIGURATION_COMPONENT_DATA']]],
    'Sibling' : [ 0x8, ['pointer', ['_CONFIGURATION_COMPONENT_DATA']]],
    'ComponentEntry' : [ 0xc, ['_CONFIGURATION_COMPONENT']],
    'ConfigurationData' : [ 0x30, ['pointer', ['void']]],
} ],
  '_DBGKD_QUERY_SPECIAL_CALLS' : [ 0x4, {
    'NumberOfSpecialCalls' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_2005' : [ 0x4, {
    'Balance' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='long')]],
    'Parent' : [ 0x0, ['pointer', ['_MMSUBSECTION_NODE']]],
} ],
  '_MMSUBSECTION_NODE' : [ 0x18, {
    'u' : [ 0x0, ['__unnamed_1f77']],
    'StartingSector' : [ 0x4, ['unsigned long']],
    'NumberOfFullSectors' : [ 0x8, ['unsigned long']],
    'u1' : [ 0xc, ['__unnamed_2005']],
    'LeftChild' : [ 0x10, ['pointer', ['_MMSUBSECTION_NODE']]],
    'RightChild' : [ 0x14, ['pointer', ['_MMSUBSECTION_NODE']]],
} ],
  '_VF_AVL_TREE_NODE' : [ 0x8, {
    'p' : [ 0x0, ['pointer', ['void']]],
    'RangeSize' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_200d' : [ 0x8, {
    'IdleTime' : [ 0x0, ['unsigned long']],
    'NonIdleTime' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_200f' : [ 0x8, {
    'Disk' : [ 0x0, ['__unnamed_200d']],
} ],
  '_DEVICE_OBJECT_POWER_EXTENSION' : [ 0x40, {
    'IdleCount' : [ 0x0, ['unsigned long']],
    'BusyCount' : [ 0x4, ['unsigned long']],
    'BusyReference' : [ 0x8, ['unsigned long']],
    'TotalBusyCount' : [ 0xc, ['unsigned long']],
    'ConservationIdleTime' : [ 0x10, ['unsigned long']],
    'PerformanceIdleTime' : [ 0x14, ['unsigned long']],
    'DeviceObject' : [ 0x18, ['pointer', ['_DEVICE_OBJECT']]],
    'IdleList' : [ 0x1c, ['_LIST_ENTRY']],
    'IdleType' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: 'DeviceIdleNormal', 1: 'DeviceIdleDisk'})]],
    'IdleState' : [ 0x28, ['Enumeration', dict(target = 'long', choices = {0: 'PowerDeviceUnspecified', 1: 'PowerDeviceD0', 2: 'PowerDeviceD1', 3: 'PowerDeviceD2', 4: 'PowerDeviceD3', 5: 'PowerDeviceMaximum'})]],
    'CurrentState' : [ 0x2c, ['Enumeration', dict(target = 'long', choices = {0: 'PowerDeviceUnspecified', 1: 'PowerDeviceD0', 2: 'PowerDeviceD1', 3: 'PowerDeviceD2', 4: 'PowerDeviceD3', 5: 'PowerDeviceMaximum'})]],
    'Volume' : [ 0x30, ['_LIST_ENTRY']],
    'Specific' : [ 0x38, ['__unnamed_200f']],
} ],
  '_ARBITER_RETEST_ALLOCATION_PARAMETERS' : [ 0xc, {
    'ArbitrationList' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'AllocateFromCount' : [ 0x4, ['unsigned long']],
    'AllocateFrom' : [ 0x8, ['pointer', ['_CM_PARTIAL_RESOURCE_DESCRIPTOR']]],
} ],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS' : [ 0x1, {
    'FRUId' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'FRUText' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'AsUCHAR' : [ 0x0, ['unsigned char']],
} ],
  '_FS_FILTER_CALLBACKS' : [ 0x38, {
    'SizeOfFsFilterCallbacks' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'PreAcquireForSectionSynchronization' : [ 0x8, ['pointer', ['void']]],
    'PostAcquireForSectionSynchronization' : [ 0xc, ['pointer', ['void']]],
    'PreReleaseForSectionSynchronization' : [ 0x10, ['pointer', ['void']]],
    'PostReleaseForSectionSynchronization' : [ 0x14, ['pointer', ['void']]],
    'PreAcquireForCcFlush' : [ 0x18, ['pointer', ['void']]],
    'PostAcquireForCcFlush' : [ 0x1c, ['pointer', ['void']]],
    'PreReleaseForCcFlush' : [ 0x20, ['pointer', ['void']]],
    'PostReleaseForCcFlush' : [ 0x24, ['pointer', ['void']]],
    'PreAcquireForModifiedPageWriter' : [ 0x28, ['pointer', ['void']]],
    'PostAcquireForModifiedPageWriter' : [ 0x2c, ['pointer', ['void']]],
    'PreReleaseForModifiedPageWriter' : [ 0x30, ['pointer', ['void']]],
    'PostReleaseForModifiedPageWriter' : [ 0x34, ['pointer', ['void']]],
} ],
  '_KENLISTMENT' : [ 0x168, {
    'cookie' : [ 0x0, ['unsigned long']],
    'NamespaceLink' : [ 0x4, ['_KTMOBJECT_NAMESPACE_LINK']],
    'EnlistmentId' : [ 0x18, ['_GUID']],
    'Mutex' : [ 0x28, ['_KMUTANT']],
    'NextSameTx' : [ 0x48, ['_LIST_ENTRY']],
    'NextSameRm' : [ 0x50, ['_LIST_ENTRY']],
    'ResourceManager' : [ 0x58, ['pointer', ['_KRESOURCEMANAGER']]],
    'Transaction' : [ 0x5c, ['pointer', ['_KTRANSACTION']]],
    'State' : [ 0x60, ['Enumeration', dict(target = 'long', choices = {0: 'KEnlistmentUninitialized', 256: 'KEnlistmentActive', 258: 'KEnlistmentPrepared', 259: 'KEnlistmentInDoubt', 260: 'KEnlistmentCommitted', 261: 'KEnlistmentCommittedNotify', 262: 'KEnlistmentCommitRequested', 257: 'KEnlistmentPreparing', 264: 'KEnlistmentDelegated', 265: 'KEnlistmentDelegatedDisconnected', 266: 'KEnlistmentPrePreparing', 263: 'KEnlistmentAborted', 268: 'KEnlistmentRecovering', 269: 'KEnlistmentAborting', 270: 'KEnlistmentReadOnly', 271: 'KEnlistmentOutcomeUnavailable', 272: 'KEnlistmentOffline', 273: 'KEnlistmentPrePrepared', 274: 'KEnlistmentInitialized', 267: 'KEnlistmentForgotten'})]],
    'Flags' : [ 0x64, ['unsigned long']],
    'NotificationMask' : [ 0x68, ['unsigned long']],
    'Key' : [ 0x6c, ['pointer', ['void']]],
    'KeyRefCount' : [ 0x70, ['unsigned long']],
    'RecoveryInformation' : [ 0x74, ['pointer', ['void']]],
    'RecoveryInformationLength' : [ 0x78, ['unsigned long']],
    'DynamicNameInformation' : [ 0x7c, ['pointer', ['void']]],
    'DynamicNameInformationLength' : [ 0x80, ['unsigned long']],
    'FinalNotification' : [ 0x84, ['pointer', ['_KTMNOTIFICATION_PACKET']]],
    'SupSubEnlistment' : [ 0x88, ['pointer', ['_KENLISTMENT']]],
    'SupSubEnlHandle' : [ 0x8c, ['pointer', ['void']]],
    'SubordinateTxHandle' : [ 0x90, ['pointer', ['void']]],
    'CrmEnlistmentEnId' : [ 0x94, ['_GUID']],
    'CrmEnlistmentTmId' : [ 0xa4, ['_GUID']],
    'CrmEnlistmentRmId' : [ 0xb4, ['_GUID']],
    'NextHistory' : [ 0xc4, ['unsigned long']],
    'History' : [ 0xc8, ['array', 20, ['_KENLISTMENT_HISTORY']]],
} ],
  '_ARBITER_INTERFACE' : [ 0x18, {
    'Size' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned short']],
    'Context' : [ 0x4, ['pointer', ['void']]],
    'InterfaceReference' : [ 0x8, ['pointer', ['void']]],
    'InterfaceDereference' : [ 0xc, ['pointer', ['void']]],
    'ArbiterHandler' : [ 0x10, ['pointer', ['void']]],
    'Flags' : [ 0x14, ['unsigned long']],
} ],
  '_KAPC_STATE' : [ 0x18, {
    'ApcListHead' : [ 0x0, ['array', 2, ['_LIST_ENTRY']]],
    'Process' : [ 0x10, ['pointer', ['_KPROCESS']]],
    'KernelApcInProgress' : [ 0x14, ['unsigned char']],
    'KernelApcPending' : [ 0x15, ['unsigned char']],
    'UserApcPending' : [ 0x16, ['unsigned char']],
} ],
  '_IA64_LOADER_BLOCK' : [ 0x4, {
    'PlaceHolder' : [ 0x0, ['unsigned long']],
} ],
  '_IA64_DBGKD_CONTROL_SET' : [ 0x14, {
    'Continue' : [ 0x0, ['unsigned long']],
    'CurrentSymbolStart' : [ 0x4, ['unsigned long long']],
    'CurrentSymbolEnd' : [ 0xc, ['unsigned long long']],
} ],
  '_DEVICE_RELATIONS' : [ 0x8, {
    'Count' : [ 0x0, ['unsigned long']],
    'Objects' : [ 0x4, ['array', 1, ['pointer', ['_DEVICE_OBJECT']]]],
} ],
  '_IMAGE_ROM_OPTIONAL_HEADER' : [ 0x38, {
    'Magic' : [ 0x0, ['unsigned short']],
    'MajorLinkerVersion' : [ 0x2, ['unsigned char']],
    'MinorLinkerVersion' : [ 0x3, ['unsigned char']],
    'SizeOfCode' : [ 0x4, ['unsigned long']],
    'SizeOfInitializedData' : [ 0x8, ['unsigned long']],
    'SizeOfUninitializedData' : [ 0xc, ['unsigned long']],
    'AddressOfEntryPoint' : [ 0x10, ['unsigned long']],
    'BaseOfCode' : [ 0x14, ['unsigned long']],
    'BaseOfData' : [ 0x18, ['unsigned long']],
    'BaseOfBss' : [ 0x1c, ['unsigned long']],
    'GprMask' : [ 0x20, ['unsigned long']],
    'CprMask' : [ 0x24, ['array', 4, ['unsigned long']]],
    'GpValue' : [ 0x34, ['unsigned long']],
} ],
  '_ALPC_COMPLETION_LIST_HEADER' : [ 0x300, {
    'StartMagic' : [ 0x0, ['unsigned long long']],
    'TotalSize' : [ 0x8, ['unsigned long']],
    'ListOffset' : [ 0xc, ['unsigned long']],
    'ListSize' : [ 0x10, ['unsigned long']],
    'BitmapOffset' : [ 0x14, ['unsigned long']],
    'BitmapSize' : [ 0x18, ['unsigned long']],
    'DataOffset' : [ 0x1c, ['unsigned long']],
    'DataSize' : [ 0x20, ['unsigned long']],
    'AttributeFlags' : [ 0x24, ['unsigned long']],
    'AttributeSize' : [ 0x28, ['unsigned long']],
    'State' : [ 0x80, ['_ALPC_COMPLETION_LIST_STATE']],
    'LastMessageId' : [ 0x88, ['unsigned long']],
    'LastCallbackId' : [ 0x8c, ['unsigned long']],
    'PostCount' : [ 0x100, ['unsigned long']],
    'ReturnCount' : [ 0x180, ['unsigned long']],
    'LogSequenceNumber' : [ 0x200, ['unsigned long']],
    'UserLock' : [ 0x280, ['_RTL_SRWLOCK']],
    'EndMagic' : [ 0x288, ['unsigned long long']],
} ],
  '_IMAGE_DEBUG_DIRECTORY' : [ 0x1c, {
    'Characteristics' : [ 0x0, ['unsigned long']],
    'TimeDateStamp' : [ 0x4, ['unsigned long']],
    'MajorVersion' : [ 0x8, ['unsigned short']],
    'MinorVersion' : [ 0xa, ['unsigned short']],
    'Type' : [ 0xc, ['unsigned long']],
    'SizeOfData' : [ 0x10, ['unsigned long']],
    'AddressOfRawData' : [ 0x14, ['unsigned long']],
    'PointerToRawData' : [ 0x18, ['unsigned long']],
} ],
  '_ETW_WMITRACE_WORK' : [ 0xf0, {
    'LoggerId' : [ 0x0, ['unsigned long']],
    'LoggerName' : [ 0x8, ['array', 65, ['unsigned char']]],
    'FileName' : [ 0x49, ['array', 129, ['unsigned char']]],
    'MaximumFileSize' : [ 0xcc, ['unsigned long']],
    'MinBuffers' : [ 0xd0, ['unsigned long']],
    'MaxBuffers' : [ 0xd4, ['unsigned long']],
    'BufferSize' : [ 0xd8, ['unsigned long']],
    'Mode' : [ 0xdc, ['unsigned long']],
    'FlushTimer' : [ 0xe0, ['unsigned long']],
    'MatchAny' : [ 0x8, ['unsigned long long']],
    'MatchAll' : [ 0x10, ['unsigned long long']],
    'EnableProperty' : [ 0x18, ['unsigned long']],
    'Guid' : [ 0x1c, ['_GUID']],
    'Level' : [ 0x2c, ['unsigned char']],
    'Status' : [ 0xe8, ['long']],
} ],
  '_DEVICE_MAP' : [ 0x34, {
    'DosDevicesDirectory' : [ 0x0, ['pointer', ['_OBJECT_DIRECTORY']]],
    'GlobalDosDevicesDirectory' : [ 0x4, ['pointer', ['_OBJECT_DIRECTORY']]],
    'DosDevicesDirectoryHandle' : [ 0x8, ['pointer', ['void']]],
    'ReferenceCount' : [ 0xc, ['unsigned long']],
    'DriveMap' : [ 0x10, ['unsigned long']],
    'DriveType' : [ 0x14, ['array', 32, ['unsigned char']]],
} ],
  '_HEAP_DEBUGGING_INFORMATION' : [ 0x1c, {
    'InterceptorFunction' : [ 0x0, ['pointer', ['void']]],
    'InterceptorValue' : [ 0x4, ['unsigned short']],
    'ExtendedOptions' : [ 0x8, ['unsigned long']],
    'StackTraceDepth' : [ 0xc, ['unsigned long']],
    'MinTotalBlockSize' : [ 0x10, ['unsigned long']],
    'MaxTotalBlockSize' : [ 0x14, ['unsigned long']],
    'HeapLeakEnumerationRoutine' : [ 0x18, ['pointer', ['void']]],
} ],
  '_IO_RESOURCE_LIST' : [ 0x28, {
    'Version' : [ 0x0, ['unsigned short']],
    'Revision' : [ 0x2, ['unsigned short']],
    'Count' : [ 0x4, ['unsigned long']],
    'Descriptors' : [ 0x8, ['array', 1, ['_IO_RESOURCE_DESCRIPTOR']]],
} ],
  '_MMBANKED_SECTION' : [ 0x20, {
    'BasePhysicalPage' : [ 0x0, ['unsigned long']],
    'BasedPte' : [ 0x4, ['pointer', ['_MMPTE']]],
    'BankSize' : [ 0x8, ['unsigned long']],
    'BankShift' : [ 0xc, ['unsigned long']],
    'BankedRoutine' : [ 0x10, ['pointer', ['void']]],
    'Context' : [ 0x14, ['pointer', ['void']]],
    'CurrentMappedPte' : [ 0x18, ['pointer', ['_MMPTE']]],
    'BankTemplate' : [ 0x1c, ['array', 1, ['_MMPTE']]],
} ],
  '_WHEA_ERROR_RECORD_HEADER_FLAGS' : [ 0x4, {
    'Recovered' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PreviousError' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Simulated' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_XSAVE_AREA_HEADER' : [ 0x40, {
    'Mask' : [ 0x0, ['unsigned long long']],
    'Reserved' : [ 0x8, ['array', 7, ['unsigned long long']]],
} ],
  '_HEAP_VIRTUAL_ALLOC_ENTRY' : [ 0x20, {
    'Entry' : [ 0x0, ['_LIST_ENTRY']],
    'ExtraStuff' : [ 0x8, ['_HEAP_ENTRY_EXTRA']],
    'CommitSize' : [ 0x10, ['unsigned long']],
    'ReserveSize' : [ 0x14, ['unsigned long']],
    'BusyBlock' : [ 0x18, ['_HEAP_ENTRY']],
} ],
  '_PNP_DEVICE_COMPLETION_REQUEST' : [ 0x38, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'DeviceNode' : [ 0x8, ['pointer', ['_DEVICE_NODE']]],
    'Context' : [ 0xc, ['pointer', ['void']]],
    'CompletionState' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]],
    'IrpPended' : [ 0x14, ['unsigned long']],
    'Status' : [ 0x18, ['long']],
    'Information' : [ 0x1c, ['pointer', ['void']]],
    'WorkItem' : [ 0x20, ['_WORK_QUEUE_ITEM']],
    'FailingDriver' : [ 0x30, ['pointer', ['_DRIVER_OBJECT']]],
    'ReferenceCount' : [ 0x34, ['long']],
} ],
  '_EVENT_FILTER_HEADER' : [ 0x18, {
    'Id' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['array', 5, ['unsigned char']]],
    'InstanceId' : [ 0x8, ['unsigned long long']],
    'Size' : [ 0x10, ['unsigned long']],
    'NextOffset' : [ 0x14, ['unsigned long']],
} ],
  '_WAIT_CONTEXT_BLOCK' : [ 0x28, {
    'WaitQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DeviceRoutine' : [ 0x10, ['pointer', ['void']]],
    'DeviceContext' : [ 0x14, ['pointer', ['void']]],
    'NumberOfMapRegisters' : [ 0x18, ['unsigned long']],
    'DeviceObject' : [ 0x1c, ['pointer', ['void']]],
    'CurrentIrp' : [ 0x20, ['pointer', ['void']]],
    'BufferChainingDpc' : [ 0x24, ['pointer', ['_KDPC']]],
} ],
  '_SECTION_OBJECT' : [ 0x18, {
    'StartingVa' : [ 0x0, ['pointer', ['void']]],
    'EndingVa' : [ 0x4, ['pointer', ['void']]],
    'Parent' : [ 0x8, ['pointer', ['void']]],
    'LeftChild' : [ 0xc, ['pointer', ['void']]],
    'RightChild' : [ 0x10, ['pointer', ['void']]],
    'Segment' : [ 0x14, ['pointer', ['_SEGMENT_OBJECT']]],
} ],
  '_CM_NAME_CONTROL_BLOCK' : [ 0x10, {
    'Compressed' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'RefCount' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 32, native_type='unsigned long')]],
    'NameHash' : [ 0x4, ['_CM_NAME_HASH']],
    'ConvKey' : [ 0x4, ['unsigned long']],
    'NextHash' : [ 0x8, ['pointer', ['_CM_KEY_HASH']]],
    'NameLength' : [ 0xc, ['unsigned short']],
    'Name' : [ 0xe, ['array', 1, ['wchar']]],
} ],
  '_u' : [ 0x50, {
    'KeyNode' : [ 0x0, ['_CM_KEY_NODE']],
    'KeyValue' : [ 0x0, ['_CM_KEY_VALUE']],
    'KeySecurity' : [ 0x0, ['_CM_KEY_SECURITY']],
    'KeyIndex' : [ 0x0, ['_CM_KEY_INDEX']],
    'ValueData' : [ 0x0, ['_CM_BIG_DATA']],
    'KeyList' : [ 0x0, ['array', 1, ['unsigned long']]],
    'KeyString' : [ 0x0, ['array', 1, ['wchar']]],
} ],
  '_GENERAL_LOOKASIDE_POOL' : [ 0x48, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'SingleListHead' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x8, ['unsigned short']],
    'MaximumDepth' : [ 0xa, ['unsigned short']],
    'TotalAllocates' : [ 0xc, ['unsigned long']],
    'AllocateMisses' : [ 0x10, ['unsigned long']],
    'AllocateHits' : [ 0x10, ['unsigned long']],
    'TotalFrees' : [ 0x14, ['unsigned long']],
    'FreeMisses' : [ 0x18, ['unsigned long']],
    'FreeHits' : [ 0x18, ['unsigned long']],
    'Type' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: 'NonPagedPool', 1: 'PagedPool', 2: 'NonPagedPoolMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolCacheAlignedMustS', 7: 'MaxPoolType', 34: 'NonPagedPoolMustSucceedSession', 35: 'DontUseThisTypeSession', 32: 'NonPagedPoolSession', 36: 'NonPagedPoolCacheAlignedSession', 33: 'PagedPoolSession', 38: 'NonPagedPoolCacheAlignedMustSSession', 37: 'PagedPoolCacheAlignedSession'})]],
    'Tag' : [ 0x20, ['unsigned long']],
    'Size' : [ 0x24, ['unsigned long']],
    'AllocateEx' : [ 0x28, ['pointer', ['void']]],
    'Allocate' : [ 0x28, ['pointer', ['void']]],
    'FreeEx' : [ 0x2c, ['pointer', ['void']]],
    'Free' : [ 0x2c, ['pointer', ['void']]],
    'ListEntry' : [ 0x30, ['_LIST_ENTRY']],
    'LastTotalAllocates' : [ 0x38, ['unsigned long']],
    'LastAllocateMisses' : [ 0x3c, ['unsigned long']],
    'LastAllocateHits' : [ 0x3c, ['unsigned long']],
    'Future' : [ 0x40, ['array', 2, ['unsigned long']]],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_ENTRY' : [ 0xc, {
    'Linkage' : [ 0x0, ['_LIST_ENTRY']],
    'Signature' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_208d' : [ 0x4, {
    'AsULONG' : [ 0x0, ['unsigned long']],
    'IncreasePolicy' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned long')]],
    'DecreasePolicy' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
} ],
  '_PPM_PERF_STATES' : [ 0x80, {
    'Count' : [ 0x0, ['unsigned long']],
    'MaxFrequency' : [ 0x4, ['unsigned long']],
    'PStateCap' : [ 0x8, ['unsigned long']],
    'TStateCap' : [ 0xc, ['unsigned long']],
    'MaxPerfState' : [ 0x10, ['unsigned long']],
    'MinPerfState' : [ 0x14, ['unsigned long']],
    'LowestPState' : [ 0x18, ['unsigned long']],
    'IncreaseTime' : [ 0x1c, ['unsigned long']],
    'DecreaseTime' : [ 0x20, ['unsigned long']],
    'BusyAdjThreshold' : [ 0x24, ['unsigned char']],
    'Reserved' : [ 0x25, ['unsigned char']],
    'ThrottleStatesOnly' : [ 0x26, ['unsigned char']],
    'PolicyType' : [ 0x27, ['unsigned char']],
    'TimerInterval' : [ 0x28, ['unsigned long']],
    'Flags' : [ 0x2c, ['__unnamed_208d']],
    'TargetProcessors' : [ 0x30, ['_KAFFINITY_EX']],
    'PStateHandler' : [ 0x3c, ['pointer', ['void']]],
    'PStateContext' : [ 0x40, ['unsigned long']],
    'TStateHandler' : [ 0x44, ['pointer', ['void']]],
    'TStateContext' : [ 0x48, ['unsigned long']],
    'FeedbackHandler' : [ 0x4c, ['pointer', ['void']]],
    'GetFFHThrottleState' : [ 0x50, ['pointer', ['void']]],
    'State' : [ 0x58, ['array', 1, ['_PPM_PERF_STATE']]],
} ],
  '_M128A' : [ 0x10, {
    'Low' : [ 0x0, ['unsigned long long']],
    'High' : [ 0x8, ['long long']],
} ],
  '_HEAP_LOOKASIDE' : [ 0x30, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'Depth' : [ 0x8, ['unsigned short']],
    'MaximumDepth' : [ 0xa, ['unsigned short']],
    'TotalAllocates' : [ 0xc, ['unsigned long']],
    'AllocateMisses' : [ 0x10, ['unsigned long']],
    'TotalFrees' : [ 0x14, ['unsigned long']],
    'FreeMisses' : [ 0x18, ['unsigned long']],
    'LastTotalAllocates' : [ 0x1c, ['unsigned long']],
    'LastAllocateMisses' : [ 0x20, ['unsigned long']],
    'Counters' : [ 0x24, ['array', 2, ['unsigned long']]],
} ],
  '_WMI_TRACE_PACKET' : [ 0x4, {
    'Size' : [ 0x0, ['unsigned short']],
    'HookId' : [ 0x2, ['unsigned short']],
    'Type' : [ 0x2, ['unsigned char']],
    'Group' : [ 0x3, ['unsigned char']],
} ],
  '_KTIMER' : [ 0x28, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'DueTime' : [ 0x10, ['_ULARGE_INTEGER']],
    'TimerListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'Dpc' : [ 0x20, ['pointer', ['_KDPC']]],
    'Period' : [ 0x24, ['unsigned long']],
} ],
  '_RTL_ATOM_TABLE' : [ 0x44, {
    'Signature' : [ 0x0, ['unsigned long']],
    'CriticalSection' : [ 0x4, ['_RTL_CRITICAL_SECTION']],
    'RtlHandleTable' : [ 0x1c, ['_RTL_HANDLE_TABLE']],
    'NumberOfBuckets' : [ 0x3c, ['unsigned long']],
    'Buckets' : [ 0x40, ['array', 1, ['pointer', ['_RTL_ATOM_TABLE_ENTRY']]]],
} ],
  '_POP_POWER_ACTION' : [ 0xb0, {
    'Updates' : [ 0x0, ['unsigned char']],
    'State' : [ 0x1, ['unsigned char']],
    'Shutdown' : [ 0x2, ['unsigned char']],
    'Action' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'PowerActionNone', 1: 'PowerActionReserved', 2: 'PowerActionSleep', 3: 'PowerActionHibernate', 4: 'PowerActionShutdown', 5: 'PowerActionShutdownReset', 6: 'PowerActionShutdownOff', 7: 'PowerActionWarmEject'})]],
    'LightestState' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'Flags' : [ 0xc, ['unsigned long']],
    'Status' : [ 0x10, ['long']],
    'DeviceType' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: 'PolicyDeviceSystemButton', 1: 'PolicyDeviceThermalZone', 2: 'PolicyDeviceBattery', 3: 'PolicyDeviceMemory', 4: 'PolicyInitiatePowerActionAPI', 5: 'PolicySetPowerStateAPI', 6: 'PolicyImmediateDozeS4', 7: 'PolicySystemIdle', 8: 'PolicyDeviceMax'})]],
    'DeviceTypeFlags' : [ 0x18, ['unsigned long']],
    'IrpMinor' : [ 0x1c, ['unsigned char']],
    'Waking' : [ 0x1d, ['unsigned char']],
    'SystemState' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'NextSystemState' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'EffectiveSystemState' : [ 0x28, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'CurrentSystemState' : [ 0x2c, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'ShutdownBugCode' : [ 0x30, ['pointer', ['_POP_SHUTDOWN_BUG_CHECK']]],
    'DevState' : [ 0x34, ['pointer', ['_POP_DEVICE_SYS_STATE']]],
    'HiberContext' : [ 0x38, ['pointer', ['_POP_HIBER_CONTEXT']]],
    'WakeTime' : [ 0x40, ['unsigned long long']],
    'SleepTime' : [ 0x48, ['unsigned long long']],
    'ProgrammedRTCTime' : [ 0x50, ['unsigned long long']],
    'WakeOnRTC' : [ 0x58, ['unsigned char']],
    'WakeTimerInfo' : [ 0x5c, ['pointer', ['_DIAGNOSTIC_BUFFER']]],
    'FilteredCapabilities' : [ 0x60, ['SYSTEM_POWER_CAPABILITIES']],
} ],
  '_CM_KEY_VALUE' : [ 0x18, {
    'Signature' : [ 0x0, ['unsigned short']],
    'NameLength' : [ 0x2, ['unsigned short']],
    'DataLength' : [ 0x4, ['unsigned long']],
    'Data' : [ 0x8, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned long']],
    'Flags' : [ 0x10, ['unsigned short']],
    'Spare' : [ 0x12, ['unsigned short']],
    'Name' : [ 0x14, ['array', 1, ['wchar']]],
} ],
  '_AMD64_DBGKD_CONTROL_SET' : [ 0x1c, {
    'TraceFlag' : [ 0x0, ['unsigned long']],
    'Dr7' : [ 0x4, ['unsigned long long']],
    'CurrentSymbolStart' : [ 0xc, ['unsigned long long']],
    'CurrentSymbolEnd' : [ 0x14, ['unsigned long long']],
} ],
  '_PO_DEVICE_NOTIFY' : [ 0x3c, {
    'Link' : [ 0x0, ['_LIST_ENTRY']],
    'PowerChildren' : [ 0x8, ['_LIST_ENTRY']],
    'PowerParents' : [ 0x10, ['_LIST_ENTRY']],
    'TargetDevice' : [ 0x18, ['pointer', ['_DEVICE_OBJECT']]],
    'OrderLevel' : [ 0x1c, ['unsigned char']],
    'DeviceObject' : [ 0x20, ['pointer', ['_DEVICE_OBJECT']]],
    'DeviceName' : [ 0x24, ['pointer', ['unsigned short']]],
    'DriverName' : [ 0x28, ['pointer', ['unsigned short']]],
    'ChildCount' : [ 0x2c, ['unsigned long']],
    'ActiveChild' : [ 0x30, ['unsigned long']],
    'ParentCount' : [ 0x34, ['unsigned long']],
    'ActiveParent' : [ 0x38, ['unsigned long']],
} ],
  '_CM_KEY_SECURITY_CACHE_ENTRY' : [ 0x8, {
    'Cell' : [ 0x0, ['unsigned long']],
    'CachedSecurity' : [ 0x4, ['pointer', ['_CM_KEY_SECURITY_CACHE']]],
} ],
  '_FS_FILTER_CALLBACK_DATA' : [ 0x24, {
    'SizeOfFsFilterCallbackData' : [ 0x0, ['unsigned long']],
    'Operation' : [ 0x4, ['unsigned char']],
    'Reserved' : [ 0x5, ['unsigned char']],
    'DeviceObject' : [ 0x8, ['pointer', ['_DEVICE_OBJECT']]],
    'FileObject' : [ 0xc, ['pointer', ['_FILE_OBJECT']]],
    'Parameters' : [ 0x10, ['_FS_FILTER_PARAMETERS']],
} ],
  '_GDI_TEB_BATCH32' : [ 0x4e0, {
    'Offset' : [ 0x0, ['unsigned long']],
    'HDC' : [ 0x4, ['unsigned long']],
    'Buffer' : [ 0x8, ['array', 310, ['unsigned long']]],
} ],
  '_PROC_IDLE_STATE_ACCOUNTING' : [ 0x228, {
    'TotalTime' : [ 0x0, ['unsigned long long']],
    'IdleTransitions' : [ 0x8, ['unsigned long']],
    'FailedTransitions' : [ 0xc, ['unsigned long']],
    'InvalidBucketIndex' : [ 0x10, ['unsigned long']],
    'MinTime' : [ 0x18, ['unsigned long long']],
    'MaxTime' : [ 0x20, ['unsigned long long']],
    'IdleTimeBuckets' : [ 0x28, ['array', 16, ['_PROC_IDLE_STATE_BUCKET']]],
} ],
  '_IMAGE_SECURITY_CONTEXT' : [ 0x4, {
    'PageHashes' : [ 0x0, ['pointer', ['void']]],
    'Value' : [ 0x0, ['unsigned long']],
    'SecurityBeingCreated' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'SecurityMandatory' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Unused' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'PageHashPointer' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_20d0' : [ 0x4, {
    'Level' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_20d2' : [ 0x4, {
    'Type' : [ 0x0, ['unsigned long']],
} ],
  '_POP_ACTION_TRIGGER' : [ 0x10, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'PolicyDeviceSystemButton', 1: 'PolicyDeviceThermalZone', 2: 'PolicyDeviceBattery', 3: 'PolicyDeviceMemory', 4: 'PolicyInitiatePowerActionAPI', 5: 'PolicySetPowerStateAPI', 6: 'PolicyImmediateDozeS4', 7: 'PolicySystemIdle', 8: 'PolicyDeviceMax'})]],
    'Flags' : [ 0x4, ['unsigned long']],
    'Wait' : [ 0x8, ['pointer', ['_POP_TRIGGER_WAIT']]],
    'Battery' : [ 0xc, ['__unnamed_20d0']],
    'Button' : [ 0xc, ['__unnamed_20d2']],
} ],
  '_KENLISTMENT_HISTORY' : [ 0x8, {
    'Notification' : [ 0x0, ['unsigned long']],
    'NewState' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'KEnlistmentUninitialized', 256: 'KEnlistmentActive', 258: 'KEnlistmentPrepared', 259: 'KEnlistmentInDoubt', 260: 'KEnlistmentCommitted', 261: 'KEnlistmentCommittedNotify', 262: 'KEnlistmentCommitRequested', 257: 'KEnlistmentPreparing', 264: 'KEnlistmentDelegated', 265: 'KEnlistmentDelegatedDisconnected', 266: 'KEnlistmentPrePreparing', 263: 'KEnlistmentAborted', 268: 'KEnlistmentRecovering', 269: 'KEnlistmentAborting', 270: 'KEnlistmentReadOnly', 271: 'KEnlistmentOutcomeUnavailable', 272: 'KEnlistmentOffline', 273: 'KEnlistmentPrePrepared', 274: 'KEnlistmentInitialized', 267: 'KEnlistmentForgotten'})]],
} ],
  '_FAST_IO_DISPATCH' : [ 0x70, {
    'SizeOfFastIoDispatch' : [ 0x0, ['unsigned long']],
    'FastIoCheckIfPossible' : [ 0x4, ['pointer', ['void']]],
    'FastIoRead' : [ 0x8, ['pointer', ['void']]],
    'FastIoWrite' : [ 0xc, ['pointer', ['void']]],
    'FastIoQueryBasicInfo' : [ 0x10, ['pointer', ['void']]],
    'FastIoQueryStandardInfo' : [ 0x14, ['pointer', ['void']]],
    'FastIoLock' : [ 0x18, ['pointer', ['void']]],
    'FastIoUnlockSingle' : [ 0x1c, ['pointer', ['void']]],
    'FastIoUnlockAll' : [ 0x20, ['pointer', ['void']]],
    'FastIoUnlockAllByKey' : [ 0x24, ['pointer', ['void']]],
    'FastIoDeviceControl' : [ 0x28, ['pointer', ['void']]],
    'AcquireFileForNtCreateSection' : [ 0x2c, ['pointer', ['void']]],
    'ReleaseFileForNtCreateSection' : [ 0x30, ['pointer', ['void']]],
    'FastIoDetachDevice' : [ 0x34, ['pointer', ['void']]],
    'FastIoQueryNetworkOpenInfo' : [ 0x38, ['pointer', ['void']]],
    'AcquireForModWrite' : [ 0x3c, ['pointer', ['void']]],
    'MdlRead' : [ 0x40, ['pointer', ['void']]],
    'MdlReadComplete' : [ 0x44, ['pointer', ['void']]],
    'PrepareMdlWrite' : [ 0x48, ['pointer', ['void']]],
    'MdlWriteComplete' : [ 0x4c, ['pointer', ['void']]],
    'FastIoReadCompressed' : [ 0x50, ['pointer', ['void']]],
    'FastIoWriteCompressed' : [ 0x54, ['pointer', ['void']]],
    'MdlReadCompleteCompressed' : [ 0x58, ['pointer', ['void']]],
    'MdlWriteCompleteCompressed' : [ 0x5c, ['pointer', ['void']]],
    'FastIoQueryOpen' : [ 0x60, ['pointer', ['void']]],
    'ReleaseForModWrite' : [ 0x64, ['pointer', ['void']]],
    'AcquireForCcFlush' : [ 0x68, ['pointer', ['void']]],
    'ReleaseForCcFlush' : [ 0x6c, ['pointer', ['void']]],
} ],
  '_CM_CELL_REMAP_BLOCK' : [ 0x8, {
    'OldCell' : [ 0x0, ['unsigned long']],
    'NewCell' : [ 0x4, ['unsigned long']],
} ],
  '_OBJECT_DIRECTORY_ENTRY' : [ 0xc, {
    'ChainLink' : [ 0x0, ['pointer', ['_OBJECT_DIRECTORY_ENTRY']]],
    'Object' : [ 0x4, ['pointer', ['void']]],
    'HashValue' : [ 0x8, ['unsigned long']],
} ],
  '_LOADER_PARAMETER_EXTENSION' : [ 0xe8, {
    'Size' : [ 0x0, ['unsigned long']],
    'Profile' : [ 0x4, ['_PROFILE_PARAMETER_BLOCK']],
    'EmInfFileImage' : [ 0x14, ['pointer', ['void']]],
    'EmInfFileSize' : [ 0x18, ['unsigned long']],
    'TriageDumpBlock' : [ 0x1c, ['pointer', ['void']]],
    'LoaderPagesSpanned' : [ 0x20, ['unsigned long']],
    'HeadlessLoaderBlock' : [ 0x24, ['pointer', ['_HEADLESS_LOADER_BLOCK']]],
    'SMBiosEPSHeader' : [ 0x28, ['pointer', ['_SMBIOS_TABLE_HEADER']]],
    'DrvDBImage' : [ 0x2c, ['pointer', ['void']]],
    'DrvDBSize' : [ 0x30, ['unsigned long']],
    'NetworkLoaderBlock' : [ 0x34, ['pointer', ['_NETWORK_LOADER_BLOCK']]],
    'HalpIRQLToTPR' : [ 0x38, ['pointer', ['unsigned char']]],
    'HalpVectorToIRQL' : [ 0x3c, ['pointer', ['unsigned char']]],
    'FirmwareDescriptorListHead' : [ 0x40, ['_LIST_ENTRY']],
    'AcpiTable' : [ 0x48, ['pointer', ['void']]],
    'AcpiTableSize' : [ 0x4c, ['unsigned long']],
    'LastBootSucceeded' : [ 0x50, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'LastBootShutdown' : [ 0x50, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'IoPortAccessSupported' : [ 0x50, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Reserved' : [ 0x50, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'LoaderPerformanceData' : [ 0x54, ['pointer', ['_LOADER_PERFORMANCE_DATA']]],
    'BootApplicationPersistentData' : [ 0x58, ['_LIST_ENTRY']],
    'WmdTestResult' : [ 0x60, ['pointer', ['void']]],
    'BootIdentifier' : [ 0x64, ['_GUID']],
    'ResumePages' : [ 0x74, ['unsigned long']],
    'DumpHeader' : [ 0x78, ['pointer', ['void']]],
    'BgContext' : [ 0x7c, ['pointer', ['void']]],
    'NumaLocalityInfo' : [ 0x80, ['pointer', ['void']]],
    'NumaGroupAssignment' : [ 0x84, ['pointer', ['void']]],
    'AttachedHives' : [ 0x88, ['_LIST_ENTRY']],
    'MemoryCachingRequirementsCount' : [ 0x90, ['unsigned long']],
    'MemoryCachingRequirements' : [ 0x94, ['pointer', ['void']]],
    'TpmBootEntropyResult' : [ 0x98, ['_TPM_BOOT_ENTROPY_LDR_RESULT']],
    'ProcessorCounterFrequency' : [ 0xe0, ['unsigned long long']],
} ],
  '_PI_RESOURCE_ARBITER_ENTRY' : [ 0x38, {
    'DeviceArbiterList' : [ 0x0, ['_LIST_ENTRY']],
    'ResourceType' : [ 0x8, ['unsigned char']],
    'ArbiterInterface' : [ 0xc, ['pointer', ['_ARBITER_INTERFACE']]],
    'DeviceNode' : [ 0x10, ['pointer', ['_DEVICE_NODE']]],
    'ResourceList' : [ 0x14, ['_LIST_ENTRY']],
    'BestResourceList' : [ 0x1c, ['_LIST_ENTRY']],
    'BestConfig' : [ 0x24, ['_LIST_ENTRY']],
    'ActiveArbiterList' : [ 0x2c, ['_LIST_ENTRY']],
    'State' : [ 0x34, ['unsigned char']],
    'ResourcesChanged' : [ 0x35, ['unsigned char']],
} ],
  '_SECURITY_DESCRIPTOR' : [ 0x14, {
    'Revision' : [ 0x0, ['unsigned char']],
    'Sbz1' : [ 0x1, ['unsigned char']],
    'Control' : [ 0x2, ['unsigned short']],
    'Owner' : [ 0x4, ['pointer', ['void']]],
    'Group' : [ 0x8, ['pointer', ['void']]],
    'Sacl' : [ 0xc, ['pointer', ['_ACL']]],
    'Dacl' : [ 0x10, ['pointer', ['_ACL']]],
} ],
  '_RTL_USER_PROCESS_PARAMETERS' : [ 0x298, {
    'MaximumLength' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
    'Flags' : [ 0x8, ['unsigned long']],
    'DebugFlags' : [ 0xc, ['unsigned long']],
    'ConsoleHandle' : [ 0x10, ['pointer', ['void']]],
    'ConsoleFlags' : [ 0x14, ['unsigned long']],
    'StandardInput' : [ 0x18, ['pointer', ['void']]],
    'StandardOutput' : [ 0x1c, ['pointer', ['void']]],
    'StandardError' : [ 0x20, ['pointer', ['void']]],
    'CurrentDirectory' : [ 0x24, ['_CURDIR']],
    'DllPath' : [ 0x30, ['_UNICODE_STRING']],
    'ImagePathName' : [ 0x38, ['_UNICODE_STRING']],
    'CommandLine' : [ 0x40, ['_UNICODE_STRING']],
    'Environment' : [ 0x48, ['pointer', ['void']]],
    'StartingX' : [ 0x4c, ['unsigned long']],
    'StartingY' : [ 0x50, ['unsigned long']],
    'CountX' : [ 0x54, ['unsigned long']],
    'CountY' : [ 0x58, ['unsigned long']],
    'CountCharsX' : [ 0x5c, ['unsigned long']],
    'CountCharsY' : [ 0x60, ['unsigned long']],
    'FillAttribute' : [ 0x64, ['unsigned long']],
    'WindowFlags' : [ 0x68, ['unsigned long']],
    'ShowWindowFlags' : [ 0x6c, ['unsigned long']],
    'WindowTitle' : [ 0x70, ['_UNICODE_STRING']],
    'DesktopInfo' : [ 0x78, ['_UNICODE_STRING']],
    'ShellInfo' : [ 0x80, ['_UNICODE_STRING']],
    'RuntimeData' : [ 0x88, ['_UNICODE_STRING']],
    'CurrentDirectores' : [ 0x90, ['array', 32, ['_RTL_DRIVE_LETTER_CURDIR']]],
    'EnvironmentSize' : [ 0x290, ['unsigned long']],
    'EnvironmentVersion' : [ 0x294, ['unsigned long']],
} ],
  '_PHYSICAL_MEMORY_RUN' : [ 0x8, {
    'BasePage' : [ 0x0, ['unsigned long']],
    'PageCount' : [ 0x4, ['unsigned long']],
} ],
  '_RTL_SRWLOCK' : [ 0x4, {
    'Locked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Waiting' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Waking' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'MultipleShared' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Shared' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
    'Value' : [ 0x0, ['unsigned long']],
    'Ptr' : [ 0x0, ['pointer', ['void']]],
} ],
  '_ALPC_MESSAGE_ZONE' : [ 0x18, {
    'Mdl' : [ 0x0, ['pointer', ['_MDL']]],
    'UserVa' : [ 0x4, ['pointer', ['void']]],
    'UserLimit' : [ 0x8, ['pointer', ['void']]],
    'SystemVa' : [ 0xc, ['pointer', ['void']]],
    'SystemLimit' : [ 0x10, ['pointer', ['void']]],
    'Size' : [ 0x14, ['unsigned long']],
} ],
  '_KTMOBJECT_NAMESPACE_LINK' : [ 0x14, {
    'Links' : [ 0x0, ['_RTL_BALANCED_LINKS']],
    'Expired' : [ 0x10, ['unsigned char']],
} ],
  '_CACHE_MANAGER_CALLBACKS' : [ 0x10, {
    'AcquireForLazyWrite' : [ 0x0, ['pointer', ['void']]],
    'ReleaseFromLazyWrite' : [ 0x4, ['pointer', ['void']]],
    'AcquireForReadAhead' : [ 0x8, ['pointer', ['void']]],
    'ReleaseFromReadAhead' : [ 0xc, ['pointer', ['void']]],
} ],
  '_PROC_PERF_LOAD' : [ 0x2, {
    'BusyPercentage' : [ 0x0, ['unsigned char']],
    'FrequencyPercentage' : [ 0x1, ['unsigned char']],
} ],
  '_PROC_HISTORY_ENTRY' : [ 0x4, {
    'Utility' : [ 0x0, ['unsigned short']],
    'Frequency' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
} ],
  '_RTL_RANGE' : [ 0x20, {
    'Start' : [ 0x0, ['unsigned long long']],
    'End' : [ 0x8, ['unsigned long long']],
    'UserData' : [ 0x10, ['pointer', ['void']]],
    'Owner' : [ 0x14, ['pointer', ['void']]],
    'Attributes' : [ 0x18, ['unsigned char']],
    'Flags' : [ 0x19, ['unsigned char']],
} ],
  '_SYSTEM_POWER_POLICY' : [ 0xe8, {
    'Revision' : [ 0x0, ['unsigned long']],
    'PowerButton' : [ 0x4, ['POWER_ACTION_POLICY']],
    'SleepButton' : [ 0x10, ['POWER_ACTION_POLICY']],
    'LidClose' : [ 0x1c, ['POWER_ACTION_POLICY']],
    'LidOpenWake' : [ 0x28, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'Reserved' : [ 0x2c, ['unsigned long']],
    'Idle' : [ 0x30, ['POWER_ACTION_POLICY']],
    'IdleTimeout' : [ 0x3c, ['unsigned long']],
    'IdleSensitivity' : [ 0x40, ['unsigned char']],
    'DynamicThrottle' : [ 0x41, ['unsigned char']],
    'Spare2' : [ 0x42, ['array', 2, ['unsigned char']]],
    'MinSleep' : [ 0x44, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'MaxSleep' : [ 0x48, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'ReducedLatencySleep' : [ 0x4c, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'WinLogonFlags' : [ 0x50, ['unsigned long']],
    'Spare3' : [ 0x54, ['unsigned long']],
    'DozeS4Timeout' : [ 0x58, ['unsigned long']],
    'BroadcastCapacityResolution' : [ 0x5c, ['unsigned long']],
    'DischargePolicy' : [ 0x60, ['array', 4, ['SYSTEM_POWER_LEVEL']]],
    'VideoTimeout' : [ 0xc0, ['unsigned long']],
    'VideoDimDisplay' : [ 0xc4, ['unsigned char']],
    'VideoReserved' : [ 0xc8, ['array', 3, ['unsigned long']]],
    'SpindownTimeout' : [ 0xd4, ['unsigned long']],
    'OptimizeForPower' : [ 0xd8, ['unsigned char']],
    'FanThrottleTolerance' : [ 0xd9, ['unsigned char']],
    'ForcedThrottle' : [ 0xda, ['unsigned char']],
    'MinThrottle' : [ 0xdb, ['unsigned char']],
    'OverThrottled' : [ 0xdc, ['POWER_ACTION_POLICY']],
} ],
  '_POOL_HEADER' : [ 0x8, {
    'PreviousSize' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 9, native_type='unsigned short')]],
    'PoolIndex' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 16, native_type='unsigned short')]],
    'BlockSize' : [ 0x2, ['BitField', dict(start_bit = 0, end_bit = 9, native_type='unsigned short')]],
    'PoolType' : [ 0x2, ['BitField', dict(start_bit = 9, end_bit = 16, native_type='unsigned short')]],
    'Ulong1' : [ 0x0, ['unsigned long']],
    'PoolTag' : [ 0x4, ['unsigned long']],
    'AllocatorBackTraceIndex' : [ 0x4, ['unsigned short']],
    'PoolTagHash' : [ 0x6, ['unsigned short']],
} ],
  '_ETW_PROVIDER_TABLE_ENTRY' : [ 0x10, {
    'RefCount' : [ 0x0, ['long']],
    'State' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'EtwProviderStateFree', 1: 'EtwProviderStateTransition', 2: 'EtwProviderStateActive', 3: 'EtwProviderStateMax'})]],
    'RegEntry' : [ 0x8, ['pointer', ['_ETW_REG_ENTRY']]],
    'Caller' : [ 0xc, ['pointer', ['void']]],
} ],
  '_SE_AUDIT_PROCESS_CREATION_INFO' : [ 0x4, {
    'ImageFileName' : [ 0x0, ['pointer', ['_OBJECT_NAME_INFORMATION']]],
} ],
  '_HEAP_ENTRY_EXTRA' : [ 0x8, {
    'AllocatorBackTraceIndex' : [ 0x0, ['unsigned short']],
    'TagIndex' : [ 0x2, ['unsigned short']],
    'Settable' : [ 0x4, ['unsigned long']],
    'ZeroInit' : [ 0x0, ['unsigned long long']],
} ],
  '_VF_POOL_TRACE' : [ 0x40, {
    'Address' : [ 0x0, ['pointer', ['void']]],
    'Size' : [ 0x4, ['unsigned long']],
    'Thread' : [ 0x8, ['pointer', ['_ETHREAD']]],
    'StackTrace' : [ 0xc, ['array', 13, ['pointer', ['void']]]],
} ],
  '__unnamed_2164' : [ 0x4, {
    'LongFlags' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x0, ['_MM_SESSION_SPACE_FLAGS']],
} ],
  '_MM_SESSION_SPACE' : [ 0x2040, {
    'ReferenceCount' : [ 0x0, ['long']],
    'u' : [ 0x4, ['__unnamed_2164']],
    'SessionId' : [ 0x8, ['unsigned long']],
    'ProcessReferenceToSession' : [ 0xc, ['long']],
    'ProcessList' : [ 0x10, ['_LIST_ENTRY']],
    'LastProcessSwappedOutTime' : [ 0x18, ['_LARGE_INTEGER']],
    'SessionPageDirectoryIndex' : [ 0x20, ['unsigned long']],
    'NonPagablePages' : [ 0x24, ['unsigned long']],
    'CommittedPages' : [ 0x28, ['unsigned long']],
    'PagedPoolStart' : [ 0x2c, ['pointer', ['void']]],
    'PagedPoolEnd' : [ 0x30, ['pointer', ['void']]],
    'SessionObject' : [ 0x34, ['pointer', ['void']]],
    'SessionObjectHandle' : [ 0x38, ['pointer', ['void']]],
    'ResidentProcessCount' : [ 0x3c, ['long']],
    'SessionPoolAllocationFailures' : [ 0x40, ['array', 4, ['unsigned long']]],
    'ImageList' : [ 0x50, ['_LIST_ENTRY']],
    'LocaleId' : [ 0x58, ['unsigned long']],
    'AttachCount' : [ 0x5c, ['unsigned long']],
    'AttachGate' : [ 0x60, ['_KGATE']],
    'WsListEntry' : [ 0x70, ['_LIST_ENTRY']],
    'Lookaside' : [ 0x80, ['array', 25, ['_GENERAL_LOOKASIDE']]],
    'Session' : [ 0xd00, ['_MMSESSION']],
    'PagedPoolInfo' : [ 0xd38, ['_MM_PAGED_POOL_INFO']],
    'Vm' : [ 0xd70, ['_MMSUPPORT']],
    'Wsle' : [ 0xddc, ['pointer', ['_MMWSLE']]],
    'DriverUnload' : [ 0xde0, ['pointer', ['void']]],
    'PagedPool' : [ 0xe00, ['_POOL_DESCRIPTOR']],
    'PageTables' : [ 0x1f40, ['pointer', ['_MMPTE']]],
    'SpecialPool' : [ 0x1f44, ['_MI_SPECIAL_POOL']],
    'SessionPteLock' : [ 0x1f68, ['_KGUARDED_MUTEX']],
    'PoolBigEntriesInUse' : [ 0x1f88, ['long']],
    'PagedPoolPdeCount' : [ 0x1f8c, ['unsigned long']],
    'SpecialPoolPdeCount' : [ 0x1f90, ['unsigned long']],
    'DynamicSessionPdeCount' : [ 0x1f94, ['unsigned long']],
    'SystemPteInfo' : [ 0x1f98, ['_MI_SYSTEM_PTE_TYPE']],
    'PoolTrackTableExpansion' : [ 0x1fc8, ['pointer', ['void']]],
    'PoolTrackTableExpansionSize' : [ 0x1fcc, ['unsigned long']],
    'PoolTrackBigPages' : [ 0x1fd0, ['pointer', ['void']]],
    'PoolTrackBigPagesSize' : [ 0x1fd4, ['unsigned long']],
    'IoState' : [ 0x1fd8, ['Enumeration', dict(target = 'long', choices = {1: 'IoSessionStateCreated', 2: 'IoSessionStateInitialized', 3: 'IoSessionStateConnected', 4: 'IoSessionStateDisconnected', 5: 'IoSessionStateDisconnectedLoggedOn', 6: 'IoSessionStateLoggedOn', 7: 'IoSessionStateLoggedOff', 8: 'IoSessionStateTerminated', 9: 'IoSessionStateMax'})]],
    'IoStateSequence' : [ 0x1fdc, ['unsigned long']],
    'IoNotificationEvent' : [ 0x1fe0, ['_KEVENT']],
    'CreateTime' : [ 0x1ff0, ['unsigned long long']],
    'SessionPoolPdes' : [ 0x1ff8, ['_RTL_BITMAP']],
    'CpuQuotaBlock' : [ 0x2000, ['pointer', ['_PS_CPU_QUOTA_BLOCK']]],
} ],
  '_OBJECT_HANDLE_COUNT_ENTRY' : [ 0x8, {
    'Process' : [ 0x0, ['pointer', ['_EPROCESS']]],
    'HandleCount' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 24, native_type='unsigned long')]],
    'LockCount' : [ 0x4, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
} ],
  '_CLIENT_ID' : [ 0x8, {
    'UniqueProcess' : [ 0x0, ['pointer', ['void']]],
    'UniqueThread' : [ 0x4, ['pointer', ['void']]],
} ],
  '_WHEA_MEMORY_ERROR_SECTION' : [ 0x49, {
    'ValidBits' : [ 0x0, ['_WHEA_MEMORY_ERROR_SECTION_VALIDBITS']],
    'ErrorStatus' : [ 0x8, ['_WHEA_ERROR_STATUS']],
    'PhysicalAddress' : [ 0x10, ['unsigned long long']],
    'PhysicalAddressMask' : [ 0x18, ['unsigned long long']],
    'Node' : [ 0x20, ['unsigned short']],
    'Card' : [ 0x22, ['unsigned short']],
    'Module' : [ 0x24, ['unsigned short']],
    'Bank' : [ 0x26, ['unsigned short']],
    'Device' : [ 0x28, ['unsigned short']],
    'Row' : [ 0x2a, ['unsigned short']],
    'Column' : [ 0x2c, ['unsigned short']],
    'BitPosition' : [ 0x2e, ['unsigned short']],
    'RequesterId' : [ 0x30, ['unsigned long long']],
    'ResponderId' : [ 0x38, ['unsigned long long']],
    'TargetId' : [ 0x40, ['unsigned long long']],
    'ErrorType' : [ 0x48, ['unsigned char']],
} ],
  '_KWAIT_STATUS_REGISTER' : [ 0x1, {
    'Flags' : [ 0x0, ['unsigned char']],
    'State' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'Affinity' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Priority' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Apc' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'UserApc' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'Alert' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'Unused' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
} ],
  '_VI_DEADLOCK_RESOURCE' : [ 0x80, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'VfDeadlockUnknown', 1: 'VfDeadlockMutex', 2: 'VfDeadlockMutexAbandoned', 3: 'VfDeadlockFastMutex', 4: 'VfDeadlockFastMutexUnsafe', 5: 'VfDeadlockSpinLock', 6: 'VfDeadlockInStackQueuedSpinLock', 7: 'VfDeadlockUnusedSpinLock', 8: 'VfDeadlockEresource', 9: 'VfDeadlockTypeMaximum'})]],
    'NodeCount' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'RecursionCount' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
    'ResourceAddress' : [ 0x8, ['pointer', ['void']]],
    'ThreadOwner' : [ 0xc, ['pointer', ['_VI_DEADLOCK_THREAD']]],
    'ResourceList' : [ 0x10, ['_LIST_ENTRY']],
    'HashChainList' : [ 0x18, ['_LIST_ENTRY']],
    'FreeListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'StackTrace' : [ 0x20, ['array', 8, ['pointer', ['void']]]],
    'LastAcquireTrace' : [ 0x40, ['array', 8, ['pointer', ['void']]]],
    'LastReleaseTrace' : [ 0x60, ['array', 8, ['pointer', ['void']]]],
} ],
  '_DBGKD_GET_SET_BUS_DATA' : [ 0x14, {
    'BusDataType' : [ 0x0, ['unsigned long']],
    'BusNumber' : [ 0x4, ['unsigned long']],
    'SlotNumber' : [ 0x8, ['unsigned long']],
    'Offset' : [ 0xc, ['unsigned long']],
    'Length' : [ 0x10, ['unsigned long']],
} ],
  '_MMSECTION_FLAGS' : [ 0x4, {
    'BeingDeleted' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'BeingCreated' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'BeingPurged' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'NoModifiedWriting' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'FailAllIo' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Image' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Based' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'File' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'Networked' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Rom' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'PhysicalMemory' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'CopyOnWrite' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'Reserve' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'Commit' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'Spare' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'WasPurged' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'UserReference' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'GlobalMemory' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'DeleteOnClose' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'FilePointerNull' : [ 0x0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'GlobalOnlyPerSession' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'SetMappedFileIoComplete' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'CollidedFlush' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'NoChange' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'AttemptingDelete' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'UserWritable' : [ 0x0, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'PreferredNode' : [ 0x0, ['BitField', dict(start_bit = 26, end_bit = 32, native_type='unsigned long')]],
} ],
  '_SECURITY_CLIENT_CONTEXT' : [ 0x3c, {
    'SecurityQos' : [ 0x0, ['_SECURITY_QUALITY_OF_SERVICE']],
    'ClientToken' : [ 0xc, ['pointer', ['void']]],
    'DirectlyAccessClientToken' : [ 0x10, ['unsigned char']],
    'DirectAccessEffectiveOnly' : [ 0x11, ['unsigned char']],
    'ServerIsRemote' : [ 0x12, ['unsigned char']],
    'ClientTokenControl' : [ 0x14, ['_TOKEN_CONTROL']],
} ],
  '_MM_PAGED_POOL_INFO' : [ 0x38, {
    'Mutex' : [ 0x0, ['_KGUARDED_MUTEX']],
    'PagedPoolAllocationMap' : [ 0x20, ['_RTL_BITMAP']],
    'FirstPteForPagedPool' : [ 0x28, ['pointer', ['_MMPTE']]],
    'PagedPoolHint' : [ 0x2c, ['unsigned long']],
    'PagedPoolCommit' : [ 0x30, ['unsigned long']],
    'AllocatedPagedPool' : [ 0x34, ['unsigned long']],
} ],
  '_BITMAP_RANGE' : [ 0x20, {
    'Links' : [ 0x0, ['_LIST_ENTRY']],
    'BasePage' : [ 0x8, ['long long']],
    'FirstDirtyPage' : [ 0x10, ['unsigned long']],
    'LastDirtyPage' : [ 0x14, ['unsigned long']],
    'DirtyPages' : [ 0x18, ['unsigned long']],
    'Bitmap' : [ 0x1c, ['pointer', ['unsigned long']]],
} ],
  '_IO_SECURITY_CONTEXT' : [ 0x10, {
    'SecurityQos' : [ 0x0, ['pointer', ['_SECURITY_QUALITY_OF_SERVICE']]],
    'AccessState' : [ 0x4, ['pointer', ['_ACCESS_STATE']]],
    'DesiredAccess' : [ 0x8, ['unsigned long']],
    'FullCreateOptions' : [ 0xc, ['unsigned long']],
} ],
  '_PROC_PERF_DOMAIN' : [ 0x78, {
    'Link' : [ 0x0, ['_LIST_ENTRY']],
    'Master' : [ 0x8, ['pointer', ['_KPRCB']]],
    'Members' : [ 0xc, ['_KAFFINITY_EX']],
    'FeedbackHandler' : [ 0x18, ['pointer', ['void']]],
    'GetFFHThrottleState' : [ 0x1c, ['pointer', ['void']]],
    'BoostPolicyHandler' : [ 0x20, ['pointer', ['void']]],
    'PerfSelectionHandler' : [ 0x24, ['pointer', ['void']]],
    'PerfHandler' : [ 0x28, ['pointer', ['void']]],
    'Processors' : [ 0x2c, ['pointer', ['_PROC_PERF_CONSTRAINT']]],
    'PerfChangeTime' : [ 0x30, ['unsigned long long']],
    'ProcessorCount' : [ 0x38, ['unsigned long']],
    'PreviousFrequencyMhz' : [ 0x3c, ['unsigned long']],
    'CurrentFrequencyMhz' : [ 0x40, ['unsigned long']],
    'PreviousFrequency' : [ 0x44, ['unsigned long']],
    'CurrentFrequency' : [ 0x48, ['unsigned long']],
    'CurrentPerfContext' : [ 0x4c, ['unsigned long']],
    'DesiredFrequency' : [ 0x50, ['unsigned long']],
    'MaxFrequency' : [ 0x54, ['unsigned long']],
    'MinPerfPercent' : [ 0x58, ['unsigned long']],
    'MinThrottlePercent' : [ 0x5c, ['unsigned long']],
    'MaxPercent' : [ 0x60, ['unsigned long']],
    'MinPercent' : [ 0x64, ['unsigned long']],
    'ConstrainedMaxPercent' : [ 0x68, ['unsigned long']],
    'ConstrainedMinPercent' : [ 0x6c, ['unsigned long']],
    'Coordination' : [ 0x70, ['unsigned char']],
    'PerfChangeIntervalCount' : [ 0x74, ['long']],
} ],
  '_X86_DBGKD_CONTROL_SET' : [ 0x10, {
    'TraceFlag' : [ 0x0, ['unsigned long']],
    'Dr7' : [ 0x4, ['unsigned long']],
    'CurrentSymbolStart' : [ 0x8, ['unsigned long']],
    'CurrentSymbolEnd' : [ 0xc, ['unsigned long']],
} ],
  '_HANDLE_TRACE_DB_ENTRY' : [ 0x50, {
    'ClientId' : [ 0x0, ['_CLIENT_ID']],
    'Handle' : [ 0x8, ['pointer', ['void']]],
    'Type' : [ 0xc, ['unsigned long']],
    'StackTrace' : [ 0x10, ['array', 16, ['pointer', ['void']]]],
} ],
  '_DUMMY_FILE_OBJECT' : [ 0xa0, {
    'ObjectHeader' : [ 0x0, ['_OBJECT_HEADER']],
    'FileObjectBody' : [ 0x20, ['array', 128, ['unsigned char']]],
} ],
  '_POP_TRIGGER_WAIT' : [ 0x20, {
    'Event' : [ 0x0, ['_KEVENT']],
    'Status' : [ 0x10, ['long']],
    'Link' : [ 0x14, ['_LIST_ENTRY']],
    'Trigger' : [ 0x1c, ['pointer', ['_POP_ACTION_TRIGGER']]],
} ],
  '_RELATION_LIST' : [ 0x14, {
    'Count' : [ 0x0, ['unsigned long']],
    'TagCount' : [ 0x4, ['unsigned long']],
    'FirstLevel' : [ 0x8, ['unsigned long']],
    'MaxLevel' : [ 0xc, ['unsigned long']],
    'Entries' : [ 0x10, ['array', 1, ['pointer', ['_RELATION_LIST_ENTRY']]]],
} ],
  '_IO_TIMER' : [ 0x18, {
    'Type' : [ 0x0, ['short']],
    'TimerFlag' : [ 0x2, ['short']],
    'TimerList' : [ 0x4, ['_LIST_ENTRY']],
    'TimerRoutine' : [ 0xc, ['pointer', ['void']]],
    'Context' : [ 0x10, ['pointer', ['void']]],
    'DeviceObject' : [ 0x14, ['pointer', ['_DEVICE_OBJECT']]],
} ],
  '_ARBITER_TEST_ALLOCATION_PARAMETERS' : [ 0xc, {
    'ArbitrationList' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'AllocateFromCount' : [ 0x4, ['unsigned long']],
    'AllocateFrom' : [ 0x8, ['pointer', ['_CM_PARTIAL_RESOURCE_DESCRIPTOR']]],
} ],
  '_MI_SPECIAL_POOL' : [ 0x24, {
    'PteBase' : [ 0x0, ['pointer', ['_MMPTE']]],
    'Lock' : [ 0x4, ['unsigned long']],
    'Paged' : [ 0x8, ['_MI_SPECIAL_POOL_PTE_LIST']],
    'NonPaged' : [ 0x10, ['_MI_SPECIAL_POOL_PTE_LIST']],
    'PagesInUse' : [ 0x18, ['long']],
    'SpecialPoolPdes' : [ 0x1c, ['_RTL_BITMAP']],
} ],
  '_ARBITER_QUERY_CONFLICT_PARAMETERS' : [ 0x10, {
    'PhysicalDeviceObject' : [ 0x0, ['pointer', ['_DEVICE_OBJECT']]],
    'ConflictingResource' : [ 0x4, ['pointer', ['_IO_RESOURCE_DESCRIPTOR']]],
    'ConflictCount' : [ 0x8, ['pointer', ['unsigned long']]],
    'Conflicts' : [ 0xc, ['pointer', ['pointer', ['_ARBITER_CONFLICT_INFO']]]],
} ],
  '_PHYSICAL_MEMORY_DESCRIPTOR' : [ 0x10, {
    'NumberOfRuns' : [ 0x0, ['unsigned long']],
    'NumberOfPages' : [ 0x4, ['unsigned long']],
    'Run' : [ 0x8, ['array', 1, ['_PHYSICAL_MEMORY_RUN']]],
} ],
  '_PNP_DEVICE_EVENT_LIST' : [ 0x4c, {
    'Status' : [ 0x0, ['long']],
    'EventQueueMutex' : [ 0x4, ['_KMUTANT']],
    'Lock' : [ 0x24, ['_KGUARDED_MUTEX']],
    'List' : [ 0x44, ['_LIST_ENTRY']],
} ],
  '_MAILSLOT_CREATE_PARAMETERS' : [ 0x18, {
    'MailslotQuota' : [ 0x0, ['unsigned long']],
    'MaximumMessageSize' : [ 0x4, ['unsigned long']],
    'ReadTimeout' : [ 0x8, ['_LARGE_INTEGER']],
    'TimeoutSpecified' : [ 0x10, ['unsigned char']],
} ],
  '_PO_IRP_MANAGER' : [ 0x10, {
    'DeviceIrpQueue' : [ 0x0, ['_PO_IRP_QUEUE']],
    'SystemIrpQueue' : [ 0x8, ['_PO_IRP_QUEUE']],
} ],
  '_PPM_PERF_STATE' : [ 0x28, {
    'Frequency' : [ 0x0, ['unsigned long']],
    'Power' : [ 0x4, ['unsigned long']],
    'PercentFrequency' : [ 0x8, ['unsigned char']],
    'IncreaseLevel' : [ 0x9, ['unsigned char']],
    'DecreaseLevel' : [ 0xa, ['unsigned char']],
    'Type' : [ 0xb, ['unsigned char']],
    'Control' : [ 0x10, ['unsigned long long']],
    'Status' : [ 0x18, ['unsigned long long']],
    'TotalHitCount' : [ 0x20, ['unsigned long']],
    'DesiredCount' : [ 0x24, ['unsigned long']],
} ],
  '_PPM_FFH_THROTTLE_STATE_INFO' : [ 0x20, {
    'EnableLogging' : [ 0x0, ['unsigned char']],
    'MismatchCount' : [ 0x4, ['unsigned long']],
    'Initialized' : [ 0x8, ['unsigned char']],
    'LastValue' : [ 0x10, ['unsigned long long']],
    'LastLogTickCount' : [ 0x18, ['_LARGE_INTEGER']],
} ],
  '_SECURITY_DESCRIPTOR_RELATIVE' : [ 0x14, {
    'Revision' : [ 0x0, ['unsigned char']],
    'Sbz1' : [ 0x1, ['unsigned char']],
    'Control' : [ 0x2, ['unsigned short']],
    'Owner' : [ 0x4, ['unsigned long']],
    'Group' : [ 0x8, ['unsigned long']],
    'Sacl' : [ 0xc, ['unsigned long']],
    'Dacl' : [ 0x10, ['unsigned long']],
} ],
  '_CLIENT_ID64' : [ 0x10, {
    'UniqueProcess' : [ 0x0, ['unsigned long long']],
    'UniqueThread' : [ 0x8, ['unsigned long long']],
} ],
  '_KDPC_DATA' : [ 0x14, {
    'DpcListHead' : [ 0x0, ['_LIST_ENTRY']],
    'DpcLock' : [ 0x8, ['unsigned long']],
    'DpcQueueDepth' : [ 0xc, ['long']],
    'DpcCount' : [ 0x10, ['unsigned long']],
} ],
  '_NAMED_PIPE_CREATE_PARAMETERS' : [ 0x28, {
    'NamedPipeType' : [ 0x0, ['unsigned long']],
    'ReadMode' : [ 0x4, ['unsigned long']],
    'CompletionMode' : [ 0x8, ['unsigned long']],
    'MaximumInstances' : [ 0xc, ['unsigned long']],
    'InboundQuota' : [ 0x10, ['unsigned long']],
    'OutboundQuota' : [ 0x14, ['unsigned long']],
    'DefaultTimeout' : [ 0x18, ['_LARGE_INTEGER']],
    'TimeoutSpecified' : [ 0x20, ['unsigned char']],
} ],
  '_CM_BIG_DATA' : [ 0x8, {
    'Signature' : [ 0x0, ['unsigned short']],
    'Count' : [ 0x2, ['unsigned short']],
    'List' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_21f1' : [ 0x8, {
    'UserData' : [ 0x0, ['pointer', ['void']]],
    'Owner' : [ 0x4, ['pointer', ['void']]],
} ],
  '__unnamed_21f3' : [ 0x8, {
    'ListHead' : [ 0x0, ['_LIST_ENTRY']],
} ],
  '_RTLP_RANGE_LIST_ENTRY' : [ 0x28, {
    'Start' : [ 0x0, ['unsigned long long']],
    'End' : [ 0x8, ['unsigned long long']],
    'Allocated' : [ 0x10, ['__unnamed_21f1']],
    'Merged' : [ 0x10, ['__unnamed_21f3']],
    'Attributes' : [ 0x18, ['unsigned char']],
    'PublicFlags' : [ 0x19, ['unsigned char']],
    'PrivateFlags' : [ 0x1a, ['unsigned short']],
    'ListEntry' : [ 0x1c, ['_LIST_ENTRY']],
} ],
  '_ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY' : [ 0xc, {
    'ListEntry' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Packet' : [ 0x4, ['pointer', ['_IO_MINI_COMPLETION_PACKET_USER']]],
    'Lookaside' : [ 0x8, ['pointer', ['_ALPC_COMPLETION_PACKET_LOOKASIDE']]],
} ],
  '__unnamed_21fb' : [ 0x2, {
    'AsUSHORT' : [ 0x0, ['unsigned short']],
    'AllowScaling' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'Disabled' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 16, native_type='unsigned short')]],
} ],
  'PROCESSOR_IDLESTATE_POLICY' : [ 0x20, {
    'Revision' : [ 0x0, ['unsigned short']],
    'Flags' : [ 0x2, ['__unnamed_21fb']],
    'PolicyCount' : [ 0x4, ['unsigned long']],
    'Policy' : [ 0x8, ['array', 3, ['PROCESSOR_IDLESTATE_INFO']]],
} ],
  '_ACTIVATION_CONTEXT_STACK' : [ 0x18, {
    'ActiveFrame' : [ 0x0, ['pointer', ['_RTL_ACTIVATION_CONTEXT_STACK_FRAME']]],
    'FrameListCache' : [ 0x4, ['_LIST_ENTRY']],
    'Flags' : [ 0xc, ['unsigned long']],
    'NextCookieSequenceNumber' : [ 0x10, ['unsigned long']],
    'StackId' : [ 0x14, ['unsigned long']],
} ],
  '_MSUBSECTION' : [ 0x3c, {
    'ControlArea' : [ 0x0, ['pointer', ['_CONTROL_AREA']]],
    'SubsectionBase' : [ 0x4, ['pointer', ['_MMPTE']]],
    'NextSubsection' : [ 0x8, ['pointer', ['_SUBSECTION']]],
    'NextMappedSubsection' : [ 0x8, ['pointer', ['_MSUBSECTION']]],
    'PtesInSubsection' : [ 0xc, ['unsigned long']],
    'UnusedPtes' : [ 0x10, ['unsigned long']],
    'GlobalPerSessionHead' : [ 0x10, ['pointer', ['_MM_AVL_TABLE']]],
    'u' : [ 0x14, ['__unnamed_1f77']],
    'StartingSector' : [ 0x18, ['unsigned long']],
    'NumberOfFullSectors' : [ 0x1c, ['unsigned long']],
    'u1' : [ 0x20, ['__unnamed_2005']],
    'LeftChild' : [ 0x24, ['pointer', ['_MMSUBSECTION_NODE']]],
    'RightChild' : [ 0x28, ['pointer', ['_MMSUBSECTION_NODE']]],
    'DereferenceList' : [ 0x2c, ['_LIST_ENTRY']],
    'NumberOfMappedViews' : [ 0x34, ['unsigned long']],
    'NumberOfPfnReferences' : [ 0x38, ['unsigned long']],
} ],
  '_RTL_DRIVE_LETTER_CURDIR' : [ 0x10, {
    'Flags' : [ 0x0, ['unsigned short']],
    'Length' : [ 0x2, ['unsigned short']],
    'TimeStamp' : [ 0x4, ['unsigned long']],
    'DosPath' : [ 0x8, ['_STRING']],
} ],
  '_VIRTUAL_EFI_RUNTIME_SERVICES' : [ 0x38, {
    'GetTime' : [ 0x0, ['unsigned long']],
    'SetTime' : [ 0x4, ['unsigned long']],
    'GetWakeupTime' : [ 0x8, ['unsigned long']],
    'SetWakeupTime' : [ 0xc, ['unsigned long']],
    'SetVirtualAddressMap' : [ 0x10, ['unsigned long']],
    'ConvertPointer' : [ 0x14, ['unsigned long']],
    'GetVariable' : [ 0x18, ['unsigned long']],
    'GetNextVariableName' : [ 0x1c, ['unsigned long']],
    'SetVariable' : [ 0x20, ['unsigned long']],
    'GetNextHighMonotonicCount' : [ 0x24, ['unsigned long']],
    'ResetSystem' : [ 0x28, ['unsigned long']],
    'UpdateCapsule' : [ 0x2c, ['unsigned long']],
    'QueryCapsuleCapabilities' : [ 0x30, ['unsigned long']],
    'QueryVariableInfo' : [ 0x34, ['unsigned long']],
} ],
  '_MI_SPECIAL_POOL_PTE_LIST' : [ 0x8, {
    'FreePteHead' : [ 0x0, ['_MMPTE']],
    'FreePteTail' : [ 0x4, ['_MMPTE']],
} ],
  'SYSTEM_POWER_CAPABILITIES' : [ 0x4c, {
    'PowerButtonPresent' : [ 0x0, ['unsigned char']],
    'SleepButtonPresent' : [ 0x1, ['unsigned char']],
    'LidPresent' : [ 0x2, ['unsigned char']],
    'SystemS1' : [ 0x3, ['unsigned char']],
    'SystemS2' : [ 0x4, ['unsigned char']],
    'SystemS3' : [ 0x5, ['unsigned char']],
    'SystemS4' : [ 0x6, ['unsigned char']],
    'SystemS5' : [ 0x7, ['unsigned char']],
    'HiberFilePresent' : [ 0x8, ['unsigned char']],
    'FullWake' : [ 0x9, ['unsigned char']],
    'VideoDimPresent' : [ 0xa, ['unsigned char']],
    'ApmPresent' : [ 0xb, ['unsigned char']],
    'UpsPresent' : [ 0xc, ['unsigned char']],
    'ThermalControl' : [ 0xd, ['unsigned char']],
    'ProcessorThrottle' : [ 0xe, ['unsigned char']],
    'ProcessorMinThrottle' : [ 0xf, ['unsigned char']],
    'ProcessorMaxThrottle' : [ 0x10, ['unsigned char']],
    'FastSystemS4' : [ 0x11, ['unsigned char']],
    'spare2' : [ 0x12, ['array', 3, ['unsigned char']]],
    'DiskSpinDown' : [ 0x15, ['unsigned char']],
    'spare3' : [ 0x16, ['array', 8, ['unsigned char']]],
    'SystemBatteriesPresent' : [ 0x1e, ['unsigned char']],
    'BatteriesAreShortTerm' : [ 0x1f, ['unsigned char']],
    'BatteryScale' : [ 0x20, ['array', 3, ['BATTERY_REPORTING_SCALE']]],
    'AcOnLineWake' : [ 0x38, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'SoftLidWake' : [ 0x3c, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'RtcWake' : [ 0x40, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'MinDeviceWakeState' : [ 0x44, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'DefaultLowLatencyWake' : [ 0x48, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
} ],
  '__unnamed_2211' : [ 0x4, {
    'ImageCommitment' : [ 0x0, ['unsigned long']],
    'CreatingProcess' : [ 0x0, ['pointer', ['_EPROCESS']]],
} ],
  '__unnamed_2215' : [ 0x4, {
    'ImageInformation' : [ 0x0, ['pointer', ['_MI_SECTION_IMAGE_INFORMATION']]],
    'FirstMappedVa' : [ 0x0, ['pointer', ['void']]],
} ],
  '_SEGMENT' : [ 0x30, {
    'ControlArea' : [ 0x0, ['pointer', ['_CONTROL_AREA']]],
    'TotalNumberOfPtes' : [ 0x4, ['unsigned long']],
    'SegmentFlags' : [ 0x8, ['_SEGMENT_FLAGS']],
    'NumberOfCommittedPages' : [ 0xc, ['unsigned long']],
    'SizeOfSegment' : [ 0x10, ['unsigned long long']],
    'ExtendInfo' : [ 0x18, ['pointer', ['_MMEXTEND_INFO']]],
    'BasedAddress' : [ 0x18, ['pointer', ['void']]],
    'SegmentLock' : [ 0x1c, ['_EX_PUSH_LOCK']],
    'u1' : [ 0x20, ['__unnamed_2211']],
    'u2' : [ 0x24, ['__unnamed_2215']],
    'PrototypePte' : [ 0x28, ['pointer', ['_MMPTE']]],
    'ThePtes' : [ 0x2c, ['array', 1, ['_MMPTE']]],
} ],
  '_DIAGNOSTIC_CONTEXT' : [ 0x10, {
    'CallerType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'KernelRequester', 1: 'UserProcessRequester', 2: 'UserSharedServiceRequester'})]],
    'Process' : [ 0x4, ['pointer', ['_EPROCESS']]],
    'ServiceTag' : [ 0x8, ['unsigned long']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
    'ReasonSize' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_221e' : [ 0x4, {
    'MissedEtwRegistration' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Spare' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_2220' : [ 0x4, {
    'Flags' : [ 0x0, ['__unnamed_221e']],
    'Whole' : [ 0x0, ['unsigned long']],
} ],
  '_VF_TARGET_VERIFIED_DRIVER_DATA' : [ 0x90, {
    'SuspectDriverEntry' : [ 0x0, ['pointer', ['_VF_SUSPECT_DRIVER_ENTRY']]],
    'WMICallback' : [ 0x4, ['pointer', ['void']]],
    'EtwHandlesListHead' : [ 0x8, ['_LIST_ENTRY']],
    'u1' : [ 0x10, ['__unnamed_2220']],
    'Signature' : [ 0x14, ['unsigned long']],
    'PoolPageHeaders' : [ 0x18, ['_SLIST_HEADER']],
    'PoolTrackers' : [ 0x20, ['_SLIST_HEADER']],
    'CurrentPagedPoolAllocations' : [ 0x28, ['unsigned long']],
    'CurrentNonPagedPoolAllocations' : [ 0x2c, ['unsigned long']],
    'PeakPagedPoolAllocations' : [ 0x30, ['unsigned long']],
    'PeakNonPagedPoolAllocations' : [ 0x34, ['unsigned long']],
    'PagedBytes' : [ 0x38, ['unsigned long']],
    'NonPagedBytes' : [ 0x3c, ['unsigned long']],
    'PeakPagedBytes' : [ 0x40, ['unsigned long']],
    'PeakNonPagedBytes' : [ 0x44, ['unsigned long']],
    'RaiseIrqls' : [ 0x48, ['unsigned long']],
    'AcquireSpinLocks' : [ 0x4c, ['unsigned long']],
    'SynchronizeExecutions' : [ 0x50, ['unsigned long']],
    'AllocationsWithNoTag' : [ 0x54, ['unsigned long']],
    'AllocationsFailed' : [ 0x58, ['unsigned long']],
    'AllocationsFailedDeliberately' : [ 0x5c, ['unsigned long']],
    'LockedBytes' : [ 0x60, ['unsigned long']],
    'PeakLockedBytes' : [ 0x64, ['unsigned long']],
    'MappedLockedBytes' : [ 0x68, ['unsigned long']],
    'PeakMappedLockedBytes' : [ 0x6c, ['unsigned long']],
    'MappedIoSpaceBytes' : [ 0x70, ['unsigned long']],
    'PeakMappedIoSpaceBytes' : [ 0x74, ['unsigned long']],
    'PagesForMdlBytes' : [ 0x78, ['unsigned long']],
    'PeakPagesForMdlBytes' : [ 0x7c, ['unsigned long']],
    'ContiguousMemoryBytes' : [ 0x80, ['unsigned long']],
    'PeakContiguousMemoryBytes' : [ 0x84, ['unsigned long']],
    'ContiguousMemoryListHead' : [ 0x88, ['_LIST_ENTRY']],
} ],
  '_PCAT_FIRMWARE_INFORMATION' : [ 0x4, {
    'PlaceHolder' : [ 0x0, ['unsigned long']],
} ],
  '_PRIVATE_CACHE_MAP' : [ 0x58, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'Flags' : [ 0x0, ['_PRIVATE_CACHE_MAP_FLAGS']],
    'UlongFlags' : [ 0x0, ['unsigned long']],
    'ReadAheadMask' : [ 0x4, ['unsigned long']],
    'FileObject' : [ 0x8, ['pointer', ['_FILE_OBJECT']]],
    'FileOffset1' : [ 0x10, ['_LARGE_INTEGER']],
    'BeyondLastByte1' : [ 0x18, ['_LARGE_INTEGER']],
    'FileOffset2' : [ 0x20, ['_LARGE_INTEGER']],
    'BeyondLastByte2' : [ 0x28, ['_LARGE_INTEGER']],
    'SequentialReadCount' : [ 0x30, ['unsigned long']],
    'ReadAheadLength' : [ 0x34, ['unsigned long']],
    'ReadAheadOffset' : [ 0x38, ['_LARGE_INTEGER']],
    'ReadAheadBeyondLastByte' : [ 0x40, ['_LARGE_INTEGER']],
    'ReadAheadSpinLock' : [ 0x48, ['unsigned long']],
    'PrivateLinks' : [ 0x4c, ['_LIST_ENTRY']],
    'ReadAheadWorkItem' : [ 0x54, ['pointer', ['void']]],
} ],
  '_CM_KEY_NODE' : [ 0x50, {
    'Signature' : [ 0x0, ['unsigned short']],
    'Flags' : [ 0x2, ['unsigned short']],
    'LastWriteTime' : [ 0x4, ['_LARGE_INTEGER']],
    'Spare' : [ 0xc, ['unsigned long']],
    'Parent' : [ 0x10, ['unsigned long']],
    'SubKeyCounts' : [ 0x14, ['array', 2, ['unsigned long']]],
    'SubKeyLists' : [ 0x1c, ['array', 2, ['unsigned long']]],
    'ValueList' : [ 0x24, ['_CHILD_LIST']],
    'ChildHiveReference' : [ 0x1c, ['_CM_KEY_REFERENCE']],
    'Security' : [ 0x2c, ['unsigned long']],
    'Class' : [ 0x30, ['unsigned long']],
    'MaxNameLen' : [ 0x34, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'UserFlags' : [ 0x34, ['BitField', dict(start_bit = 16, end_bit = 20, native_type='unsigned long')]],
    'VirtControlFlags' : [ 0x34, ['BitField', dict(start_bit = 20, end_bit = 24, native_type='unsigned long')]],
    'Debug' : [ 0x34, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'MaxClassLen' : [ 0x38, ['unsigned long']],
    'MaxValueNameLen' : [ 0x3c, ['unsigned long']],
    'MaxValueDataLen' : [ 0x40, ['unsigned long']],
    'WorkVar' : [ 0x44, ['unsigned long']],
    'NameLength' : [ 0x48, ['unsigned short']],
    'ClassLength' : [ 0x4a, ['unsigned short']],
    'Name' : [ 0x4c, ['array', 1, ['wchar']]],
} ],
  '_TPM_BOOT_ENTROPY_LDR_RESULT' : [ 0x48, {
    'Policy' : [ 0x0, ['unsigned long long']],
    'ResultCode' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'TpmBootEntropyStructureUninitialized', 1: 'TpmBootEntropyDisabledByPolicy', 2: 'TpmBootEntropyNoTpmFound', 3: 'TpmBootEntropyTpmError', 4: 'TpmBootEntropySuccess'})]],
    'ResultStatus' : [ 0xc, ['long']],
    'Time' : [ 0x10, ['unsigned long long']],
    'EntropyLength' : [ 0x18, ['unsigned long']],
    'EntropyData' : [ 0x1c, ['array', 40, ['unsigned char']]],
} ],
  '_RTL_HANDLE_TABLE' : [ 0x20, {
    'MaximumNumberOfHandles' : [ 0x0, ['unsigned long']],
    'SizeOfHandleTableEntry' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['array', 2, ['unsigned long']]],
    'FreeHandles' : [ 0x10, ['pointer', ['_RTL_HANDLE_TABLE_ENTRY']]],
    'CommittedHandles' : [ 0x14, ['pointer', ['_RTL_HANDLE_TABLE_ENTRY']]],
    'UnCommittedHandles' : [ 0x18, ['pointer', ['_RTL_HANDLE_TABLE_ENTRY']]],
    'MaxReservedHandles' : [ 0x1c, ['pointer', ['_RTL_HANDLE_TABLE_ENTRY']]],
} ],
  '_PTE_TRACKER' : [ 0x30, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Mdl' : [ 0x8, ['pointer', ['_MDL']]],
    'Count' : [ 0xc, ['unsigned long']],
    'SystemVa' : [ 0x10, ['pointer', ['void']]],
    'StartVa' : [ 0x14, ['pointer', ['void']]],
    'Offset' : [ 0x18, ['unsigned long']],
    'Length' : [ 0x1c, ['unsigned long']],
    'Page' : [ 0x20, ['unsigned long']],
    'IoMapping' : [ 0x24, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Matched' : [ 0x24, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'CacheAttribute' : [ 0x24, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned long')]],
    'Spare' : [ 0x24, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
    'CallingAddress' : [ 0x28, ['pointer', ['void']]],
    'CallersCaller' : [ 0x2c, ['pointer', ['void']]],
} ],
  '_KTHREAD_COUNTERS' : [ 0x1a8, {
    'WaitReasonBitMap' : [ 0x0, ['unsigned long long']],
    'UserData' : [ 0x8, ['pointer', ['_THREAD_PERFORMANCE_DATA']]],
    'Flags' : [ 0xc, ['unsigned long']],
    'ContextSwitches' : [ 0x10, ['unsigned long']],
    'CycleTimeBias' : [ 0x18, ['unsigned long long']],
    'HardwareCounters' : [ 0x20, ['unsigned long long']],
    'HwCounter' : [ 0x28, ['array', 16, ['_COUNTER_READING']]],
} ],
  '_SHARED_CACHE_MAP_LIST_CURSOR' : [ 0xc, {
    'SharedCacheMapLinks' : [ 0x0, ['_LIST_ENTRY']],
    'Flags' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_GET_VERSION64' : [ 0x28, {
    'MajorVersion' : [ 0x0, ['unsigned short']],
    'MinorVersion' : [ 0x2, ['unsigned short']],
    'ProtocolVersion' : [ 0x4, ['unsigned char']],
    'KdSecondaryVersion' : [ 0x5, ['unsigned char']],
    'Flags' : [ 0x6, ['unsigned short']],
    'MachineType' : [ 0x8, ['unsigned short']],
    'MaxPacketType' : [ 0xa, ['unsigned char']],
    'MaxStateChange' : [ 0xb, ['unsigned char']],
    'MaxManipulate' : [ 0xc, ['unsigned char']],
    'Simulation' : [ 0xd, ['unsigned char']],
    'Unused' : [ 0xe, ['array', 1, ['unsigned short']]],
    'KernBase' : [ 0x10, ['unsigned long long']],
    'PsLoadedModuleList' : [ 0x18, ['unsigned long long']],
    'DebuggerDataList' : [ 0x20, ['unsigned long long']],
} ],
  '_HMAP_ENTRY' : [ 0x10, {
    'BlockAddress' : [ 0x0, ['unsigned long']],
    'BinAddress' : [ 0x4, ['unsigned long']],
    'CmView' : [ 0x8, ['pointer', ['_CM_VIEW_OF_FILE']]],
    'MemAlloc' : [ 0xc, ['unsigned long']],
} ],
  '_RTL_ATOM_TABLE_ENTRY' : [ 0x10, {
    'HashLink' : [ 0x0, ['pointer', ['_RTL_ATOM_TABLE_ENTRY']]],
    'HandleIndex' : [ 0x4, ['unsigned short']],
    'Atom' : [ 0x6, ['unsigned short']],
    'ReferenceCount' : [ 0x8, ['unsigned short']],
    'Flags' : [ 0xa, ['unsigned char']],
    'NameLength' : [ 0xb, ['unsigned char']],
    'Name' : [ 0xc, ['array', 1, ['wchar']]],
} ],
  '_TXN_PARAMETER_BLOCK' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned short']],
    'TxFsContext' : [ 0x2, ['unsigned short']],
    'TransactionObject' : [ 0x4, ['pointer', ['void']]],
} ],
  '_LOADER_PERFORMANCE_DATA' : [ 0x10, {
    'StartTime' : [ 0x0, ['unsigned long long']],
    'EndTime' : [ 0x8, ['unsigned long long']],
} ],
  '_PNP_DEVICE_ACTION_ENTRY' : [ 0x20, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'DeviceObject' : [ 0x8, ['pointer', ['_DEVICE_OBJECT']]],
    'RequestType' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: 'AssignResources', 1: 'ClearDeviceProblem', 2: 'ClearProblem', 3: 'ClearEjectProblem', 4: 'HaltDevice', 5: 'QueryPowerRelations', 6: 'Rebalance', 7: 'ReenumerateBootDevices', 8: 'ReenumerateDeviceOnly', 9: 'ReenumerateDeviceTree', 10: 'ReenumerateRootDevices', 11: 'RequeryDeviceState', 12: 'ResetDevice', 13: 'ResourceRequirementsChanged', 14: 'RestartEnumeration', 15: 'SetDeviceProblem', 16: 'StartDevice', 17: 'StartSystemDevicesPass0', 18: 'StartSystemDevicesPass1'})]],
    'ReorderingBarrier' : [ 0x10, ['unsigned char']],
    'RequestArgument' : [ 0x14, ['unsigned long']],
    'CompletionEvent' : [ 0x18, ['pointer', ['_KEVENT']]],
    'CompletionStatus' : [ 0x1c, ['pointer', ['long']]],
} ],
  '_COUNTER_READING' : [ 0x18, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'PMCCounter', 1: 'MaxHardwareCounterType'})]],
    'Index' : [ 0x4, ['unsigned long']],
    'Start' : [ 0x8, ['unsigned long long']],
    'Total' : [ 0x10, ['unsigned long long']],
} ],
  '_MMSESSION' : [ 0x38, {
    'SystemSpaceViewLock' : [ 0x0, ['_KGUARDED_MUTEX']],
    'SystemSpaceViewLockPointer' : [ 0x20, ['pointer', ['_KGUARDED_MUTEX']]],
    'SystemSpaceViewTable' : [ 0x24, ['pointer', ['_MMVIEW']]],
    'SystemSpaceHashSize' : [ 0x28, ['unsigned long']],
    'SystemSpaceHashEntries' : [ 0x2c, ['unsigned long']],
    'SystemSpaceHashKey' : [ 0x30, ['unsigned long']],
    'BitmapFailures' : [ 0x34, ['unsigned long']],
} ],
  '_ETW_REG_ENTRY' : [ 0x3c, {
    'RegList' : [ 0x0, ['_LIST_ENTRY']],
    'GroupRegList' : [ 0x8, ['_LIST_ENTRY']],
    'GuidEntry' : [ 0x10, ['pointer', ['_ETW_GUID_ENTRY']]],
    'GroupEntry' : [ 0x14, ['pointer', ['_ETW_GUID_ENTRY']]],
    'Index' : [ 0x18, ['unsigned short']],
    'Flags' : [ 0x1a, ['unsigned short']],
    'EnableMask' : [ 0x1c, ['unsigned char']],
    'GroupEnableMask' : [ 0x1d, ['unsigned char']],
    'UseDescriptorType' : [ 0x1e, ['unsigned char']],
    'SessionId' : [ 0x20, ['unsigned long']],
    'ReplyQueue' : [ 0x20, ['pointer', ['_ETW_REPLY_QUEUE']]],
    'ReplySlot' : [ 0x20, ['array', 4, ['pointer', ['_ETW_REG_ENTRY']]]],
    'Process' : [ 0x30, ['pointer', ['_EPROCESS']]],
    'Callback' : [ 0x30, ['pointer', ['void']]],
    'CallbackContext' : [ 0x34, ['pointer', ['void']]],
    'Traits' : [ 0x38, ['pointer', ['_ETW_PROVIDER_TRAITS']]],
} ],
  '_LPCP_PORT_OBJECT' : [ 0xa4, {
    'ConnectionPort' : [ 0x0, ['pointer', ['_LPCP_PORT_OBJECT']]],
    'ConnectedPort' : [ 0x4, ['pointer', ['_LPCP_PORT_OBJECT']]],
    'MsgQueue' : [ 0x8, ['_LPCP_PORT_QUEUE']],
    'Creator' : [ 0x18, ['_CLIENT_ID']],
    'ClientSectionBase' : [ 0x20, ['pointer', ['void']]],
    'ServerSectionBase' : [ 0x24, ['pointer', ['void']]],
    'PortContext' : [ 0x28, ['pointer', ['void']]],
    'ClientThread' : [ 0x2c, ['pointer', ['_ETHREAD']]],
    'SecurityQos' : [ 0x30, ['_SECURITY_QUALITY_OF_SERVICE']],
    'StaticSecurity' : [ 0x3c, ['_SECURITY_CLIENT_CONTEXT']],
    'LpcReplyChainHead' : [ 0x78, ['_LIST_ENTRY']],
    'LpcDataInfoChainHead' : [ 0x80, ['_LIST_ENTRY']],
    'ServerProcess' : [ 0x88, ['pointer', ['_EPROCESS']]],
    'MappingProcess' : [ 0x88, ['pointer', ['_EPROCESS']]],
    'MaxMessageLength' : [ 0x8c, ['unsigned short']],
    'MaxConnectionInfoLength' : [ 0x8e, ['unsigned short']],
    'Flags' : [ 0x90, ['unsigned long']],
    'WaitEvent' : [ 0x94, ['_KEVENT']],
} ],
  '_ARBITER_LIST_ENTRY' : [ 0x38, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'AlternativeCount' : [ 0x8, ['unsigned long']],
    'Alternatives' : [ 0xc, ['pointer', ['_IO_RESOURCE_DESCRIPTOR']]],
    'PhysicalDeviceObject' : [ 0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'RequestSource' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: 'ArbiterRequestLegacyReported', 1: 'ArbiterRequestHalReported', 2: 'ArbiterRequestLegacyAssigned', 3: 'ArbiterRequestPnpDetected', 4: 'ArbiterRequestPnpEnumerated', -1: 'ArbiterRequestUndefined'})]],
    'Flags' : [ 0x18, ['unsigned long']],
    'WorkSpace' : [ 0x1c, ['long']],
    'InterfaceType' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'SlotNumber' : [ 0x24, ['unsigned long']],
    'BusNumber' : [ 0x28, ['unsigned long']],
    'Assignment' : [ 0x2c, ['pointer', ['_CM_PARTIAL_RESOURCE_DESCRIPTOR']]],
    'SelectedAlternative' : [ 0x30, ['pointer', ['_IO_RESOURCE_DESCRIPTOR']]],
    'Result' : [ 0x34, ['Enumeration', dict(target = 'long', choices = {0: 'ArbiterResultSuccess', 1: 'ArbiterResultExternalConflict', 2: 'ArbiterResultNullRequest', -1: 'ArbiterResultUndefined'})]],
} ],
  '_ETW_PROVIDER_TRAITS' : [ 0x14, {
    'Node' : [ 0x0, ['_RTL_BALANCED_NODE']],
    'ReferenceCount' : [ 0xc, ['unsigned long']],
    'Traits' : [ 0x10, ['array', 1, ['unsigned char']]],
} ],
  '_POP_DEVICE_SYS_STATE' : [ 0x1a8, {
    'IrpMinor' : [ 0x0, ['unsigned char']],
    'SystemState' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'SpinLock' : [ 0x8, ['unsigned long']],
    'Thread' : [ 0xc, ['pointer', ['_KTHREAD']]],
    'AbortEvent' : [ 0x10, ['pointer', ['_KEVENT']]],
    'ReadySemaphore' : [ 0x14, ['pointer', ['_KSEMAPHORE']]],
    'FinishedSemaphore' : [ 0x18, ['pointer', ['_KSEMAPHORE']]],
    'GetNewDeviceList' : [ 0x1c, ['unsigned char']],
    'Order' : [ 0x20, ['_PO_DEVICE_NOTIFY_ORDER']],
    'Pending' : [ 0x190, ['_LIST_ENTRY']],
    'Status' : [ 0x198, ['long']],
    'FailedDevice' : [ 0x19c, ['pointer', ['_DEVICE_OBJECT']]],
    'Waking' : [ 0x1a0, ['unsigned char']],
    'Cancelled' : [ 0x1a1, ['unsigned char']],
    'IgnoreErrors' : [ 0x1a2, ['unsigned char']],
    'IgnoreNotImplemented' : [ 0x1a3, ['unsigned char']],
    'TimeRefreshLockAcquired' : [ 0x1a4, ['unsigned char']],
} ],
  '_SEGMENT_FLAGS' : [ 0x4, {
    'TotalNumberOfPtes4132' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 10, native_type='unsigned long')]],
    'ExtraSharedWowSubsections' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'LargePages' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'WatchProto' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'DebugSymbolsLoaded' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'WriteCombined' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'NoCache' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'FloppyMedia' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'DefaultProtectionMask' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 22, native_type='unsigned long')]],
    'Binary32' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'ContainsDebug' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'Spare' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
} ],
  '_VF_KE_CRITICAL_REGION_TRACE' : [ 0x20, {
    'Thread' : [ 0x0, ['pointer', ['_ETHREAD']]],
    'StackTrace' : [ 0x4, ['array', 7, ['pointer', ['void']]]],
} ],
  '_DIAGNOSTIC_BUFFER' : [ 0x18, {
    'Size' : [ 0x0, ['unsigned long']],
    'CallerType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'KernelRequester', 1: 'UserProcessRequester', 2: 'UserSharedServiceRequester'})]],
    'ProcessImageNameOffset' : [ 0x8, ['unsigned long']],
    'ProcessId' : [ 0xc, ['unsigned long']],
    'ServiceTag' : [ 0x10, ['unsigned long']],
    'DeviceDescriptionOffset' : [ 0x8, ['unsigned long']],
    'DevicePathOffset' : [ 0xc, ['unsigned long']],
    'ReasonOffset' : [ 0x14, ['unsigned long']],
} ],
  '_EX_WORK_QUEUE' : [ 0x3c, {
    'WorkerQueue' : [ 0x0, ['_KQUEUE']],
    'DynamicThreadCount' : [ 0x28, ['unsigned long']],
    'WorkItemsProcessed' : [ 0x2c, ['unsigned long']],
    'WorkItemsProcessedLastPass' : [ 0x30, ['unsigned long']],
    'QueueDepthLastPass' : [ 0x34, ['unsigned long']],
    'Info' : [ 0x38, ['EX_QUEUE_WORKER_INFO']],
} ],
  '_CLIENT_ID32' : [ 0x8, {
    'UniqueProcess' : [ 0x0, ['unsigned long']],
    'UniqueThread' : [ 0x4, ['unsigned long']],
} ],
  '_CM_KEY_INDEX' : [ 0x8, {
    'Signature' : [ 0x0, ['unsigned short']],
    'Count' : [ 0x2, ['unsigned short']],
    'List' : [ 0x4, ['array', 1, ['unsigned long']]],
} ],
  '_VI_DEADLOCK_THREAD' : [ 0x20, {
    'Thread' : [ 0x0, ['pointer', ['_KTHREAD']]],
    'CurrentSpinNode' : [ 0x4, ['pointer', ['_VI_DEADLOCK_NODE']]],
    'CurrentOtherNode' : [ 0x8, ['pointer', ['_VI_DEADLOCK_NODE']]],
    'ListEntry' : [ 0xc, ['_LIST_ENTRY']],
    'FreeListEntry' : [ 0xc, ['_LIST_ENTRY']],
    'NodeCount' : [ 0x14, ['unsigned long']],
    'PagingCount' : [ 0x18, ['unsigned long']],
    'ThreadUsesEresources' : [ 0x1c, ['unsigned char']],
} ],
  '_PPM_IDLE_STATE' : [ 0x40, {
    'DomainMembers' : [ 0x0, ['_KAFFINITY_EX']],
    'IdleCheck' : [ 0xc, ['pointer', ['void']]],
    'IdleHandler' : [ 0x10, ['pointer', ['void']]],
    'HvConfig' : [ 0x18, ['unsigned long long']],
    'Context' : [ 0x20, ['pointer', ['void']]],
    'Latency' : [ 0x24, ['unsigned long']],
    'Power' : [ 0x28, ['unsigned long']],
    'TimeCheck' : [ 0x2c, ['unsigned long']],
    'StateFlags' : [ 0x30, ['unsigned long']],
    'PromotePercent' : [ 0x34, ['unsigned char']],
    'DemotePercent' : [ 0x35, ['unsigned char']],
    'PromotePercentBase' : [ 0x36, ['unsigned char']],
    'DemotePercentBase' : [ 0x37, ['unsigned char']],
    'StateType' : [ 0x38, ['unsigned char']],
} ],
  '_KRESOURCEMANAGER' : [ 0x154, {
    'NotificationAvailable' : [ 0x0, ['_KEVENT']],
    'cookie' : [ 0x10, ['unsigned long']],
    'State' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: 'KResourceManagerUninitialized', 1: 'KResourceManagerOffline', 2: 'KResourceManagerOnline'})]],
    'Flags' : [ 0x18, ['unsigned long']],
    'Mutex' : [ 0x1c, ['_KMUTANT']],
    'NamespaceLink' : [ 0x3c, ['_KTMOBJECT_NAMESPACE_LINK']],
    'RmId' : [ 0x50, ['_GUID']],
    'NotificationQueue' : [ 0x60, ['_KQUEUE']],
    'NotificationMutex' : [ 0x88, ['_KMUTANT']],
    'EnlistmentHead' : [ 0xa8, ['_LIST_ENTRY']],
    'EnlistmentCount' : [ 0xb0, ['unsigned long']],
    'NotificationRoutine' : [ 0xb4, ['pointer', ['void']]],
    'Key' : [ 0xb8, ['pointer', ['void']]],
    'ProtocolListHead' : [ 0xbc, ['_LIST_ENTRY']],
    'PendingPropReqListHead' : [ 0xc4, ['_LIST_ENTRY']],
    'CRMListEntry' : [ 0xcc, ['_LIST_ENTRY']],
    'Tm' : [ 0xd4, ['pointer', ['_KTM']]],
    'Description' : [ 0xd8, ['_UNICODE_STRING']],
    'Enlistments' : [ 0xe0, ['_KTMOBJECT_NAMESPACE']],
    'CompletionBinding' : [ 0x140, ['_KRESOURCEMANAGER_COMPLETION_BINDING']],
} ],
  '_GDI_TEB_BATCH64' : [ 0x4e8, {
    'Offset' : [ 0x0, ['unsigned long']],
    'HDC' : [ 0x8, ['unsigned long long']],
    'Buffer' : [ 0x10, ['array', 310, ['unsigned long']]],
} ],
  '__unnamed_229b' : [ 0x4, {
    'NodeSize' : [ 0x0, ['unsigned long']],
    'UseLookaside' : [ 0x0, ['unsigned long']],
} ],
  '_VF_AVL_TREE' : [ 0x40, {
    'Lock' : [ 0x0, ['long']],
    'NodeToFree' : [ 0x4, ['pointer', ['void']]],
    'NodeRangeSize' : [ 0x8, ['unsigned long']],
    'NodeCount' : [ 0xc, ['unsigned long']],
    'Tables' : [ 0x10, ['pointer', ['_VF_AVL_TABLE']]],
    'TablesNo' : [ 0x14, ['unsigned long']],
    'u1' : [ 0x18, ['__unnamed_229b']],
} ],
  '_FILE_NETWORK_OPEN_INFORMATION' : [ 0x38, {
    'CreationTime' : [ 0x0, ['_LARGE_INTEGER']],
    'LastAccessTime' : [ 0x8, ['_LARGE_INTEGER']],
    'LastWriteTime' : [ 0x10, ['_LARGE_INTEGER']],
    'ChangeTime' : [ 0x18, ['_LARGE_INTEGER']],
    'AllocationSize' : [ 0x20, ['_LARGE_INTEGER']],
    'EndOfFile' : [ 0x28, ['_LARGE_INTEGER']],
    'FileAttributes' : [ 0x30, ['unsigned long']],
} ],
  '_WHEA_MEMORY_ERROR_SECTION_VALIDBITS' : [ 0x8, {
    'ErrorStatus' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'PhysicalAddress' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'PhysicalAddressMask' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'Node' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'Card' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'Module' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
    'Bank' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long long')]],
    'Device' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long long')]],
    'Row' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'Column' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'BitPosition' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'RequesterId' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'ResponderId' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long long')]],
    'TargetId' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long long')]],
    'ErrorType' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 64, native_type='unsigned long long')]],
    'ValidBits' : [ 0x0, ['unsigned long long']],
} ],
  '_RELATION_LIST_ENTRY' : [ 0xc, {
    'Count' : [ 0x0, ['unsigned long']],
    'MaxCount' : [ 0x4, ['unsigned long']],
    'Devices' : [ 0x8, ['array', 1, ['pointer', ['_DEVICE_OBJECT']]]],
} ],
  '_HEAP_FREE_ENTRY_EXTRA' : [ 0x4, {
    'TagIndex' : [ 0x0, ['unsigned short']],
    'FreeBackTraceIndex' : [ 0x2, ['unsigned short']],
} ],
  '_VI_DEADLOCK_GLOBALS' : [ 0x40e0, {
    'TimeAcquire' : [ 0x0, ['long long']],
    'TimeRelease' : [ 0x8, ['long long']],
    'ResourceDatabase' : [ 0x10, ['pointer', ['_LIST_ENTRY']]],
    'ResourceDatabaseCount' : [ 0x14, ['unsigned long']],
    'ResourceAddressRange' : [ 0x18, ['array', 1023, ['_VF_ADDRESS_RANGE']]],
    'ThreadDatabase' : [ 0x2010, ['pointer', ['_LIST_ENTRY']]],
    'ThreadDatabaseCount' : [ 0x2014, ['unsigned long']],
    'ThreadAddressRange' : [ 0x2018, ['array', 1023, ['_VF_ADDRESS_RANGE']]],
    'AllocationFailures' : [ 0x4010, ['unsigned long']],
    'NodesTrimmedBasedOnAge' : [ 0x4014, ['unsigned long']],
    'NodesTrimmedBasedOnCount' : [ 0x4018, ['unsigned long']],
    'NodesSearched' : [ 0x401c, ['unsigned long']],
    'MaxNodesSearched' : [ 0x4020, ['unsigned long']],
    'SequenceNumber' : [ 0x4024, ['unsigned long']],
    'RecursionDepthLimit' : [ 0x4028, ['unsigned long']],
    'SearchedNodesLimit' : [ 0x402c, ['unsigned long']],
    'DepthLimitHits' : [ 0x4030, ['unsigned long']],
    'SearchLimitHits' : [ 0x4034, ['unsigned long']],
    'ABC_ACB_Skipped' : [ 0x4038, ['unsigned long']],
    'OutOfOrderReleases' : [ 0x403c, ['unsigned long']],
    'NodesReleasedOutOfOrder' : [ 0x4040, ['unsigned long']],
    'TotalReleases' : [ 0x4044, ['unsigned long']],
    'RootNodesDeleted' : [ 0x4048, ['unsigned long']],
    'ForgetHistoryCounter' : [ 0x404c, ['unsigned long']],
    'Instigator' : [ 0x4050, ['pointer', ['void']]],
    'NumberOfParticipants' : [ 0x4054, ['unsigned long']],
    'Participant' : [ 0x4058, ['array', 32, ['pointer', ['_VI_DEADLOCK_NODE']]]],
    'ChildrenCountWatermark' : [ 0x40d8, ['long']],
} ],
  '_KTM' : [ 0x238, {
    'cookie' : [ 0x0, ['unsigned long']],
    'Mutex' : [ 0x4, ['_KMUTANT']],
    'State' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: 'KKtmUninitialized', 1: 'KKtmInitialized', 2: 'KKtmRecovering', 3: 'KKtmOnline', 4: 'KKtmRecoveryFailed', 5: 'KKtmOffline'})]],
    'NamespaceLink' : [ 0x28, ['_KTMOBJECT_NAMESPACE_LINK']],
    'TmIdentity' : [ 0x3c, ['_GUID']],
    'Flags' : [ 0x4c, ['unsigned long']],
    'VolatileFlags' : [ 0x50, ['unsigned long']],
    'LogFileName' : [ 0x54, ['_UNICODE_STRING']],
    'LogFileObject' : [ 0x5c, ['pointer', ['_FILE_OBJECT']]],
    'MarshallingContext' : [ 0x60, ['pointer', ['void']]],
    'LogManagementContext' : [ 0x64, ['pointer', ['void']]],
    'Transactions' : [ 0x68, ['_KTMOBJECT_NAMESPACE']],
    'ResourceManagers' : [ 0xc8, ['_KTMOBJECT_NAMESPACE']],
    'LsnOrderedMutex' : [ 0x128, ['_KMUTANT']],
    'LsnOrderedList' : [ 0x148, ['_LIST_ENTRY']],
    'CommitVirtualClock' : [ 0x150, ['_LARGE_INTEGER']],
    'CommitVirtualClockMutex' : [ 0x158, ['_FAST_MUTEX']],
    'BaseLsn' : [ 0x178, ['_CLS_LSN']],
    'CurrentReadLsn' : [ 0x180, ['_CLS_LSN']],
    'LastRecoveredLsn' : [ 0x188, ['_CLS_LSN']],
    'TmRmHandle' : [ 0x190, ['pointer', ['void']]],
    'TmRm' : [ 0x194, ['pointer', ['_KRESOURCEMANAGER']]],
    'LogFullNotifyEvent' : [ 0x198, ['_KEVENT']],
    'CheckpointWorkItem' : [ 0x1a8, ['_WORK_QUEUE_ITEM']],
    'CheckpointTargetLsn' : [ 0x1b8, ['_CLS_LSN']],
    'LogFullCompletedWorkItem' : [ 0x1c0, ['_WORK_QUEUE_ITEM']],
    'LogWriteResource' : [ 0x1d0, ['_ERESOURCE']],
    'LogFlags' : [ 0x208, ['unsigned long']],
    'LogFullStatus' : [ 0x20c, ['long']],
    'RecoveryStatus' : [ 0x210, ['long']],
    'LastCheckBaseLsn' : [ 0x218, ['_CLS_LSN']],
    'RestartOrderedList' : [ 0x220, ['_LIST_ENTRY']],
    'OfflineWorkItem' : [ 0x228, ['_WORK_QUEUE_ITEM']],
} ],
  '_CONFIGURATION_COMPONENT' : [ 0x24, {
    'Class' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'SystemClass', 1: 'ProcessorClass', 2: 'CacheClass', 3: 'AdapterClass', 4: 'ControllerClass', 5: 'PeripheralClass', 6: 'MemoryClass', 7: 'MaximumClass'})]],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'ArcSystem', 1: 'CentralProcessor', 2: 'FloatingPointProcessor', 3: 'PrimaryIcache', 4: 'PrimaryDcache', 5: 'SecondaryIcache', 6: 'SecondaryDcache', 7: 'SecondaryCache', 8: 'EisaAdapter', 9: 'TcAdapter', 10: 'ScsiAdapter', 11: 'DtiAdapter', 12: 'MultiFunctionAdapter', 13: 'DiskController', 14: 'TapeController', 15: 'CdromController', 16: 'WormController', 17: 'SerialController', 18: 'NetworkController', 19: 'DisplayController', 20: 'ParallelController', 21: 'PointerController', 22: 'KeyboardController', 23: 'AudioController', 24: 'OtherController', 25: 'DiskPeripheral', 26: 'FloppyDiskPeripheral', 27: 'TapePeripheral', 28: 'ModemPeripheral', 29: 'MonitorPeripheral', 30: 'PrinterPeripheral', 31: 'PointerPeripheral', 32: 'KeyboardPeripheral', 33: 'TerminalPeripheral', 34: 'OtherPeripheral', 35: 'LinePeripheral', 36: 'NetworkPeripheral', 37: 'SystemMemory', 38: 'DockingInformation', 39: 'RealModeIrqRoutingTable', 40: 'RealModePCIEnumeration', 41: 'MaximumType'})]],
    'Flags' : [ 0x8, ['_DEVICE_FLAGS']],
    'Version' : [ 0xc, ['unsigned short']],
    'Revision' : [ 0xe, ['unsigned short']],
    'Key' : [ 0x10, ['unsigned long']],
    'AffinityMask' : [ 0x14, ['unsigned long']],
    'Group' : [ 0x14, ['unsigned short']],
    'GroupIndex' : [ 0x16, ['unsigned short']],
    'ConfigurationDataLength' : [ 0x18, ['unsigned long']],
    'IdentifierLength' : [ 0x1c, ['unsigned long']],
    'Identifier' : [ 0x20, ['pointer', ['unsigned char']]],
} ],
  '_VF_BTS_RECORD' : [ 0xc, {
    'JumpedFrom' : [ 0x0, ['pointer', ['void']]],
    'JumpedTo' : [ 0x4, ['pointer', ['void']]],
    'Unused1' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'Predicted' : [ 0x8, ['BitField', dict(start_bit = 3, end_bit = 7, native_type='unsigned long')]],
    'Unused2' : [ 0x8, ['BitField', dict(start_bit = 7, end_bit = 32, native_type='unsigned long')]],
} ],
  '_KTRANSACTION' : [ 0x1e0, {
    'OutcomeEvent' : [ 0x0, ['_KEVENT']],
    'cookie' : [ 0x10, ['unsigned long']],
    'Mutex' : [ 0x14, ['_KMUTANT']],
    'TreeTx' : [ 0x34, ['pointer', ['_KTRANSACTION']]],
    'GlobalNamespaceLink' : [ 0x38, ['_KTMOBJECT_NAMESPACE_LINK']],
    'TmNamespaceLink' : [ 0x4c, ['_KTMOBJECT_NAMESPACE_LINK']],
    'UOW' : [ 0x60, ['_GUID']],
    'State' : [ 0x70, ['Enumeration', dict(target = 'long', choices = {0: 'KTransactionUninitialized', 1: 'KTransactionActive', 2: 'KTransactionPreparing', 3: 'KTransactionPrepared', 4: 'KTransactionInDoubt', 5: 'KTransactionCommitted', 6: 'KTransactionAborted', 7: 'KTransactionDelegated', 8: 'KTransactionPrePreparing', 9: 'KTransactionForgotten', 10: 'KTransactionRecovering', 11: 'KTransactionPrePrepared'})]],
    'Flags' : [ 0x74, ['unsigned long']],
    'EnlistmentHead' : [ 0x78, ['_LIST_ENTRY']],
    'EnlistmentCount' : [ 0x80, ['unsigned long']],
    'RecoverableEnlistmentCount' : [ 0x84, ['unsigned long']],
    'PrePrepareRequiredEnlistmentCount' : [ 0x88, ['unsigned long']],
    'PrepareRequiredEnlistmentCount' : [ 0x8c, ['unsigned long']],
    'OutcomeRequiredEnlistmentCount' : [ 0x90, ['unsigned long']],
    'PendingResponses' : [ 0x94, ['unsigned long']],
    'SuperiorEnlistment' : [ 0x98, ['pointer', ['_KENLISTMENT']]],
    'LastLsn' : [ 0xa0, ['_CLS_LSN']],
    'PromotedEntry' : [ 0xa8, ['_LIST_ENTRY']],
    'PromoterTransaction' : [ 0xb0, ['pointer', ['_KTRANSACTION']]],
    'PromotePropagation' : [ 0xb4, ['pointer', ['void']]],
    'IsolationLevel' : [ 0xb8, ['unsigned long']],
    'IsolationFlags' : [ 0xbc, ['unsigned long']],
    'Timeout' : [ 0xc0, ['_LARGE_INTEGER']],
    'Description' : [ 0xc8, ['_UNICODE_STRING']],
    'RollbackThread' : [ 0xd0, ['pointer', ['_KTHREAD']]],
    'RollbackWorkItem' : [ 0xd4, ['_WORK_QUEUE_ITEM']],
    'RollbackDpc' : [ 0xe4, ['_KDPC']],
    'RollbackTimer' : [ 0x108, ['_KTIMER']],
    'LsnOrderedEntry' : [ 0x130, ['_LIST_ENTRY']],
    'Outcome' : [ 0x138, ['Enumeration', dict(target = 'long', choices = {0: 'KTxOutcomeUninitialized', 1: 'KTxOutcomeUndetermined', 2: 'KTxOutcomeCommitted', 3: 'KTxOutcomeAborted', 4: 'KTxOutcomeUnavailable'})]],
    'Tm' : [ 0x13c, ['pointer', ['_KTM']]],
    'CommitReservation' : [ 0x140, ['long long']],
    'TransactionHistory' : [ 0x148, ['array', 10, ['_KTRANSACTION_HISTORY']]],
    'TransactionHistoryCount' : [ 0x198, ['unsigned long']],
    'DTCPrivateInformation' : [ 0x19c, ['pointer', ['void']]],
    'DTCPrivateInformationLength' : [ 0x1a0, ['unsigned long']],
    'DTCPrivateInformationMutex' : [ 0x1a4, ['_KMUTANT']],
    'PromotedTxSelfHandle' : [ 0x1c4, ['pointer', ['void']]],
    'PendingPromotionCount' : [ 0x1c8, ['unsigned long']],
    'PromotionCompletedEvent' : [ 0x1cc, ['_KEVENT']],
} ],
  '_PRIVATE_CACHE_MAP_FLAGS' : [ 0x4, {
    'DontUse' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'ReadAheadActive' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'ReadAheadEnabled' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'PagePriority' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 21, native_type='unsigned long')]],
    'Available' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 32, native_type='unsigned long')]],
} ],
  '_CM_KCB_UOW' : [ 0x38, {
    'TransactionListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'KCBLock' : [ 0x8, ['pointer', ['_CM_INTENT_LOCK']]],
    'KeyLock' : [ 0xc, ['pointer', ['_CM_INTENT_LOCK']]],
    'KCBListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'KeyControlBlock' : [ 0x18, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'Transaction' : [ 0x1c, ['pointer', ['_CM_TRANS']]],
    'UoWState' : [ 0x20, ['unsigned long']],
    'ActionType' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: 'UoWAddThisKey', 1: 'UoWAddChildKey', 2: 'UoWDeleteThisKey', 3: 'UoWDeleteChildKey', 4: 'UoWSetValueNew', 5: 'UoWSetValueExisting', 6: 'UoWDeleteValue', 7: 'UoWSetKeyUserFlags', 8: 'UoWSetLastWriteTime', 9: 'UoWSetSecurityDescriptor', 10: 'UoWRenameSubKey', 11: 'UoWRenameOldSubKey', 12: 'UoWRenameNewSubKey', 13: 'UoWIsolation', 14: 'UoWInvalid'})]],
    'StorageType' : [ 0x28, ['Enumeration', dict(target = 'long', choices = {0: 'Stable', 1: 'Volatile', 2: 'InvalidStorage'})]],
    'ChildKCB' : [ 0x30, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'VolatileKeyCell' : [ 0x30, ['unsigned long']],
    'OldValueCell' : [ 0x30, ['unsigned long']],
    'NewValueCell' : [ 0x34, ['unsigned long']],
    'UserFlags' : [ 0x30, ['unsigned long']],
    'LastWriteTime' : [ 0x30, ['_LARGE_INTEGER']],
    'TxSecurityCell' : [ 0x30, ['unsigned long']],
    'OldChildKCB' : [ 0x30, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'NewChildKCB' : [ 0x34, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'OtherChildKCB' : [ 0x30, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'ThisVolatileKeyCell' : [ 0x34, ['unsigned long']],
} ],
  '_KPROCESSOR_STATE' : [ 0x320, {
    'ContextFrame' : [ 0x0, ['_CONTEXT']],
    'SpecialRegisters' : [ 0x2cc, ['_KSPECIAL_REGISTERS']],
} ],
  '_MMPTE_TRANSITION' : [ 0x4, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Write' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Owner' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'WriteThrough' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'CacheDisable' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Protection' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 10, native_type='unsigned long')]],
    'Prototype' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'Transition' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'PageFrameNumber' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 32, native_type='unsigned long')]],
} ],
  '_VF_WATCHDOG_IRP' : [ 0x14, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Irp' : [ 0x8, ['pointer', ['_IRP']]],
    'DueTickCount' : [ 0xc, ['unsigned long']],
    'Inserted' : [ 0x10, ['unsigned char']],
    'TrackedStackLocation' : [ 0x11, ['unsigned char']],
    'CancelTimeoutTicks' : [ 0x12, ['unsigned short']],
} ],
  '_flags' : [ 0x1, {
    'Removable' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'GroupAssigned' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'GroupCommitted' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'GroupAssignmentFixed' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Fill' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
} ],
  '__unnamed_22f8' : [ 0x8, {
    'Head' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 24, native_type='unsigned long long')]],
    'Tail' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 48, native_type='unsigned long long')]],
    'ActiveThreadCount' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 64, native_type='unsigned long long')]],
} ],
  '__unnamed_22fa' : [ 0x8, {
    's1' : [ 0x0, ['__unnamed_22f8']],
    'Value' : [ 0x0, ['unsigned long long']],
} ],
  '_ALPC_COMPLETION_LIST_STATE' : [ 0x8, {
    'u1' : [ 0x0, ['__unnamed_22fa']],
} ],
  '_PSP_CPU_SHARE_CAPTURED_WEIGHT_DATA' : [ 0x8, {
    'CapturedCpuShareWeight' : [ 0x0, ['unsigned long']],
    'CapturedTotalWeight' : [ 0x4, ['unsigned long']],
    'CombinedData' : [ 0x0, ['long long']],
} ],
  '_CM_NAME_HASH' : [ 0xc, {
    'ConvKey' : [ 0x0, ['unsigned long']],
    'NextHash' : [ 0x4, ['pointer', ['_CM_NAME_HASH']]],
    'NameLength' : [ 0x8, ['unsigned short']],
    'Name' : [ 0xa, ['array', 1, ['wchar']]],
} ],
  '_PROC_IDLE_STATE_BUCKET' : [ 0x20, {
    'TotalTime' : [ 0x0, ['unsigned long long']],
    'MinTime' : [ 0x8, ['unsigned long long']],
    'MaxTime' : [ 0x10, ['unsigned long long']],
    'Count' : [ 0x18, ['unsigned long']],
} ],
  '_MMSECURE_FLAGS' : [ 0x4, {
    'ReadOnly' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'NoWrite' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Spare' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 12, native_type='unsigned long')]],
} ],
  '_PO_IRP_QUEUE' : [ 0x8, {
    'CurrentIrp' : [ 0x0, ['pointer', ['_IRP']]],
    'PendingIrpList' : [ 0x4, ['pointer', ['_IRP']]],
} ],
  '__unnamed_230d' : [ 0x4, {
    'Active' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'OnlyTryAcquireUsed' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ReleasedOutOfOrder' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'SequenceNumber' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'Whole' : [ 0x0, ['unsigned long']],
} ],
  '_VI_DEADLOCK_NODE' : [ 0x6c, {
    'Parent' : [ 0x0, ['pointer', ['_VI_DEADLOCK_NODE']]],
    'ChildrenList' : [ 0x4, ['_LIST_ENTRY']],
    'SiblingsList' : [ 0xc, ['_LIST_ENTRY']],
    'ResourceList' : [ 0x14, ['_LIST_ENTRY']],
    'FreeListEntry' : [ 0x14, ['_LIST_ENTRY']],
    'Root' : [ 0x1c, ['pointer', ['_VI_DEADLOCK_RESOURCE']]],
    'ThreadEntry' : [ 0x20, ['pointer', ['_VI_DEADLOCK_THREAD']]],
    'u1' : [ 0x24, ['__unnamed_230d']],
    'ChildrenCount' : [ 0x28, ['long']],
    'StackTrace' : [ 0x2c, ['array', 8, ['pointer', ['void']]]],
    'ParentStackTrace' : [ 0x4c, ['array', 8, ['pointer', ['void']]]],
} ],
  'PROCESSOR_IDLESTATE_INFO' : [ 0x8, {
    'TimeCheck' : [ 0x0, ['unsigned long']],
    'DemotePercent' : [ 0x4, ['unsigned char']],
    'PromotePercent' : [ 0x5, ['unsigned char']],
    'Spare' : [ 0x6, ['array', 2, ['unsigned char']]],
} ],
  '_KTMOBJECT_NAMESPACE' : [ 0x60, {
    'Table' : [ 0x0, ['_RTL_AVL_TABLE']],
    'Mutex' : [ 0x38, ['_KMUTANT']],
    'LinksOffset' : [ 0x58, ['unsigned short']],
    'GuidOffset' : [ 0x5a, ['unsigned short']],
    'Expired' : [ 0x5c, ['unsigned char']],
} ],
  '_LPCP_PORT_QUEUE' : [ 0x10, {
    'NonPagedPortQueue' : [ 0x0, ['pointer', ['_LPCP_NONPAGED_PORT_QUEUE']]],
    'Semaphore' : [ 0x4, ['pointer', ['_KSEMAPHORE']]],
    'ReceiveHead' : [ 0x8, ['_LIST_ENTRY']],
} ],
  '_CM_KEY_REFERENCE' : [ 0x8, {
    'KeyCell' : [ 0x0, ['unsigned long']],
    'KeyHive' : [ 0x4, ['pointer', ['_HHIVE']]],
} ],
  'SYSTEM_POWER_LEVEL' : [ 0x18, {
    'Enable' : [ 0x0, ['unsigned char']],
    'Spare' : [ 0x1, ['array', 3, ['unsigned char']]],
    'BatteryLevel' : [ 0x4, ['unsigned long']],
    'PowerPolicy' : [ 0x8, ['POWER_ACTION_POLICY']],
    'MinSystemState' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
} ],
  '_OBJECT_DUMP_CONTROL' : [ 0x8, {
    'Stream' : [ 0x0, ['pointer', ['void']]],
    'Detail' : [ 0x4, ['unsigned long']],
} ],
  '_VF_ADDRESS_RANGE' : [ 0x8, {
    'Start' : [ 0x0, ['pointer', ['unsigned char']]],
    'End' : [ 0x4, ['pointer', ['unsigned char']]],
} ],
  '_OBJECT_SYMBOLIC_LINK' : [ 0x18, {
    'CreationTime' : [ 0x0, ['_LARGE_INTEGER']],
    'LinkTarget' : [ 0x8, ['_UNICODE_STRING']],
    'DosDeviceDriveIndex' : [ 0x10, ['unsigned long']],
    'Flags' : [ 0x14, ['unsigned long']],
} ],
  '_LPCP_NONPAGED_PORT_QUEUE' : [ 0x18, {
    'Semaphore' : [ 0x0, ['_KSEMAPHORE']],
    'BackPointer' : [ 0x14, ['pointer', ['_LPCP_PORT_OBJECT']]],
} ],
  '_KRESOURCEMANAGER_COMPLETION_BINDING' : [ 0x14, {
    'NotificationListHead' : [ 0x0, ['_LIST_ENTRY']],
    'Port' : [ 0x8, ['pointer', ['void']]],
    'Key' : [ 0xc, ['unsigned long']],
    'BindingProcess' : [ 0x10, ['pointer', ['_EPROCESS']]],
} ],
  '_VF_TRACKER' : [ 0x10, {
    'TrackerFlags' : [ 0x0, ['unsigned long']],
    'TrackerSize' : [ 0x4, ['unsigned long']],
    'TrackerIndex' : [ 0x8, ['unsigned long']],
    'TraceDepth' : [ 0xc, ['unsigned long']],
} ],
  '_CALL_PERFORMANCE_DATA' : [ 0x204, {
    'SpinLock' : [ 0x0, ['unsigned long']],
    'HashTable' : [ 0x4, ['array', 64, ['_LIST_ENTRY']]],
} ],
  '_ARBITER_ALTERNATIVE' : [ 0x38, {
    'Minimum' : [ 0x0, ['unsigned long long']],
    'Maximum' : [ 0x8, ['unsigned long long']],
    'Length' : [ 0x10, ['unsigned long long']],
    'Alignment' : [ 0x18, ['unsigned long long']],
    'Priority' : [ 0x20, ['long']],
    'Flags' : [ 0x24, ['unsigned long']],
    'Descriptor' : [ 0x28, ['pointer', ['_IO_RESOURCE_DESCRIPTOR']]],
    'Reserved' : [ 0x2c, ['array', 3, ['unsigned long']]],
} ],
  '_WHEA_ERROR_STATUS' : [ 0x8, {
    'ErrorStatus' : [ 0x0, ['unsigned long long']],
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long long')]],
    'ErrorType' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned long long')]],
    'Address' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long long')]],
    'Control' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long long')]],
    'Data' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long long')]],
    'Responder' : [ 0x0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long long')]],
    'Requester' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long long')]],
    'FirstError' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long long')]],
    'Overflow' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_WHEA_PERSISTENCE_INFO' : [ 0x8, {
    'Signature' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'Length' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 40, native_type='unsigned long long')]],
    'Identifier' : [ 0x0, ['BitField', dict(start_bit = 40, end_bit = 56, native_type='unsigned long long')]],
    'Attributes' : [ 0x0, ['BitField', dict(start_bit = 56, end_bit = 58, native_type='unsigned long long')]],
    'DoNotLog' : [ 0x0, ['BitField', dict(start_bit = 58, end_bit = 59, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 59, end_bit = 64, native_type='unsigned long long')]],
    'AsULONGLONG' : [ 0x0, ['unsigned long long']],
} ],
  '_MI_SECTION_IMAGE_INFORMATION' : [ 0x38, {
    'ExportedImageInformation' : [ 0x0, ['_SECTION_IMAGE_INFORMATION']],
    'InternalImageInformation' : [ 0x30, ['_MI_EXTRA_IMAGE_INFORMATION']],
} ],
  '_HEAP_USERDATA_HEADER' : [ 0x10, {
    'SFreeListEntry' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'SubSegment' : [ 0x0, ['pointer', ['_HEAP_SUBSEGMENT']]],
    'Reserved' : [ 0x4, ['pointer', ['void']]],
    'SizeIndex' : [ 0x8, ['unsigned long']],
    'Signature' : [ 0xc, ['unsigned long']],
} ],
  '_STACK_TABLE' : [ 0x8040, {
    'NumStackTraces' : [ 0x0, ['unsigned short']],
    'TraceCapacity' : [ 0x2, ['unsigned short']],
    'StackTrace' : [ 0x4, ['array', 16, ['pointer', ['_OBJECT_REF_TRACE']]]],
    'StackTableHash' : [ 0x44, ['array', 16381, ['unsigned short']]],
} ],
  '_TOKEN_CONTROL' : [ 0x28, {
    'TokenId' : [ 0x0, ['_LUID']],
    'AuthenticationId' : [ 0x8, ['_LUID']],
    'ModifiedId' : [ 0x10, ['_LUID']],
    'TokenSource' : [ 0x18, ['_TOKEN_SOURCE']],
} ],
  '_DEFERRED_WRITE' : [ 0x24, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'FileObject' : [ 0x4, ['pointer', ['_FILE_OBJECT']]],
    'BytesToWrite' : [ 0x8, ['unsigned long']],
    'DeferredWriteLinks' : [ 0xc, ['_LIST_ENTRY']],
    'Event' : [ 0x14, ['pointer', ['_KEVENT']]],
    'PostRoutine' : [ 0x18, ['pointer', ['void']]],
    'Context1' : [ 0x1c, ['pointer', ['void']]],
    'Context2' : [ 0x20, ['pointer', ['void']]],
} ],
  '_ARBITER_ORDERING_LIST' : [ 0x8, {
    'Count' : [ 0x0, ['unsigned short']],
    'Maximum' : [ 0x2, ['unsigned short']],
    'Orderings' : [ 0x4, ['pointer', ['_ARBITER_ORDERING']]],
} ],
  '_SECTION_IMAGE_INFORMATION' : [ 0x30, {
    'TransferAddress' : [ 0x0, ['pointer', ['void']]],
    'ZeroBits' : [ 0x4, ['unsigned long']],
    'MaximumStackSize' : [ 0x8, ['unsigned long']],
    'CommittedStackSize' : [ 0xc, ['unsigned long']],
    'SubSystemType' : [ 0x10, ['unsigned long']],
    'SubSystemMinorVersion' : [ 0x14, ['unsigned short']],
    'SubSystemMajorVersion' : [ 0x16, ['unsigned short']],
    'SubSystemVersion' : [ 0x14, ['unsigned long']],
    'GpValue' : [ 0x18, ['unsigned long']],
    'ImageCharacteristics' : [ 0x1c, ['unsigned short']],
    'DllCharacteristics' : [ 0x1e, ['unsigned short']],
    'Machine' : [ 0x20, ['unsigned short']],
    'ImageContainsCode' : [ 0x22, ['unsigned char']],
    'ImageFlags' : [ 0x23, ['unsigned char']],
    'ComPlusNativeReady' : [ 0x23, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'ComPlusILOnly' : [ 0x23, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'ImageDynamicallyRelocated' : [ 0x23, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'ImageMappedFlat' : [ 0x23, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Reserved' : [ 0x23, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'LoaderFlags' : [ 0x24, ['unsigned long']],
    'ImageFileSize' : [ 0x28, ['unsigned long']],
    'CheckSum' : [ 0x2c, ['unsigned long']],
} ],
  '_VF_AVL_TABLE' : [ 0x3c, {
    'RtlTable' : [ 0x0, ['_RTL_AVL_TABLE']],
    'ReservedNode' : [ 0x38, ['pointer', ['_VF_AVL_TREE_NODE']]],
} ],
  '_TOKEN_AUDIT_POLICY' : [ 0x1b, {
    'PerUserPolicy' : [ 0x0, ['array', 27, ['unsigned char']]],
} ],
  '__unnamed_2365' : [ 0x8, {
    'EndingOffset' : [ 0x0, ['pointer', ['_LARGE_INTEGER']]],
    'ResourceToRelease' : [ 0x4, ['pointer', ['pointer', ['_ERESOURCE']]]],
} ],
  '__unnamed_2367' : [ 0x4, {
    'ResourceToRelease' : [ 0x0, ['pointer', ['_ERESOURCE']]],
} ],
  '__unnamed_236b' : [ 0x8, {
    'SyncType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'SyncTypeOther', 1: 'SyncTypeCreateSection'})]],
    'PageProtection' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_236f' : [ 0x8, {
    'NotificationType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'NotifyTypeCreate', 1: 'NotifyTypeRetired'})]],
    'SafeToRecurse' : [ 0x4, ['unsigned char']],
} ],
  '__unnamed_2371' : [ 0x14, {
    'Argument1' : [ 0x0, ['pointer', ['void']]],
    'Argument2' : [ 0x4, ['pointer', ['void']]],
    'Argument3' : [ 0x8, ['pointer', ['void']]],
    'Argument4' : [ 0xc, ['pointer', ['void']]],
    'Argument5' : [ 0x10, ['pointer', ['void']]],
} ],
  '_FS_FILTER_PARAMETERS' : [ 0x14, {
    'AcquireForModifiedPageWriter' : [ 0x0, ['__unnamed_2365']],
    'ReleaseForModifiedPageWriter' : [ 0x0, ['__unnamed_2367']],
    'AcquireForSectionSynchronization' : [ 0x0, ['__unnamed_236b']],
    'NotifyStreamFileObject' : [ 0x0, ['__unnamed_236f']],
    'Others' : [ 0x0, ['__unnamed_2371']],
} ],
  '_PROFILE_PARAMETER_BLOCK' : [ 0x10, {
    'Status' : [ 0x0, ['unsigned short']],
    'Reserved' : [ 0x2, ['unsigned short']],
    'DockingState' : [ 0x4, ['unsigned short']],
    'Capabilities' : [ 0x6, ['unsigned short']],
    'DockID' : [ 0x8, ['unsigned long']],
    'SerialNumber' : [ 0xc, ['unsigned long']],
} ],
  '_COMPRESSED_DATA_INFO' : [ 0xc, {
    'CompressionFormatAndEngine' : [ 0x0, ['unsigned short']],
    'CompressionUnitShift' : [ 0x2, ['unsigned char']],
    'ChunkShift' : [ 0x3, ['unsigned char']],
    'ClusterShift' : [ 0x4, ['unsigned char']],
    'Reserved' : [ 0x5, ['unsigned char']],
    'NumberOfChunks' : [ 0x6, ['unsigned short']],
    'CompressedChunkSizes' : [ 0x8, ['array', 1, ['unsigned long']]],
} ],
  '_POP_HIBER_CONTEXT' : [ 0xa0, {
    'WriteToFile' : [ 0x0, ['unsigned char']],
    'ReserveLoaderMemory' : [ 0x1, ['unsigned char']],
    'ReserveFreeMemory' : [ 0x2, ['unsigned char']],
    'Reset' : [ 0x3, ['unsigned char']],
    'HiberFlags' : [ 0x4, ['unsigned char']],
    'WroteHiberFile' : [ 0x5, ['unsigned char']],
    'MapFrozen' : [ 0x6, ['unsigned char']],
    'MemoryMap' : [ 0x8, ['_RTL_BITMAP']],
    'DiscardedMemoryPages' : [ 0x10, ['_RTL_BITMAP']],
    'ClonedRanges' : [ 0x18, ['_LIST_ENTRY']],
    'ClonedRangeCount' : [ 0x20, ['unsigned long']],
    'NextCloneRange' : [ 0x24, ['pointer', ['_LIST_ENTRY']]],
    'NextPreserve' : [ 0x28, ['unsigned long']],
    'LoaderMdl' : [ 0x2c, ['pointer', ['_MDL']]],
    'AllocatedMdl' : [ 0x30, ['pointer', ['_MDL']]],
    'PagesOut' : [ 0x38, ['unsigned long long']],
    'IoPages' : [ 0x40, ['pointer', ['void']]],
    'IoPagesCount' : [ 0x44, ['unsigned long']],
    'CurrentMcb' : [ 0x48, ['pointer', ['void']]],
    'DumpStack' : [ 0x4c, ['pointer', ['_DUMP_STACK_CONTEXT']]],
    'WakeState' : [ 0x50, ['pointer', ['_KPROCESSOR_STATE']]],
    'PreferredIoWriteSize' : [ 0x54, ['unsigned long']],
    'IoProgress' : [ 0x58, ['unsigned long']],
    'HiberVa' : [ 0x5c, ['unsigned long']],
    'HiberPte' : [ 0x60, ['_LARGE_INTEGER']],
    'Status' : [ 0x68, ['long']],
    'MemoryImage' : [ 0x6c, ['pointer', ['PO_MEMORY_IMAGE']]],
    'CompressionWorkspace' : [ 0x70, ['pointer', ['void']]],
    'CompressedWriteBuffer' : [ 0x74, ['pointer', ['unsigned char']]],
    'CompressedWriteBufferSize' : [ 0x78, ['unsigned long']],
    'MaxCompressedOutputSize' : [ 0x7c, ['unsigned long']],
    'PerformanceStats' : [ 0x80, ['pointer', ['unsigned long']]],
    'CompressionBlock' : [ 0x84, ['pointer', ['void']]],
    'DmaIO' : [ 0x88, ['pointer', ['void']]],
    'TemporaryHeap' : [ 0x8c, ['pointer', ['void']]],
    'BootLoaderLogMdl' : [ 0x90, ['pointer', ['_MDL']]],
    'FirmwareRuntimeInformationMdl' : [ 0x94, ['pointer', ['_MDL']]],
    'ResumeContext' : [ 0x98, ['pointer', ['void']]],
    'ResumeContextPages' : [ 0x9c, ['unsigned long']],
} ],
  '_OBJECT_REF_TRACE' : [ 0x40, {
    'StackTrace' : [ 0x0, ['array', 16, ['pointer', ['void']]]],
} ],
  '_OBJECT_NAME_INFORMATION' : [ 0x8, {
    'Name' : [ 0x0, ['_UNICODE_STRING']],
} ],
  '_PCW_COUNTER_INFORMATION' : [ 0x10, {
    'CounterMask' : [ 0x0, ['unsigned long long']],
    'InstanceMask' : [ 0x8, ['pointer', ['_UNICODE_STRING']]],
} ],
  '_DUMP_STACK_CONTEXT' : [ 0xb0, {
    'Init' : [ 0x0, ['_DUMP_INITIALIZATION_CONTEXT']],
    'PartitionOffset' : [ 0x70, ['_LARGE_INTEGER']],
    'DumpPointers' : [ 0x78, ['pointer', ['void']]],
    'PointersLength' : [ 0x7c, ['unsigned long']],
    'ModulePrefix' : [ 0x80, ['pointer', ['unsigned short']]],
    'DriverList' : [ 0x84, ['_LIST_ENTRY']],
    'InitMsg' : [ 0x8c, ['_STRING']],
    'ProgMsg' : [ 0x94, ['_STRING']],
    'DoneMsg' : [ 0x9c, ['_STRING']],
    'FileObject' : [ 0xa4, ['pointer', ['void']]],
    'UsageType' : [ 0xa8, ['Enumeration', dict(target = 'long', choices = {0: 'DeviceUsageTypeUndefined', 1: 'DeviceUsageTypePaging', 2: 'DeviceUsageTypeHibernation', 3: 'DeviceUsageTypeDumpFile'})]],
} ],
  '_FILE_STANDARD_INFORMATION' : [ 0x18, {
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
    'EndOfFile' : [ 0x8, ['_LARGE_INTEGER']],
    'NumberOfLinks' : [ 0x10, ['unsigned long']],
    'DeletePending' : [ 0x14, ['unsigned char']],
    'Directory' : [ 0x15, ['unsigned char']],
} ],
  '_POP_SHUTDOWN_BUG_CHECK' : [ 0x20, {
    'ThreadHandle' : [ 0x0, ['pointer', ['void']]],
    'ThreadId' : [ 0x4, ['pointer', ['void']]],
    'ProcessId' : [ 0x8, ['pointer', ['void']]],
    'Code' : [ 0xc, ['unsigned long']],
    'Parameter1' : [ 0x10, ['unsigned long']],
    'Parameter2' : [ 0x14, ['unsigned long']],
    'Parameter3' : [ 0x18, ['unsigned long']],
    'Parameter4' : [ 0x1c, ['unsigned long']],
} ],
  '_MI_EXTRA_IMAGE_INFORMATION' : [ 0x8, {
    'SizeOfHeaders' : [ 0x0, ['unsigned long']],
    'SizeOfImage' : [ 0x4, ['unsigned long']],
} ],
  '_PCW_MASK_INFORMATION' : [ 0x20, {
    'CounterMask' : [ 0x0, ['unsigned long long']],
    'InstanceMask' : [ 0x8, ['pointer', ['_UNICODE_STRING']]],
    'InstanceId' : [ 0xc, ['unsigned long']],
    'CollectMultiple' : [ 0x10, ['unsigned char']],
    'Buffer' : [ 0x14, ['pointer', ['_PCW_BUFFER']]],
    'CancelEvent' : [ 0x18, ['pointer', ['_KEVENT']]],
} ],
  '_RTL_HANDLE_TABLE_ENTRY' : [ 0x4, {
    'Flags' : [ 0x0, ['unsigned long']],
    'NextFree' : [ 0x0, ['pointer', ['_RTL_HANDLE_TABLE_ENTRY']]],
} ],
  '__unnamed_2395' : [ 0x10, {
    'TestAllocation' : [ 0x0, ['_ARBITER_TEST_ALLOCATION_PARAMETERS']],
    'RetestAllocation' : [ 0x0, ['_ARBITER_RETEST_ALLOCATION_PARAMETERS']],
    'BootAllocation' : [ 0x0, ['_ARBITER_BOOT_ALLOCATION_PARAMETERS']],
    'QueryAllocatedResources' : [ 0x0, ['_ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS']],
    'QueryConflict' : [ 0x0, ['_ARBITER_QUERY_CONFLICT_PARAMETERS']],
    'QueryArbitrate' : [ 0x0, ['_ARBITER_QUERY_ARBITRATE_PARAMETERS']],
    'AddReserved' : [ 0x0, ['_ARBITER_ADD_RESERVED_PARAMETERS']],
} ],
  '_ARBITER_PARAMETERS' : [ 0x10, {
    'Parameters' : [ 0x0, ['__unnamed_2395']],
} ],
  '__unnamed_2399' : [ 0x8, {
    'idxRecord' : [ 0x0, ['unsigned long']],
    'cidContainer' : [ 0x4, ['unsigned long']],
} ],
  '_CLS_LSN' : [ 0x8, {
    'offset' : [ 0x0, ['__unnamed_2399']],
    'ullOffset' : [ 0x0, ['unsigned long long']],
} ],
  'POWER_ACTION_POLICY' : [ 0xc, {
    'Action' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'PowerActionNone', 1: 'PowerActionReserved', 2: 'PowerActionSleep', 3: 'PowerActionHibernate', 4: 'PowerActionShutdown', 5: 'PowerActionShutdownReset', 6: 'PowerActionShutdownOff', 7: 'PowerActionWarmEject'})]],
    'Flags' : [ 0x4, ['unsigned long']],
    'EventCode' : [ 0x8, ['unsigned long']],
} ],
  'PO_MEMORY_IMAGE' : [ 0xe0, {
    'Signature' : [ 0x0, ['unsigned long']],
    'ImageType' : [ 0x4, ['unsigned long']],
    'CheckSum' : [ 0x8, ['unsigned long']],
    'LengthSelf' : [ 0xc, ['unsigned long']],
    'PageSelf' : [ 0x10, ['unsigned long']],
    'PageSize' : [ 0x14, ['unsigned long']],
    'SystemTime' : [ 0x18, ['_LARGE_INTEGER']],
    'InterruptTime' : [ 0x20, ['unsigned long long']],
    'FeatureFlags' : [ 0x28, ['unsigned long']],
    'HiberFlags' : [ 0x2c, ['unsigned char']],
    'spare' : [ 0x2d, ['array', 3, ['unsigned char']]],
    'NoHiberPtes' : [ 0x30, ['unsigned long']],
    'HiberVa' : [ 0x34, ['unsigned long']],
    'HiberPte' : [ 0x38, ['_LARGE_INTEGER']],
    'NoFreePages' : [ 0x40, ['unsigned long']],
    'FreeMapCheck' : [ 0x44, ['unsigned long']],
    'WakeCheck' : [ 0x48, ['unsigned long']],
    'FirstTablePage' : [ 0x4c, ['unsigned long']],
    'PerfInfo' : [ 0x50, ['_PO_HIBER_PERF']],
    'FirmwareRuntimeInformationPages' : [ 0xa8, ['unsigned long']],
    'FirmwareRuntimeInformation' : [ 0xac, ['array', 1, ['unsigned long']]],
    'NoBootLoaderLogPages' : [ 0xb0, ['unsigned long']],
    'BootLoaderLogPages' : [ 0xb4, ['array', 8, ['unsigned long']]],
    'NotUsed' : [ 0xd4, ['unsigned long']],
    'ResumeContextCheck' : [ 0xd8, ['unsigned long']],
    'ResumeContextPages' : [ 0xdc, ['unsigned long']],
} ],
  'EX_QUEUE_WORKER_INFO' : [ 0x4, {
    'QueueDisabled' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MakeThreadsAsNecessary' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'WaitMode' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'WorkerCount' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'QueueWorkerInfo' : [ 0x0, ['long']],
} ],
  'BATTERY_REPORTING_SCALE' : [ 0x8, {
    'Granularity' : [ 0x0, ['unsigned long']],
    'Capacity' : [ 0x4, ['unsigned long']],
} ],
  '_CURDIR' : [ 0xc, {
    'DosPath' : [ 0x0, ['_UNICODE_STRING']],
    'Handle' : [ 0x8, ['pointer', ['void']]],
} ],
  '_PO_HIBER_PERF' : [ 0x58, {
    'IoTicks' : [ 0x0, ['unsigned long long']],
    'InitTicks' : [ 0x8, ['unsigned long long']],
    'CopyTicks' : [ 0x10, ['unsigned long long']],
    'ElapsedTicks' : [ 0x18, ['unsigned long long']],
    'CompressTicks' : [ 0x20, ['unsigned long long']],
    'ResumeAppTime' : [ 0x28, ['unsigned long long']],
    'HiberFileResumeTime' : [ 0x30, ['unsigned long long']],
    'BytesCopied' : [ 0x38, ['unsigned long long']],
    'PagesProcessed' : [ 0x40, ['unsigned long long']],
    'PagesWritten' : [ 0x48, ['unsigned long']],
    'DumpCount' : [ 0x4c, ['unsigned long']],
    'FileRuns' : [ 0x50, ['unsigned long']],
} ],
  '_DEVICE_FLAGS' : [ 0x4, {
    'Failed' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReadOnly' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Removable' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ConsoleIn' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ConsoleOut' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Input' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Output' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
} ],
  '_RTL_BALANCED_LINKS' : [ 0x10, {
    'Parent' : [ 0x0, ['pointer', ['_RTL_BALANCED_LINKS']]],
    'LeftChild' : [ 0x4, ['pointer', ['_RTL_BALANCED_LINKS']]],
    'RightChild' : [ 0x8, ['pointer', ['_RTL_BALANCED_LINKS']]],
    'Balance' : [ 0xc, ['unsigned char']],
    'Reserved' : [ 0xd, ['array', 3, ['unsigned char']]],
} ],
  '_MMVIEW' : [ 0x18, {
    'Entry' : [ 0x0, ['unsigned long']],
    'Writable' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ControlArea' : [ 0x4, ['pointer', ['_CONTROL_AREA']]],
    'ViewLinks' : [ 0x8, ['_LIST_ENTRY']],
    'SessionViewVa' : [ 0x10, ['pointer', ['void']]],
    'SessionId' : [ 0x14, ['unsigned long']],
} ],
  '_MM_SESSION_SPACE_FLAGS' : [ 0x4, {
    'Initialized' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DeletePending' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'PoolInitialized' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DynamicVaInitialized' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'WsInitialized' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'PoolDestroyed' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ObjectInitialized' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Filler' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 32, native_type='unsigned long')]],
} ],
  '_HEADLESS_LOADER_BLOCK' : [ 0x34, {
    'UsedBiosSettings' : [ 0x0, ['unsigned char']],
    'DataBits' : [ 0x1, ['unsigned char']],
    'StopBits' : [ 0x2, ['unsigned char']],
    'Parity' : [ 0x3, ['unsigned char']],
    'BaudRate' : [ 0x4, ['unsigned long']],
    'PortNumber' : [ 0x8, ['unsigned long']],
    'PortAddress' : [ 0xc, ['pointer', ['unsigned char']]],
    'PciDeviceId' : [ 0x10, ['unsigned short']],
    'PciVendorId' : [ 0x12, ['unsigned short']],
    'PciBusNumber' : [ 0x14, ['unsigned char']],
    'PciBusSegment' : [ 0x16, ['unsigned short']],
    'PciSlotNumber' : [ 0x18, ['unsigned char']],
    'PciFunctionNumber' : [ 0x19, ['unsigned char']],
    'PciFlags' : [ 0x1c, ['unsigned long']],
    'SystemGUID' : [ 0x20, ['_GUID']],
    'IsMMIODevice' : [ 0x30, ['unsigned char']],
    'TerminalType' : [ 0x31, ['unsigned char']],
} ],
  '__unnamed_23c1' : [ 0x8, {
    'Signature' : [ 0x0, ['unsigned long']],
    'CheckSum' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_23c3' : [ 0x10, {
    'DiskId' : [ 0x0, ['_GUID']],
} ],
  '__unnamed_23c5' : [ 0x10, {
    'Mbr' : [ 0x0, ['__unnamed_23c1']],
    'Gpt' : [ 0x0, ['__unnamed_23c3']],
} ],
  '_DUMP_INITIALIZATION_CONTEXT' : [ 0x70, {
    'Length' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'MemoryBlock' : [ 0x8, ['pointer', ['void']]],
    'CommonBuffer' : [ 0xc, ['array', 2, ['pointer', ['void']]]],
    'PhysicalAddress' : [ 0x18, ['array', 2, ['_LARGE_INTEGER']]],
    'StallRoutine' : [ 0x28, ['pointer', ['void']]],
    'OpenRoutine' : [ 0x2c, ['pointer', ['void']]],
    'WriteRoutine' : [ 0x30, ['pointer', ['void']]],
    'FinishRoutine' : [ 0x34, ['pointer', ['void']]],
    'AdapterObject' : [ 0x38, ['pointer', ['_ADAPTER_OBJECT']]],
    'MappedRegisterBase' : [ 0x3c, ['pointer', ['void']]],
    'PortConfiguration' : [ 0x40, ['pointer', ['void']]],
    'CrashDump' : [ 0x44, ['unsigned char']],
    'MaximumTransferSize' : [ 0x48, ['unsigned long']],
    'CommonBufferSize' : [ 0x4c, ['unsigned long']],
    'TargetAddress' : [ 0x50, ['pointer', ['void']]],
    'WritePendingRoutine' : [ 0x54, ['pointer', ['void']]],
    'PartitionStyle' : [ 0x58, ['unsigned long']],
    'DiskInfo' : [ 0x5c, ['__unnamed_23c5']],
} ],
  '_MI_SYSTEM_PTE_TYPE' : [ 0x30, {
    'Bitmap' : [ 0x0, ['_RTL_BITMAP']],
    'Flags' : [ 0x8, ['unsigned long']],
    'Hint' : [ 0xc, ['unsigned long']],
    'BasePte' : [ 0x10, ['pointer', ['_MMPTE']]],
    'FailureCount' : [ 0x14, ['pointer', ['unsigned long']]],
    'Vm' : [ 0x18, ['pointer', ['_MMSUPPORT']]],
    'TotalSystemPtes' : [ 0x1c, ['long']],
    'TotalFreeSystemPtes' : [ 0x20, ['long']],
    'CachedPteCount' : [ 0x24, ['long']],
    'PteFailures' : [ 0x28, ['unsigned long']],
    'SpinLock' : [ 0x2c, ['unsigned long']],
    'GlobalMutex' : [ 0x2c, ['pointer', ['_KGUARDED_MUTEX']]],
} ],
  '_NETWORK_LOADER_BLOCK' : [ 0x10, {
    'DHCPServerACK' : [ 0x0, ['pointer', ['unsigned char']]],
    'DHCPServerACKLength' : [ 0x4, ['unsigned long']],
    'BootServerReplyPacket' : [ 0x8, ['pointer', ['unsigned char']]],
    'BootServerReplyPacketLength' : [ 0xc, ['unsigned long']],
} ],
  '_CM_KEY_SECURITY' : [ 0x28, {
    'Signature' : [ 0x0, ['unsigned short']],
    'Reserved' : [ 0x2, ['unsigned short']],
    'Flink' : [ 0x4, ['unsigned long']],
    'Blink' : [ 0x8, ['unsigned long']],
    'ReferenceCount' : [ 0xc, ['unsigned long']],
    'DescriptorLength' : [ 0x10, ['unsigned long']],
    'Descriptor' : [ 0x14, ['_SECURITY_DESCRIPTOR_RELATIVE']],
} ],
  '_PO_DEVICE_NOTIFY_ORDER' : [ 0x170, {
    'Locked' : [ 0x0, ['unsigned char']],
    'WarmEjectPdoPointer' : [ 0x4, ['pointer', ['pointer', ['_DEVICE_OBJECT']]]],
    'OrderLevel' : [ 0x8, ['array', 9, ['_PO_NOTIFY_ORDER_LEVEL']]],
} ],
  '_ARBITER_CONFLICT_INFO' : [ 0x18, {
    'OwningObject' : [ 0x0, ['pointer', ['_DEVICE_OBJECT']]],
    'Start' : [ 0x8, ['unsigned long long']],
    'End' : [ 0x10, ['unsigned long long']],
} ],
  '_PO_NOTIFY_ORDER_LEVEL' : [ 0x28, {
    'DeviceCount' : [ 0x0, ['unsigned long']],
    'ActiveCount' : [ 0x4, ['unsigned long']],
    'WaitSleep' : [ 0x8, ['_LIST_ENTRY']],
    'ReadySleep' : [ 0x10, ['_LIST_ENTRY']],
    'ReadyS0' : [ 0x18, ['_LIST_ENTRY']],
    'WaitS0' : [ 0x20, ['_LIST_ENTRY']],
} ],
  '_THREAD_PERFORMANCE_DATA' : [ 0x1c0, {
    'Size' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned short']],
    'ProcessorNumber' : [ 0x4, ['_PROCESSOR_NUMBER']],
    'ContextSwitches' : [ 0x8, ['unsigned long']],
    'HwCountersCount' : [ 0xc, ['unsigned long']],
    'UpdateCount' : [ 0x10, ['unsigned long long']],
    'WaitReasonBitMap' : [ 0x18, ['unsigned long long']],
    'HardwareCounters' : [ 0x20, ['unsigned long long']],
    'CycleTime' : [ 0x28, ['_COUNTER_READING']],
    'HwCounters' : [ 0x40, ['array', 16, ['_COUNTER_READING']]],
} ],
  '_ETW_REPLY_QUEUE' : [ 0x2c, {
    'Queue' : [ 0x0, ['_KQUEUE']],
    'EventsLost' : [ 0x28, ['long']],
} ],
  '_ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS' : [ 0x4, {
    'AllocatedResources' : [ 0x0, ['pointer', ['pointer', ['_CM_PARTIAL_RESOURCE_LIST']]]],
} ],
  '_KSPECIAL_REGISTERS' : [ 0x54, {
    'Cr0' : [ 0x0, ['unsigned long']],
    'Cr2' : [ 0x4, ['unsigned long']],
    'Cr3' : [ 0x8, ['unsigned long']],
    'Cr4' : [ 0xc, ['unsigned long']],
    'KernelDr0' : [ 0x10, ['unsigned long']],
    'KernelDr1' : [ 0x14, ['unsigned long']],
    'KernelDr2' : [ 0x18, ['unsigned long']],
    'KernelDr3' : [ 0x1c, ['unsigned long']],
    'KernelDr6' : [ 0x20, ['unsigned long']],
    'KernelDr7' : [ 0x24, ['unsigned long']],
    'Gdtr' : [ 0x28, ['_DESCRIPTOR']],
    'Idtr' : [ 0x30, ['_DESCRIPTOR']],
    'Tr' : [ 0x38, ['unsigned short']],
    'Ldtr' : [ 0x3a, ['unsigned short']],
    'Reserved' : [ 0x3c, ['array', 6, ['unsigned long']]],
} ],
  '_RTL_ACTIVATION_CONTEXT_STACK_FRAME' : [ 0xc, {
    'Previous' : [ 0x0, ['pointer', ['_RTL_ACTIVATION_CONTEXT_STACK_FRAME']]],
    'ActivationContext' : [ 0x4, ['pointer', ['_ACTIVATION_CONTEXT']]],
    'Flags' : [ 0x8, ['unsigned long']],
} ],
  '_ARBITER_ORDERING' : [ 0x10, {
    'Start' : [ 0x0, ['unsigned long long']],
    'End' : [ 0x8, ['unsigned long long']],
} ],
  '_RTL_AVL_TABLE' : [ 0x38, {
    'BalancedRoot' : [ 0x0, ['_RTL_BALANCED_LINKS']],
    'OrderedPointer' : [ 0x10, ['pointer', ['void']]],
    'WhichOrderedElement' : [ 0x14, ['unsigned long']],
    'NumberGenericTableElements' : [ 0x18, ['unsigned long']],
    'DepthOfTree' : [ 0x1c, ['unsigned long']],
    'RestartKey' : [ 0x20, ['pointer', ['_RTL_BALANCED_LINKS']]],
    'DeleteCount' : [ 0x24, ['unsigned long']],
    'CompareRoutine' : [ 0x28, ['pointer', ['void']]],
    'AllocateRoutine' : [ 0x2c, ['pointer', ['void']]],
    'FreeRoutine' : [ 0x30, ['pointer', ['void']]],
    'TableContext' : [ 0x34, ['pointer', ['void']]],
} ],
  '_KTRANSACTION_HISTORY' : [ 0x8, {
    'RecordType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {1: 'KTMOH_CommitTransaction_Result', 2: 'KTMOH_RollbackTransaction_Result'})]],
    'Payload' : [ 0x4, ['unsigned long']],
} ],
  '_DESCRIPTOR' : [ 0x8, {
    'Pad' : [ 0x0, ['unsigned short']],
    'Limit' : [ 0x2, ['unsigned short']],
    'Base' : [ 0x4, ['unsigned long']],
} ],
  'LIST_ENTRY64' : [ 0x10, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'Blink' : [ 0x8, ['unsigned long long']],
} ],
  'LIST_ENTRY32' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long']],
    'Blink' : [ 0x4, ['unsigned long']],
} ],
  '_KSYSTEM_TIME' : [ 0xc, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'High1Time' : [ 0x4, ['long']],
    'High2Time' : [ 0x8, ['long']],
} ],
  '_KUSER_SHARED_DATA' : [ 0x5f0, {
    'TickCountLowDeprecated' : [ 0x0, ['unsigned long']],
    'TickCountMultiplier' : [ 0x4, ['unsigned long']],
    'InterruptTime' : [ 0x8, ['_KSYSTEM_TIME']],
    'SystemTime' : [ 0x14, ['_KSYSTEM_TIME']],
    'TimeZoneBias' : [ 0x20, ['_KSYSTEM_TIME']],
    'ImageNumberLow' : [ 0x2c, ['unsigned short']],
    'ImageNumberHigh' : [ 0x2e, ['unsigned short']],
    'NtSystemRoot' : [ 0x30, ['array', 260, ['wchar']]],
    'MaxStackTraceDepth' : [ 0x238, ['unsigned long']],
    'CryptoExponent' : [ 0x23c, ['unsigned long']],
    'TimeZoneId' : [ 0x240, ['unsigned long']],
    'LargePageMinimum' : [ 0x244, ['unsigned long']],
    'Reserved2' : [ 0x248, ['array', 7, ['unsigned long']]],
    'NtProductType' : [ 0x264, ['Enumeration', dict(target = 'long', choices = {1: 'NtProductWinNt', 2: 'NtProductLanManNt', 3: 'NtProductServer'})]],
    'ProductTypeIsValid' : [ 0x268, ['unsigned char']],
    'NtMajorVersion' : [ 0x26c, ['unsigned long']],
    'NtMinorVersion' : [ 0x270, ['unsigned long']],
    'ProcessorFeatures' : [ 0x274, ['array', 64, ['unsigned char']]],
    'Reserved1' : [ 0x2b4, ['unsigned long']],
    'Reserved3' : [ 0x2b8, ['unsigned long']],
    'TimeSlip' : [ 0x2bc, ['unsigned long']],
    'AlternativeArchitecture' : [ 0x2c0, ['Enumeration', dict(target = 'long', choices = {0: 'StandardDesign', 1: 'NEC98x86', 2: 'EndAlternatives'})]],
    'AltArchitecturePad' : [ 0x2c4, ['array', 1, ['unsigned long']]],
    'SystemExpirationDate' : [ 0x2c8, ['_LARGE_INTEGER']],
    'SuiteMask' : [ 0x2d0, ['unsigned long']],
    'KdDebuggerEnabled' : [ 0x2d4, ['unsigned char']],
    'NXSupportPolicy' : [ 0x2d5, ['unsigned char']],
    'ActiveConsoleId' : [ 0x2d8, ['unsigned long']],
    'DismountCount' : [ 0x2dc, ['unsigned long']],
    'ComPlusPackage' : [ 0x2e0, ['unsigned long']],
    'LastSystemRITEventTickCount' : [ 0x2e4, ['unsigned long']],
    'NumberOfPhysicalPages' : [ 0x2e8, ['unsigned long']],
    'SafeBootMode' : [ 0x2ec, ['unsigned char']],
    'TscQpcData' : [ 0x2ed, ['unsigned char']],
    'TscQpcEnabled' : [ 0x2ed, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'TscQpcSpareFlag' : [ 0x2ed, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'TscQpcShift' : [ 0x2ed, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'TscQpcPad' : [ 0x2ee, ['array', 2, ['unsigned char']]],
    'SharedDataFlags' : [ 0x2f0, ['unsigned long']],
    'DbgErrorPortPresent' : [ 0x2f0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DbgElevationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DbgVirtEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DbgInstallerDetectEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DbgSystemDllRelocated' : [ 0x2f0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DbgDynProcessorEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DbgSEHValidationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'SpareBits' : [ 0x2f0, ['BitField', dict(start_bit = 7, end_bit = 32, native_type='unsigned long')]],
    'DataFlagsPad' : [ 0x2f4, ['array', 1, ['unsigned long']]],
    'TestRetInstruction' : [ 0x2f8, ['unsigned long long']],
    'SystemCall' : [ 0x300, ['unsigned long']],
    'SystemCallReturn' : [ 0x304, ['unsigned long']],
    'SystemCallPad' : [ 0x308, ['array', 3, ['unsigned long long']]],
    'TickCount' : [ 0x320, ['_KSYSTEM_TIME']],
    'TickCountQuad' : [ 0x320, ['unsigned long long']],
    'ReservedTickCountOverlay' : [ 0x320, ['array', 3, ['unsigned long']]],
    'TickCountPad' : [ 0x32c, ['array', 1, ['unsigned long']]],
    'Cookie' : [ 0x330, ['unsigned long']],
    'CookiePad' : [ 0x334, ['array', 1, ['unsigned long']]],
    'ConsoleSessionForegroundProcessId' : [ 0x338, ['long long']],
    'DEPRECATED_Wow64SharedInformation' : [ 0x340, ['array', 16, ['unsigned long']]],
    'UserModeGlobalLogger' : [ 0x380, ['array', 16, ['unsigned short']]],
    'ImageFileExecutionOptions' : [ 0x3a0, ['unsigned long']],
    'LangGenerationCount' : [ 0x3a4, ['unsigned long']],
    'Reserved5' : [ 0x3a8, ['unsigned long long']],
    'InterruptTimeBias' : [ 0x3b0, ['unsigned long long']],
    'TscQpcBias' : [ 0x3b8, ['unsigned long long']],
    'ActiveProcessorCount' : [ 0x3c0, ['unsigned long']],
    'ActiveGroupCount' : [ 0x3c4, ['unsigned short']],
    'Reserved4' : [ 0x3c6, ['unsigned short']],
    'AitSamplingValue' : [ 0x3c8, ['unsigned long']],
    'AppCompatFlag' : [ 0x3cc, ['unsigned long']],
    'DEPRECATED_SystemDllNativeRelocation' : [ 0x3d0, ['unsigned long long']],
    'DEPRECATED_SystemDllWowRelocation' : [ 0x3d8, ['unsigned long']],
    'XStatePad' : [ 0x3dc, ['array', 1, ['unsigned long']]],
    'XState' : [ 0x3e0, ['_XSTATE_CONFIGURATION']],
} ],
  '__unnamed_1041' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
} ],
  '_ULARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
    'u' : [ 0x0, ['__unnamed_1041']],
    'QuadPart' : [ 0x0, ['unsigned long long']],
} ],
  '__unnamed_1045' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_LARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
    'u' : [ 0x0, ['__unnamed_1045']],
    'QuadPart' : [ 0x0, ['long long']],
} ],
  '__unnamed_105e' : [ 0x4, {
    'LongFunction' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Persistent' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Private' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_1060' : [ 0x4, {
    'Flags' : [ 0x0, ['unsigned long']],
    's' : [ 0x0, ['__unnamed_105e']],
} ],
  '_TP_CALLBACK_ENVIRON_V3' : [ 0x28, {
    'Version' : [ 0x0, ['unsigned long']],
    'Pool' : [ 0x4, ['pointer', ['_TP_POOL']]],
    'CleanupGroup' : [ 0x8, ['pointer', ['_TP_CLEANUP_GROUP']]],
    'CleanupGroupCancelCallback' : [ 0xc, ['pointer', ['void']]],
    'RaceDll' : [ 0x10, ['pointer', ['void']]],
    'ActivationContext' : [ 0x14, ['pointer', ['_ACTIVATION_CONTEXT']]],
    'FinalizationCallback' : [ 0x18, ['pointer', ['void']]],
    'u' : [ 0x1c, ['__unnamed_1060']],
    'CallbackPriority' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {0: 'TP_CALLBACK_PRIORITY_HIGH', 1: 'TP_CALLBACK_PRIORITY_NORMAL', 2: 'TP_CALLBACK_PRIORITY_LOW', 3: 'TP_CALLBACK_PRIORITY_INVALID'})]],
    'Size' : [ 0x24, ['unsigned long']],
} ],
  '_TP_TASK' : [ 0x14, {
    'Callbacks' : [ 0x0, ['pointer', ['_TP_TASK_CALLBACKS']]],
    'NumaNode' : [ 0x4, ['unsigned long']],
    'IdealProcessor' : [ 0x8, ['unsigned char']],
    'ListEntry' : [ 0xc, ['_LIST_ENTRY']],
} ],
  '_TP_TASK_CALLBACKS' : [ 0x8, {
    'ExecuteCallback' : [ 0x0, ['pointer', ['void']]],
    'Unposted' : [ 0x4, ['pointer', ['void']]],
} ],
  '_TP_DIRECT' : [ 0xc, {
    'Callback' : [ 0x0, ['pointer', ['void']]],
    'NumaNode' : [ 0x4, ['unsigned long']],
    'IdealProcessor' : [ 0x8, ['unsigned char']],
} ],
  '_TEB' : [ 0xfe4, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'EnvironmentPointer' : [ 0x1c, ['pointer', ['void']]],
    'ClientId' : [ 0x20, ['_CLIENT_ID']],
    'ActiveRpcHandle' : [ 0x28, ['pointer', ['void']]],
    'ThreadLocalStoragePointer' : [ 0x2c, ['pointer', ['void']]],
    'ProcessEnvironmentBlock' : [ 0x30, ['pointer', ['_PEB']]],
    'LastErrorValue' : [ 0x34, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x38, ['unsigned long']],
    'CsrClientThread' : [ 0x3c, ['pointer', ['void']]],
    'Win32ThreadInfo' : [ 0x40, ['pointer', ['void']]],
    'User32Reserved' : [ 0x44, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xac, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0xc0, ['pointer', ['void']]],
    'CurrentLocale' : [ 0xc4, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0xc8, ['unsigned long']],
    'SystemReserved1' : [ 0xcc, ['array', 54, ['pointer', ['void']]]],
    'ExceptionCode' : [ 0x1a4, ['long']],
    'ActivationContextStackPointer' : [ 0x1a8, ['pointer', ['_ACTIVATION_CONTEXT_STACK']]],
    'SpareBytes' : [ 0x1ac, ['array', 36, ['unsigned char']]],
    'TxFsContext' : [ 0x1d0, ['unsigned long']],
    'GdiTebBatch' : [ 0x1d4, ['_GDI_TEB_BATCH']],
    'RealClientId' : [ 0x6b4, ['_CLIENT_ID']],
    'GdiCachedProcessHandle' : [ 0x6bc, ['pointer', ['void']]],
    'GdiClientPID' : [ 0x6c0, ['unsigned long']],
    'GdiClientTID' : [ 0x6c4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x6c8, ['pointer', ['void']]],
    'Win32ClientInfo' : [ 0x6cc, ['array', 62, ['unsigned long']]],
    'glDispatchTable' : [ 0x7c4, ['array', 233, ['pointer', ['void']]]],
    'glReserved1' : [ 0xb68, ['array', 29, ['unsigned long']]],
    'glReserved2' : [ 0xbdc, ['pointer', ['void']]],
    'glSectionInfo' : [ 0xbe0, ['pointer', ['void']]],
    'glSection' : [ 0xbe4, ['pointer', ['void']]],
    'glTable' : [ 0xbe8, ['pointer', ['void']]],
    'glCurrentRC' : [ 0xbec, ['pointer', ['void']]],
    'glContext' : [ 0xbf0, ['pointer', ['void']]],
    'LastStatusValue' : [ 0xbf4, ['unsigned long']],
    'StaticUnicodeString' : [ 0xbf8, ['_UNICODE_STRING']],
    'StaticUnicodeBuffer' : [ 0xc00, ['array', 261, ['wchar']]],
    'DeallocationStack' : [ 0xe0c, ['pointer', ['void']]],
    'TlsSlots' : [ 0xe10, ['array', 64, ['pointer', ['void']]]],
    'TlsLinks' : [ 0xf10, ['_LIST_ENTRY']],
    'Vdm' : [ 0xf18, ['pointer', ['void']]],
    'ReservedForNtRpc' : [ 0xf1c, ['pointer', ['void']]],
    'DbgSsReserved' : [ 0xf20, ['array', 2, ['pointer', ['void']]]],
    'HardErrorMode' : [ 0xf28, ['unsigned long']],
    'Instrumentation' : [ 0xf2c, ['array', 9, ['pointer', ['void']]]],
    'ActivityId' : [ 0xf50, ['_GUID']],
    'SubProcessTag' : [ 0xf60, ['pointer', ['void']]],
    'EtwLocalData' : [ 0xf64, ['pointer', ['void']]],
    'EtwTraceData' : [ 0xf68, ['pointer', ['void']]],
    'WinSockData' : [ 0xf6c, ['pointer', ['void']]],
    'GdiBatchCount' : [ 0xf70, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0xf74, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0xf74, ['unsigned long']],
    'ReservedPad0' : [ 0xf74, ['unsigned char']],
    'ReservedPad1' : [ 0xf75, ['unsigned char']],
    'ReservedPad2' : [ 0xf76, ['unsigned char']],
    'IdealProcessor' : [ 0xf77, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0xf78, ['unsigned long']],
    'ReservedForPerf' : [ 0xf7c, ['pointer', ['void']]],
    'ReservedForOle' : [ 0xf80, ['pointer', ['void']]],
    'WaitingOnLoaderLock' : [ 0xf84, ['unsigned long']],
    'SavedPriorityState' : [ 0xf88, ['pointer', ['void']]],
    'SoftPatchPtr1' : [ 0xf8c, ['unsigned long']],
    'ThreadPoolData' : [ 0xf90, ['pointer', ['void']]],
    'TlsExpansionSlots' : [ 0xf94, ['pointer', ['pointer', ['void']]]],
    'MuiGeneration' : [ 0xf98, ['unsigned long']],
    'IsImpersonating' : [ 0xf9c, ['unsigned long']],
    'NlsCache' : [ 0xfa0, ['pointer', ['void']]],
    'pShimData' : [ 0xfa4, ['pointer', ['void']]],
    'HeapVirtualAffinity' : [ 0xfa8, ['unsigned long']],
    'CurrentTransactionHandle' : [ 0xfac, ['pointer', ['void']]],
    'ActiveFrame' : [ 0xfb0, ['pointer', ['_TEB_ACTIVE_FRAME']]],
    'FlsData' : [ 0xfb4, ['pointer', ['void']]],
    'PreferredLanguages' : [ 0xfb8, ['pointer', ['void']]],
    'UserPrefLanguages' : [ 0xfbc, ['pointer', ['void']]],
    'MergedPrefLanguages' : [ 0xfc0, ['pointer', ['void']]],
    'MuiImpersonation' : [ 0xfc4, ['unsigned long']],
    'CrossTebFlags' : [ 0xfc8, ['unsigned short']],
    'SpareCrossTebBits' : [ 0xfc8, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0xfca, ['unsigned short']],
    'SafeThunkCall' : [ 0xfca, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0xfca, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0xfca, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0xfca, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0xfca, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0xfca, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0xfca, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0xfca, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0xfca, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0xfca, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0xfca, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0xfca, ['BitField', dict(start_bit = 11, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0xfcc, ['pointer', ['void']]],
    'TxnScopeExitCallback' : [ 0xfd0, ['pointer', ['void']]],
    'TxnScopeContext' : [ 0xfd4, ['pointer', ['void']]],
    'LockCount' : [ 0xfd8, ['unsigned long']],
    'SpareUlong0' : [ 0xfdc, ['unsigned long']],
    'ResourceRetValue' : [ 0xfe0, ['pointer', ['void']]],
} ],
  '_LIST_ENTRY' : [ 0x8, {
    'Flink' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'Blink' : [ 0x4, ['pointer', ['_LIST_ENTRY']]],
} ],
  '_SINGLE_LIST_ENTRY' : [ 0x4, {
    'Next' : [ 0x0, ['pointer', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_CONTEXT' : [ 0xc, {
    'ChainHead' : [ 0x0, ['pointer', ['_LIST_ENTRY']]],
    'PrevLinkage' : [ 0x4, ['pointer', ['_LIST_ENTRY']]],
    'Signature' : [ 0x8, ['unsigned long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_ENUMERATOR' : [ 0x14, {
    'HashEntry' : [ 0x0, ['_RTL_DYNAMIC_HASH_TABLE_ENTRY']],
    'ChainHead' : [ 0xc, ['pointer', ['_LIST_ENTRY']]],
    'BucketIndex' : [ 0x10, ['unsigned long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE' : [ 0x24, {
    'Flags' : [ 0x0, ['unsigned long']],
    'Shift' : [ 0x4, ['unsigned long']],
    'TableSize' : [ 0x8, ['unsigned long']],
    'Pivot' : [ 0xc, ['unsigned long']],
    'DivisorMask' : [ 0x10, ['unsigned long']],
    'NumEntries' : [ 0x14, ['unsigned long']],
    'NonEmptyBuckets' : [ 0x18, ['unsigned long']],
    'NumEnumerators' : [ 0x1c, ['unsigned long']],
    'Directory' : [ 0x20, ['pointer', ['void']]],
} ],
  '_UNICODE_STRING' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x4, ['pointer', ['unsigned short']]],
} ],
  '_STRING' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x4, ['pointer', ['unsigned char']]],
} ],
  '_LUID' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_IMAGE_NT_HEADERS' : [ 0xf8, {
    'Signature' : [ 0x0, ['unsigned long']],
    'FileHeader' : [ 0x4, ['_IMAGE_FILE_HEADER']],
    'OptionalHeader' : [ 0x18, ['_IMAGE_OPTIONAL_HEADER']],
} ],
  '_IMAGE_DOS_HEADER' : [ 0x40, {
    'e_magic' : [ 0x0, ['unsigned short']],
    'e_cblp' : [ 0x2, ['unsigned short']],
    'e_cp' : [ 0x4, ['unsigned short']],
    'e_crlc' : [ 0x6, ['unsigned short']],
    'e_cparhdr' : [ 0x8, ['unsigned short']],
    'e_minalloc' : [ 0xa, ['unsigned short']],
    'e_maxalloc' : [ 0xc, ['unsigned short']],
    'e_ss' : [ 0xe, ['unsigned short']],
    'e_sp' : [ 0x10, ['unsigned short']],
    'e_csum' : [ 0x12, ['unsigned short']],
    'e_ip' : [ 0x14, ['unsigned short']],
    'e_cs' : [ 0x16, ['unsigned short']],
    'e_lfarlc' : [ 0x18, ['unsigned short']],
    'e_ovno' : [ 0x1a, ['unsigned short']],
    'e_res' : [ 0x1c, ['array', 4, ['unsigned short']]],
    'e_oemid' : [ 0x24, ['unsigned short']],
    'e_oeminfo' : [ 0x26, ['unsigned short']],
    'e_res2' : [ 0x28, ['array', 10, ['unsigned short']]],
    'e_lfanew' : [ 0x3c, ['long']],
} ],
  '_KPCR' : [ 0x3748, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'Used_ExceptionList' : [ 0x0, ['pointer', ['_EXCEPTION_REGISTRATION_RECORD']]],
    'Used_StackBase' : [ 0x4, ['pointer', ['void']]],
    'Spare2' : [ 0x8, ['pointer', ['void']]],
    'TssCopy' : [ 0xc, ['pointer', ['void']]],
    'ContextSwitches' : [ 0x10, ['unsigned long']],
    'SetMemberCopy' : [ 0x14, ['unsigned long']],
    'Used_Self' : [ 0x18, ['pointer', ['void']]],
    'SelfPcr' : [ 0x1c, ['pointer', ['_KPCR']]],
    'Prcb' : [ 0x20, ['pointer', ['_KPRCB']]],
    'Irql' : [ 0x24, ['unsigned char']],
    'IRR' : [ 0x28, ['unsigned long']],
    'IrrActive' : [ 0x2c, ['unsigned long']],
    'IDR' : [ 0x30, ['unsigned long']],
    'KdVersionBlock' : [ 0x34, ['pointer', ['void']]],
    'IDT' : [ 0x38, ['pointer', ['_KIDTENTRY']]],
    'GDT' : [ 0x3c, ['pointer', ['_KGDTENTRY']]],
    'TSS' : [ 0x40, ['pointer', ['_KTSS']]],
    'MajorVersion' : [ 0x44, ['unsigned short']],
    'MinorVersion' : [ 0x46, ['unsigned short']],
    'SetMember' : [ 0x48, ['unsigned long']],
    'StallScaleFactor' : [ 0x4c, ['unsigned long']],
    'SpareUnused' : [ 0x50, ['unsigned char']],
    'Number' : [ 0x51, ['unsigned char']],
    'Spare0' : [ 0x52, ['unsigned char']],
    'SecondLevelCacheAssociativity' : [ 0x53, ['unsigned char']],
    'VdmAlert' : [ 0x54, ['unsigned long']],
    'KernelReserved' : [ 0x58, ['array', 14, ['unsigned long']]],
    'SecondLevelCacheSize' : [ 0x90, ['unsigned long']],
    'HalReserved' : [ 0x94, ['array', 16, ['unsigned long']]],
    'InterruptMode' : [ 0xd4, ['unsigned long']],
    'Spare1' : [ 0xd8, ['unsigned char']],
    'KernelReserved2' : [ 0xdc, ['array', 17, ['unsigned long']]],
    'PrcbData' : [ 0x120, ['_KPRCB']],
} ],
  '_KPRCB' : [ 0x3628, {
    'MinorVersion' : [ 0x0, ['unsigned short']],
    'MajorVersion' : [ 0x2, ['unsigned short']],
    'CurrentThread' : [ 0x4, ['pointer', ['_KTHREAD']]],
    'NextThread' : [ 0x8, ['pointer', ['_KTHREAD']]],
    'IdleThread' : [ 0xc, ['pointer', ['_KTHREAD']]],
    'LegacyNumber' : [ 0x10, ['unsigned char']],
    'NestingLevel' : [ 0x11, ['unsigned char']],
    'BuildType' : [ 0x12, ['unsigned short']],
    'CpuType' : [ 0x14, ['unsigned char']],
    'CpuID' : [ 0x15, ['unsigned char']],
    'CpuStep' : [ 0x16, ['unsigned short']],
    'CpuStepping' : [ 0x16, ['unsigned char']],
    'CpuModel' : [ 0x17, ['unsigned char']],
    'ProcessorState' : [ 0x18, ['_KPROCESSOR_STATE']],
    'KernelReserved' : [ 0x338, ['array', 16, ['unsigned long']]],
    'HalReserved' : [ 0x378, ['array', 16, ['unsigned long']]],
    'CFlushSize' : [ 0x3b8, ['unsigned long']],
    'CoresPerPhysicalProcessor' : [ 0x3bc, ['unsigned char']],
    'LogicalProcessorsPerCore' : [ 0x3bd, ['unsigned char']],
    'PrcbPad0' : [ 0x3be, ['array', 2, ['unsigned char']]],
    'MHz' : [ 0x3c0, ['unsigned long']],
    'CpuVendor' : [ 0x3c4, ['unsigned char']],
    'GroupIndex' : [ 0x3c5, ['unsigned char']],
    'Group' : [ 0x3c6, ['unsigned short']],
    'GroupSetMember' : [ 0x3c8, ['unsigned long']],
    'Number' : [ 0x3cc, ['unsigned long']],
    'PrcbPad1' : [ 0x3d0, ['array', 72, ['unsigned char']]],
    'LockQueue' : [ 0x418, ['array', 17, ['_KSPIN_LOCK_QUEUE']]],
    'NpxThread' : [ 0x4a0, ['pointer', ['_KTHREAD']]],
    'InterruptCount' : [ 0x4a4, ['unsigned long']],
    'KernelTime' : [ 0x4a8, ['unsigned long']],
    'UserTime' : [ 0x4ac, ['unsigned long']],
    'DpcTime' : [ 0x4b0, ['unsigned long']],
    'DpcTimeCount' : [ 0x4b4, ['unsigned long']],
    'InterruptTime' : [ 0x4b8, ['unsigned long']],
    'AdjustDpcThreshold' : [ 0x4bc, ['unsigned long']],
    'PageColor' : [ 0x4c0, ['unsigned long']],
    'DebuggerSavedIRQL' : [ 0x4c4, ['unsigned char']],
    'NodeColor' : [ 0x4c5, ['unsigned char']],
    'PrcbPad20' : [ 0x4c6, ['array', 2, ['unsigned char']]],
    'NodeShiftedColor' : [ 0x4c8, ['unsigned long']],
    'ParentNode' : [ 0x4cc, ['pointer', ['_KNODE']]],
    'SecondaryColorMask' : [ 0x4d0, ['unsigned long']],
    'DpcTimeLimit' : [ 0x4d4, ['unsigned long']],
    'PrcbPad21' : [ 0x4d8, ['array', 2, ['unsigned long']]],
    'CcFastReadNoWait' : [ 0x4e0, ['unsigned long']],
    'CcFastReadWait' : [ 0x4e4, ['unsigned long']],
    'CcFastReadNotPossible' : [ 0x4e8, ['unsigned long']],
    'CcCopyReadNoWait' : [ 0x4ec, ['unsigned long']],
    'CcCopyReadWait' : [ 0x4f0, ['unsigned long']],
    'CcCopyReadNoWaitMiss' : [ 0x4f4, ['unsigned long']],
    'MmSpinLockOrdering' : [ 0x4f8, ['long']],
    'IoReadOperationCount' : [ 0x4fc, ['long']],
    'IoWriteOperationCount' : [ 0x500, ['long']],
    'IoOtherOperationCount' : [ 0x504, ['long']],
    'IoReadTransferCount' : [ 0x508, ['_LARGE_INTEGER']],
    'IoWriteTransferCount' : [ 0x510, ['_LARGE_INTEGER']],
    'IoOtherTransferCount' : [ 0x518, ['_LARGE_INTEGER']],
    'CcFastMdlReadNoWait' : [ 0x520, ['unsigned long']],
    'CcFastMdlReadWait' : [ 0x524, ['unsigned long']],
    'CcFastMdlReadNotPossible' : [ 0x528, ['unsigned long']],
    'CcMapDataNoWait' : [ 0x52c, ['unsigned long']],
    'CcMapDataWait' : [ 0x530, ['unsigned long']],
    'CcPinMappedDataCount' : [ 0x534, ['unsigned long']],
    'CcPinReadNoWait' : [ 0x538, ['unsigned long']],
    'CcPinReadWait' : [ 0x53c, ['unsigned long']],
    'CcMdlReadNoWait' : [ 0x540, ['unsigned long']],
    'CcMdlReadWait' : [ 0x544, ['unsigned long']],
    'CcLazyWriteHotSpots' : [ 0x548, ['unsigned long']],
    'CcLazyWriteIos' : [ 0x54c, ['unsigned long']],
    'CcLazyWritePages' : [ 0x550, ['unsigned long']],
    'CcDataFlushes' : [ 0x554, ['unsigned long']],
    'CcDataPages' : [ 0x558, ['unsigned long']],
    'CcLostDelayedWrites' : [ 0x55c, ['unsigned long']],
    'CcFastReadResourceMiss' : [ 0x560, ['unsigned long']],
    'CcCopyReadWaitMiss' : [ 0x564, ['unsigned long']],
    'CcFastMdlReadResourceMiss' : [ 0x568, ['unsigned long']],
    'CcMapDataNoWaitMiss' : [ 0x56c, ['unsigned long']],
    'CcMapDataWaitMiss' : [ 0x570, ['unsigned long']],
    'CcPinReadNoWaitMiss' : [ 0x574, ['unsigned long']],
    'CcPinReadWaitMiss' : [ 0x578, ['unsigned long']],
    'CcMdlReadNoWaitMiss' : [ 0x57c, ['unsigned long']],
    'CcMdlReadWaitMiss' : [ 0x580, ['unsigned long']],
    'CcReadAheadIos' : [ 0x584, ['unsigned long']],
    'KeAlignmentFixupCount' : [ 0x588, ['unsigned long']],
    'KeExceptionDispatchCount' : [ 0x58c, ['unsigned long']],
    'KeSystemCalls' : [ 0x590, ['unsigned long']],
    'AvailableTime' : [ 0x594, ['unsigned long']],
    'PrcbPad22' : [ 0x598, ['array', 2, ['unsigned long']]],
    'PPLookasideList' : [ 0x5a0, ['array', 16, ['_PP_LOOKASIDE_LIST']]],
    'PPNPagedLookasideList' : [ 0x620, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PPPagedLookasideList' : [ 0xf20, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PacketBarrier' : [ 0x1820, ['unsigned long']],
    'ReverseStall' : [ 0x1824, ['long']],
    'IpiFrame' : [ 0x1828, ['pointer', ['void']]],
    'PrcbPad3' : [ 0x182c, ['array', 52, ['unsigned char']]],
    'CurrentPacket' : [ 0x1860, ['array', 3, ['pointer', ['void']]]],
    'TargetSet' : [ 0x186c, ['unsigned long']],
    'WorkerRoutine' : [ 0x1870, ['pointer', ['void']]],
    'IpiFrozen' : [ 0x1874, ['unsigned long']],
    'PrcbPad4' : [ 0x1878, ['array', 40, ['unsigned char']]],
    'RequestSummary' : [ 0x18a0, ['unsigned long']],
    'SignalDone' : [ 0x18a4, ['pointer', ['_KPRCB']]],
    'PrcbPad50' : [ 0x18a8, ['array', 56, ['unsigned char']]],
    'DpcData' : [ 0x18e0, ['array', 2, ['_KDPC_DATA']]],
    'DpcStack' : [ 0x1908, ['pointer', ['void']]],
    'MaximumDpcQueueDepth' : [ 0x190c, ['long']],
    'DpcRequestRate' : [ 0x1910, ['unsigned long']],
    'MinimumDpcRate' : [ 0x1914, ['unsigned long']],
    'DpcLastCount' : [ 0x1918, ['unsigned long']],
    'PrcbLock' : [ 0x191c, ['unsigned long']],
    'DpcGate' : [ 0x1920, ['_KGATE']],
    'ThreadDpcEnable' : [ 0x1930, ['unsigned char']],
    'QuantumEnd' : [ 0x1931, ['unsigned char']],
    'DpcRoutineActive' : [ 0x1932, ['unsigned char']],
    'IdleSchedule' : [ 0x1933, ['unsigned char']],
    'DpcRequestSummary' : [ 0x1934, ['long']],
    'DpcRequestSlot' : [ 0x1934, ['array', 2, ['short']]],
    'NormalDpcState' : [ 0x1934, ['short']],
    'DpcThreadActive' : [ 0x1936, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'ThreadDpcState' : [ 0x1936, ['short']],
    'TimerHand' : [ 0x1938, ['unsigned long']],
    'LastTick' : [ 0x193c, ['unsigned long']],
    'MasterOffset' : [ 0x1940, ['long']],
    'PrcbPad41' : [ 0x1944, ['array', 2, ['unsigned long']]],
    'PeriodicCount' : [ 0x194c, ['unsigned long']],
    'PeriodicBias' : [ 0x1950, ['unsigned long']],
    'TickOffset' : [ 0x1958, ['unsigned long long']],
    'TimerTable' : [ 0x1960, ['_KTIMER_TABLE']],
    'CallDpc' : [ 0x31a0, ['_KDPC']],
    'ClockKeepAlive' : [ 0x31c0, ['long']],
    'ClockCheckSlot' : [ 0x31c4, ['unsigned char']],
    'ClockPollCycle' : [ 0x31c5, ['unsigned char']],
    'PrcbPad6' : [ 0x31c6, ['array', 2, ['unsigned char']]],
    'DpcWatchdogPeriod' : [ 0x31c8, ['long']],
    'DpcWatchdogCount' : [ 0x31cc, ['long']],
    'ThreadWatchdogPeriod' : [ 0x31d0, ['long']],
    'ThreadWatchdogCount' : [ 0x31d4, ['long']],
    'KeSpinLockOrdering' : [ 0x31d8, ['long']],
    'PrcbPad70' : [ 0x31dc, ['array', 1, ['unsigned long']]],
    'WaitListHead' : [ 0x31e0, ['_LIST_ENTRY']],
    'WaitLock' : [ 0x31e8, ['unsigned long']],
    'ReadySummary' : [ 0x31ec, ['unsigned long']],
    'QueueIndex' : [ 0x31f0, ['unsigned long']],
    'DeferredReadyListHead' : [ 0x31f4, ['_SINGLE_LIST_ENTRY']],
    'StartCycles' : [ 0x31f8, ['unsigned long long']],
    'CycleTime' : [ 0x3200, ['unsigned long long']],
    'HighCycleTime' : [ 0x3208, ['unsigned long']],
    'PrcbPad71' : [ 0x320c, ['unsigned long']],
    'PrcbPad72' : [ 0x3210, ['array', 2, ['unsigned long long']]],
    'DispatcherReadyListHead' : [ 0x3220, ['array', 32, ['_LIST_ENTRY']]],
    'ChainedInterruptList' : [ 0x3320, ['pointer', ['void']]],
    'LookasideIrpFloat' : [ 0x3324, ['long']],
    'MmPageFaultCount' : [ 0x3328, ['long']],
    'MmCopyOnWriteCount' : [ 0x332c, ['long']],
    'MmTransitionCount' : [ 0x3330, ['long']],
    'MmCacheTransitionCount' : [ 0x3334, ['long']],
    'MmDemandZeroCount' : [ 0x3338, ['long']],
    'MmPageReadCount' : [ 0x333c, ['long']],
    'MmPageReadIoCount' : [ 0x3340, ['long']],
    'MmCacheReadCount' : [ 0x3344, ['long']],
    'MmCacheIoCount' : [ 0x3348, ['long']],
    'MmDirtyPagesWriteCount' : [ 0x334c, ['long']],
    'MmDirtyWriteIoCount' : [ 0x3350, ['long']],
    'MmMappedPagesWriteCount' : [ 0x3354, ['long']],
    'MmMappedWriteIoCount' : [ 0x3358, ['long']],
    'CachedCommit' : [ 0x335c, ['unsigned long']],
    'CachedResidentAvailable' : [ 0x3360, ['unsigned long']],
    'HyperPte' : [ 0x3364, ['pointer', ['void']]],
    'PrcbPad8' : [ 0x3368, ['array', 4, ['unsigned char']]],
    'VendorString' : [ 0x336c, ['array', 13, ['unsigned char']]],
    'InitialApicId' : [ 0x3379, ['unsigned char']],
    'LogicalProcessorsPerPhysicalProcessor' : [ 0x337a, ['unsigned char']],
    'PrcbPad9' : [ 0x337b, ['array', 5, ['unsigned char']]],
    'FeatureBits' : [ 0x3380, ['unsigned long']],
    'UpdateSignature' : [ 0x3388, ['_LARGE_INTEGER']],
    'IsrTime' : [ 0x3390, ['unsigned long long']],
    'RuntimeAccumulation' : [ 0x3398, ['unsigned long long']],
    'PowerState' : [ 0x33a0, ['_PROCESSOR_POWER_STATE']],
    'DpcWatchdogDpc' : [ 0x3468, ['_KDPC']],
    'DpcWatchdogTimer' : [ 0x3488, ['_KTIMER']],
    'WheaInfo' : [ 0x34b0, ['pointer', ['void']]],
    'EtwSupport' : [ 0x34b4, ['pointer', ['void']]],
    'InterruptObjectPool' : [ 0x34b8, ['_SLIST_HEADER']],
    'HypercallPageList' : [ 0x34c0, ['_SLIST_HEADER']],
    'HypercallPageVirtual' : [ 0x34c8, ['pointer', ['void']]],
    'VirtualApicAssist' : [ 0x34cc, ['pointer', ['void']]],
    'StatisticsPage' : [ 0x34d0, ['pointer', ['unsigned long long']]],
    'RateControl' : [ 0x34d4, ['pointer', ['void']]],
    'Cache' : [ 0x34d8, ['array', 5, ['_CACHE_DESCRIPTOR']]],
    'CacheCount' : [ 0x3514, ['unsigned long']],
    'CacheProcessorMask' : [ 0x3518, ['array', 5, ['unsigned long']]],
    'PackageProcessorSet' : [ 0x352c, ['_KAFFINITY_EX']],
    'PrcbPad91' : [ 0x3538, ['array', 1, ['unsigned long']]],
    'CoreProcessorSet' : [ 0x353c, ['unsigned long']],
    'TimerExpirationDpc' : [ 0x3540, ['_KDPC']],
    'SpinLockAcquireCount' : [ 0x3560, ['unsigned long']],
    'SpinLockContentionCount' : [ 0x3564, ['unsigned long']],
    'SpinLockSpinCount' : [ 0x3568, ['unsigned long']],
    'IpiSendRequestBroadcastCount' : [ 0x356c, ['unsigned long']],
    'IpiSendRequestRoutineCount' : [ 0x3570, ['unsigned long']],
    'IpiSendSoftwareInterruptCount' : [ 0x3574, ['unsigned long']],
    'ExInitializeResourceCount' : [ 0x3578, ['unsigned long']],
    'ExReInitializeResourceCount' : [ 0x357c, ['unsigned long']],
    'ExDeleteResourceCount' : [ 0x3580, ['unsigned long']],
    'ExecutiveResourceAcquiresCount' : [ 0x3584, ['unsigned long']],
    'ExecutiveResourceContentionsCount' : [ 0x3588, ['unsigned long']],
    'ExecutiveResourceReleaseExclusiveCount' : [ 0x358c, ['unsigned long']],
    'ExecutiveResourceReleaseSharedCount' : [ 0x3590, ['unsigned long']],
    'ExecutiveResourceConvertsCount' : [ 0x3594, ['unsigned long']],
    'ExAcqResExclusiveAttempts' : [ 0x3598, ['unsigned long']],
    'ExAcqResExclusiveAcquiresExclusive' : [ 0x359c, ['unsigned long']],
    'ExAcqResExclusiveAcquiresExclusiveRecursive' : [ 0x35a0, ['unsigned long']],
    'ExAcqResExclusiveWaits' : [ 0x35a4, ['unsigned long']],
    'ExAcqResExclusiveNotAcquires' : [ 0x35a8, ['unsigned long']],
    'ExAcqResSharedAttempts' : [ 0x35ac, ['unsigned long']],
    'ExAcqResSharedAcquiresExclusive' : [ 0x35b0, ['unsigned long']],
    'ExAcqResSharedAcquiresShared' : [ 0x35b4, ['unsigned long']],
    'ExAcqResSharedAcquiresSharedRecursive' : [ 0x35b8, ['unsigned long']],
    'ExAcqResSharedWaits' : [ 0x35bc, ['unsigned long']],
    'ExAcqResSharedNotAcquires' : [ 0x35c0, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAttempts' : [ 0x35c4, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresExclusive' : [ 0x35c8, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresShared' : [ 0x35cc, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresSharedRecursive' : [ 0x35d0, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveWaits' : [ 0x35d4, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveNotAcquires' : [ 0x35d8, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAttempts' : [ 0x35dc, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresExclusive' : [ 0x35e0, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresShared' : [ 0x35e4, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresSharedRecursive' : [ 0x35e8, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveWaits' : [ 0x35ec, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveNotAcquires' : [ 0x35f0, ['unsigned long']],
    'ExSetResOwnerPointerExclusive' : [ 0x35f4, ['unsigned long']],
    'ExSetResOwnerPointerSharedNew' : [ 0x35f8, ['unsigned long']],
    'ExSetResOwnerPointerSharedOld' : [ 0x35fc, ['unsigned long']],
    'ExTryToAcqExclusiveAttempts' : [ 0x3600, ['unsigned long']],
    'ExTryToAcqExclusiveAcquires' : [ 0x3604, ['unsigned long']],
    'ExBoostExclusiveOwner' : [ 0x3608, ['unsigned long']],
    'ExBoostSharedOwners' : [ 0x360c, ['unsigned long']],
    'ExEtwSynchTrackingNotificationsCount' : [ 0x3610, ['unsigned long']],
    'ExEtwSynchTrackingNotificationsAccountedCount' : [ 0x3614, ['unsigned long']],
    'Context' : [ 0x3618, ['pointer', ['_CONTEXT']]],
    'ContextFlags' : [ 0x361c, ['unsigned long']],
    'ExtendedState' : [ 0x3620, ['pointer', ['_XSAVE_AREA']]],
} ],
  '_KAPC' : [ 0x30, {
    'Type' : [ 0x0, ['unsigned char']],
    'SpareByte0' : [ 0x1, ['unsigned char']],
    'Size' : [ 0x2, ['unsigned char']],
    'SpareByte1' : [ 0x3, ['unsigned char']],
    'SpareLong0' : [ 0x4, ['unsigned long']],
    'Thread' : [ 0x8, ['pointer', ['_KTHREAD']]],
    'ApcListEntry' : [ 0xc, ['_LIST_ENTRY']],
    'KernelRoutine' : [ 0x14, ['pointer', ['void']]],
    'RundownRoutine' : [ 0x18, ['pointer', ['void']]],
    'NormalRoutine' : [ 0x1c, ['pointer', ['void']]],
    'NormalContext' : [ 0x20, ['pointer', ['void']]],
    'SystemArgument1' : [ 0x24, ['pointer', ['void']]],
    'SystemArgument2' : [ 0x28, ['pointer', ['void']]],
    'ApcStateIndex' : [ 0x2c, ['unsigned char']],
    'ApcMode' : [ 0x2d, ['unsigned char']],
    'Inserted' : [ 0x2e, ['unsigned char']],
} ],
  '_KTHREAD' : [ 0x200, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'CycleTime' : [ 0x10, ['unsigned long long']],
    'HighCycleTime' : [ 0x18, ['unsigned long']],
    'QuantumTarget' : [ 0x20, ['unsigned long long']],
    'InitialStack' : [ 0x28, ['pointer', ['void']]],
    'StackLimit' : [ 0x2c, ['pointer', ['void']]],
    'KernelStack' : [ 0x30, ['pointer', ['void']]],
    'ThreadLock' : [ 0x34, ['unsigned long']],
    'WaitRegister' : [ 0x38, ['_KWAIT_STATUS_REGISTER']],
    'Running' : [ 0x39, ['unsigned char']],
    'Alerted' : [ 0x3a, ['array', 2, ['unsigned char']]],
    'KernelStackResident' : [ 0x3c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReadyTransition' : [ 0x3c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessReadyQueue' : [ 0x3c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'WaitNext' : [ 0x3c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'SystemAffinityActive' : [ 0x3c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Alertable' : [ 0x3c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'GdiFlushActive' : [ 0x3c, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'UserStackWalkActive' : [ 0x3c, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ApcInterruptRequest' : [ 0x3c, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'ForceDeferSchedule' : [ 0x3c, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'QuantumEndMigrate' : [ 0x3c, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'UmsDirectedSwitchEnable' : [ 0x3c, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'TimerActive' : [ 0x3c, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'SystemThread' : [ 0x3c, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'Reserved' : [ 0x3c, ['BitField', dict(start_bit = 14, end_bit = 32, native_type='unsigned long')]],
    'MiscFlags' : [ 0x3c, ['long']],
    'ApcState' : [ 0x40, ['_KAPC_STATE']],
    'ApcStateFill' : [ 0x40, ['array', 23, ['unsigned char']]],
    'Priority' : [ 0x57, ['unsigned char']],
    'NextProcessor' : [ 0x58, ['unsigned long']],
    'DeferredProcessor' : [ 0x5c, ['unsigned long']],
    'ApcQueueLock' : [ 0x60, ['unsigned long']],
    'ContextSwitches' : [ 0x64, ['unsigned long']],
    'State' : [ 0x68, ['unsigned char']],
    'NpxState' : [ 0x69, ['unsigned char']],
    'WaitIrql' : [ 0x6a, ['unsigned char']],
    'WaitMode' : [ 0x6b, ['unsigned char']],
    'WaitStatus' : [ 0x6c, ['long']],
    'WaitBlockList' : [ 0x70, ['pointer', ['_KWAIT_BLOCK']]],
    'WaitListEntry' : [ 0x74, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0x74, ['_SINGLE_LIST_ENTRY']],
    'Queue' : [ 0x7c, ['pointer', ['_KQUEUE']]],
    'WaitTime' : [ 0x80, ['unsigned long']],
    'KernelApcDisable' : [ 0x84, ['short']],
    'SpecialApcDisable' : [ 0x86, ['short']],
    'CombinedApcDisable' : [ 0x84, ['unsigned long']],
    'Teb' : [ 0x88, ['pointer', ['void']]],
    'Timer' : [ 0x90, ['_KTIMER']],
    'AutoAlignment' : [ 0xb8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DisableBoost' : [ 0xb8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'EtwStackTraceApc1Inserted' : [ 0xb8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'EtwStackTraceApc2Inserted' : [ 0xb8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'CalloutActive' : [ 0xb8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'ApcQueueable' : [ 0xb8, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'EnableStackSwap' : [ 0xb8, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'GuiThread' : [ 0xb8, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'UmsPerformingSyscall' : [ 0xb8, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'VdmSafe' : [ 0xb8, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'UmsDispatched' : [ 0xb8, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ReservedFlags' : [ 0xb8, ['BitField', dict(start_bit = 11, end_bit = 32, native_type='unsigned long')]],
    'ThreadFlags' : [ 0xb8, ['long']],
    'ServiceTable' : [ 0xbc, ['pointer', ['void']]],
    'WaitBlock' : [ 0xc0, ['array', 4, ['_KWAIT_BLOCK']]],
    'QueueListEntry' : [ 0x120, ['_LIST_ENTRY']],
    'TrapFrame' : [ 0x128, ['pointer', ['_KTRAP_FRAME']]],
    'FirstArgument' : [ 0x12c, ['pointer', ['void']]],
    'CallbackStack' : [ 0x130, ['pointer', ['void']]],
    'CallbackDepth' : [ 0x130, ['unsigned long']],
    'ApcStateIndex' : [ 0x134, ['unsigned char']],
    'BasePriority' : [ 0x135, ['unsigned char']],
    'PriorityDecrement' : [ 0x136, ['unsigned char']],
    'ForegroundBoost' : [ 0x136, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'UnusualBoost' : [ 0x136, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Preempted' : [ 0x137, ['unsigned char']],
    'AdjustReason' : [ 0x138, ['unsigned char']],
    'AdjustIncrement' : [ 0x139, ['unsigned char']],
    'PreviousMode' : [ 0x13a, ['unsigned char']],
    'Saturation' : [ 0x13b, ['unsigned char']],
    'SystemCallNumber' : [ 0x13c, ['unsigned long']],
    'FreezeCount' : [ 0x140, ['unsigned long']],
    'UserAffinity' : [ 0x144, ['_GROUP_AFFINITY']],
    'Process' : [ 0x150, ['pointer', ['_KPROCESS']]],
    'Affinity' : [ 0x154, ['_GROUP_AFFINITY']],
    'IdealProcessor' : [ 0x160, ['unsigned long']],
    'UserIdealProcessor' : [ 0x164, ['unsigned long']],
    'ApcStatePointer' : [ 0x168, ['array', 2, ['pointer', ['_KAPC_STATE']]]],
    'SavedApcState' : [ 0x170, ['_KAPC_STATE']],
    'SavedApcStateFill' : [ 0x170, ['array', 23, ['unsigned char']]],
    'WaitReason' : [ 0x187, ['unsigned char']],
    'SuspendCount' : [ 0x188, ['unsigned char']],
    'Spare1' : [ 0x189, ['unsigned char']],
    'OtherPlatformFill' : [ 0x18a, ['unsigned char']],
    'Win32Thread' : [ 0x18c, ['pointer', ['void']]],
    'StackBase' : [ 0x190, ['pointer', ['void']]],
    'SuspendApc' : [ 0x194, ['_KAPC']],
    'SuspendApcFill0' : [ 0x194, ['array', 1, ['unsigned char']]],
    'ResourceIndex' : [ 0x195, ['unsigned char']],
    'SuspendApcFill1' : [ 0x194, ['array', 3, ['unsigned char']]],
    'QuantumReset' : [ 0x197, ['unsigned char']],
    'SuspendApcFill2' : [ 0x194, ['array', 4, ['unsigned char']]],
    'KernelTime' : [ 0x198, ['unsigned long']],
    'SuspendApcFill3' : [ 0x194, ['array', 36, ['unsigned char']]],
    'WaitPrcb' : [ 0x1b8, ['pointer', ['_KPRCB']]],
    'SuspendApcFill4' : [ 0x194, ['array', 40, ['unsigned char']]],
    'LegoData' : [ 0x1bc, ['pointer', ['void']]],
    'SuspendApcFill5' : [ 0x194, ['array', 47, ['unsigned char']]],
    'LargeStack' : [ 0x1c3, ['unsigned char']],
    'UserTime' : [ 0x1c4, ['unsigned long']],
    'SuspendSemaphore' : [ 0x1c8, ['_KSEMAPHORE']],
    'SuspendSemaphorefill' : [ 0x1c8, ['array', 20, ['unsigned char']]],
    'SListFaultCount' : [ 0x1dc, ['unsigned long']],
    'ThreadListEntry' : [ 0x1e0, ['_LIST_ENTRY']],
    'MutantListHead' : [ 0x1e8, ['_LIST_ENTRY']],
    'SListFaultAddress' : [ 0x1f0, ['pointer', ['void']]],
    'ThreadCounters' : [ 0x1f4, ['pointer', ['_KTHREAD_COUNTERS']]],
    'XStateSave' : [ 0x1f8, ['pointer', ['_XSTATE_SAVE']]],
} ],
  '_KSPIN_LOCK_QUEUE' : [ 0x8, {
    'Next' : [ 0x0, ['pointer', ['_KSPIN_LOCK_QUEUE']]],
    'Lock' : [ 0x4, ['pointer', ['unsigned long']]],
} ],
  '_FAST_MUTEX' : [ 0x20, {
    'Count' : [ 0x0, ['long']],
    'Owner' : [ 0x4, ['pointer', ['_KTHREAD']]],
    'Contention' : [ 0x8, ['unsigned long']],
    'Event' : [ 0xc, ['_KEVENT']],
    'OldIrql' : [ 0x1c, ['unsigned long']],
} ],
  '_KEVENT' : [ 0x10, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
} ],
  '_SLIST_HEADER' : [ 0x8, {
    'Alignment' : [ 0x0, ['unsigned long long']],
    'Next' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x4, ['unsigned short']],
    'Sequence' : [ 0x6, ['unsigned short']],
} ],
  '_LOOKASIDE_LIST_EX' : [ 0x48, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE_POOL']],
} ],
  '_NPAGED_LOOKASIDE_LIST' : [ 0xc0, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
    'Lock__ObsoleteButDoNotDelete' : [ 0x80, ['unsigned long']],
} ],
  '_PAGED_LOOKASIDE_LIST' : [ 0xc0, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
    'Lock__ObsoleteButDoNotDelete' : [ 0x80, ['_FAST_MUTEX']],
} ],
  '_QUAD' : [ 0x8, {
    'UseThisFieldToCopy' : [ 0x0, ['long long']],
    'DoNotUseThisField' : [ 0x0, ['double']],
} ],
  '_IO_STATUS_BLOCK' : [ 0x8, {
    'Status' : [ 0x0, ['long']],
    'Pointer' : [ 0x0, ['pointer', ['void']]],
    'Information' : [ 0x4, ['unsigned long']],
} ],
  '_EX_PUSH_LOCK' : [ 0x4, {
    'Locked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Waiting' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Waking' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'MultipleShared' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Shared' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
    'Value' : [ 0x0, ['unsigned long']],
    'Ptr' : [ 0x0, ['pointer', ['void']]],
} ],
  '_PROCESSOR_NUMBER' : [ 0x4, {
    'Group' : [ 0x0, ['unsigned short']],
    'Number' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
} ],
  '_EX_PUSH_LOCK_CACHE_AWARE' : [ 0x80, {
    'Locks' : [ 0x0, ['array', 32, ['pointer', ['_EX_PUSH_LOCK']]]],
} ],
  '_PP_LOOKASIDE_LIST' : [ 0x8, {
    'P' : [ 0x0, ['pointer', ['_GENERAL_LOOKASIDE']]],
    'L' : [ 0x4, ['pointer', ['_GENERAL_LOOKASIDE']]],
} ],
  '_GENERAL_LOOKASIDE' : [ 0x80, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'SingleListHead' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x8, ['unsigned short']],
    'MaximumDepth' : [ 0xa, ['unsigned short']],
    'TotalAllocates' : [ 0xc, ['unsigned long']],
    'AllocateMisses' : [ 0x10, ['unsigned long']],
    'AllocateHits' : [ 0x10, ['unsigned long']],
    'TotalFrees' : [ 0x14, ['unsigned long']],
    'FreeMisses' : [ 0x18, ['unsigned long']],
    'FreeHits' : [ 0x18, ['unsigned long']],
    'Type' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: 'NonPagedPool', 1: 'PagedPool', 2: 'NonPagedPoolMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolCacheAlignedMustS', 7: 'MaxPoolType', 34: 'NonPagedPoolMustSucceedSession', 35: 'DontUseThisTypeSession', 32: 'NonPagedPoolSession', 36: 'NonPagedPoolCacheAlignedSession', 33: 'PagedPoolSession', 38: 'NonPagedPoolCacheAlignedMustSSession', 37: 'PagedPoolCacheAlignedSession'})]],
    'Tag' : [ 0x20, ['unsigned long']],
    'Size' : [ 0x24, ['unsigned long']],
    'AllocateEx' : [ 0x28, ['pointer', ['void']]],
    'Allocate' : [ 0x28, ['pointer', ['void']]],
    'FreeEx' : [ 0x2c, ['pointer', ['void']]],
    'Free' : [ 0x2c, ['pointer', ['void']]],
    'ListEntry' : [ 0x30, ['_LIST_ENTRY']],
    'LastTotalAllocates' : [ 0x38, ['unsigned long']],
    'LastAllocateMisses' : [ 0x3c, ['unsigned long']],
    'LastAllocateHits' : [ 0x3c, ['unsigned long']],
    'Future' : [ 0x40, ['array', 2, ['unsigned long']]],
} ],
  '_EX_FAST_REF' : [ 0x4, {
    'Object' : [ 0x0, ['pointer', ['void']]],
    'RefCnt' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'Value' : [ 0x0, ['unsigned long']],
} ],
  '_EX_PUSH_LOCK_WAIT_BLOCK' : [ 0x30, {
    'WakeEvent' : [ 0x0, ['_KEVENT']],
    'Next' : [ 0x10, ['pointer', ['_EX_PUSH_LOCK_WAIT_BLOCK']]],
    'Last' : [ 0x14, ['pointer', ['_EX_PUSH_LOCK_WAIT_BLOCK']]],
    'Previous' : [ 0x18, ['pointer', ['_EX_PUSH_LOCK_WAIT_BLOCK']]],
    'ShareCount' : [ 0x1c, ['long']],
    'Flags' : [ 0x20, ['long']],
} ],
  '_ETHREAD' : [ 0x2b8, {
    'Tcb' : [ 0x0, ['_KTHREAD']],
    'CreateTime' : [ 0x200, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0x208, ['_LARGE_INTEGER']],
    'KeyedWaitChain' : [ 0x208, ['_LIST_ENTRY']],
    'ExitStatus' : [ 0x210, ['long']],
    'PostBlockList' : [ 0x214, ['_LIST_ENTRY']],
    'ForwardLinkShadow' : [ 0x214, ['pointer', ['void']]],
    'StartAddress' : [ 0x218, ['pointer', ['void']]],
    'TerminationPort' : [ 0x21c, ['pointer', ['_TERMINATION_PORT']]],
    'ReaperLink' : [ 0x21c, ['pointer', ['_ETHREAD']]],
    'KeyedWaitValue' : [ 0x21c, ['pointer', ['void']]],
    'ActiveTimerListLock' : [ 0x220, ['unsigned long']],
    'ActiveTimerListHead' : [ 0x224, ['_LIST_ENTRY']],
    'Cid' : [ 0x22c, ['_CLIENT_ID']],
    'KeyedWaitSemaphore' : [ 0x234, ['_KSEMAPHORE']],
    'AlpcWaitSemaphore' : [ 0x234, ['_KSEMAPHORE']],
    'ClientSecurity' : [ 0x248, ['_PS_CLIENT_SECURITY_CONTEXT']],
    'IrpList' : [ 0x24c, ['_LIST_ENTRY']],
    'TopLevelIrp' : [ 0x254, ['unsigned long']],
    'DeviceToVerify' : [ 0x258, ['pointer', ['_DEVICE_OBJECT']]],
    'CpuQuotaApc' : [ 0x25c, ['pointer', ['_PSP_CPU_QUOTA_APC']]],
    'Win32StartAddress' : [ 0x260, ['pointer', ['void']]],
    'LegacyPowerObject' : [ 0x264, ['pointer', ['void']]],
    'ThreadListEntry' : [ 0x268, ['_LIST_ENTRY']],
    'RundownProtect' : [ 0x270, ['_EX_RUNDOWN_REF']],
    'ThreadLock' : [ 0x274, ['_EX_PUSH_LOCK']],
    'ReadClusterSize' : [ 0x278, ['unsigned long']],
    'MmLockOrdering' : [ 0x27c, ['long']],
    'CrossThreadFlags' : [ 0x280, ['unsigned long']],
    'Terminated' : [ 0x280, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ThreadInserted' : [ 0x280, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'HideFromDebugger' : [ 0x280, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ActiveImpersonationInfo' : [ 0x280, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Reserved' : [ 0x280, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'HardErrorsAreDisabled' : [ 0x280, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0x280, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'SkipCreationMsg' : [ 0x280, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'SkipTerminationMsg' : [ 0x280, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'CopyTokenOnOpen' : [ 0x280, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'ThreadIoPriority' : [ 0x280, ['BitField', dict(start_bit = 10, end_bit = 13, native_type='unsigned long')]],
    'ThreadPagePriority' : [ 0x280, ['BitField', dict(start_bit = 13, end_bit = 16, native_type='unsigned long')]],
    'RundownFail' : [ 0x280, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'NeedsWorkingSetAging' : [ 0x280, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'SameThreadPassiveFlags' : [ 0x284, ['unsigned long']],
    'ActiveExWorker' : [ 0x284, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ExWorkerCanWaitUser' : [ 0x284, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'MemoryMaker' : [ 0x284, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ClonedThread' : [ 0x284, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'KeyedEventInUse' : [ 0x284, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'RateApcState' : [ 0x284, ['BitField', dict(start_bit = 5, end_bit = 7, native_type='unsigned long')]],
    'SelfTerminate' : [ 0x284, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'SameThreadApcFlags' : [ 0x288, ['unsigned long']],
    'Spare' : [ 0x288, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'StartAddressInvalid' : [ 0x288, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'EtwPageFaultCalloutActive' : [ 0x288, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'OwnsProcessWorkingSetExclusive' : [ 0x288, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'OwnsProcessWorkingSetShared' : [ 0x288, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'OwnsSystemCacheWorkingSetExclusive' : [ 0x288, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'OwnsSystemCacheWorkingSetShared' : [ 0x288, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'OwnsSessionWorkingSetExclusive' : [ 0x288, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'OwnsSessionWorkingSetShared' : [ 0x289, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'OwnsProcessAddressSpaceExclusive' : [ 0x289, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'OwnsProcessAddressSpaceShared' : [ 0x289, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'SuppressSymbolLoad' : [ 0x289, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Prefetching' : [ 0x289, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'OwnsDynamicMemoryShared' : [ 0x289, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'OwnsChangeControlAreaExclusive' : [ 0x289, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'OwnsChangeControlAreaShared' : [ 0x289, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'OwnsPagedPoolWorkingSetExclusive' : [ 0x28a, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'OwnsPagedPoolWorkingSetShared' : [ 0x28a, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'OwnsSystemPtesWorkingSetExclusive' : [ 0x28a, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'OwnsSystemPtesWorkingSetShared' : [ 0x28a, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'TrimTrigger' : [ 0x28a, ['BitField', dict(start_bit = 4, end_bit = 6, native_type='unsigned char')]],
    'Spare1' : [ 0x28a, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'PriorityRegionActive' : [ 0x28b, ['unsigned char']],
    'CacheManagerActive' : [ 0x28c, ['unsigned char']],
    'DisablePageFaultClustering' : [ 0x28d, ['unsigned char']],
    'ActiveFaultCount' : [ 0x28e, ['unsigned char']],
    'LockOrderState' : [ 0x28f, ['unsigned char']],
    'AlpcMessageId' : [ 0x290, ['unsigned long']],
    'AlpcMessage' : [ 0x294, ['pointer', ['void']]],
    'AlpcReceiveAttributeSet' : [ 0x294, ['unsigned long']],
    'AlpcWaitListEntry' : [ 0x298, ['_LIST_ENTRY']],
    'CacheManagerCount' : [ 0x2a0, ['unsigned long']],
    'IoBoostCount' : [ 0x2a4, ['unsigned long']],
    'IrpListLock' : [ 0x2a8, ['unsigned long']],
    'ReservedForSynchTracking' : [ 0x2ac, ['pointer', ['void']]],
    'CmCallbackListHead' : [ 0x2b0, ['_SINGLE_LIST_ENTRY']],
    'KernelStackReference' : [ 0x2b4, ['unsigned long']],
} ],
  '_EPROCESS' : [ 0x2d8, {
    'Pcb' : [ 0x0, ['_KPROCESS']],
    'ProcessLock' : [ 0x98, ['_EX_PUSH_LOCK']],
    'CreateTime' : [ 0xa0, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0xa8, ['_LARGE_INTEGER']],
    'RundownProtect' : [ 0xb0, ['_EX_RUNDOWN_REF']],
    'UniqueProcessId' : [ 0xb4, ['pointer', ['void']]],
    'ActiveProcessLinks' : [ 0xb8, ['_LIST_ENTRY']],
    'ProcessQuotaUsage' : [ 0xc0, ['array', 2, ['unsigned long']]],
    'ProcessQuotaPeak' : [ 0xc8, ['array', 2, ['unsigned long']]],
    'CommitCharge' : [ 0xd0, ['unsigned long']],
    'QuotaBlock' : [ 0xd4, ['pointer', ['_EPROCESS_QUOTA_BLOCK']]],
    'CpuQuotaBlock' : [ 0xd8, ['pointer', ['_PS_CPU_QUOTA_BLOCK']]],
    'PeakVirtualSize' : [ 0xdc, ['unsigned long']],
    'VirtualSize' : [ 0xe0, ['unsigned long']],
    'SessionProcessLinks' : [ 0xe4, ['_LIST_ENTRY']],
    'DebugPort' : [ 0xec, ['pointer', ['void']]],
    'ExceptionPortData' : [ 0xf0, ['pointer', ['void']]],
    'ExceptionPortValue' : [ 0xf0, ['unsigned long']],
    'ExceptionPortState' : [ 0xf0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'ObjectTable' : [ 0xf4, ['pointer', ['_HANDLE_TABLE']]],
    'Token' : [ 0xf8, ['_EX_FAST_REF']],
    'WorkingSetPage' : [ 0xfc, ['unsigned long']],
    'AddressCreationLock' : [ 0x100, ['_EX_PUSH_LOCK']],
    'RotateInProgress' : [ 0x104, ['pointer', ['_ETHREAD']]],
    'ForkInProgress' : [ 0x108, ['pointer', ['_ETHREAD']]],
    'HardwareTrigger' : [ 0x10c, ['unsigned long']],
    'PhysicalVadRoot' : [ 0x110, ['pointer', ['_MM_AVL_TABLE']]],
    'CloneRoot' : [ 0x114, ['pointer', ['void']]],
    'NumberOfPrivatePages' : [ 0x118, ['unsigned long']],
    'NumberOfLockedPages' : [ 0x11c, ['unsigned long']],
    'Win32Process' : [ 0x120, ['pointer', ['void']]],
    'Job' : [ 0x124, ['pointer', ['_EJOB']]],
    'SectionObject' : [ 0x128, ['pointer', ['void']]],
    'SectionBaseAddress' : [ 0x12c, ['pointer', ['void']]],
    'Cookie' : [ 0x130, ['unsigned long']],
    'Spare8' : [ 0x134, ['unsigned long']],
    'WorkingSetWatch' : [ 0x138, ['pointer', ['_PAGEFAULT_HISTORY']]],
    'Win32WindowStation' : [ 0x13c, ['pointer', ['void']]],
    'InheritedFromUniqueProcessId' : [ 0x140, ['pointer', ['void']]],
    'LdtInformation' : [ 0x144, ['pointer', ['void']]],
    'VdmObjects' : [ 0x148, ['pointer', ['void']]],
    'ConsoleHostProcess' : [ 0x14c, ['unsigned long']],
    'DeviceMap' : [ 0x150, ['pointer', ['void']]],
    'EtwDataSource' : [ 0x154, ['pointer', ['void']]],
    'FreeTebHint' : [ 0x158, ['pointer', ['void']]],
    'PageDirectoryPte' : [ 0x160, ['_HARDWARE_PTE']],
    'Filler' : [ 0x160, ['unsigned long long']],
    'Session' : [ 0x168, ['pointer', ['void']]],
    'ImageFileName' : [ 0x16c, ['array', 15, ['unsigned char']]],
    'PriorityClass' : [ 0x17b, ['unsigned char']],
    'JobLinks' : [ 0x17c, ['_LIST_ENTRY']],
    'LockedPagesList' : [ 0x184, ['pointer', ['void']]],
    'ThreadListHead' : [ 0x188, ['_LIST_ENTRY']],
    'SecurityPort' : [ 0x190, ['pointer', ['void']]],
    'PaeTop' : [ 0x194, ['pointer', ['void']]],
    'ActiveThreads' : [ 0x198, ['unsigned long']],
    'ImagePathHash' : [ 0x19c, ['unsigned long']],
    'DefaultHardErrorProcessing' : [ 0x1a0, ['unsigned long']],
    'LastThreadExitStatus' : [ 0x1a4, ['long']],
    'Peb' : [ 0x1a8, ['pointer', ['_PEB']]],
    'PrefetchTrace' : [ 0x1ac, ['_EX_FAST_REF']],
    'ReadOperationCount' : [ 0x1b0, ['_LARGE_INTEGER']],
    'WriteOperationCount' : [ 0x1b8, ['_LARGE_INTEGER']],
    'OtherOperationCount' : [ 0x1c0, ['_LARGE_INTEGER']],
    'ReadTransferCount' : [ 0x1c8, ['_LARGE_INTEGER']],
    'WriteTransferCount' : [ 0x1d0, ['_LARGE_INTEGER']],
    'OtherTransferCount' : [ 0x1d8, ['_LARGE_INTEGER']],
    'CommitChargeLimit' : [ 0x1e0, ['unsigned long']],
    'CommitChargePeak' : [ 0x1e4, ['unsigned long']],
    'AweInfo' : [ 0x1e8, ['pointer', ['void']]],
    'SeAuditProcessCreationInfo' : [ 0x1ec, ['_SE_AUDIT_PROCESS_CREATION_INFO']],
    'Vm' : [ 0x1f0, ['_MMSUPPORT']],
    'MmProcessLinks' : [ 0x25c, ['_LIST_ENTRY']],
    'HighestUserAddress' : [ 0x264, ['pointer', ['void']]],
    'ModifiedPageCount' : [ 0x268, ['unsigned long']],
    'Flags2' : [ 0x26c, ['unsigned long']],
    'JobNotReallyActive' : [ 0x26c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AccountingFolded' : [ 0x26c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'NewProcessReported' : [ 0x26c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ExitProcessReported' : [ 0x26c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ReportCommitChanges' : [ 0x26c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'LastReportMemory' : [ 0x26c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ReportPhysicalPageChanges' : [ 0x26c, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'HandleTableRundown' : [ 0x26c, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'NeedsHandleRundown' : [ 0x26c, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'RefTraceEnabled' : [ 0x26c, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'NumaAware' : [ 0x26c, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ProtectedProcess' : [ 0x26c, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DefaultPagePriority' : [ 0x26c, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
    'PrimaryTokenFrozen' : [ 0x26c, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessVerifierTarget' : [ 0x26c, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'StackRandomizationDisabled' : [ 0x26c, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'AffinityPermanent' : [ 0x26c, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'AffinityUpdateEnable' : [ 0x26c, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'PropagateNode' : [ 0x26c, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'ExplicitAffinity' : [ 0x26c, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'Spare1' : [ 0x26c, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'ForceRelocateImages' : [ 0x26c, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'DisallowStrippedImages' : [ 0x26c, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'LowVaAccessible' : [ 0x26c, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'Flags' : [ 0x270, ['unsigned long']],
    'CreateReported' : [ 0x270, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'NoDebugInherit' : [ 0x270, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessExiting' : [ 0x270, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ProcessDelete' : [ 0x270, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Wow64SplitPages' : [ 0x270, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'VmDeleted' : [ 0x270, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'OutswapEnabled' : [ 0x270, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Outswapped' : [ 0x270, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ForkFailed' : [ 0x270, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Wow64VaSpace4Gb' : [ 0x270, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'AddressSpaceInitialized' : [ 0x270, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
    'SetTimerResolution' : [ 0x270, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0x270, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'DeprioritizeViews' : [ 0x270, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'WriteWatch' : [ 0x270, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessInSession' : [ 0x270, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'OverrideAddressSpace' : [ 0x270, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HasAddressSpace' : [ 0x270, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'LaunchPrefetched' : [ 0x270, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'InjectInpageErrors' : [ 0x270, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'VmTopDown' : [ 0x270, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ImageNotifyDone' : [ 0x270, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'PdeUpdateNeeded' : [ 0x270, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'VdmAllowed' : [ 0x270, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'CrossSessionCreate' : [ 0x270, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'ProcessInserted' : [ 0x270, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'DefaultIoPriority' : [ 0x270, ['BitField', dict(start_bit = 27, end_bit = 30, native_type='unsigned long')]],
    'ProcessSelfDelete' : [ 0x270, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'SetTimerResolutionLink' : [ 0x270, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'ExitStatus' : [ 0x274, ['long']],
    'VadRoot' : [ 0x278, ['_MM_AVL_TABLE']],
    'AlpcContext' : [ 0x298, ['_ALPC_PROCESS_CONTEXT']],
    'TimerResolutionLink' : [ 0x2a8, ['_LIST_ENTRY']],
    'RequestedTimerResolution' : [ 0x2b0, ['unsigned long']],
    'ActiveThreadsHighWatermark' : [ 0x2b4, ['unsigned long']],
    'SmallestTimerResolution' : [ 0x2b8, ['unsigned long']],
    'TimerResolutionStackRecord' : [ 0x2bc, ['pointer', ['_PO_DIAG_STACK_RECORD']]],
    'SequenceNumber' : [ 0x2c0, ['unsigned long long']],
    'CreateInterruptTime' : [ 0x2c8, ['unsigned long long']],
    'CreateUnbiasedInterruptTime' : [ 0x2d0, ['unsigned long long']],
} ],
  '_KPROCESS' : [ 0x98, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'ProfileListHead' : [ 0x10, ['_LIST_ENTRY']],
    'DirectoryTableBase' : [ 0x18, ['unsigned long']],
    'LdtDescriptor' : [ 0x1c, ['_KGDTENTRY']],
    'Int21Descriptor' : [ 0x24, ['_KIDTENTRY']],
    'ThreadListHead' : [ 0x2c, ['_LIST_ENTRY']],
    'ProcessLock' : [ 0x34, ['unsigned long']],
    'Affinity' : [ 0x38, ['_KAFFINITY_EX']],
    'ReadyListHead' : [ 0x44, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0x4c, ['_SINGLE_LIST_ENTRY']],
    'ActiveProcessors' : [ 0x50, ['_KAFFINITY_EX']],
    'AutoAlignment' : [ 0x5c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='long')]],
    'DisableBoost' : [ 0x5c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='long')]],
    'DisableQuantum' : [ 0x5c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='long')]],
    'ActiveGroupsMask' : [ 0x5c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ReservedFlags' : [ 0x5c, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='long')]],
    'ProcessFlags' : [ 0x5c, ['long']],
    'BasePriority' : [ 0x60, ['unsigned char']],
    'QuantumReset' : [ 0x61, ['unsigned char']],
    'Visited' : [ 0x62, ['unsigned char']],
    'Unused3' : [ 0x63, ['unsigned char']],
    'ThreadSeed' : [ 0x64, ['array', 1, ['unsigned long']]],
    'IdealNode' : [ 0x68, ['array', 1, ['unsigned short']]],
    'IdealGlobalNode' : [ 0x6a, ['unsigned short']],
    'Flags' : [ 0x6c, ['_KEXECUTE_OPTIONS']],
    'Unused1' : [ 0x6d, ['unsigned char']],
    'IopmOffset' : [ 0x6e, ['unsigned short']],
    'Unused4' : [ 0x70, ['unsigned long']],
    'StackCount' : [ 0x74, ['_KSTACK_COUNT']],
    'ProcessListEntry' : [ 0x78, ['_LIST_ENTRY']],
    'CycleTime' : [ 0x80, ['unsigned long long']],
    'KernelTime' : [ 0x88, ['unsigned long']],
    'UserTime' : [ 0x8c, ['unsigned long']],
    'VdmTrapcHandler' : [ 0x90, ['pointer', ['void']]],
} ],
  '__unnamed_1292' : [ 0x2c, {
    'InitialPrivilegeSet' : [ 0x0, ['_INITIAL_PRIVILEGE_SET']],
    'PrivilegeSet' : [ 0x0, ['_PRIVILEGE_SET']],
} ],
  '_ACCESS_STATE' : [ 0x74, {
    'OperationID' : [ 0x0, ['_LUID']],
    'SecurityEvaluated' : [ 0x8, ['unsigned char']],
    'GenerateAudit' : [ 0x9, ['unsigned char']],
    'GenerateOnClose' : [ 0xa, ['unsigned char']],
    'PrivilegesAllocated' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['unsigned long']],
    'RemainingDesiredAccess' : [ 0x10, ['unsigned long']],
    'PreviouslyGrantedAccess' : [ 0x14, ['unsigned long']],
    'OriginalDesiredAccess' : [ 0x18, ['unsigned long']],
    'SubjectSecurityContext' : [ 0x1c, ['_SECURITY_SUBJECT_CONTEXT']],
    'SecurityDescriptor' : [ 0x2c, ['pointer', ['void']]],
    'AuxData' : [ 0x30, ['pointer', ['void']]],
    'Privileges' : [ 0x34, ['__unnamed_1292']],
    'AuditPrivileges' : [ 0x60, ['unsigned char']],
    'ObjectName' : [ 0x64, ['_UNICODE_STRING']],
    'ObjectTypeName' : [ 0x6c, ['_UNICODE_STRING']],
} ],
  '_AUX_ACCESS_DATA' : [ 0xc0, {
    'PrivilegesUsed' : [ 0x0, ['pointer', ['_PRIVILEGE_SET']]],
    'GenericMapping' : [ 0x4, ['_GENERIC_MAPPING']],
    'AccessesToAudit' : [ 0x14, ['unsigned long']],
    'MaximumAuditMask' : [ 0x18, ['unsigned long']],
    'TransactionId' : [ 0x1c, ['_GUID']],
    'NewSecurityDescriptor' : [ 0x2c, ['pointer', ['void']]],
    'ExistingSecurityDescriptor' : [ 0x30, ['pointer', ['void']]],
    'ParentSecurityDescriptor' : [ 0x34, ['pointer', ['void']]],
    'DeRefSecurityDescriptor' : [ 0x38, ['pointer', ['void']]],
    'SDLock' : [ 0x3c, ['pointer', ['void']]],
    'AccessReasons' : [ 0x40, ['_ACCESS_REASONS']],
} ],
  '__unnamed_12a1' : [ 0x4, {
    'MasterIrp' : [ 0x0, ['pointer', ['_IRP']]],
    'IrpCount' : [ 0x0, ['long']],
    'SystemBuffer' : [ 0x0, ['pointer', ['void']]],
} ],
  '__unnamed_12a6' : [ 0x8, {
    'UserApcRoutine' : [ 0x0, ['pointer', ['void']]],
    'IssuingProcess' : [ 0x0, ['pointer', ['void']]],
    'UserApcContext' : [ 0x4, ['pointer', ['void']]],
} ],
  '__unnamed_12a8' : [ 0x8, {
    'AsynchronousParameters' : [ 0x0, ['__unnamed_12a6']],
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
} ],
  '__unnamed_12b3' : [ 0x28, {
    'DeviceQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DriverContext' : [ 0x0, ['array', 4, ['pointer', ['void']]]],
    'Thread' : [ 0x10, ['pointer', ['_ETHREAD']]],
    'AuxiliaryBuffer' : [ 0x14, ['pointer', ['unsigned char']]],
    'ListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'CurrentStackLocation' : [ 0x20, ['pointer', ['_IO_STACK_LOCATION']]],
    'PacketType' : [ 0x20, ['unsigned long']],
    'OriginalFileObject' : [ 0x24, ['pointer', ['_FILE_OBJECT']]],
} ],
  '__unnamed_12b5' : [ 0x30, {
    'Overlay' : [ 0x0, ['__unnamed_12b3']],
    'Apc' : [ 0x0, ['_KAPC']],
    'CompletionKey' : [ 0x0, ['pointer', ['void']]],
} ],
  '_IRP' : [ 0x70, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'MdlAddress' : [ 0x4, ['pointer', ['_MDL']]],
    'Flags' : [ 0x8, ['unsigned long']],
    'AssociatedIrp' : [ 0xc, ['__unnamed_12a1']],
    'ThreadListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'IoStatus' : [ 0x18, ['_IO_STATUS_BLOCK']],
    'RequestorMode' : [ 0x20, ['unsigned char']],
    'PendingReturned' : [ 0x21, ['unsigned char']],
    'StackCount' : [ 0x22, ['unsigned char']],
    'CurrentLocation' : [ 0x23, ['unsigned char']],
    'Cancel' : [ 0x24, ['unsigned char']],
    'CancelIrql' : [ 0x25, ['unsigned char']],
    'ApcEnvironment' : [ 0x26, ['unsigned char']],
    'AllocationFlags' : [ 0x27, ['unsigned char']],
    'UserIosb' : [ 0x28, ['pointer', ['_IO_STATUS_BLOCK']]],
    'UserEvent' : [ 0x2c, ['pointer', ['_KEVENT']]],
    'Overlay' : [ 0x30, ['__unnamed_12a8']],
    'CancelRoutine' : [ 0x38, ['pointer', ['void']]],
    'UserBuffer' : [ 0x3c, ['pointer', ['void']]],
    'Tail' : [ 0x40, ['__unnamed_12b5']],
} ],
  '__unnamed_12bc' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['pointer', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x4, ['unsigned long']],
    'FileAttributes' : [ 0x8, ['unsigned short']],
    'ShareAccess' : [ 0xa, ['unsigned short']],
    'EaLength' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_12c0' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['pointer', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned short']],
    'ShareAccess' : [ 0xa, ['unsigned short']],
    'Parameters' : [ 0xc, ['pointer', ['_NAMED_PIPE_CREATE_PARAMETERS']]],
} ],
  '__unnamed_12c4' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['pointer', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['unsigned short']],
    'ShareAccess' : [ 0xa, ['unsigned short']],
    'Parameters' : [ 0xc, ['pointer', ['_MAILSLOT_CREATE_PARAMETERS']]],
} ],
  '__unnamed_12c6' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'Key' : [ 0x4, ['unsigned long']],
    'ByteOffset' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '__unnamed_12ca' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileName' : [ 0x4, ['pointer', ['_UNICODE_STRING']]],
    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileIsRemoteDeviceInformation', 52: 'FileAttributeCacheInformation', 53: 'FileNumaNodeInformation', 54: 'FileStandardLinkInformation', 55: 'FileRemoteProtocolInformation', 56: 'FileMaximumInformation'})]],
    'FileIndex' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_12cc' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
    'CompletionFilter' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_12ce' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileIsRemoteDeviceInformation', 52: 'FileAttributeCacheInformation', 53: 'FileNumaNodeInformation', 54: 'FileStandardLinkInformation', 55: 'FileRemoteProtocolInformation', 56: 'FileMaximumInformation'})]],
} ],
  '__unnamed_12d0' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileIsRemoteDeviceInformation', 52: 'FileAttributeCacheInformation', 53: 'FileNumaNodeInformation', 54: 'FileStandardLinkInformation', 55: 'FileRemoteProtocolInformation', 56: 'FileMaximumInformation'})]],
    'FileObject' : [ 0x8, ['pointer', ['_FILE_OBJECT']]],
    'ReplaceIfExists' : [ 0xc, ['unsigned char']],
    'AdvanceOnly' : [ 0xd, ['unsigned char']],
    'ClusterCount' : [ 0xc, ['unsigned long']],
    'DeleteHandle' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_12d2' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'EaList' : [ 0x4, ['pointer', ['void']]],
    'EaListLength' : [ 0x8, ['unsigned long']],
    'EaIndex' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_12d4' : [ 0x4, {
    'Length' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_12d8' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned long']],
    'FsInformationClass' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {1: 'FileFsVolumeInformation', 2: 'FileFsLabelInformation', 3: 'FileFsSizeInformation', 4: 'FileFsDeviceInformation', 5: 'FileFsAttributeInformation', 6: 'FileFsControlInformation', 7: 'FileFsFullSizeInformation', 8: 'FileFsObjectIdInformation', 9: 'FileFsDriverPathInformation', 10: 'FileFsVolumeFlagsInformation', 11: 'FileFsSectorSizeInformation', 12: 'FileFsMaximumInformation'})]],
} ],
  '__unnamed_12da' : [ 0x10, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x4, ['unsigned long']],
    'FsControlCode' : [ 0x8, ['unsigned long']],
    'Type3InputBuffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_12dd' : [ 0x10, {
    'Length' : [ 0x0, ['pointer', ['_LARGE_INTEGER']]],
    'Key' : [ 0x4, ['unsigned long']],
    'ByteOffset' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '__unnamed_12df' : [ 0x10, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x4, ['unsigned long']],
    'IoControlCode' : [ 0x8, ['unsigned long']],
    'Type3InputBuffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_12e1' : [ 0x8, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_12e3' : [ 0x8, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'SecurityDescriptor' : [ 0x4, ['pointer', ['void']]],
} ],
  '__unnamed_12e7' : [ 0x8, {
    'Vpb' : [ 0x0, ['pointer', ['_VPB']]],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
} ],
  '__unnamed_12eb' : [ 0x4, {
    'Srb' : [ 0x0, ['pointer', ['_SCSI_REQUEST_BLOCK']]],
} ],
  '__unnamed_12ef' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'StartSid' : [ 0x4, ['pointer', ['void']]],
    'SidList' : [ 0x8, ['pointer', ['_FILE_GET_QUOTA_INFORMATION']]],
    'SidListLength' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_12f3' : [ 0x4, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'BusRelations', 1: 'EjectionRelations', 2: 'PowerRelations', 3: 'RemovalRelations', 4: 'TargetDeviceRelation', 5: 'SingleBusRelations', 6: 'TransportRelations'})]],
} ],
  '__unnamed_12f9' : [ 0x10, {
    'InterfaceType' : [ 0x0, ['pointer', ['_GUID']]],
    'Size' : [ 0x4, ['unsigned short']],
    'Version' : [ 0x6, ['unsigned short']],
    'Interface' : [ 0x8, ['pointer', ['_INTERFACE']]],
    'InterfaceSpecificData' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_12fd' : [ 0x4, {
    'Capabilities' : [ 0x0, ['pointer', ['_DEVICE_CAPABILITIES']]],
} ],
  '__unnamed_1301' : [ 0x4, {
    'IoResourceRequirementList' : [ 0x0, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
} ],
  '__unnamed_1303' : [ 0x10, {
    'WhichSpace' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x4, ['pointer', ['void']]],
    'Offset' : [ 0x8, ['unsigned long']],
    'Length' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_1305' : [ 0x1, {
    'Lock' : [ 0x0, ['unsigned char']],
} ],
  '__unnamed_1309' : [ 0x4, {
    'IdType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'BusQueryDeviceID', 1: 'BusQueryHardwareIDs', 2: 'BusQueryCompatibleIDs', 3: 'BusQueryInstanceID', 4: 'BusQueryDeviceSerialNumber', 5: 'BusQueryContainerID'})]],
} ],
  '__unnamed_130d' : [ 0x8, {
    'DeviceTextType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'DeviceTextDescription', 1: 'DeviceTextLocationInformation'})]],
    'LocaleId' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_1311' : [ 0x8, {
    'InPath' : [ 0x0, ['unsigned char']],
    'Reserved' : [ 0x1, ['array', 3, ['unsigned char']]],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'DeviceUsageTypeUndefined', 1: 'DeviceUsageTypePaging', 2: 'DeviceUsageTypeHibernation', 3: 'DeviceUsageTypeDumpFile'})]],
} ],
  '__unnamed_1315' : [ 0x4, {
    'PowerState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
} ],
  '__unnamed_1319' : [ 0x4, {
    'PowerSequence' : [ 0x0, ['pointer', ['_POWER_SEQUENCE']]],
} ],
  '__unnamed_1321' : [ 0x10, {
    'SystemContext' : [ 0x0, ['unsigned long']],
    'SystemPowerStateContext' : [ 0x0, ['_SYSTEM_POWER_STATE_CONTEXT']],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'SystemPowerState', 1: 'DevicePowerState'})]],
    'State' : [ 0x8, ['_POWER_STATE']],
    'ShutdownType' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: 'PowerActionNone', 1: 'PowerActionReserved', 2: 'PowerActionSleep', 3: 'PowerActionHibernate', 4: 'PowerActionShutdown', 5: 'PowerActionShutdownReset', 6: 'PowerActionShutdownOff', 7: 'PowerActionWarmEject'})]],
} ],
  '__unnamed_1325' : [ 0x8, {
    'AllocatedResources' : [ 0x0, ['pointer', ['_CM_RESOURCE_LIST']]],
    'AllocatedResourcesTranslated' : [ 0x4, ['pointer', ['_CM_RESOURCE_LIST']]],
} ],
  '__unnamed_1327' : [ 0x10, {
    'ProviderId' : [ 0x0, ['unsigned long']],
    'DataPath' : [ 0x4, ['pointer', ['void']]],
    'BufferSize' : [ 0x8, ['unsigned long']],
    'Buffer' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_1329' : [ 0x10, {
    'Argument1' : [ 0x0, ['pointer', ['void']]],
    'Argument2' : [ 0x4, ['pointer', ['void']]],
    'Argument3' : [ 0x8, ['pointer', ['void']]],
    'Argument4' : [ 0xc, ['pointer', ['void']]],
} ],
  '__unnamed_132b' : [ 0x10, {
    'Create' : [ 0x0, ['__unnamed_12bc']],
    'CreatePipe' : [ 0x0, ['__unnamed_12c0']],
    'CreateMailslot' : [ 0x0, ['__unnamed_12c4']],
    'Read' : [ 0x0, ['__unnamed_12c6']],
    'Write' : [ 0x0, ['__unnamed_12c6']],
    'QueryDirectory' : [ 0x0, ['__unnamed_12ca']],
    'NotifyDirectory' : [ 0x0, ['__unnamed_12cc']],
    'QueryFile' : [ 0x0, ['__unnamed_12ce']],
    'SetFile' : [ 0x0, ['__unnamed_12d0']],
    'QueryEa' : [ 0x0, ['__unnamed_12d2']],
    'SetEa' : [ 0x0, ['__unnamed_12d4']],
    'QueryVolume' : [ 0x0, ['__unnamed_12d8']],
    'SetVolume' : [ 0x0, ['__unnamed_12d8']],
    'FileSystemControl' : [ 0x0, ['__unnamed_12da']],
    'LockControl' : [ 0x0, ['__unnamed_12dd']],
    'DeviceIoControl' : [ 0x0, ['__unnamed_12df']],
    'QuerySecurity' : [ 0x0, ['__unnamed_12e1']],
    'SetSecurity' : [ 0x0, ['__unnamed_12e3']],
    'MountVolume' : [ 0x0, ['__unnamed_12e7']],
    'VerifyVolume' : [ 0x0, ['__unnamed_12e7']],
    'Scsi' : [ 0x0, ['__unnamed_12eb']],
    'QueryQuota' : [ 0x0, ['__unnamed_12ef']],
    'SetQuota' : [ 0x0, ['__unnamed_12d4']],
    'QueryDeviceRelations' : [ 0x0, ['__unnamed_12f3']],
    'QueryInterface' : [ 0x0, ['__unnamed_12f9']],
    'DeviceCapabilities' : [ 0x0, ['__unnamed_12fd']],
    'FilterResourceRequirements' : [ 0x0, ['__unnamed_1301']],
    'ReadWriteConfig' : [ 0x0, ['__unnamed_1303']],
    'SetLock' : [ 0x0, ['__unnamed_1305']],
    'QueryId' : [ 0x0, ['__unnamed_1309']],
    'QueryDeviceText' : [ 0x0, ['__unnamed_130d']],
    'UsageNotification' : [ 0x0, ['__unnamed_1311']],
    'WaitWake' : [ 0x0, ['__unnamed_1315']],
    'PowerSequence' : [ 0x0, ['__unnamed_1319']],
    'Power' : [ 0x0, ['__unnamed_1321']],
    'StartDevice' : [ 0x0, ['__unnamed_1325']],
    'WMI' : [ 0x0, ['__unnamed_1327']],
    'Others' : [ 0x0, ['__unnamed_1329']],
} ],
  '_IO_STACK_LOCATION' : [ 0x24, {
    'MajorFunction' : [ 0x0, ['unsigned char']],
    'MinorFunction' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned char']],
    'Control' : [ 0x3, ['unsigned char']],
    'Parameters' : [ 0x4, ['__unnamed_132b']],
    'DeviceObject' : [ 0x14, ['pointer', ['_DEVICE_OBJECT']]],
    'FileObject' : [ 0x18, ['pointer', ['_FILE_OBJECT']]],
    'CompletionRoutine' : [ 0x1c, ['pointer', ['void']]],
    'Context' : [ 0x20, ['pointer', ['void']]],
} ],
  '__unnamed_1341' : [ 0x28, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Wcb' : [ 0x0, ['_WAIT_CONTEXT_BLOCK']],
} ],
  '_DEVICE_OBJECT' : [ 0xb8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'ReferenceCount' : [ 0x4, ['long']],
    'DriverObject' : [ 0x8, ['pointer', ['_DRIVER_OBJECT']]],
    'NextDevice' : [ 0xc, ['pointer', ['_DEVICE_OBJECT']]],
    'AttachedDevice' : [ 0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'CurrentIrp' : [ 0x14, ['pointer', ['_IRP']]],
    'Timer' : [ 0x18, ['pointer', ['_IO_TIMER']]],
    'Flags' : [ 0x1c, ['unsigned long']],
    'Characteristics' : [ 0x20, ['unsigned long']],
    'Vpb' : [ 0x24, ['pointer', ['_VPB']]],
    'DeviceExtension' : [ 0x28, ['pointer', ['void']]],
    'DeviceType' : [ 0x2c, ['unsigned long']],
    'StackSize' : [ 0x30, ['unsigned char']],
    'Queue' : [ 0x34, ['__unnamed_1341']],
    'AlignmentRequirement' : [ 0x5c, ['unsigned long']],
    'DeviceQueue' : [ 0x60, ['_KDEVICE_QUEUE']],
    'Dpc' : [ 0x74, ['_KDPC']],
    'ActiveThreadCount' : [ 0x94, ['unsigned long']],
    'SecurityDescriptor' : [ 0x98, ['pointer', ['void']]],
    'DeviceLock' : [ 0x9c, ['_KEVENT']],
    'SectorSize' : [ 0xac, ['unsigned short']],
    'Spare1' : [ 0xae, ['unsigned short']],
    'DeviceObjectExtension' : [ 0xb0, ['pointer', ['_DEVOBJ_EXTENSION']]],
    'Reserved' : [ 0xb4, ['pointer', ['void']]],
} ],
  '_KDPC' : [ 0x20, {
    'Type' : [ 0x0, ['unsigned char']],
    'Importance' : [ 0x1, ['unsigned char']],
    'Number' : [ 0x2, ['unsigned short']],
    'DpcListEntry' : [ 0x4, ['_LIST_ENTRY']],
    'DeferredRoutine' : [ 0xc, ['pointer', ['void']]],
    'DeferredContext' : [ 0x10, ['pointer', ['void']]],
    'SystemArgument1' : [ 0x14, ['pointer', ['void']]],
    'SystemArgument2' : [ 0x18, ['pointer', ['void']]],
    'DpcData' : [ 0x1c, ['pointer', ['void']]],
} ],
  '_IO_DRIVER_CREATE_CONTEXT' : [ 0x10, {
    'Size' : [ 0x0, ['short']],
    'ExtraCreateParameter' : [ 0x4, ['pointer', ['_ECP_LIST']]],
    'DeviceObjectHint' : [ 0x8, ['pointer', ['void']]],
    'TxnParameters' : [ 0xc, ['pointer', ['_TXN_PARAMETER_BLOCK']]],
} ],
  '_IO_PRIORITY_INFO' : [ 0x10, {
    'Size' : [ 0x0, ['unsigned long']],
    'ThreadPriority' : [ 0x4, ['unsigned long']],
    'PagePriority' : [ 0x8, ['unsigned long']],
    'IoPriority' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: 'IoPriorityVeryLow', 1: 'IoPriorityLow', 2: 'IoPriorityNormal', 3: 'IoPriorityHigh', 4: 'IoPriorityCritical', 5: 'MaxIoPriorityTypes'})]],
} ],
  '_OBJECT_ATTRIBUTES' : [ 0x18, {
    'Length' : [ 0x0, ['unsigned long']],
    'RootDirectory' : [ 0x4, ['pointer', ['void']]],
    'ObjectName' : [ 0x8, ['pointer', ['_UNICODE_STRING']]],
    'Attributes' : [ 0xc, ['unsigned long']],
    'SecurityDescriptor' : [ 0x10, ['pointer', ['void']]],
    'SecurityQualityOfService' : [ 0x14, ['pointer', ['void']]],
} ],
  '_OBJECT_HANDLE_INFORMATION' : [ 0x8, {
    'HandleAttributes' : [ 0x0, ['unsigned long']],
    'GrantedAccess' : [ 0x4, ['unsigned long']],
} ],
  '_EVENT_DATA_DESCRIPTOR' : [ 0x10, {
    'Ptr' : [ 0x0, ['unsigned long long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned char']],
    'Reserved1' : [ 0xd, ['unsigned char']],
    'Reserved2' : [ 0xe, ['unsigned short']],
} ],
  '_EVENT_DESCRIPTOR' : [ 0x10, {
    'Id' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned char']],
    'Channel' : [ 0x3, ['unsigned char']],
    'Level' : [ 0x4, ['unsigned char']],
    'Opcode' : [ 0x5, ['unsigned char']],
    'Task' : [ 0x6, ['unsigned short']],
    'Keyword' : [ 0x8, ['unsigned long long']],
} ],
  '_PERFINFO_GROUPMASK' : [ 0x20, {
    'Masks' : [ 0x0, ['array', 8, ['unsigned long']]],
} ],
  '_FILE_OBJECT' : [ 0x80, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
    'Vpb' : [ 0x8, ['pointer', ['_VPB']]],
    'FsContext' : [ 0xc, ['pointer', ['void']]],
    'FsContext2' : [ 0x10, ['pointer', ['void']]],
    'SectionObjectPointer' : [ 0x14, ['pointer', ['_SECTION_OBJECT_POINTERS']]],
    'PrivateCacheMap' : [ 0x18, ['pointer', ['void']]],
    'FinalStatus' : [ 0x1c, ['long']],
    'RelatedFileObject' : [ 0x20, ['pointer', ['_FILE_OBJECT']]],
    'LockOperation' : [ 0x24, ['unsigned char']],
    'DeletePending' : [ 0x25, ['unsigned char']],
    'ReadAccess' : [ 0x26, ['unsigned char']],
    'WriteAccess' : [ 0x27, ['unsigned char']],
    'DeleteAccess' : [ 0x28, ['unsigned char']],
    'SharedRead' : [ 0x29, ['unsigned char']],
    'SharedWrite' : [ 0x2a, ['unsigned char']],
    'SharedDelete' : [ 0x2b, ['unsigned char']],
    'Flags' : [ 0x2c, ['unsigned long']],
    'FileName' : [ 0x30, ['_UNICODE_STRING']],
    'CurrentByteOffset' : [ 0x38, ['_LARGE_INTEGER']],
    'Waiters' : [ 0x40, ['unsigned long']],
    'Busy' : [ 0x44, ['unsigned long']],
    'LastLock' : [ 0x48, ['pointer', ['void']]],
    'Lock' : [ 0x4c, ['_KEVENT']],
    'Event' : [ 0x5c, ['_KEVENT']],
    'CompletionContext' : [ 0x6c, ['pointer', ['_IO_COMPLETION_CONTEXT']]],
    'IrpListLock' : [ 0x70, ['unsigned long']],
    'IrpList' : [ 0x74, ['_LIST_ENTRY']],
    'FileObjectExtension' : [ 0x7c, ['pointer', ['void']]],
} ],
  '_EX_RUNDOWN_REF' : [ 0x4, {
    'Count' : [ 0x0, ['unsigned long']],
    'Ptr' : [ 0x0, ['pointer', ['void']]],
} ],
  '_MM_PAGE_ACCESS_INFO_HEADER' : [ 0x38, {
    'Link' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'MmPteAccessType', 1: 'MmCcReadAheadType', 2: 'MmPfnRepurposeType', 3: 'MmMaximumPageAccessType'})]],
    'EmptySequenceNumber' : [ 0x8, ['unsigned long']],
    'CurrentFileIndex' : [ 0x8, ['unsigned long']],
    'CreateTime' : [ 0x10, ['unsigned long long']],
    'EmptyTime' : [ 0x18, ['unsigned long long']],
    'TempEntry' : [ 0x18, ['pointer', ['_MM_PAGE_ACCESS_INFO']]],
    'PageEntry' : [ 0x20, ['pointer', ['_MM_PAGE_ACCESS_INFO']]],
    'FileEntry' : [ 0x24, ['pointer', ['unsigned long']]],
    'FirstFileEntry' : [ 0x28, ['pointer', ['unsigned long']]],
    'Process' : [ 0x2c, ['pointer', ['_EPROCESS']]],
    'SessionId' : [ 0x30, ['unsigned long']],
    'PageFrameEntry' : [ 0x20, ['pointer', ['unsigned long']]],
    'LastPageFrameEntry' : [ 0x24, ['pointer', ['unsigned long']]],
} ],
  '_WHEA_ERROR_PACKET_V2' : [ 0x50, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'Length' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_PACKET_FLAGS']],
    'ErrorType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrTypeProcessor', 1: 'WheaErrTypeMemory', 2: 'WheaErrTypePCIExpress', 3: 'WheaErrTypeNMI', 4: 'WheaErrTypePCIXBus', 5: 'WheaErrTypePCIXDevice', 6: 'WheaErrTypeGeneric'})]],
    'ErrorSeverity' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSevRecoverable', 1: 'WheaErrSevFatal', 2: 'WheaErrSevCorrected', 3: 'WheaErrSevInformational'})]],
    'ErrorSourceId' : [ 0x18, ['unsigned long']],
    'ErrorSourceType' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSrcTypeMCE', 1: 'WheaErrSrcTypeCMC', 2: 'WheaErrSrcTypeCPE', 3: 'WheaErrSrcTypeNMI', 4: 'WheaErrSrcTypePCIe', 5: 'WheaErrSrcTypeGeneric', 6: 'WheaErrSrcTypeINIT', 7: 'WheaErrSrcTypeBOOT', 8: 'WheaErrSrcTypeSCIGeneric', 9: 'WheaErrSrcTypeIPFMCA', 10: 'WheaErrSrcTypeIPFCMC', 11: 'WheaErrSrcTypeIPFCPE', 12: 'WheaErrSrcTypeMax'})]],
    'NotifyType' : [ 0x20, ['_GUID']],
    'Context' : [ 0x30, ['unsigned long long']],
    'DataFormat' : [ 0x38, ['Enumeration', dict(target = 'long', choices = {0: 'WheaDataFormatIPFSalRecord', 1: 'WheaDataFormatXPFMCA', 2: 'WheaDataFormatMemory', 3: 'WheaDataFormatPCIExpress', 4: 'WheaDataFormatNMIPort', 5: 'WheaDataFormatPCIXBus', 6: 'WheaDataFormatPCIXDevice', 7: 'WheaDataFormatGeneric', 8: 'WheaDataFormatMax'})]],
    'Reserved1' : [ 0x3c, ['unsigned long']],
    'DataOffset' : [ 0x40, ['unsigned long']],
    'DataLength' : [ 0x44, ['unsigned long']],
    'PshedDataOffset' : [ 0x48, ['unsigned long']],
    'PshedDataLength' : [ 0x4c, ['unsigned long']],
} ],
  '_WHEA_ERROR_RECORD' : [ 0xc8, {
    'Header' : [ 0x0, ['_WHEA_ERROR_RECORD_HEADER']],
    'SectionDescriptor' : [ 0x80, ['array', 1, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR']]],
} ],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR' : [ 0x48, {
    'SectionOffset' : [ 0x0, ['unsigned long']],
    'SectionLength' : [ 0x4, ['unsigned long']],
    'Revision' : [ 0x8, ['_WHEA_REVISION']],
    'ValidBits' : [ 0xa, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS']],
    'Reserved' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS']],
    'SectionType' : [ 0x10, ['_GUID']],
    'FRUId' : [ 0x20, ['_GUID']],
    'SectionSeverity' : [ 0x30, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSevRecoverable', 1: 'WheaErrSevFatal', 2: 'WheaErrSevCorrected', 3: 'WheaErrSevInformational'})]],
    'FRUText' : [ 0x34, ['array', 20, ['unsigned char']]],
} ],
  '_GUID' : [ 0x10, {
    'Data1' : [ 0x0, ['unsigned long']],
    'Data2' : [ 0x4, ['unsigned short']],
    'Data3' : [ 0x6, ['unsigned short']],
    'Data4' : [ 0x8, ['array', 8, ['unsigned char']]],
} ],
  '_FSRTL_ADVANCED_FCB_HEADER' : [ 0x40, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'Flags' : [ 0x4, ['unsigned char']],
    'IsFastIoPossible' : [ 0x5, ['unsigned char']],
    'Flags2' : [ 0x6, ['unsigned char']],
    'Reserved' : [ 0x7, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'Version' : [ 0x7, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Resource' : [ 0x8, ['pointer', ['_ERESOURCE']]],
    'PagingIoResource' : [ 0xc, ['pointer', ['_ERESOURCE']]],
    'AllocationSize' : [ 0x10, ['_LARGE_INTEGER']],
    'FileSize' : [ 0x18, ['_LARGE_INTEGER']],
    'ValidDataLength' : [ 0x20, ['_LARGE_INTEGER']],
    'FastMutex' : [ 0x28, ['pointer', ['_FAST_MUTEX']]],
    'FilterContexts' : [ 0x2c, ['_LIST_ENTRY']],
    'PushLock' : [ 0x34, ['_EX_PUSH_LOCK']],
    'FileContextSupportPointer' : [ 0x38, ['pointer', ['pointer', ['void']]]],
} ],
  '_iobuf' : [ 0x20, {
    '_ptr' : [ 0x0, ['pointer', ['unsigned char']]],
    '_cnt' : [ 0x4, ['long']],
    '_base' : [ 0x8, ['pointer', ['unsigned char']]],
    '_flag' : [ 0xc, ['long']],
    '_file' : [ 0x10, ['long']],
    '_charbuf' : [ 0x14, ['long']],
    '_bufsiz' : [ 0x18, ['long']],
    '_tmpfname' : [ 0x1c, ['pointer', ['unsigned char']]],
} ],
  '__unnamed_14ae' : [ 0x4, {
    'Long' : [ 0x0, ['unsigned long']],
    'VolatileLong' : [ 0x0, ['unsigned long']],
    'Flush' : [ 0x0, ['_HARDWARE_PTE']],
    'Hard' : [ 0x0, ['_MMPTE_HARDWARE']],
    'Proto' : [ 0x0, ['_MMPTE_PROTOTYPE']],
    'Soft' : [ 0x0, ['_MMPTE_SOFTWARE']],
    'TimeStamp' : [ 0x0, ['_MMPTE_TIMESTAMP']],
    'Trans' : [ 0x0, ['_MMPTE_TRANSITION']],
    'Subsect' : [ 0x0, ['_MMPTE_SUBSECTION']],
    'List' : [ 0x0, ['_MMPTE_LIST']],
} ],
  '_MMPTE' : [ 0x4, {
    'u' : [ 0x0, ['__unnamed_14ae']],
} ],
  '__unnamed_14bf' : [ 0xc, {
    'I386' : [ 0x0, ['_I386_LOADER_BLOCK']],
    'Ia64' : [ 0x0, ['_IA64_LOADER_BLOCK']],
} ],
  '_LOADER_PARAMETER_BLOCK' : [ 0x88, {
    'OsMajorVersion' : [ 0x0, ['unsigned long']],
    'OsMinorVersion' : [ 0x4, ['unsigned long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'LoadOrderListHead' : [ 0x10, ['_LIST_ENTRY']],
    'MemoryDescriptorListHead' : [ 0x18, ['_LIST_ENTRY']],
    'BootDriverListHead' : [ 0x20, ['_LIST_ENTRY']],
    'KernelStack' : [ 0x28, ['unsigned long']],
    'Prcb' : [ 0x2c, ['unsigned long']],
    'Process' : [ 0x30, ['unsigned long']],
    'Thread' : [ 0x34, ['unsigned long']],
    'RegistryLength' : [ 0x38, ['unsigned long']],
    'RegistryBase' : [ 0x3c, ['pointer', ['void']]],
    'ConfigurationRoot' : [ 0x40, ['pointer', ['_CONFIGURATION_COMPONENT_DATA']]],
    'ArcBootDeviceName' : [ 0x44, ['pointer', ['unsigned char']]],
    'ArcHalDeviceName' : [ 0x48, ['pointer', ['unsigned char']]],
    'NtBootPathName' : [ 0x4c, ['pointer', ['unsigned char']]],
    'NtHalPathName' : [ 0x50, ['pointer', ['unsigned char']]],
    'LoadOptions' : [ 0x54, ['pointer', ['unsigned char']]],
    'NlsData' : [ 0x58, ['pointer', ['_NLS_DATA_BLOCK']]],
    'ArcDiskInformation' : [ 0x5c, ['pointer', ['_ARC_DISK_INFORMATION']]],
    'OemFontFile' : [ 0x60, ['pointer', ['void']]],
    'Extension' : [ 0x64, ['pointer', ['_LOADER_PARAMETER_EXTENSION']]],
    'u' : [ 0x68, ['__unnamed_14bf']],
    'FirmwareInformation' : [ 0x74, ['_FIRMWARE_INFORMATION_LOADER_BLOCK']],
} ],
  '_KLOCK_QUEUE_HANDLE' : [ 0xc, {
    'LockQueue' : [ 0x0, ['_KSPIN_LOCK_QUEUE']],
    'OldIrql' : [ 0x8, ['unsigned char']],
} ],
  '_MMPFNLIST' : [ 0x14, {
    'Total' : [ 0x0, ['unsigned long']],
    'ListName' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'ZeroedPageList', 1: 'FreePageList', 2: 'StandbyPageList', 3: 'ModifiedPageList', 4: 'ModifiedNoWritePageList', 5: 'BadPageList', 6: 'ActiveAndValid', 7: 'TransitionPage'})]],
    'Flink' : [ 0x8, ['unsigned long']],
    'Blink' : [ 0xc, ['unsigned long']],
    'Lock' : [ 0x10, ['unsigned long']],
} ],
  '__unnamed_14f0' : [ 0x4, {
    'Flink' : [ 0x0, ['unsigned long']],
    'WsIndex' : [ 0x0, ['unsigned long']],
    'Event' : [ 0x0, ['pointer', ['_KEVENT']]],
    'Next' : [ 0x0, ['pointer', ['void']]],
    'VolatileNext' : [ 0x0, ['pointer', ['void']]],
    'KernelStackOwner' : [ 0x0, ['pointer', ['_KTHREAD']]],
    'NextStackPfn' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
} ],
  '__unnamed_14f2' : [ 0x4, {
    'Blink' : [ 0x0, ['unsigned long']],
    'ImageProtoPte' : [ 0x0, ['pointer', ['_MMPTE']]],
    'ShareCount' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_14f5' : [ 0x4, {
    'ReferenceCount' : [ 0x0, ['unsigned short']],
    'VolatileReferenceCount' : [ 0x0, ['short']],
    'ShortFlags' : [ 0x2, ['unsigned short']],
} ],
  '__unnamed_14f7' : [ 0x4, {
    'ReferenceCount' : [ 0x0, ['unsigned short']],
    'e1' : [ 0x2, ['_MMPFNENTRY']],
    'e2' : [ 0x0, ['__unnamed_14f5']],
} ],
  '__unnamed_14fc' : [ 0x4, {
    'PteFrame' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 25, native_type='unsigned long')]],
    'PfnImageVerified' : [ 0x0, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'AweAllocation' : [ 0x0, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'PrototypePte' : [ 0x0, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'PageColor' : [ 0x0, ['BitField', dict(start_bit = 28, end_bit = 32, native_type='unsigned long')]],
} ],
  '_MMPFN' : [ 0x18, {
    'u1' : [ 0x0, ['__unnamed_14f0']],
    'u2' : [ 0x4, ['__unnamed_14f2']],
    'PteAddress' : [ 0x8, ['pointer', ['_MMPTE']]],
    'VolatilePteAddress' : [ 0x8, ['pointer', ['void']]],
    'Lock' : [ 0x8, ['long']],
    'PteLong' : [ 0x8, ['unsigned long']],
    'u3' : [ 0xc, ['__unnamed_14f7']],
    'OriginalPte' : [ 0x10, ['_MMPTE']],
    'AweReferenceCount' : [ 0x10, ['long']],
    'u4' : [ 0x14, ['__unnamed_14fc']],
} ],
  '_MI_COLOR_BASE' : [ 0x8, {
    'ColorPointer' : [ 0x0, ['pointer', ['unsigned short']]],
    'ColorMask' : [ 0x4, ['unsigned short']],
    'ColorNode' : [ 0x6, ['unsigned short']],
} ],
  '_MMSUPPORT' : [ 0x6c, {
    'WorkingSetMutex' : [ 0x0, ['_EX_PUSH_LOCK']],
    'ExitGate' : [ 0x4, ['pointer', ['_KGATE']]],
    'AccessLog' : [ 0x8, ['pointer', ['void']]],
    'WorkingSetExpansionLinks' : [ 0xc, ['_LIST_ENTRY']],
    'AgeDistribution' : [ 0x14, ['array', 7, ['unsigned long']]],
    'MinimumWorkingSetSize' : [ 0x30, ['unsigned long']],
    'WorkingSetSize' : [ 0x34, ['unsigned long']],
    'WorkingSetPrivateSize' : [ 0x38, ['unsigned long']],
    'MaximumWorkingSetSize' : [ 0x3c, ['unsigned long']],
    'ChargedWslePages' : [ 0x40, ['unsigned long']],
    'ActualWslePages' : [ 0x44, ['unsigned long']],
    'WorkingSetSizeOverhead' : [ 0x48, ['unsigned long']],
    'PeakWorkingSetSize' : [ 0x4c, ['unsigned long']],
    'HardFaultCount' : [ 0x50, ['unsigned long']],
    'VmWorkingSetList' : [ 0x54, ['pointer', ['_MMWSL']]],
    'NextPageColor' : [ 0x58, ['unsigned short']],
    'LastTrimStamp' : [ 0x5a, ['unsigned short']],
    'PageFaultCount' : [ 0x5c, ['unsigned long']],
    'RepurposeCount' : [ 0x60, ['unsigned long']],
    'Spare' : [ 0x64, ['array', 1, ['unsigned long']]],
    'Flags' : [ 0x68, ['_MMSUPPORT_FLAGS']],
} ],
  '_MMWSL' : [ 0x6a8, {
    'FirstFree' : [ 0x0, ['unsigned long']],
    'FirstDynamic' : [ 0x4, ['unsigned long']],
    'LastEntry' : [ 0x8, ['unsigned long']],
    'NextSlot' : [ 0xc, ['unsigned long']],
    'Wsle' : [ 0x10, ['pointer', ['_MMWSLE']]],
    'LowestPagableAddress' : [ 0x14, ['pointer', ['void']]],
    'LastInitializedWsle' : [ 0x18, ['unsigned long']],
    'NextAgingSlot' : [ 0x1c, ['unsigned long']],
    'NumberOfCommittedPageTables' : [ 0x20, ['unsigned long']],
    'VadBitMapHint' : [ 0x24, ['unsigned long']],
    'NonDirectCount' : [ 0x28, ['unsigned long']],
    'LastVadBit' : [ 0x2c, ['unsigned long']],
    'MaximumLastVadBit' : [ 0x30, ['unsigned long']],
    'LastAllocationSizeHint' : [ 0x34, ['unsigned long']],
    'LastAllocationSize' : [ 0x38, ['unsigned long']],
    'NonDirectHash' : [ 0x3c, ['pointer', ['_MMWSLE_NONDIRECT_HASH']]],
    'HashTableStart' : [ 0x40, ['pointer', ['_MMWSLE_HASH']]],
    'HighestPermittedHashAddress' : [ 0x44, ['pointer', ['_MMWSLE_HASH']]],
    'UsedPageTableEntries' : [ 0x48, ['array', 768, ['unsigned short']]],
    'CommittedPageTables' : [ 0x648, ['array', 24, ['unsigned long']]],
} ],
  '__unnamed_152c' : [ 0x4, {
    'VirtualAddress' : [ 0x0, ['pointer', ['void']]],
    'Long' : [ 0x0, ['unsigned long']],
    'e1' : [ 0x0, ['_MMWSLENTRY']],
    'e2' : [ 0x0, ['_MMWSLE_FREE_ENTRY']],
} ],
  '_MMWSLE' : [ 0x4, {
    'u1' : [ 0x0, ['__unnamed_152c']],
} ],
  '__unnamed_1538' : [ 0x4, {
    'LongFlags' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x0, ['_MMSECTION_FLAGS']],
} ],
  '__unnamed_1542' : [ 0xc, {
    'NumberOfSystemCacheViews' : [ 0x0, ['unsigned long']],
    'ImageRelocationStartBit' : [ 0x0, ['unsigned long']],
    'WritableUserReferences' : [ 0x4, ['long']],
    'ImageRelocationSizeIn64k' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'Unused' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 30, native_type='unsigned long')]],
    'BitMap64' : [ 0x4, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'ImageActive' : [ 0x4, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'SubsectionRoot' : [ 0x8, ['pointer', ['_MM_SUBSECTION_AVL_TABLE']]],
    'SeImageStub' : [ 0x8, ['pointer', ['_MI_IMAGE_SECURITY_REFERENCE']]],
} ],
  '__unnamed_1544' : [ 0xc, {
    'e2' : [ 0x0, ['__unnamed_1542']],
} ],
  '_CONTROL_AREA' : [ 0x50, {
    'Segment' : [ 0x0, ['pointer', ['_SEGMENT']]],
    'DereferenceList' : [ 0x4, ['_LIST_ENTRY']],
    'NumberOfSectionReferences' : [ 0xc, ['unsigned long']],
    'NumberOfPfnReferences' : [ 0x10, ['unsigned long']],
    'NumberOfMappedViews' : [ 0x14, ['unsigned long']],
    'NumberOfUserReferences' : [ 0x18, ['unsigned long']],
    'u' : [ 0x1c, ['__unnamed_1538']],
    'FlushInProgressCount' : [ 0x20, ['unsigned long']],
    'FilePointer' : [ 0x24, ['_EX_FAST_REF']],
    'ControlAreaLock' : [ 0x28, ['long']],
    'ModifiedWriteCount' : [ 0x2c, ['unsigned long']],
    'StartingFrame' : [ 0x2c, ['unsigned long']],
    'WaitList' : [ 0x30, ['pointer', ['_MI_CONTROL_AREA_WAIT_BLOCK']]],
    'u2' : [ 0x34, ['__unnamed_1544']],
    'LockedPages' : [ 0x40, ['unsigned long long']],
    'ViewList' : [ 0x48, ['_LIST_ENTRY']],
} ],
  '_MM_STORE_KEY' : [ 0x4, {
    'KeyLow' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 28, native_type='unsigned long')]],
    'KeyHigh' : [ 0x0, ['BitField', dict(start_bit = 28, end_bit = 32, native_type='unsigned long')]],
    'EntireKey' : [ 0x0, ['unsigned long']],
} ],
  '_MMPAGING_FILE' : [ 0x50, {
    'Size' : [ 0x0, ['unsigned long']],
    'MaximumSize' : [ 0x4, ['unsigned long']],
    'MinimumSize' : [ 0x8, ['unsigned long']],
    'FreeSpace' : [ 0xc, ['unsigned long']],
    'PeakUsage' : [ 0x10, ['unsigned long']],
    'HighestPage' : [ 0x14, ['unsigned long']],
    'File' : [ 0x18, ['pointer', ['_FILE_OBJECT']]],
    'Entry' : [ 0x1c, ['array', 2, ['pointer', ['_MMMOD_WRITER_MDL_ENTRY']]]],
    'PageFileName' : [ 0x24, ['_UNICODE_STRING']],
    'Bitmap' : [ 0x2c, ['pointer', ['_RTL_BITMAP']]],
    'EvictStoreBitmap' : [ 0x30, ['pointer', ['_RTL_BITMAP']]],
    'BitmapHint' : [ 0x34, ['unsigned long']],
    'LastAllocationSize' : [ 0x38, ['unsigned long']],
    'ToBeEvictedCount' : [ 0x3c, ['unsigned long']],
    'PageFileNumber' : [ 0x40, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned short')]],
    'BootPartition' : [ 0x40, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'Spare0' : [ 0x40, ['BitField', dict(start_bit = 5, end_bit = 16, native_type='unsigned short')]],
    'AdriftMdls' : [ 0x42, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'Spare1' : [ 0x42, ['BitField', dict(start_bit = 1, end_bit = 16, native_type='unsigned short')]],
    'FileHandle' : [ 0x44, ['pointer', ['void']]],
    'Lock' : [ 0x48, ['unsigned long']],
    'LockOwner' : [ 0x4c, ['pointer', ['_ETHREAD']]],
} ],
  '_RTL_BITMAP' : [ 0x8, {
    'SizeOfBitMap' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x4, ['pointer', ['unsigned long']]],
} ],
  '_MM_AVL_TABLE' : [ 0x20, {
    'BalancedRoot' : [ 0x0, ['_MMADDRESS_NODE']],
    'DepthOfTree' : [ 0x14, ['BitField', dict(start_bit = 0, end_bit = 5, native_type='unsigned long')]],
    'Unused' : [ 0x14, ['BitField', dict(start_bit = 5, end_bit = 8, native_type='unsigned long')]],
    'NumberGenericTableElements' : [ 0x14, ['BitField', dict(start_bit = 8, end_bit = 32, native_type='unsigned long')]],
    'NodeHint' : [ 0x18, ['pointer', ['void']]],
    'NodeFreeHint' : [ 0x1c, ['pointer', ['void']]],
} ],
  '__unnamed_1584' : [ 0x4, {
    'Balance' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='long')]],
    'Parent' : [ 0x0, ['pointer', ['_MMVAD']]],
} ],
  '__unnamed_1587' : [ 0x4, {
    'LongFlags' : [ 0x0, ['unsigned long']],
    'VadFlags' : [ 0x0, ['_MMVAD_FLAGS']],
} ],
  '__unnamed_158a' : [ 0x4, {
    'LongFlags3' : [ 0x0, ['unsigned long']],
    'VadFlags3' : [ 0x0, ['_MMVAD_FLAGS3']],
} ],
  '_MMVAD_SHORT' : [ 0x20, {
    'u1' : [ 0x0, ['__unnamed_1584']],
    'LeftChild' : [ 0x4, ['pointer', ['_MMVAD']]],
    'RightChild' : [ 0x8, ['pointer', ['_MMVAD']]],
    'StartingVpn' : [ 0xc, ['unsigned long']],
    'EndingVpn' : [ 0x10, ['unsigned long']],
    'u' : [ 0x14, ['__unnamed_1587']],
    'PushLock' : [ 0x18, ['_EX_PUSH_LOCK']],
    'u5' : [ 0x1c, ['__unnamed_158a']],
} ],
  '__unnamed_1592' : [ 0x4, {
    'Balance' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='long')]],
    'Parent' : [ 0x0, ['pointer', ['_MMADDRESS_NODE']]],
} ],
  '_MMADDRESS_NODE' : [ 0x14, {
    'u1' : [ 0x0, ['__unnamed_1592']],
    'LeftChild' : [ 0x4, ['pointer', ['_MMADDRESS_NODE']]],
    'RightChild' : [ 0x8, ['pointer', ['_MMADDRESS_NODE']]],
    'StartingVpn' : [ 0xc, ['unsigned long']],
    'EndingVpn' : [ 0x10, ['unsigned long']],
} ],
  '__unnamed_1597' : [ 0x4, {
    'LongFlags2' : [ 0x0, ['unsigned long']],
    'VadFlags2' : [ 0x0, ['_MMVAD_FLAGS2']],
} ],
  '_MMVAD' : [ 0x3c, {
    'u1' : [ 0x0, ['__unnamed_1584']],
    'LeftChild' : [ 0x4, ['pointer', ['_MMVAD']]],
    'RightChild' : [ 0x8, ['pointer', ['_MMVAD']]],
    'StartingVpn' : [ 0xc, ['unsigned long']],
    'EndingVpn' : [ 0x10, ['unsigned long']],
    'u' : [ 0x14, ['__unnamed_1587']],
    'PushLock' : [ 0x18, ['_EX_PUSH_LOCK']],
    'u5' : [ 0x1c, ['__unnamed_158a']],
    'u2' : [ 0x20, ['__unnamed_1597']],
    'Subsection' : [ 0x24, ['pointer', ['_SUBSECTION']]],
    'MappedSubsection' : [ 0x24, ['pointer', ['_MSUBSECTION']]],
    'FirstPrototypePte' : [ 0x28, ['pointer', ['_MMPTE']]],
    'LastContiguousPte' : [ 0x2c, ['pointer', ['_MMPTE']]],
    'ViewLinks' : [ 0x30, ['_LIST_ENTRY']],
    'VadsProcess' : [ 0x38, ['pointer', ['_EPROCESS']]],
} ],
  '__unnamed_15a2' : [ 0x20, {
    'Mdl' : [ 0x0, ['_MDL']],
    'Page' : [ 0x1c, ['array', 1, ['unsigned long']]],
} ],
  '_MI_PAGEFILE_TRACES' : [ 0x40, {
    'Status' : [ 0x0, ['long']],
    'Priority' : [ 0x4, ['unsigned char']],
    'IrpPriority' : [ 0x5, ['unsigned char']],
    'CurrentTime' : [ 0x8, ['_LARGE_INTEGER']],
    'AvailablePages' : [ 0x10, ['unsigned long']],
    'ModifiedPagesTotal' : [ 0x14, ['unsigned long']],
    'ModifiedPagefilePages' : [ 0x18, ['unsigned long']],
    'ModifiedNoWritePages' : [ 0x1c, ['unsigned long']],
    'MdlHack' : [ 0x20, ['__unnamed_15a2']],
} ],
  '__unnamed_15a8' : [ 0x8, {
    'IoStatus' : [ 0x0, ['_IO_STATUS_BLOCK']],
} ],
  '__unnamed_15aa' : [ 0x4, {
    'KeepForever' : [ 0x0, ['unsigned long']],
} ],
  '_MMMOD_WRITER_MDL_ENTRY' : [ 0x60, {
    'Links' : [ 0x0, ['_LIST_ENTRY']],
    'u' : [ 0x8, ['__unnamed_15a8']],
    'Irp' : [ 0x10, ['pointer', ['_IRP']]],
    'u1' : [ 0x14, ['__unnamed_15aa']],
    'PagingFile' : [ 0x18, ['pointer', ['_MMPAGING_FILE']]],
    'File' : [ 0x1c, ['pointer', ['_FILE_OBJECT']]],
    'ControlArea' : [ 0x20, ['pointer', ['_CONTROL_AREA']]],
    'FileResource' : [ 0x24, ['pointer', ['_ERESOURCE']]],
    'WriteOffset' : [ 0x28, ['_LARGE_INTEGER']],
    'IssueTime' : [ 0x30, ['_LARGE_INTEGER']],
    'PointerMdl' : [ 0x38, ['pointer', ['_MDL']]],
    'Mdl' : [ 0x3c, ['_MDL']],
    'Page' : [ 0x58, ['array', 1, ['unsigned long']]],
} ],
  '_MDL' : [ 0x1c, {
    'Next' : [ 0x0, ['pointer', ['_MDL']]],
    'Size' : [ 0x4, ['short']],
    'MdlFlags' : [ 0x6, ['short']],
    'Process' : [ 0x8, ['pointer', ['_EPROCESS']]],
    'MappedSystemVa' : [ 0xc, ['pointer', ['void']]],
    'StartVa' : [ 0x10, ['pointer', ['void']]],
    'ByteCount' : [ 0x14, ['unsigned long']],
    'ByteOffset' : [ 0x18, ['unsigned long']],
} ],
  '_HHIVE' : [ 0x2ec, {
    'Signature' : [ 0x0, ['unsigned long']],
    'GetCellRoutine' : [ 0x4, ['pointer', ['void']]],
    'ReleaseCellRoutine' : [ 0x8, ['pointer', ['void']]],
    'Allocate' : [ 0xc, ['pointer', ['void']]],
    'Free' : [ 0x10, ['pointer', ['void']]],
    'FileSetSize' : [ 0x14, ['pointer', ['void']]],
    'FileWrite' : [ 0x18, ['pointer', ['void']]],
    'FileRead' : [ 0x1c, ['pointer', ['void']]],
    'FileFlush' : [ 0x20, ['pointer', ['void']]],
    'HiveLoadFailure' : [ 0x24, ['pointer', ['void']]],
    'BaseBlock' : [ 0x28, ['pointer', ['_HBASE_BLOCK']]],
    'DirtyVector' : [ 0x2c, ['_RTL_BITMAP']],
    'DirtyCount' : [ 0x34, ['unsigned long']],
    'DirtyAlloc' : [ 0x38, ['unsigned long']],
    'BaseBlockAlloc' : [ 0x3c, ['unsigned long']],
    'Cluster' : [ 0x40, ['unsigned long']],
    'Flat' : [ 0x44, ['unsigned char']],
    'ReadOnly' : [ 0x45, ['unsigned char']],
    'DirtyFlag' : [ 0x46, ['unsigned char']],
    'HvBinHeadersUse' : [ 0x48, ['unsigned long']],
    'HvFreeCellsUse' : [ 0x4c, ['unsigned long']],
    'HvUsedCellsUse' : [ 0x50, ['unsigned long']],
    'CmUsedCellsUse' : [ 0x54, ['unsigned long']],
    'HiveFlags' : [ 0x58, ['unsigned long']],
    'CurrentLog' : [ 0x5c, ['unsigned long']],
    'LogSize' : [ 0x60, ['array', 2, ['unsigned long']]],
    'RefreshCount' : [ 0x68, ['unsigned long']],
    'StorageTypeCount' : [ 0x6c, ['unsigned long']],
    'Version' : [ 0x70, ['unsigned long']],
    'Storage' : [ 0x74, ['array', 2, ['_DUAL']]],
} ],
  '_CM_VIEW_OF_FILE' : [ 0x30, {
    'MappedViewLinks' : [ 0x0, ['_LIST_ENTRY']],
    'PinnedViewLinks' : [ 0x8, ['_LIST_ENTRY']],
    'FlushedViewLinks' : [ 0x10, ['_LIST_ENTRY']],
    'CmHive' : [ 0x18, ['pointer', ['_CMHIVE']]],
    'Bcb' : [ 0x1c, ['pointer', ['void']]],
    'ViewAddress' : [ 0x20, ['pointer', ['void']]],
    'FileOffset' : [ 0x24, ['unsigned long']],
    'Size' : [ 0x28, ['unsigned long']],
    'UseCount' : [ 0x2c, ['unsigned long']],
} ],
  '_CMHIVE' : [ 0x638, {
    'Hive' : [ 0x0, ['_HHIVE']],
    'FileHandles' : [ 0x2ec, ['array', 6, ['pointer', ['void']]]],
    'NotifyList' : [ 0x304, ['_LIST_ENTRY']],
    'HiveList' : [ 0x30c, ['_LIST_ENTRY']],
    'PreloadedHiveList' : [ 0x314, ['_LIST_ENTRY']],
    'HiveRundown' : [ 0x31c, ['_EX_RUNDOWN_REF']],
    'ParseCacheEntries' : [ 0x320, ['_LIST_ENTRY']],
    'KcbCacheTable' : [ 0x328, ['pointer', ['_CM_KEY_HASH_TABLE_ENTRY']]],
    'KcbCacheTableSize' : [ 0x32c, ['unsigned long']],
    'Identity' : [ 0x330, ['unsigned long']],
    'HiveLock' : [ 0x334, ['pointer', ['_FAST_MUTEX']]],
    'ViewLock' : [ 0x338, ['_EX_PUSH_LOCK']],
    'ViewLockOwner' : [ 0x33c, ['pointer', ['_KTHREAD']]],
    'ViewLockLast' : [ 0x340, ['unsigned long']],
    'ViewUnLockLast' : [ 0x344, ['unsigned long']],
    'WriterLock' : [ 0x348, ['pointer', ['_FAST_MUTEX']]],
    'FlusherLock' : [ 0x34c, ['pointer', ['_ERESOURCE']]],
    'FlushDirtyVector' : [ 0x350, ['_RTL_BITMAP']],
    'FlushOffsetArray' : [ 0x358, ['pointer', ['CMP_OFFSET_ARRAY']]],
    'FlushOffsetArrayCount' : [ 0x35c, ['unsigned long']],
    'FlushHiveTruncated' : [ 0x360, ['unsigned long']],
    'FlushLock2' : [ 0x364, ['pointer', ['_FAST_MUTEX']]],
    'SecurityLock' : [ 0x368, ['_EX_PUSH_LOCK']],
    'MappedViewList' : [ 0x36c, ['_LIST_ENTRY']],
    'PinnedViewList' : [ 0x374, ['_LIST_ENTRY']],
    'FlushedViewList' : [ 0x37c, ['_LIST_ENTRY']],
    'MappedViewCount' : [ 0x384, ['unsigned short']],
    'PinnedViewCount' : [ 0x386, ['unsigned short']],
    'UseCount' : [ 0x388, ['unsigned long']],
    'ViewsPerHive' : [ 0x38c, ['unsigned long']],
    'FileObject' : [ 0x390, ['pointer', ['_FILE_OBJECT']]],
    'LastShrinkHiveSize' : [ 0x394, ['unsigned long']],
    'ActualFileSize' : [ 0x398, ['_LARGE_INTEGER']],
    'FileFullPath' : [ 0x3a0, ['_UNICODE_STRING']],
    'FileUserName' : [ 0x3a8, ['_UNICODE_STRING']],
    'HiveRootPath' : [ 0x3b0, ['_UNICODE_STRING']],
    'SecurityCount' : [ 0x3b8, ['unsigned long']],
    'SecurityCacheSize' : [ 0x3bc, ['unsigned long']],
    'SecurityHitHint' : [ 0x3c0, ['long']],
    'SecurityCache' : [ 0x3c4, ['pointer', ['_CM_KEY_SECURITY_CACHE_ENTRY']]],
    'SecurityHash' : [ 0x3c8, ['array', 64, ['_LIST_ENTRY']]],
    'UnloadEventCount' : [ 0x5c8, ['unsigned long']],
    'UnloadEventArray' : [ 0x5cc, ['pointer', ['pointer', ['_KEVENT']]]],
    'RootKcb' : [ 0x5d0, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'Frozen' : [ 0x5d4, ['unsigned char']],
    'UnloadWorkItem' : [ 0x5d8, ['pointer', ['_CM_WORKITEM']]],
    'UnloadWorkItemHolder' : [ 0x5dc, ['_CM_WORKITEM']],
    'GrowOnlyMode' : [ 0x5f0, ['unsigned char']],
    'GrowOffset' : [ 0x5f4, ['unsigned long']],
    'KcbConvertListHead' : [ 0x5f8, ['_LIST_ENTRY']],
    'KnodeConvertListHead' : [ 0x600, ['_LIST_ENTRY']],
    'CellRemapArray' : [ 0x608, ['pointer', ['_CM_CELL_REMAP_BLOCK']]],
    'Flags' : [ 0x60c, ['unsigned long']],
    'TrustClassEntry' : [ 0x610, ['_LIST_ENTRY']],
    'FlushCount' : [ 0x618, ['unsigned long']],
    'CmRm' : [ 0x61c, ['pointer', ['_CM_RM']]],
    'CmRmInitFailPoint' : [ 0x620, ['unsigned long']],
    'CmRmInitFailStatus' : [ 0x624, ['long']],
    'CreatorOwner' : [ 0x628, ['pointer', ['_KTHREAD']]],
    'RundownThread' : [ 0x62c, ['pointer', ['_KTHREAD']]],
    'LastWriteTime' : [ 0x630, ['_LARGE_INTEGER']],
} ],
  '_CM_KEY_CONTROL_BLOCK' : [ 0xa0, {
    'RefCount' : [ 0x0, ['unsigned long']],
    'ExtFlags' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'PrivateAlloc' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'Delete' : [ 0x4, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HiveUnloaded' : [ 0x4, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'Decommissioned' : [ 0x4, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'LockTablePresent' : [ 0x4, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'TotalLevels' : [ 0x4, ['BitField', dict(start_bit = 21, end_bit = 31, native_type='unsigned long')]],
    'DelayedDeref' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DelayedClose' : [ 0x8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Parking' : [ 0x8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'KeyHash' : [ 0xc, ['_CM_KEY_HASH']],
    'ConvKey' : [ 0xc, ['unsigned long']],
    'NextHash' : [ 0x10, ['pointer', ['_CM_KEY_HASH']]],
    'KeyHive' : [ 0x14, ['pointer', ['_HHIVE']]],
    'KeyCell' : [ 0x18, ['unsigned long']],
    'KcbPushlock' : [ 0x1c, ['_EX_PUSH_LOCK']],
    'Owner' : [ 0x20, ['pointer', ['_KTHREAD']]],
    'SharedCount' : [ 0x20, ['long']],
    'SlotHint' : [ 0x24, ['unsigned long']],
    'ParentKcb' : [ 0x28, ['pointer', ['_CM_KEY_CONTROL_BLOCK']]],
    'NameBlock' : [ 0x2c, ['pointer', ['_CM_NAME_CONTROL_BLOCK']]],
    'CachedSecurity' : [ 0x30, ['pointer', ['_CM_KEY_SECURITY_CACHE']]],
    'ValueCache' : [ 0x34, ['_CACHED_CHILD_LIST']],
    'IndexHint' : [ 0x3c, ['pointer', ['_CM_INDEX_HINT_BLOCK']]],
    'HashKey' : [ 0x3c, ['unsigned long']],
    'SubKeyCount' : [ 0x3c, ['unsigned long']],
    'KeyBodyListHead' : [ 0x40, ['_LIST_ENTRY']],
    'FreeListEntry' : [ 0x40, ['_LIST_ENTRY']],
    'KeyBodyArray' : [ 0x48, ['array', 4, ['pointer', ['_CM_KEY_BODY']]]],
    'KcbLastWriteTime' : [ 0x58, ['_LARGE_INTEGER']],
    'KcbMaxNameLen' : [ 0x60, ['unsigned short']],
    'KcbMaxValueNameLen' : [ 0x62, ['unsigned short']],
    'KcbMaxValueDataLen' : [ 0x64, ['unsigned long']],
    'KcbUserFlags' : [ 0x68, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long')]],
    'KcbVirtControlFlags' : [ 0x68, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned long')]],
    'KcbDebug' : [ 0x68, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned long')]],
    'Flags' : [ 0x68, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
    'KCBUoWListHead' : [ 0x6c, ['_LIST_ENTRY']],
    'DelayQueueEntry' : [ 0x74, ['_LIST_ENTRY']],
    'Stolen' : [ 0x74, ['pointer', ['unsigned char']]],
    'TransKCBOwner' : [ 0x7c, ['pointer', ['_CM_TRANS']]],
    'KCBLock' : [ 0x80, ['_CM_INTENT_LOCK']],
    'KeyLock' : [ 0x88, ['_CM_INTENT_LOCK']],
    'TransValueCache' : [ 0x90, ['_CHILD_LIST']],
    'TransValueListOwner' : [ 0x98, ['pointer', ['_CM_TRANS']]],
    'FullKCBName' : [ 0x9c, ['pointer', ['_UNICODE_STRING']]],
} ],
  '_CM_KEY_HASH_TABLE_ENTRY' : [ 0xc, {
    'Lock' : [ 0x0, ['_EX_PUSH_LOCK']],
    'Owner' : [ 0x4, ['pointer', ['_KTHREAD']]],
    'Entry' : [ 0x8, ['pointer', ['_CM_KEY_HASH']]],
} ],
  '__unnamed_162f' : [ 0xc, {
    'Failure' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: '_None', 1: '_CmInitializeHive', 2: '_HvInitializeHive', 3: '_HvpBuildMap', 4: '_HvpBuildMapAndCopy', 5: '_HvpInitMap', 6: '_HvLoadHive', 7: '_HvpReadFileImageAndBuildMap', 8: '_HvpRecoverData', 9: '_HvpRecoverWholeHive', 10: '_HvpMapFileImageAndBuildMap', 11: '_CmpValidateHiveSecurityDescriptors', 12: '_HvpEnlistBinInMap', 13: '_CmCheckRegistry', 14: '_CmRegistryIO', 15: '_CmCheckRegistry2', 16: '_CmpCheckKey', 17: '_CmpCheckValueList', 18: '_HvCheckHive', 19: '_HvCheckBin'})]],
    'Status' : [ 0x4, ['long']],
    'Point' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1632' : [ 0xc, {
    'Action' : [ 0x0, ['unsigned long']],
    'Handle' : [ 0x4, ['pointer', ['void']]],
    'Status' : [ 0x8, ['long']],
} ],
  '__unnamed_1634' : [ 0x4, {
    'CheckStack' : [ 0x0, ['pointer', ['void']]],
} ],
  '__unnamed_1636' : [ 0x10, {
    'Cell' : [ 0x0, ['unsigned long']],
    'CellPoint' : [ 0x4, ['pointer', ['_CELL_DATA']]],
    'RootPoint' : [ 0x8, ['pointer', ['void']]],
    'Index' : [ 0xc, ['unsigned long']],
} ],
  '__unnamed_1638' : [ 0x10, {
    'List' : [ 0x0, ['pointer', ['_CELL_DATA']]],
    'Index' : [ 0x4, ['unsigned long']],
    'Cell' : [ 0x8, ['unsigned long']],
    'CellPoint' : [ 0xc, ['pointer', ['_CELL_DATA']]],
} ],
  '__unnamed_163c' : [ 0xc, {
    'Space' : [ 0x0, ['unsigned long']],
    'MapPoint' : [ 0x4, ['unsigned long']],
    'BinPoint' : [ 0x8, ['pointer', ['_HBIN']]],
} ],
  '__unnamed_1640' : [ 0x8, {
    'Bin' : [ 0x0, ['pointer', ['_HBIN']]],
    'CellPoint' : [ 0x4, ['pointer', ['_HCELL']]],
} ],
  '__unnamed_1642' : [ 0x4, {
    'FileOffset' : [ 0x0, ['unsigned long']],
} ],
  '_HIVE_LOAD_FAILURE' : [ 0x120, {
    'Hive' : [ 0x0, ['pointer', ['_HHIVE']]],
    'Index' : [ 0x4, ['unsigned long']],
    'RecoverableIndex' : [ 0x8, ['unsigned long']],
    'Locations' : [ 0xc, ['array', 8, ['__unnamed_162f']]],
    'RecoverableLocations' : [ 0x6c, ['array', 8, ['__unnamed_162f']]],
    'RegistryIO' : [ 0xcc, ['__unnamed_1632']],
    'CheckRegistry2' : [ 0xd8, ['__unnamed_1634']],
    'CheckKey' : [ 0xdc, ['__unnamed_1636']],
    'CheckValueList' : [ 0xec, ['__unnamed_1638']],
    'CheckHive' : [ 0xfc, ['__unnamed_163c']],
    'CheckHive1' : [ 0x108, ['__unnamed_163c']],
    'CheckBin' : [ 0x114, ['__unnamed_1640']],
    'RecoverData' : [ 0x11c, ['__unnamed_1642']],
} ],
  '_PCW_COUNTER_DESCRIPTOR' : [ 0x8, {
    'Id' : [ 0x0, ['unsigned short']],
    'StructIndex' : [ 0x2, ['unsigned short']],
    'Offset' : [ 0x4, ['unsigned short']],
    'Size' : [ 0x6, ['unsigned short']],
} ],
  '_PCW_REGISTRATION_INFORMATION' : [ 0x18, {
    'Version' : [ 0x0, ['unsigned long']],
    'Name' : [ 0x4, ['pointer', ['_UNICODE_STRING']]],
    'CounterCount' : [ 0x8, ['unsigned long']],
    'Counters' : [ 0xc, ['pointer', ['_PCW_COUNTER_DESCRIPTOR']]],
    'Callback' : [ 0x10, ['pointer', ['void']]],
    'CallbackContext' : [ 0x14, ['pointer', ['void']]],
} ],
  '_PCW_PROCESSOR_INFO' : [ 0x80, {
    'IdleTime' : [ 0x0, ['unsigned long long']],
    'AvailableTime' : [ 0x8, ['unsigned long long']],
    'UserTime' : [ 0x10, ['unsigned long long']],
    'KernelTime' : [ 0x18, ['unsigned long long']],
    'Interrupts' : [ 0x20, ['unsigned long']],
    'DpcTime' : [ 0x28, ['unsigned long long']],
    'InterruptTime' : [ 0x30, ['unsigned long long']],
    'DpcCount' : [ 0x38, ['unsigned long']],
    'DpcRate' : [ 0x3c, ['unsigned long']],
    'C1Time' : [ 0x40, ['unsigned long long']],
    'C2Time' : [ 0x48, ['unsigned long long']],
    'C3Time' : [ 0x50, ['unsigned long long']],
    'C1Transitions' : [ 0x58, ['unsigned long long']],
    'C2Transitions' : [ 0x60, ['unsigned long long']],
    'C3Transitions' : [ 0x68, ['unsigned long long']],
    'ParkingStatus' : [ 0x70, ['unsigned long']],
    'CurrentFrequency' : [ 0x74, ['unsigned long']],
    'PercentMaxFrequency' : [ 0x78, ['unsigned long']],
    'StateFlags' : [ 0x7c, ['unsigned long']],
} ],
  '_PCW_DATA' : [ 0x8, {
    'Data' : [ 0x0, ['pointer', ['void']]],
    'Size' : [ 0x4, ['unsigned long']],
} ],
  '_ETW_PERF_COUNTERS' : [ 0x18, {
    'TotalActiveSessions' : [ 0x0, ['long']],
    'TotalBufferMemoryNonPagedPool' : [ 0x4, ['long']],
    'TotalBufferMemoryPagedPool' : [ 0x8, ['long']],
    'TotalGuidsEnabled' : [ 0xc, ['long']],
    'TotalGuidsNotEnabled' : [ 0x10, ['long']],
    'TotalGuidsPreEnabled' : [ 0x14, ['long']],
} ],
  '_ETW_SESSION_PERF_COUNTERS' : [ 0x18, {
    'BufferMemoryPagedPool' : [ 0x0, ['long']],
    'BufferMemoryNonPagedPool' : [ 0x4, ['long']],
    'EventsLoggedCount' : [ 0x8, ['unsigned long long']],
    'EventsLost' : [ 0x10, ['long']],
    'NumConsumers' : [ 0x14, ['long']],
} ],
  '_TEB32' : [ 0xfe4, {
    'NtTib' : [ 0x0, ['_NT_TIB32']],
    'EnvironmentPointer' : [ 0x1c, ['unsigned long']],
    'ClientId' : [ 0x20, ['_CLIENT_ID32']],
    'ActiveRpcHandle' : [ 0x28, ['unsigned long']],
    'ThreadLocalStoragePointer' : [ 0x2c, ['unsigned long']],
    'ProcessEnvironmentBlock' : [ 0x30, ['unsigned long']],
    'LastErrorValue' : [ 0x34, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x38, ['unsigned long']],
    'CsrClientThread' : [ 0x3c, ['unsigned long']],
    'Win32ThreadInfo' : [ 0x40, ['unsigned long']],
    'User32Reserved' : [ 0x44, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xac, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0xc0, ['unsigned long']],
    'CurrentLocale' : [ 0xc4, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0xc8, ['unsigned long']],
    'SystemReserved1' : [ 0xcc, ['array', 54, ['unsigned long']]],
    'ExceptionCode' : [ 0x1a4, ['long']],
    'ActivationContextStackPointer' : [ 0x1a8, ['unsigned long']],
    'SpareBytes' : [ 0x1ac, ['array', 36, ['unsigned char']]],
    'TxFsContext' : [ 0x1d0, ['unsigned long']],
    'GdiTebBatch' : [ 0x1d4, ['_GDI_TEB_BATCH32']],
    'RealClientId' : [ 0x6b4, ['_CLIENT_ID32']],
    'GdiCachedProcessHandle' : [ 0x6bc, ['unsigned long']],
    'GdiClientPID' : [ 0x6c0, ['unsigned long']],
    'GdiClientTID' : [ 0x6c4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x6c8, ['unsigned long']],
    'Win32ClientInfo' : [ 0x6cc, ['array', 62, ['unsigned long']]],
    'glDispatchTable' : [ 0x7c4, ['array', 233, ['unsigned long']]],
    'glReserved1' : [ 0xb68, ['array', 29, ['unsigned long']]],
    'glReserved2' : [ 0xbdc, ['unsigned long']],
    'glSectionInfo' : [ 0xbe0, ['unsigned long']],
    'glSection' : [ 0xbe4, ['unsigned long']],
    'glTable' : [ 0xbe8, ['unsigned long']],
    'glCurrentRC' : [ 0xbec, ['unsigned long']],
    'glContext' : [ 0xbf0, ['unsigned long']],
    'LastStatusValue' : [ 0xbf4, ['unsigned long']],
    'StaticUnicodeString' : [ 0xbf8, ['_STRING32']],
    'StaticUnicodeBuffer' : [ 0xc00, ['array', 261, ['wchar']]],
    'DeallocationStack' : [ 0xe0c, ['unsigned long']],
    'TlsSlots' : [ 0xe10, ['array', 64, ['unsigned long']]],
    'TlsLinks' : [ 0xf10, ['LIST_ENTRY32']],
    'Vdm' : [ 0xf18, ['unsigned long']],
    'ReservedForNtRpc' : [ 0xf1c, ['unsigned long']],
    'DbgSsReserved' : [ 0xf20, ['array', 2, ['unsigned long']]],
    'HardErrorMode' : [ 0xf28, ['unsigned long']],
    'Instrumentation' : [ 0xf2c, ['array', 9, ['unsigned long']]],
    'ActivityId' : [ 0xf50, ['_GUID']],
    'SubProcessTag' : [ 0xf60, ['unsigned long']],
    'EtwLocalData' : [ 0xf64, ['unsigned long']],
    'EtwTraceData' : [ 0xf68, ['unsigned long']],
    'WinSockData' : [ 0xf6c, ['unsigned long']],
    'GdiBatchCount' : [ 0xf70, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0xf74, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0xf74, ['unsigned long']],
    'ReservedPad0' : [ 0xf74, ['unsigned char']],
    'ReservedPad1' : [ 0xf75, ['unsigned char']],
    'ReservedPad2' : [ 0xf76, ['unsigned char']],
    'IdealProcessor' : [ 0xf77, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0xf78, ['unsigned long']],
    'ReservedForPerf' : [ 0xf7c, ['unsigned long']],
    'ReservedForOle' : [ 0xf80, ['unsigned long']],
    'WaitingOnLoaderLock' : [ 0xf84, ['unsigned long']],
    'SavedPriorityState' : [ 0xf88, ['unsigned long']],
    'SoftPatchPtr1' : [ 0xf8c, ['unsigned long']],
    'ThreadPoolData' : [ 0xf90, ['unsigned long']],
    'TlsExpansionSlots' : [ 0xf94, ['unsigned long']],
    'MuiGeneration' : [ 0xf98, ['unsigned long']],
    'IsImpersonating' : [ 0xf9c, ['unsigned long']],
    'NlsCache' : [ 0xfa0, ['unsigned long']],
    'pShimData' : [ 0xfa4, ['unsigned long']],
    'HeapVirtualAffinity' : [ 0xfa8, ['unsigned long']],
    'CurrentTransactionHandle' : [ 0xfac, ['unsigned long']],
    'ActiveFrame' : [ 0xfb0, ['unsigned long']],
    'FlsData' : [ 0xfb4, ['unsigned long']],
    'PreferredLanguages' : [ 0xfb8, ['unsigned long']],
    'UserPrefLanguages' : [ 0xfbc, ['unsigned long']],
    'MergedPrefLanguages' : [ 0xfc0, ['unsigned long']],
    'MuiImpersonation' : [ 0xfc4, ['unsigned long']],
    'CrossTebFlags' : [ 0xfc8, ['unsigned short']],
    'SpareCrossTebBits' : [ 0xfc8, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0xfca, ['unsigned short']],
    'SafeThunkCall' : [ 0xfca, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0xfca, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0xfca, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0xfca, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0xfca, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0xfca, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0xfca, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0xfca, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0xfca, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0xfca, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0xfca, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0xfca, ['BitField', dict(start_bit = 11, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0xfcc, ['unsigned long']],
    'TxnScopeExitCallback' : [ 0xfd0, ['unsigned long']],
    'TxnScopeContext' : [ 0xfd4, ['unsigned long']],
    'LockCount' : [ 0xfd8, ['unsigned long']],
    'SpareUlong0' : [ 0xfdc, ['unsigned long']],
    'ResourceRetValue' : [ 0xfe0, ['unsigned long']],
} ],
  '_TEB64' : [ 0x1818, {
    'NtTib' : [ 0x0, ['_NT_TIB64']],
    'EnvironmentPointer' : [ 0x38, ['unsigned long long']],
    'ClientId' : [ 0x40, ['_CLIENT_ID64']],
    'ActiveRpcHandle' : [ 0x50, ['unsigned long long']],
    'ThreadLocalStoragePointer' : [ 0x58, ['unsigned long long']],
    'ProcessEnvironmentBlock' : [ 0x60, ['unsigned long long']],
    'LastErrorValue' : [ 0x68, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x6c, ['unsigned long']],
    'CsrClientThread' : [ 0x70, ['unsigned long long']],
    'Win32ThreadInfo' : [ 0x78, ['unsigned long long']],
    'User32Reserved' : [ 0x80, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xe8, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0x100, ['unsigned long long']],
    'CurrentLocale' : [ 0x108, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0x10c, ['unsigned long']],
    'SystemReserved1' : [ 0x110, ['array', 54, ['unsigned long long']]],
    'ExceptionCode' : [ 0x2c0, ['long']],
    'ActivationContextStackPointer' : [ 0x2c8, ['unsigned long long']],
    'SpareBytes' : [ 0x2d0, ['array', 24, ['unsigned char']]],
    'TxFsContext' : [ 0x2e8, ['unsigned long']],
    'GdiTebBatch' : [ 0x2f0, ['_GDI_TEB_BATCH64']],
    'RealClientId' : [ 0x7d8, ['_CLIENT_ID64']],
    'GdiCachedProcessHandle' : [ 0x7e8, ['unsigned long long']],
    'GdiClientPID' : [ 0x7f0, ['unsigned long']],
    'GdiClientTID' : [ 0x7f4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x7f8, ['unsigned long long']],
    'Win32ClientInfo' : [ 0x800, ['array', 62, ['unsigned long long']]],
    'glDispatchTable' : [ 0x9f0, ['array', 233, ['unsigned long long']]],
    'glReserved1' : [ 0x1138, ['array', 29, ['unsigned long long']]],
    'glReserved2' : [ 0x1220, ['unsigned long long']],
    'glSectionInfo' : [ 0x1228, ['unsigned long long']],
    'glSection' : [ 0x1230, ['unsigned long long']],
    'glTable' : [ 0x1238, ['unsigned long long']],
    'glCurrentRC' : [ 0x1240, ['unsigned long long']],
    'glContext' : [ 0x1248, ['unsigned long long']],
    'LastStatusValue' : [ 0x1250, ['unsigned long']],
    'StaticUnicodeString' : [ 0x1258, ['_STRING64']],
    'StaticUnicodeBuffer' : [ 0x1268, ['array', 261, ['wchar']]],
    'DeallocationStack' : [ 0x1478, ['unsigned long long']],
    'TlsSlots' : [ 0x1480, ['array', 64, ['unsigned long long']]],
    'TlsLinks' : [ 0x1680, ['LIST_ENTRY64']],
    'Vdm' : [ 0x1690, ['unsigned long long']],
    'ReservedForNtRpc' : [ 0x1698, ['unsigned long long']],
    'DbgSsReserved' : [ 0x16a0, ['array', 2, ['unsigned long long']]],
    'HardErrorMode' : [ 0x16b0, ['unsigned long']],
    'Instrumentation' : [ 0x16b8, ['array', 11, ['unsigned long long']]],
    'ActivityId' : [ 0x1710, ['_GUID']],
    'SubProcessTag' : [ 0x1720, ['unsigned long long']],
    'EtwLocalData' : [ 0x1728, ['unsigned long long']],
    'EtwTraceData' : [ 0x1730, ['unsigned long long']],
    'WinSockData' : [ 0x1738, ['unsigned long long']],
    'GdiBatchCount' : [ 0x1740, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0x1744, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0x1744, ['unsigned long']],
    'ReservedPad0' : [ 0x1744, ['unsigned char']],
    'ReservedPad1' : [ 0x1745, ['unsigned char']],
    'ReservedPad2' : [ 0x1746, ['unsigned char']],
    'IdealProcessor' : [ 0x1747, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0x1748, ['unsigned long']],
    'ReservedForPerf' : [ 0x1750, ['unsigned long long']],
    'ReservedForOle' : [ 0x1758, ['unsigned long long']],
    'WaitingOnLoaderLock' : [ 0x1760, ['unsigned long']],
    'SavedPriorityState' : [ 0x1768, ['unsigned long long']],
    'SoftPatchPtr1' : [ 0x1770, ['unsigned long long']],
    'ThreadPoolData' : [ 0x1778, ['unsigned long long']],
    'TlsExpansionSlots' : [ 0x1780, ['unsigned long long']],
    'DeallocationBStore' : [ 0x1788, ['unsigned long long']],
    'BStoreLimit' : [ 0x1790, ['unsigned long long']],
    'MuiGeneration' : [ 0x1798, ['unsigned long']],
    'IsImpersonating' : [ 0x179c, ['unsigned long']],
    'NlsCache' : [ 0x17a0, ['unsigned long long']],
    'pShimData' : [ 0x17a8, ['unsigned long long']],
    'HeapVirtualAffinity' : [ 0x17b0, ['unsigned long']],
    'CurrentTransactionHandle' : [ 0x17b8, ['unsigned long long']],
    'ActiveFrame' : [ 0x17c0, ['unsigned long long']],
    'FlsData' : [ 0x17c8, ['unsigned long long']],
    'PreferredLanguages' : [ 0x17d0, ['unsigned long long']],
    'UserPrefLanguages' : [ 0x17d8, ['unsigned long long']],
    'MergedPrefLanguages' : [ 0x17e0, ['unsigned long long']],
    'MuiImpersonation' : [ 0x17e8, ['unsigned long']],
    'CrossTebFlags' : [ 0x17ec, ['unsigned short']],
    'SpareCrossTebBits' : [ 0x17ec, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0x17ee, ['unsigned short']],
    'SafeThunkCall' : [ 0x17ee, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0x17ee, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0x17ee, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0x17ee, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0x17ee, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0x17ee, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0x17ee, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0x17ee, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0x17ee, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0x17ee, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0x17ee, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0x17ee, ['BitField', dict(start_bit = 11, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0x17f0, ['unsigned long long']],
    'TxnScopeExitCallback' : [ 0x17f8, ['unsigned long long']],
    'TxnScopeContext' : [ 0x1800, ['unsigned long long']],
    'LockCount' : [ 0x1808, ['unsigned long']],
    'SpareUlong0' : [ 0x180c, ['unsigned long']],
    'ResourceRetValue' : [ 0x1810, ['unsigned long long']],
} ],
  '_KTIMER_TABLE' : [ 0x1840, {
    'TimerExpiry' : [ 0x0, ['array', 16, ['pointer', ['_KTIMER']]]],
    'TimerEntries' : [ 0x40, ['array', 256, ['_KTIMER_TABLE_ENTRY']]],
} ],
  '_KTIMER_TABLE_ENTRY' : [ 0x18, {
    'Lock' : [ 0x0, ['unsigned long']],
    'Entry' : [ 0x4, ['_LIST_ENTRY']],
    'Time' : [ 0x10, ['_ULARGE_INTEGER']],
} ],
  '_KAFFINITY_EX' : [ 0xc, {
    'Count' : [ 0x0, ['unsigned short']],
    'Size' : [ 0x2, ['unsigned short']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Bitmap' : [ 0x8, ['array', 1, ['unsigned long']]],
} ],
  '_KAFFINITY_ENUMERATION_CONTEXT' : [ 0xc, {
    'Affinity' : [ 0x0, ['pointer', ['_KAFFINITY_EX']]],
    'CurrentMask' : [ 0x4, ['unsigned long']],
    'CurrentIndex' : [ 0x8, ['unsigned short']],
} ],
  '_GROUP_AFFINITY' : [ 0xc, {
    'Mask' : [ 0x0, ['unsigned long']],
    'Group' : [ 0x4, ['unsigned short']],
    'Reserved' : [ 0x6, ['array', 3, ['unsigned short']]],
} ],
  '_XSTATE_SAVE' : [ 0x20, {
    'Reserved1' : [ 0x0, ['long long']],
    'Reserved2' : [ 0x8, ['unsigned long']],
    'Prev' : [ 0xc, ['pointer', ['_XSTATE_SAVE']]],
    'Reserved3' : [ 0x10, ['pointer', ['_XSAVE_AREA']]],
    'Thread' : [ 0x14, ['pointer', ['_KTHREAD']]],
    'Reserved4' : [ 0x18, ['pointer', ['void']]],
    'Level' : [ 0x1c, ['unsigned char']],
    'XStateContext' : [ 0x0, ['_XSTATE_CONTEXT']],
} ],
  '_XSAVE_AREA' : [ 0x240, {
    'LegacyState' : [ 0x0, ['_XSAVE_FORMAT']],
    'Header' : [ 0x200, ['_XSAVE_AREA_HEADER']],
} ],
  '_FXSAVE_FORMAT' : [ 0x1e0, {
    'ControlWord' : [ 0x0, ['unsigned short']],
    'StatusWord' : [ 0x2, ['unsigned short']],
    'TagWord' : [ 0x4, ['unsigned short']],
    'ErrorOpcode' : [ 0x6, ['unsigned short']],
    'ErrorOffset' : [ 0x8, ['unsigned long']],
    'ErrorSelector' : [ 0xc, ['unsigned long']],
    'DataOffset' : [ 0x10, ['unsigned long']],
    'DataSelector' : [ 0x14, ['unsigned long']],
    'MXCsr' : [ 0x18, ['unsigned long']],
    'MXCsrMask' : [ 0x1c, ['unsigned long']],
    'RegisterArea' : [ 0x20, ['array', 128, ['unsigned char']]],
    'Reserved3' : [ 0xa0, ['array', 128, ['unsigned char']]],
    'Reserved4' : [ 0x120, ['array', 192, ['unsigned char']]],
} ],
  '_FNSAVE_FORMAT' : [ 0x6c, {
    'ControlWord' : [ 0x0, ['unsigned long']],
    'StatusWord' : [ 0x4, ['unsigned long']],
    'TagWord' : [ 0x8, ['unsigned long']],
    'ErrorOffset' : [ 0xc, ['unsigned long']],
    'ErrorSelector' : [ 0x10, ['unsigned long']],
    'DataOffset' : [ 0x14, ['unsigned long']],
    'DataSelector' : [ 0x18, ['unsigned long']],
    'RegisterArea' : [ 0x1c, ['array', 80, ['unsigned char']]],
} ],
  '_KSTACK_AREA' : [ 0x210, {
    'FnArea' : [ 0x0, ['_FNSAVE_FORMAT']],
    'NpxFrame' : [ 0x0, ['_FXSAVE_FORMAT']],
    'StackControl' : [ 0x1e0, ['_KERNEL_STACK_CONTROL']],
    'Cr0NpxState' : [ 0x1fc, ['unsigned long']],
    'Padding' : [ 0x200, ['array', 4, ['unsigned long']]],
} ],
  '_KERNEL_STACK_CONTROL' : [ 0x1c, {
    'PreviousTrapFrame' : [ 0x0, ['pointer', ['_KTRAP_FRAME']]],
    'PreviousExceptionList' : [ 0x0, ['pointer', ['void']]],
    'StackControlFlags' : [ 0x4, ['unsigned long']],
    'PreviousLargeStack' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PreviousSegmentsPresent' : [ 0x4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ExpandCalloutStack' : [ 0x4, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Previous' : [ 0x8, ['_KERNEL_STACK_SEGMENT']],
} ],
  '_KTRAP_FRAME' : [ 0x8c, {
    'DbgEbp' : [ 0x0, ['unsigned long']],
    'DbgEip' : [ 0x4, ['unsigned long']],
    'DbgArgMark' : [ 0x8, ['unsigned long']],
    'DbgArgPointer' : [ 0xc, ['unsigned long']],
    'TempSegCs' : [ 0x10, ['unsigned short']],
    'Logging' : [ 0x12, ['unsigned char']],
    'Reserved' : [ 0x13, ['unsigned char']],
    'TempEsp' : [ 0x14, ['unsigned long']],
    'Dr0' : [ 0x18, ['unsigned long']],
    'Dr1' : [ 0x1c, ['unsigned long']],
    'Dr2' : [ 0x20, ['unsigned long']],
    'Dr3' : [ 0x24, ['unsigned long']],
    'Dr6' : [ 0x28, ['unsigned long']],
    'Dr7' : [ 0x2c, ['unsigned long']],
    'SegGs' : [ 0x30, ['unsigned long']],
    'SegEs' : [ 0x34, ['unsigned long']],
    'SegDs' : [ 0x38, ['unsigned long']],
    'Edx' : [ 0x3c, ['unsigned long']],
    'Ecx' : [ 0x40, ['unsigned long']],
    'Eax' : [ 0x44, ['unsigned long']],
    'PreviousPreviousMode' : [ 0x48, ['unsigned long']],
    'ExceptionList' : [ 0x4c, ['pointer', ['_EXCEPTION_REGISTRATION_RECORD']]],
    'SegFs' : [ 0x50, ['unsigned long']],
    'Edi' : [ 0x54, ['unsigned long']],
    'Esi' : [ 0x58, ['unsigned long']],
    'Ebx' : [ 0x5c, ['unsigned long']],
    'Ebp' : [ 0x60, ['unsigned long']],
    'ErrCode' : [ 0x64, ['unsigned long']],
    'Eip' : [ 0x68, ['unsigned long']],
    'SegCs' : [ 0x6c, ['unsigned long']],
    'EFlags' : [ 0x70, ['unsigned long']],
    'HardwareEsp' : [ 0x74, ['unsigned long']],
    'HardwareSegSs' : [ 0x78, ['unsigned long']],
    'V86Es' : [ 0x7c, ['unsigned long']],
    'V86Ds' : [ 0x80, ['unsigned long']],
    'V86Fs' : [ 0x84, ['unsigned long']],
    'V86Gs' : [ 0x88, ['unsigned long']],
} ],
  '_PNP_DEVICE_COMPLETION_QUEUE' : [ 0x2c, {
    'DispatchedList' : [ 0x0, ['_LIST_ENTRY']],
    'DispatchedCount' : [ 0x8, ['unsigned long']],
    'CompletedList' : [ 0xc, ['_LIST_ENTRY']],
    'CompletedSemaphore' : [ 0x14, ['_KSEMAPHORE']],
    'SpinLock' : [ 0x28, ['unsigned long']],
} ],
  '_KSEMAPHORE' : [ 0x14, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'Limit' : [ 0x10, ['long']],
} ],
  '_DEVOBJ_EXTENSION' : [ 0x3c, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'DeviceObject' : [ 0x4, ['pointer', ['_DEVICE_OBJECT']]],
    'PowerFlags' : [ 0x8, ['unsigned long']],
    'Dope' : [ 0xc, ['pointer', ['_DEVICE_OBJECT_POWER_EXTENSION']]],
    'ExtensionFlags' : [ 0x10, ['unsigned long']],
    'DeviceNode' : [ 0x14, ['pointer', ['void']]],
    'AttachedTo' : [ 0x18, ['pointer', ['_DEVICE_OBJECT']]],
    'StartIoCount' : [ 0x1c, ['long']],
    'StartIoKey' : [ 0x20, ['long']],
    'StartIoFlags' : [ 0x24, ['unsigned long']],
    'Vpb' : [ 0x28, ['pointer', ['_VPB']]],
    'DependentList' : [ 0x2c, ['_LIST_ENTRY']],
    'ProviderList' : [ 0x34, ['_LIST_ENTRY']],
} ],
  '__unnamed_1744' : [ 0x4, {
    'LegacyDeviceNode' : [ 0x0, ['pointer', ['_DEVICE_NODE']]],
    'PendingDeviceRelations' : [ 0x0, ['pointer', ['_DEVICE_RELATIONS']]],
    'Information' : [ 0x0, ['pointer', ['void']]],
} ],
  '__unnamed_1746' : [ 0x4, {
    'NextResourceDeviceNode' : [ 0x0, ['pointer', ['_DEVICE_NODE']]],
} ],
  '__unnamed_174a' : [ 0x10, {
    'DockStatus' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'DOCK_NOTDOCKDEVICE', 1: 'DOCK_QUIESCENT', 2: 'DOCK_ARRIVING', 3: 'DOCK_DEPARTING', 4: 'DOCK_EJECTIRP_COMPLETED'})]],
    'ListEntry' : [ 0x4, ['_LIST_ENTRY']],
    'SerialNumber' : [ 0xc, ['pointer', ['unsigned short']]],
} ],
  '_DEVICE_NODE' : [ 0x188, {
    'Sibling' : [ 0x0, ['pointer', ['_DEVICE_NODE']]],
    'Child' : [ 0x4, ['pointer', ['_DEVICE_NODE']]],
    'Parent' : [ 0x8, ['pointer', ['_DEVICE_NODE']]],
    'LastChild' : [ 0xc, ['pointer', ['_DEVICE_NODE']]],
    'PhysicalDeviceObject' : [ 0x10, ['pointer', ['_DEVICE_OBJECT']]],
    'InstancePath' : [ 0x14, ['_UNICODE_STRING']],
    'ServiceName' : [ 0x1c, ['_UNICODE_STRING']],
    'PendingIrp' : [ 0x24, ['pointer', ['_IRP']]],
    'Level' : [ 0x28, ['unsigned long']],
    'Notify' : [ 0x2c, ['_PO_DEVICE_NOTIFY']],
    'PoIrpManager' : [ 0x68, ['_PO_IRP_MANAGER']],
    'State' : [ 0x78, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]],
    'PreviousState' : [ 0x7c, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]],
    'StateHistory' : [ 0x80, ['array', -80, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]]],
    'StateHistoryEntry' : [ 0xd0, ['unsigned long']],
    'CompletionStatus' : [ 0xd4, ['long']],
    'Flags' : [ 0xd8, ['unsigned long']],
    'UserFlags' : [ 0xdc, ['unsigned long']],
    'Problem' : [ 0xe0, ['unsigned long']],
    'ResourceList' : [ 0xe4, ['pointer', ['_CM_RESOURCE_LIST']]],
    'ResourceListTranslated' : [ 0xe8, ['pointer', ['_CM_RESOURCE_LIST']]],
    'DuplicatePDO' : [ 0xec, ['pointer', ['_DEVICE_OBJECT']]],
    'ResourceRequirements' : [ 0xf0, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'InterfaceType' : [ 0xf4, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0xf8, ['unsigned long']],
    'ChildInterfaceType' : [ 0xfc, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'ChildBusNumber' : [ 0x100, ['unsigned long']],
    'ChildBusTypeIndex' : [ 0x104, ['unsigned short']],
    'RemovalPolicy' : [ 0x106, ['unsigned char']],
    'HardwareRemovalPolicy' : [ 0x107, ['unsigned char']],
    'TargetDeviceNotify' : [ 0x108, ['_LIST_ENTRY']],
    'DeviceArbiterList' : [ 0x110, ['_LIST_ENTRY']],
    'DeviceTranslatorList' : [ 0x118, ['_LIST_ENTRY']],
    'NoTranslatorMask' : [ 0x120, ['unsigned short']],
    'QueryTranslatorMask' : [ 0x122, ['unsigned short']],
    'NoArbiterMask' : [ 0x124, ['unsigned short']],
    'QueryArbiterMask' : [ 0x126, ['unsigned short']],
    'OverUsed1' : [ 0x128, ['__unnamed_1744']],
    'OverUsed2' : [ 0x12c, ['__unnamed_1746']],
    'BootResources' : [ 0x130, ['pointer', ['_CM_RESOURCE_LIST']]],
    'BootResourcesTranslated' : [ 0x134, ['pointer', ['_CM_RESOURCE_LIST']]],
    'CapabilityFlags' : [ 0x138, ['unsigned long']],
    'DockInfo' : [ 0x13c, ['__unnamed_174a']],
    'DisableableDepends' : [ 0x14c, ['unsigned long']],
    'PendedSetInterfaceState' : [ 0x150, ['_LIST_ENTRY']],
    'LegacyBusListEntry' : [ 0x158, ['_LIST_ENTRY']],
    'DriverUnloadRetryCount' : [ 0x160, ['unsigned long']],
    'PreviousParent' : [ 0x164, ['pointer', ['_DEVICE_NODE']]],
    'DeletedChildren' : [ 0x168, ['unsigned long']],
    'NumaNodeIndex' : [ 0x16c, ['unsigned long']],
    'ContainerID' : [ 0x170, ['_GUID']],
    'OverrideFlags' : [ 0x180, ['unsigned char']],
    'RequiresUnloadedDriver' : [ 0x181, ['unsigned char']],
    'PendingEjectRelations' : [ 0x184, ['pointer', ['_PENDING_RELATIONS_LIST_ENTRY']]],
} ],
  '_KNODE' : [ 0x80, {
    'PagedPoolSListHead' : [ 0x0, ['_SLIST_HEADER']],
    'NonPagedPoolSListHead' : [ 0x8, ['array', 3, ['_SLIST_HEADER']]],
    'Affinity' : [ 0x20, ['_GROUP_AFFINITY']],
    'ProximityId' : [ 0x2c, ['unsigned long']],
    'NodeNumber' : [ 0x30, ['unsigned short']],
    'PrimaryNodeNumber' : [ 0x32, ['unsigned short']],
    'MaximumProcessors' : [ 0x34, ['unsigned char']],
    'Color' : [ 0x35, ['unsigned char']],
    'Flags' : [ 0x36, ['_flags']],
    'NodePad0' : [ 0x37, ['unsigned char']],
    'Seed' : [ 0x38, ['unsigned long']],
    'MmShiftedColor' : [ 0x3c, ['unsigned long']],
    'FreeCount' : [ 0x40, ['array', 2, ['unsigned long']]],
    'CachedKernelStacks' : [ 0x48, ['_CACHED_KSTACK_LIST']],
    'ParkLock' : [ 0x60, ['long']],
    'NodePad1' : [ 0x64, ['unsigned long']],
} ],
  '_PNP_ASSIGN_RESOURCES_CONTEXT' : [ 0xc, {
    'IncludeFailedDevices' : [ 0x0, ['unsigned long']],
    'DeviceCount' : [ 0x4, ['unsigned long']],
    'DeviceList' : [ 0x8, ['array', 1, ['pointer', ['_DEVICE_OBJECT']]]],
} ],
  '_PNP_RESOURCE_REQUEST' : [ 0x28, {
    'PhysicalDevice' : [ 0x0, ['pointer', ['_DEVICE_OBJECT']]],
    'Flags' : [ 0x4, ['unsigned long']],
    'AllocationType' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'ArbiterRequestLegacyReported', 1: 'ArbiterRequestHalReported', 2: 'ArbiterRequestLegacyAssigned', 3: 'ArbiterRequestPnpDetected', 4: 'ArbiterRequestPnpEnumerated', -1: 'ArbiterRequestUndefined'})]],
    'Priority' : [ 0xc, ['unsigned long']],
    'Position' : [ 0x10, ['unsigned long']],
    'ResourceRequirements' : [ 0x14, ['pointer', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'ReqList' : [ 0x18, ['pointer', ['void']]],
    'ResourceAssignment' : [ 0x1c, ['pointer', ['_CM_RESOURCE_LIST']]],
    'TranslatedResourceAssignment' : [ 0x20, ['pointer', ['_CM_RESOURCE_LIST']]],
    'Status' : [ 0x24, ['long']],
} ],
  '_IO_RESOURCE_REQUIREMENTS_LIST' : [ 0x48, {
    'ListSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'SlotNumber' : [ 0xc, ['unsigned long']],
    'Reserved' : [ 0x10, ['array', 3, ['unsigned long']]],
    'AlternativeLists' : [ 0x1c, ['unsigned long']],
    'List' : [ 0x20, ['array', 1, ['_IO_RESOURCE_LIST']]],
} ],
  '_EXCEPTION_RECORD64' : [ 0x98, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['unsigned long long']],
    'ExceptionAddress' : [ 0x10, ['unsigned long long']],
    'NumberParameters' : [ 0x18, ['unsigned long']],
    '__unusedAlignment' : [ 0x1c, ['unsigned long']],
    'ExceptionInformation' : [ 0x20, ['array', 15, ['unsigned long long']]],
} ],
  '_EXCEPTION_RECORD32' : [ 0x50, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['unsigned long']],
    'ExceptionAddress' : [ 0xc, ['unsigned long']],
    'NumberParameters' : [ 0x10, ['unsigned long']],
    'ExceptionInformation' : [ 0x14, ['array', 15, ['unsigned long']]],
} ],
  '_DBGKM_EXCEPTION64' : [ 0xa0, {
    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD64']],
    'FirstChance' : [ 0x98, ['unsigned long']],
} ],
  '_DBGKM_EXCEPTION32' : [ 0x54, {
    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD32']],
    'FirstChance' : [ 0x50, ['unsigned long']],
} ],
  '_DBGKD_LOAD_SYMBOLS64' : [ 0x28, {
    'PathNameLength' : [ 0x0, ['unsigned long']],
    'BaseOfDll' : [ 0x8, ['unsigned long long']],
    'ProcessId' : [ 0x10, ['unsigned long long']],
    'CheckSum' : [ 0x18, ['unsigned long']],
    'SizeOfImage' : [ 0x1c, ['unsigned long']],
    'UnloadSymbols' : [ 0x20, ['unsigned char']],
} ],
  '_DBGKD_LOAD_SYMBOLS32' : [ 0x18, {
    'PathNameLength' : [ 0x0, ['unsigned long']],
    'BaseOfDll' : [ 0x4, ['unsigned long']],
    'ProcessId' : [ 0x8, ['unsigned long']],
    'CheckSum' : [ 0xc, ['unsigned long']],
    'SizeOfImage' : [ 0x10, ['unsigned long']],
    'UnloadSymbols' : [ 0x14, ['unsigned char']],
} ],
  '_DBGKD_READ_MEMORY64' : [ 0x10, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
    'TransferCount' : [ 0x8, ['unsigned long']],
    'ActualBytesRead' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_READ_MEMORY32' : [ 0xc, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
    'TransferCount' : [ 0x4, ['unsigned long']],
    'ActualBytesRead' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_MEMORY64' : [ 0x10, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
    'TransferCount' : [ 0x8, ['unsigned long']],
    'ActualBytesWritten' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_WRITE_MEMORY32' : [ 0xc, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
    'TransferCount' : [ 0x4, ['unsigned long']],
    'ActualBytesWritten' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_BREAKPOINT64' : [ 0x10, {
    'BreakPointAddress' : [ 0x0, ['unsigned long long']],
    'BreakPointHandle' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_BREAKPOINT32' : [ 0x8, {
    'BreakPointAddress' : [ 0x0, ['unsigned long']],
    'BreakPointHandle' : [ 0x4, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO64' : [ 0x10, {
    'IoAddress' : [ 0x0, ['unsigned long long']],
    'DataSize' : [ 0x8, ['unsigned long']],
    'DataValue' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO32' : [ 0xc, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'IoAddress' : [ 0x4, ['unsigned long']],
    'DataValue' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO_EXTENDED64' : [ 0x20, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['unsigned long']],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'AddressSpace' : [ 0xc, ['unsigned long']],
    'IoAddress' : [ 0x10, ['unsigned long long']],
    'DataValue' : [ 0x18, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO_EXTENDED32' : [ 0x18, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['unsigned long']],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'AddressSpace' : [ 0xc, ['unsigned long']],
    'IoAddress' : [ 0x10, ['unsigned long']],
    'DataValue' : [ 0x14, ['unsigned long']],
} ],
  '_DBGKD_SET_SPECIAL_CALL32' : [ 0x4, {
    'SpecialCall' : [ 0x0, ['unsigned long']],
} ],
  '_DBGKD_SET_SPECIAL_CALL64' : [ 0x8, {
    'SpecialCall' : [ 0x0, ['unsigned long long']],
} ],
  '_DBGKD_SET_INTERNAL_BREAKPOINT32' : [ 0x8, {
    'BreakpointAddress' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
} ],
  '_DBGKD_SET_INTERNAL_BREAKPOINT64' : [ 0x10, {
    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_GET_INTERNAL_BREAKPOINT64' : [ 0x20, {
    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x8, ['unsigned long']],
    'Calls' : [ 0xc, ['unsigned long']],
    'MaxCallsPerPeriod' : [ 0x10, ['unsigned long']],
    'MinInstructions' : [ 0x14, ['unsigned long']],
    'MaxInstructions' : [ 0x18, ['unsigned long']],
    'TotalInstructions' : [ 0x1c, ['unsigned long']],
} ],
  '_DBGKD_GET_INTERNAL_BREAKPOINT32' : [ 0x1c, {
    'BreakpointAddress' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'Calls' : [ 0x8, ['unsigned long']],
    'MaxCallsPerPeriod' : [ 0xc, ['unsigned long']],
    'MinInstructions' : [ 0x10, ['unsigned long']],
    'MaxInstructions' : [ 0x14, ['unsigned long']],
    'TotalInstructions' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_17f3' : [ 0x28, {
    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT64']],
    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
    'ReadWriteIo' : [ 0x0, ['_DBGKD_READ_WRITE_IO64']],
    'ReadWriteIoExtended' : [ 0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED64']],
    'QuerySpecialCalls' : [ 0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
    'SetSpecialCall' : [ 0x0, ['_DBGKD_SET_SPECIAL_CALL64']],
    'SetInternalBreakpoint' : [ 0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT64']],
    'GetInternalBreakpoint' : [ 0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT64']],
    'GetVersion64' : [ 0x0, ['_DBGKD_GET_VERSION64']],
    'BreakPointEx' : [ 0x0, ['_DBGKD_BREAKPOINTEX']],
    'ReadWriteMsr' : [ 0x0, ['_DBGKD_READ_WRITE_MSR']],
    'SearchMemory' : [ 0x0, ['_DBGKD_SEARCH_MEMORY']],
    'GetSetBusData' : [ 0x0, ['_DBGKD_GET_SET_BUS_DATA']],
    'FillMemory' : [ 0x0, ['_DBGKD_FILL_MEMORY']],
    'QueryMemory' : [ 0x0, ['_DBGKD_QUERY_MEMORY']],
    'SwitchPartition' : [ 0x0, ['_DBGKD_SWITCH_PARTITION']],
} ],
  '_DBGKD_MANIPULATE_STATE64' : [ 0x38, {
    'ApiNumber' : [ 0x0, ['unsigned long']],
    'ProcessorLevel' : [ 0x4, ['unsigned short']],
    'Processor' : [ 0x6, ['unsigned short']],
    'ReturnStatus' : [ 0x8, ['long']],
    'u' : [ 0x10, ['__unnamed_17f3']],
} ],
  '__unnamed_17fa' : [ 0x28, {
    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY32']],
    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY32']],
    'ReadMemory64' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
    'WriteMemory64' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT32']],
    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
    'ReadWriteIo' : [ 0x0, ['_DBGKD_READ_WRITE_IO32']],
    'ReadWriteIoExtended' : [ 0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED32']],
    'QuerySpecialCalls' : [ 0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
    'SetSpecialCall' : [ 0x0, ['_DBGKD_SET_SPECIAL_CALL32']],
    'SetInternalBreakpoint' : [ 0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT32']],
    'GetInternalBreakpoint' : [ 0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT32']],
    'GetVersion32' : [ 0x0, ['_DBGKD_GET_VERSION32']],
    'BreakPointEx' : [ 0x0, ['_DBGKD_BREAKPOINTEX']],
    'ReadWriteMsr' : [ 0x0, ['_DBGKD_READ_WRITE_MSR']],
    'SearchMemory' : [ 0x0, ['_DBGKD_SEARCH_MEMORY']],
} ],
  '_DBGKD_MANIPULATE_STATE32' : [ 0x34, {
    'ApiNumber' : [ 0x0, ['unsigned long']],
    'ProcessorLevel' : [ 0x4, ['unsigned short']],
    'Processor' : [ 0x6, ['unsigned short']],
    'ReturnStatus' : [ 0x8, ['long']],
    'u' : [ 0xc, ['__unnamed_17fa']],
} ],
  '_DBGKD_READ_WRITE_MSR' : [ 0xc, {
    'Msr' : [ 0x0, ['unsigned long']],
    'DataValueLow' : [ 0x4, ['unsigned long']],
    'DataValueHigh' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_BREAKPOINTEX' : [ 0x8, {
    'BreakPointCount' : [ 0x0, ['unsigned long']],
    'ContinueStatus' : [ 0x4, ['long']],
} ],
  '_DBGKD_SEARCH_MEMORY' : [ 0x18, {
    'SearchAddress' : [ 0x0, ['unsigned long long']],
    'FoundAddress' : [ 0x0, ['unsigned long long']],
    'SearchLength' : [ 0x8, ['unsigned long long']],
    'PatternLength' : [ 0x10, ['unsigned long']],
} ],
  '_DBGKD_RESTORE_BREAKPOINT' : [ 0x4, {
    'BreakPointHandle' : [ 0x0, ['unsigned long']],
} ],
  '_DBGKD_CONTINUE' : [ 0x4, {
    'ContinueStatus' : [ 0x0, ['long']],
} ],
  '_DBGKD_CONTINUE2' : [ 0x20, {
    'ContinueStatus' : [ 0x0, ['long']],
    'ControlSet' : [ 0x4, ['_X86_DBGKD_CONTROL_SET']],
    'AnyControlSet' : [ 0x4, ['_DBGKD_ANY_CONTROL_SET']],
} ],
  '_POP_CPU_INFO' : [ 0x10, {
    'Eax' : [ 0x0, ['unsigned long']],
    'Ebx' : [ 0x4, ['unsigned long']],
    'Ecx' : [ 0x8, ['unsigned long']],
    'Edx' : [ 0xc, ['unsigned long']],
} ],
  '_VOLUME_CACHE_MAP' : [ 0x20, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteCode' : [ 0x2, ['short']],
    'UseCount' : [ 0x4, ['unsigned long']],
    'DeviceObject' : [ 0x8, ['pointer', ['_DEVICE_OBJECT']]],
    'VolumeCacheMapLinks' : [ 0xc, ['_LIST_ENTRY']],
    'Flags' : [ 0x14, ['unsigned long']],
    'DirtyPages' : [ 0x18, ['unsigned long']],
    'PagesQueuedToDisk' : [ 0x1c, ['unsigned long']],
} ],
  '_SHARED_CACHE_MAP' : [ 0x160, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'OpenCount' : [ 0x4, ['unsigned long']],
    'FileSize' : [ 0x8, ['_LARGE_INTEGER']],
    'BcbList' : [ 0x10, ['_LIST_ENTRY']],
    'SectionSize' : [ 0x18, ['_LARGE_INTEGER']],
    'ValidDataLength' : [ 0x20, ['_LARGE_INTEGER']],
    'ValidDataGoal' : [ 0x28, ['_LARGE_INTEGER']],
    'InitialVacbs' : [ 0x30, ['array', 4, ['pointer', ['_VACB']]]],
    'Vacbs' : [ 0x40, ['pointer', ['pointer', ['_VACB']]]],
    'FileObjectFastRef' : [ 0x44, ['_EX_FAST_REF']],
    'VacbLock' : [ 0x48, ['_EX_PUSH_LOCK']],
    'DirtyPages' : [ 0x4c, ['unsigned long']],
    'LoggedStreamLinks' : [ 0x50, ['_LIST_ENTRY']],
    'SharedCacheMapLinks' : [ 0x58, ['_LIST_ENTRY']],
    'Flags' : [ 0x60, ['unsigned long']],
    'Status' : [ 0x64, ['long']],
    'Mbcb' : [ 0x68, ['pointer', ['_MBCB']]],
    'Section' : [ 0x6c, ['pointer', ['void']]],
    'CreateEvent' : [ 0x70, ['pointer', ['_KEVENT']]],
    'WaitOnActiveCount' : [ 0x74, ['pointer', ['_KEVENT']]],
    'PagesToWrite' : [ 0x78, ['unsigned long']],
    'BeyondLastFlush' : [ 0x80, ['long long']],
    'Callbacks' : [ 0x88, ['pointer', ['_CACHE_MANAGER_CALLBACKS']]],
    'LazyWriteContext' : [ 0x8c, ['pointer', ['void']]],
    'PrivateList' : [ 0x90, ['_LIST_ENTRY']],
    'LogHandle' : [ 0x98, ['pointer', ['void']]],
    'FlushToLsnRoutine' : [ 0x9c, ['pointer', ['void']]],
    'DirtyPageThreshold' : [ 0xa0, ['unsigned long']],
    'LazyWritePassCount' : [ 0xa4, ['unsigned long']],
    'UninitializeEvent' : [ 0xa8, ['pointer', ['_CACHE_UNINITIALIZE_EVENT']]],
    'BcbLock' : [ 0xac, ['_KGUARDED_MUTEX']],
    'LastUnmapBehindOffset' : [ 0xd0, ['_LARGE_INTEGER']],
    'Event' : [ 0xd8, ['_KEVENT']],
