ntkrnlmp_types = {
  '_ARBITER_INTERFACE' : [ 0x30, {
    'Size' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned short']],
    'Context' : [ 0x8, ['pointer64', ['void']]],
    'InterfaceReference' : [ 0x10, ['pointer64', ['void']]],
    'InterfaceDereference' : [ 0x18, ['pointer64', ['void']]],
    'ArbiterHandler' : [ 0x20, ['pointer64', ['void']]],
    'Flags' : [ 0x28, ['unsigned long']],
} ],
  '_KAPC_STATE' : [ 0x30, {
    'ApcListHead' : [ 0x0, ['array', 2, ['_LIST_ENTRY']]],
    'Process' : [ 0x20, ['pointer64', ['_KPROCESS']]],
    'KernelApcInProgress' : [ 0x28, ['unsigned char']],
    'KernelApcPending' : [ 0x29, ['unsigned char']],
    'UserApcPending' : [ 0x2a, ['unsigned char']],
} ],
  '_IA64_LOADER_BLOCK' : [ 0x4, {
    'PlaceHolder' : [ 0x0, ['unsigned long']],
} ],
  '_IA64_DBGKD_CONTROL_SET' : [ 0x14, {
    'Continue' : [ 0x0, ['unsigned long']],
    'CurrentSymbolStart' : [ 0x4, ['unsigned long long']],
    'CurrentSymbolEnd' : [ 0xc, ['unsigned long long']],
} ],
  '_DEVICE_RELATIONS' : [ 0x10, {
    'Count' : [ 0x0, ['unsigned long']],
    'Objects' : [ 0x8, ['array', 1, ['pointer64', ['_DEVICE_OBJECT']]]],
} ],
  '_IMAGE_ROM_OPTIONAL_HEADER' : [ 0x38, {
    'Magic' : [ 0x0, ['unsigned short']],
    'MajorLinkerVersion' : [ 0x2, ['unsigned char']],
    'MinorLinkerVersion' : [ 0x3, ['unsigned char']],
    'SizeOfCode' : [ 0x4, ['unsigned long']],
    'SizeOfInitializedData' : [ 0x8, ['unsigned long']],
    'SizeOfUninitializedData' : [ 0xc, ['unsigned long']],
    'AddressOfEntryPoint' : [ 0x10, ['unsigned long']],
    'BaseOfCode' : [ 0x14, ['unsigned long']],
    'BaseOfData' : [ 0x18, ['unsigned long']],
    'BaseOfBss' : [ 0x1c, ['unsigned long']],
    'GprMask' : [ 0x20, ['unsigned long']],
    'CprMask' : [ 0x24, ['array', 4, ['unsigned long']]],
    'GpValue' : [ 0x34, ['unsigned long']],
} ],
  '_ALPC_COMPLETION_LIST_HEADER' : [ 0x300, {
    'StartMagic' : [ 0x0, ['unsigned long long']],
    'TotalSize' : [ 0x8, ['unsigned long']],
    'ListOffset' : [ 0xc, ['unsigned long']],
    'ListSize' : [ 0x10, ['unsigned long']],
    'BitmapOffset' : [ 0x14, ['unsigned long']],
    'BitmapSize' : [ 0x18, ['unsigned long']],
    'DataOffset' : [ 0x1c, ['unsigned long']],
    'DataSize' : [ 0x20, ['unsigned long']],
    'AttributeFlags' : [ 0x24, ['unsigned long']],
    'AttributeSize' : [ 0x28, ['unsigned long']],
    'State' : [ 0x80, ['_ALPC_COMPLETION_LIST_STATE']],
    'LastMessageId' : [ 0x88, ['unsigned long']],
    'LastCallbackId' : [ 0x8c, ['unsigned long']],
    'PostCount' : [ 0x100, ['unsigned long']],
    'ReturnCount' : [ 0x180, ['unsigned long']],
    'LogSequenceNumber' : [ 0x200, ['unsigned long']],
    'UserLock' : [ 0x280, ['_RTL_SRWLOCK']],
    'EndMagic' : [ 0x288, ['unsigned long long']],
} ],
  '_IMAGE_DEBUG_DIRECTORY' : [ 0x1c, {
    'Characteristics' : [ 0x0, ['unsigned long']],
    'TimeDateStamp' : [ 0x4, ['unsigned long']],
    'MajorVersion' : [ 0x8, ['unsigned short']],
    'MinorVersion' : [ 0xa, ['unsigned short']],
    'Type' : [ 0xc, ['unsigned long']],
    'SizeOfData' : [ 0x10, ['unsigned long']],
    'AddressOfRawData' : [ 0x14, ['unsigned long']],
    'PointerToRawData' : [ 0x18, ['unsigned long']],
} ],
  '_ETW_WMITRACE_WORK' : [ 0xf0, {
    'LoggerId' : [ 0x0, ['unsigned long']],
    'LoggerName' : [ 0x8, ['array', 65, ['unsigned char']]],
    'FileName' : [ 0x49, ['array', 129, ['unsigned char']]],
    'MaximumFileSize' : [ 0xcc, ['unsigned long']],
    'MinBuffers' : [ 0xd0, ['unsigned long']],
    'MaxBuffers' : [ 0xd4, ['unsigned long']],
    'BufferSize' : [ 0xd8, ['unsigned long']],
    'Mode' : [ 0xdc, ['unsigned long']],
    'FlushTimer' : [ 0xe0, ['unsigned long']],
    'MatchAny' : [ 0x8, ['unsigned long long']],
    'MatchAll' : [ 0x10, ['unsigned long long']],
    'EnableProperty' : [ 0x18, ['unsigned long']],
    'Guid' : [ 0x1c, ['_GUID']],
    'Level' : [ 0x2c, ['unsigned char']],
    'Status' : [ 0xe8, ['long']],
} ],
  '_DEVICE_MAP' : [ 0x40, {
    'DosDevicesDirectory' : [ 0x0, ['pointer64', ['_OBJECT_DIRECTORY']]],
    'GlobalDosDevicesDirectory' : [ 0x8, ['pointer64', ['_OBJECT_DIRECTORY']]],
    'DosDevicesDirectoryHandle' : [ 0x10, ['pointer64', ['void']]],
    'ReferenceCount' : [ 0x18, ['unsigned long']],
    'DriveMap' : [ 0x1c, ['unsigned long']],
    'DriveType' : [ 0x20, ['array', 32, ['unsigned char']]],
} ],
  '_HEAP_DEBUGGING_INFORMATION' : [ 0x30, {
    'InterceptorFunction' : [ 0x0, ['pointer64', ['void']]],
    'InterceptorValue' : [ 0x8, ['unsigned short']],
    'ExtendedOptions' : [ 0xc, ['unsigned long']],
    'StackTraceDepth' : [ 0x10, ['unsigned long']],
    'MinTotalBlockSize' : [ 0x18, ['unsigned long long']],
    'MaxTotalBlockSize' : [ 0x20, ['unsigned long long']],
    'HeapLeakEnumerationRoutine' : [ 0x28, ['pointer64', ['void']]],
} ],
  '_IO_RESOURCE_LIST' : [ 0x28, {
    'Version' : [ 0x0, ['unsigned short']],
    'Revision' : [ 0x2, ['unsigned short']],
    'Count' : [ 0x4, ['unsigned long']],
    'Descriptors' : [ 0x8, ['array', 1, ['_IO_RESOURCE_DESCRIPTOR']]],
} ],
  '_MMBANKED_SECTION' : [ 0x38, {
    'BasePhysicalPage' : [ 0x0, ['unsigned long long']],
    'BasedPte' : [ 0x8, ['pointer64', ['_MMPTE']]],
    'BankSize' : [ 0x10, ['unsigned long']],
    'BankShift' : [ 0x14, ['unsigned long']],
    'BankedRoutine' : [ 0x18, ['pointer64', ['void']]],
    'Context' : [ 0x20, ['pointer64', ['void']]],
    'CurrentMappedPte' : [ 0x28, ['pointer64', ['_MMPTE']]],
    'BankTemplate' : [ 0x30, ['array', 1, ['_MMPTE']]],
} ],
  '_WHEA_ERROR_RECORD_HEADER_FLAGS' : [ 0x4, {
    'Recovered' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PreviousError' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Simulated' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_XSAVE_AREA_HEADER' : [ 0x40, {
    'Mask' : [ 0x0, ['unsigned long long']],
    'Reserved' : [ 0x8, ['array', 7, ['unsigned long long']]],
} ],
  '_HEAP_VIRTUAL_ALLOC_ENTRY' : [ 0x40, {
    'Entry' : [ 0x0, ['_LIST_ENTRY']],
    'ExtraStuff' : [ 0x10, ['_HEAP_ENTRY_EXTRA']],
    'CommitSize' : [ 0x20, ['unsigned long long']],
    'ReserveSize' : [ 0x28, ['unsigned long long']],
    'BusyBlock' : [ 0x30, ['_HEAP_ENTRY']],
} ],
  '_PNP_DEVICE_COMPLETION_REQUEST' : [ 0x68, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'DeviceNode' : [ 0x10, ['pointer64', ['_DEVICE_NODE']]],
    'Context' : [ 0x18, ['pointer64', ['void']]],
    'CompletionState' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]],
    'IrpPended' : [ 0x24, ['unsigned long']],
    'Status' : [ 0x28, ['long']],
    'Information' : [ 0x30, ['pointer64', ['void']]],
    'WorkItem' : [ 0x38, ['_WORK_QUEUE_ITEM']],
    'FailingDriver' : [ 0x58, ['pointer64', ['_DRIVER_OBJECT']]],
    'ReferenceCount' : [ 0x60, ['long']],
} ],
  '_KTSS64' : [ 0x68, {
    'Reserved0' : [ 0x0, ['unsigned long']],
    'Rsp0' : [ 0x4, ['unsigned long long']],
    'Rsp1' : [ 0xc, ['unsigned long long']],
    'Rsp2' : [ 0x14, ['unsigned long long']],
    'Ist' : [ 0x1c, ['array', 8, ['unsigned long long']]],
    'Reserved1' : [ 0x5c, ['unsigned long long']],
    'Reserved2' : [ 0x64, ['unsigned short']],
    'IoMapBase' : [ 0x66, ['unsigned short']],
} ],
  '_EVENT_FILTER_HEADER' : [ 0x18, {
    'Id' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['array', 5, ['unsigned char']]],
    'InstanceId' : [ 0x8, ['unsigned long long']],
    'Size' : [ 0x10, ['unsigned long']],
    'NextOffset' : [ 0x14, ['unsigned long']],
} ],
  '_WAIT_CONTEXT_BLOCK' : [ 0x48, {
    'WaitQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DeviceRoutine' : [ 0x18, ['pointer64', ['void']]],
    'DeviceContext' : [ 0x20, ['pointer64', ['void']]],
    'NumberOfMapRegisters' : [ 0x28, ['unsigned long']],
    'DeviceObject' : [ 0x30, ['pointer64', ['void']]],
    'CurrentIrp' : [ 0x38, ['pointer64', ['void']]],
    'BufferChainingDpc' : [ 0x40, ['pointer64', ['_KDPC']]],
} ],
  '_SECTION_OBJECT' : [ 0x30, {
    'StartingVa' : [ 0x0, ['pointer64', ['void']]],
    'EndingVa' : [ 0x8, ['pointer64', ['void']]],
    'Parent' : [ 0x10, ['pointer64', ['void']]],
    'LeftChild' : [ 0x18, ['pointer64', ['void']]],
    'RightChild' : [ 0x20, ['pointer64', ['void']]],
    'Segment' : [ 0x28, ['pointer64', ['_SEGMENT_OBJECT']]],
} ],
  '_CM_NAME_CONTROL_BLOCK' : [ 0x20, {
    'Compressed' : [ 0x0, ['unsigned char']],
    'RefCount' : [ 0x2, ['unsigned short']],
    'NameHash' : [ 0x8, ['_CM_NAME_HASH']],
    'ConvKey' : [ 0x8, ['unsigned long']],
    'NextHash' : [ 0x10, ['pointer64', ['_CM_KEY_HASH']]],
    'NameLength' : [ 0x18, ['unsigned short']],
    'Name' : [ 0x1a, ['array', 1, ['wchar']]],
} ],
  '_u' : [ 0x50, {
    'KeyNode' : [ 0x0, ['_CM_KEY_NODE']],
    'KeyValue' : [ 0x0, ['_CM_KEY_VALUE']],
    'KeySecurity' : [ 0x0, ['_CM_KEY_SECURITY']],
    'KeyIndex' : [ 0x0, ['_CM_KEY_INDEX']],
    'ValueData' : [ 0x0, ['_CM_BIG_DATA']],
    'KeyList' : [ 0x0, ['array', 1, ['unsigned long']]],
    'KeyString' : [ 0x0, ['array', 1, ['wchar']]],
} ],
  '_GENERAL_LOOKASIDE_POOL' : [ 0x60, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'SingleListHead' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x10, ['unsigned short']],
    'MaximumDepth' : [ 0x12, ['unsigned short']],
    'TotalAllocates' : [ 0x14, ['unsigned long']],
    'AllocateMisses' : [ 0x18, ['unsigned long']],
    'AllocateHits' : [ 0x18, ['unsigned long']],
    'TotalFrees' : [ 0x1c, ['unsigned long']],
    'FreeMisses' : [ 0x20, ['unsigned long']],
    'FreeHits' : [ 0x20, ['unsigned long']],
    'Type' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: 'NonPagedPool', 1: 'PagedPool', 2: 'NonPagedPoolMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolCacheAlignedMustS', 7: 'MaxPoolType', 34: 'NonPagedPoolMustSucceedSession', 35: 'DontUseThisTypeSession', 32: 'NonPagedPoolSession', 36: 'NonPagedPoolCacheAlignedSession', 33: 'PagedPoolSession', 38: 'NonPagedPoolCacheAlignedMustSSession', 37: 'PagedPoolCacheAlignedSession'})]],
    'Tag' : [ 0x28, ['unsigned long']],
    'Size' : [ 0x2c, ['unsigned long']],
    'AllocateEx' : [ 0x30, ['pointer64', ['void']]],
    'Allocate' : [ 0x30, ['pointer64', ['void']]],
    'FreeEx' : [ 0x38, ['pointer64', ['void']]],
    'Free' : [ 0x38, ['pointer64', ['void']]],
    'ListEntry' : [ 0x40, ['_LIST_ENTRY']],
    'LastTotalAllocates' : [ 0x50, ['unsigned long']],
    'LastAllocateMisses' : [ 0x54, ['unsigned long']],
    'LastAllocateHits' : [ 0x54, ['unsigned long']],
    'Future' : [ 0x58, ['array', 2, ['unsigned long']]],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_ENTRY' : [ 0x18, {
    'Linkage' : [ 0x0, ['_LIST_ENTRY']],
    'Signature' : [ 0x10, ['unsigned long long']],
} ],
  '__unnamed_205c' : [ 0x4, {
    'AsULONG' : [ 0x0, ['unsigned long']],
    'IncreasePolicy' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned long')]],
    'DecreasePolicy' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
} ],
  '_PPM_PERF_STATES' : [ 0xb0, {
    'Count' : [ 0x0, ['unsigned long']],
    'MaxFrequency' : [ 0x4, ['unsigned long']],
    'PStateCap' : [ 0x8, ['unsigned long']],
    'TStateCap' : [ 0xc, ['unsigned long']],
    'MaxPerfState' : [ 0x10, ['unsigned long']],
    'MinPerfState' : [ 0x14, ['unsigned long']],
    'LowestPState' : [ 0x18, ['unsigned long']],
    'IncreaseTime' : [ 0x1c, ['unsigned long']],
    'DecreaseTime' : [ 0x20, ['unsigned long']],
    'BusyAdjThreshold' : [ 0x24, ['unsigned char']],
    'Reserved' : [ 0x25, ['unsigned char']],
    'ThrottleStatesOnly' : [ 0x26, ['unsigned char']],
    'PolicyType' : [ 0x27, ['unsigned char']],
    'TimerInterval' : [ 0x28, ['unsigned long']],
    'Flags' : [ 0x2c, ['__unnamed_205c']],
    'TargetProcessors' : [ 0x30, ['_KAFFINITY_EX']],
    'PStateHandler' : [ 0x58, ['pointer64', ['void']]],
    'PStateContext' : [ 0x60, ['unsigned long long']],
    'TStateHandler' : [ 0x68, ['pointer64', ['void']]],
    'TStateContext' : [ 0x70, ['unsigned long long']],
    'FeedbackHandler' : [ 0x78, ['pointer64', ['void']]],
    'GetFFHThrottleState' : [ 0x80, ['pointer64', ['void']]],
    'State' : [ 0x88, ['array', 1, ['_PPM_PERF_STATE']]],
} ],
  '_M128A' : [ 0x10, {
    'Low' : [ 0x0, ['unsigned long long']],
    'High' : [ 0x8, ['long long']],
} ],
  '_HEAP_LOOKASIDE' : [ 0x40, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'Depth' : [ 0x10, ['unsigned short']],
    'MaximumDepth' : [ 0x12, ['unsigned short']],
    'TotalAllocates' : [ 0x14, ['unsigned long']],
    'AllocateMisses' : [ 0x18, ['unsigned long']],
    'TotalFrees' : [ 0x1c, ['unsigned long']],
    'FreeMisses' : [ 0x20, ['unsigned long']],
    'LastTotalAllocates' : [ 0x24, ['unsigned long']],
    'LastAllocateMisses' : [ 0x28, ['unsigned long']],
    'Counters' : [ 0x2c, ['array', 2, ['unsigned long']]],
} ],
  '_WMI_TRACE_PACKET' : [ 0x4, {
    'Size' : [ 0x0, ['unsigned short']],
    'HookId' : [ 0x2, ['unsigned short']],
    'Type' : [ 0x2, ['unsigned char']],
    'Group' : [ 0x3, ['unsigned char']],
} ],
  '_KTIMER' : [ 0x40, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'DueTime' : [ 0x18, ['_ULARGE_INTEGER']],
    'TimerListEntry' : [ 0x20, ['_LIST_ENTRY']],
    'Dpc' : [ 0x30, ['pointer64', ['_KDPC']]],
    'Processor' : [ 0x38, ['unsigned long']],
    'Period' : [ 0x3c, ['unsigned long']],
} ],
  '_RTL_ATOM_TABLE' : [ 0x70, {
    'Signature' : [ 0x0, ['unsigned long']],
    'CriticalSection' : [ 0x8, ['_RTL_CRITICAL_SECTION']],
    'RtlHandleTable' : [ 0x30, ['_RTL_HANDLE_TABLE']],
    'NumberOfBuckets' : [ 0x60, ['unsigned long']],
    'Buckets' : [ 0x68, ['array', 1, ['pointer64', ['_RTL_ATOM_TABLE_ENTRY']]]],
} ],
  '_POP_POWER_ACTION' : [ 0xc0, {
    'Updates' : [ 0x0, ['unsigned char']],
    'State' : [ 0x1, ['unsigned char']],
    'Shutdown' : [ 0x2, ['unsigned char']],
    'Action' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'PowerActionNone', 1: 'PowerActionReserved', 2: 'PowerActionSleep', 3: 'PowerActionHibernate', 4: 'PowerActionShutdown', 5: 'PowerActionShutdownReset', 6: 'PowerActionShutdownOff', 7: 'PowerActionWarmEject'})]],
    'LightestState' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'Flags' : [ 0xc, ['unsigned long']],
    'Status' : [ 0x10, ['long']],
    'DeviceType' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: 'PolicyDeviceSystemButton', 1: 'PolicyDeviceThermalZone', 2: 'PolicyDeviceBattery', 3: 'PolicyDeviceMemory', 4: 'PolicyInitiatePowerActionAPI', 5: 'PolicySetPowerStateAPI', 6: 'PolicyImmediateDozeS4', 7: 'PolicySystemIdle', 8: 'PolicyDeviceMax'})]],
    'DeviceTypeFlags' : [ 0x18, ['unsigned long']],
    'IrpMinor' : [ 0x1c, ['unsigned char']],
    'Waking' : [ 0x1d, ['unsigned char']],
    'SystemState' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'NextSystemState' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'EffectiveSystemState' : [ 0x28, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'CurrentSystemState' : [ 0x2c, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'ShutdownBugCode' : [ 0x30, ['pointer64', ['_POP_SHUTDOWN_BUG_CHECK']]],
    'DevState' : [ 0x38, ['pointer64', ['_POP_DEVICE_SYS_STATE']]],
    'HiberContext' : [ 0x40, ['pointer64', ['_POP_HIBER_CONTEXT']]],
    'WakeTime' : [ 0x48, ['unsigned long long']],
    'SleepTime' : [ 0x50, ['unsigned long long']],
    'ProgrammedRTCTime' : [ 0x58, ['unsigned long long']],
    'WakeOnRTC' : [ 0x60, ['unsigned char']],
    'WakeTimerInfo' : [ 0x68, ['pointer64', ['_DIAGNOSTIC_BUFFER']]],
    'FilteredCapabilities' : [ 0x70, ['SYSTEM_POWER_CAPABILITIES']],
} ],
  '_CM_KEY_VALUE' : [ 0x18, {
    'Signature' : [ 0x0, ['unsigned short']],
    'NameLength' : [ 0x2, ['unsigned short']],
    'DataLength' : [ 0x4, ['unsigned long']],
    'Data' : [ 0x8, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned long']],
    'Flags' : [ 0x10, ['unsigned short']],
    'Spare' : [ 0x12, ['unsigned short']],
    'Name' : [ 0x14, ['array', 1, ['wchar']]],
} ],
  '_AMD64_DBGKD_CONTROL_SET' : [ 0x1c, {
    'TraceFlag' : [ 0x0, ['unsigned long']],
    'Dr7' : [ 0x4, ['unsigned long long']],
    'CurrentSymbolStart' : [ 0xc, ['unsigned long long']],
    'CurrentSymbolEnd' : [ 0x14, ['unsigned long long']],
} ],
  '_PO_DEVICE_NOTIFY' : [ 0x68, {
    'Link' : [ 0x0, ['_LIST_ENTRY']],
    'PowerChildren' : [ 0x10, ['_LIST_ENTRY']],
    'PowerParents' : [ 0x20, ['_LIST_ENTRY']],
    'TargetDevice' : [ 0x30, ['pointer64', ['_DEVICE_OBJECT']]],
    'OrderLevel' : [ 0x38, ['unsigned char']],
    'DeviceObject' : [ 0x40, ['pointer64', ['_DEVICE_OBJECT']]],
    'DeviceName' : [ 0x48, ['pointer64', ['unsigned short']]],
    'DriverName' : [ 0x50, ['pointer64', ['unsigned short']]],
    'ChildCount' : [ 0x58, ['unsigned long']],
    'ActiveChild' : [ 0x5c, ['unsigned long']],
    'ParentCount' : [ 0x60, ['unsigned long']],
    'ActiveParent' : [ 0x64, ['unsigned long']],
} ],
  '_CM_KEY_SECURITY_CACHE_ENTRY' : [ 0x10, {
    'Cell' : [ 0x0, ['unsigned long']],
    'CachedSecurity' : [ 0x8, ['pointer64', ['_CM_KEY_SECURITY_CACHE']]],
} ],
  '_FS_FILTER_CALLBACK_DATA' : [ 0x40, {
    'SizeOfFsFilterCallbackData' : [ 0x0, ['unsigned long']],
    'Operation' : [ 0x4, ['unsigned char']],
    'Reserved' : [ 0x5, ['unsigned char']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'FileObject' : [ 0x10, ['pointer64', ['_FILE_OBJECT']]],
    'Parameters' : [ 0x18, ['_FS_FILTER_PARAMETERS']],
} ],
  '_PROC_IDLE_STATE_ACCOUNTING' : [ 0x228, {
    'TotalTime' : [ 0x0, ['unsigned long long']],
    'IdleTransitions' : [ 0x8, ['unsigned long']],
    'FailedTransitions' : [ 0xc, ['unsigned long']],
    'InvalidBucketIndex' : [ 0x10, ['unsigned long']],
    'MinTime' : [ 0x18, ['unsigned long long']],
    'MaxTime' : [ 0x20, ['unsigned long long']],
    'IdleTimeBuckets' : [ 0x28, ['array', 16, ['_PROC_IDLE_STATE_BUCKET']]],
} ],
  '_IMAGE_SECURITY_CONTEXT' : [ 0x8, {
    'PageHashes' : [ 0x0, ['pointer64', ['void']]],
    'Value' : [ 0x0, ['unsigned long long']],
    'SecurityBeingCreated' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'SecurityMandatory' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Unused' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'PageHashPointer' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 64, native_type='unsigned long long')]],
} ],
  '__unnamed_209e' : [ 0x4, {
    'Level' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_20a0' : [ 0x4, {
    'Type' : [ 0x0, ['unsigned long']],
} ],
  '_POP_ACTION_TRIGGER' : [ 0x18, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'PolicyDeviceSystemButton', 1: 'PolicyDeviceThermalZone', 2: 'PolicyDeviceBattery', 3: 'PolicyDeviceMemory', 4: 'PolicyInitiatePowerActionAPI', 5: 'PolicySetPowerStateAPI', 6: 'PolicyImmediateDozeS4', 7: 'PolicySystemIdle', 8: 'PolicyDeviceMax'})]],
    'Flags' : [ 0x4, ['unsigned long']],
    'Wait' : [ 0x8, ['pointer64', ['_POP_TRIGGER_WAIT']]],
    'Battery' : [ 0x10, ['__unnamed_209e']],
    'Button' : [ 0x10, ['__unnamed_20a0']],
} ],
  '_KENLISTMENT_HISTORY' : [ 0x8, {
    'Notification' : [ 0x0, ['unsigned long']],
    'NewState' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'KEnlistmentUninitialized', 256: 'KEnlistmentActive', 258: 'KEnlistmentPrepared', 259: 'KEnlistmentInDoubt', 260: 'KEnlistmentCommitted', 261: 'KEnlistmentCommittedNotify', 262: 'KEnlistmentCommitRequested', 257: 'KEnlistmentPreparing', 264: 'KEnlistmentDelegated', 265: 'KEnlistmentDelegatedDisconnected', 266: 'KEnlistmentPrePreparing', 263: 'KEnlistmentAborted', 268: 'KEnlistmentRecovering', 269: 'KEnlistmentAborting', 270: 'KEnlistmentReadOnly', 271: 'KEnlistmentOutcomeUnavailable', 272: 'KEnlistmentOffline', 273: 'KEnlistmentPrePrepared', 274: 'KEnlistmentInitialized', 267: 'KEnlistmentForgotten'})]],
} ],
  '_FAST_IO_DISPATCH' : [ 0xe0, {
    'SizeOfFastIoDispatch' : [ 0x0, ['unsigned long']],
    'FastIoCheckIfPossible' : [ 0x8, ['pointer64', ['void']]],
    'FastIoRead' : [ 0x10, ['pointer64', ['void']]],
    'FastIoWrite' : [ 0x18, ['pointer64', ['void']]],
    'FastIoQueryBasicInfo' : [ 0x20, ['pointer64', ['void']]],
    'FastIoQueryStandardInfo' : [ 0x28, ['pointer64', ['void']]],
    'FastIoLock' : [ 0x30, ['pointer64', ['void']]],
    'FastIoUnlockSingle' : [ 0x38, ['pointer64', ['void']]],
    'FastIoUnlockAll' : [ 0x40, ['pointer64', ['void']]],
    'FastIoUnlockAllByKey' : [ 0x48, ['pointer64', ['void']]],
    'FastIoDeviceControl' : [ 0x50, ['pointer64', ['void']]],
    'AcquireFileForNtCreateSection' : [ 0x58, ['pointer64', ['void']]],
    'ReleaseFileForNtCreateSection' : [ 0x60, ['pointer64', ['void']]],
    'FastIoDetachDevice' : [ 0x68, ['pointer64', ['void']]],
    'FastIoQueryNetworkOpenInfo' : [ 0x70, ['pointer64', ['void']]],
    'AcquireForModWrite' : [ 0x78, ['pointer64', ['void']]],
    'MdlRead' : [ 0x80, ['pointer64', ['void']]],
    'MdlReadComplete' : [ 0x88, ['pointer64', ['void']]],
    'PrepareMdlWrite' : [ 0x90, ['pointer64', ['void']]],
    'MdlWriteComplete' : [ 0x98, ['pointer64', ['void']]],
    'FastIoReadCompressed' : [ 0xa0, ['pointer64', ['void']]],
    'FastIoWriteCompressed' : [ 0xa8, ['pointer64', ['void']]],
    'MdlReadCompleteCompressed' : [ 0xb0, ['pointer64', ['void']]],
    'MdlWriteCompleteCompressed' : [ 0xb8, ['pointer64', ['void']]],
    'FastIoQueryOpen' : [ 0xc0, ['pointer64', ['void']]],
    'ReleaseForModWrite' : [ 0xc8, ['pointer64', ['void']]],
    'AcquireForCcFlush' : [ 0xd0, ['pointer64', ['void']]],
    'ReleaseForCcFlush' : [ 0xd8, ['pointer64', ['void']]],
} ],
  '_KIDTENTRY64' : [ 0x10, {
    'OffsetLow' : [ 0x0, ['unsigned short']],
    'Selector' : [ 0x2, ['unsigned short']],
    'IstIndex' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned short')]],
    'Reserved0' : [ 0x4, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned short')]],
    'Type' : [ 0x4, ['BitField', dict(start_bit = 8, end_bit = 13, native_type='unsigned short')]],
    'Dpl' : [ 0x4, ['BitField', dict(start_bit = 13, end_bit = 15, native_type='unsigned short')]],
    'Present' : [ 0x4, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned short')]],
    'OffsetMiddle' : [ 0x6, ['unsigned short']],
    'OffsetHigh' : [ 0x8, ['unsigned long']],
    'Reserved1' : [ 0xc, ['unsigned long']],
    'Alignment' : [ 0x0, ['unsigned long long']],
} ],
  '_CM_CELL_REMAP_BLOCK' : [ 0x8, {
    'OldCell' : [ 0x0, ['unsigned long']],
    'NewCell' : [ 0x4, ['unsigned long']],
} ],
  '_OBJECT_DIRECTORY_ENTRY' : [ 0x18, {
    'ChainLink' : [ 0x0, ['pointer64', ['_OBJECT_DIRECTORY_ENTRY']]],
    'Object' : [ 0x8, ['pointer64', ['void']]],
    'HashValue' : [ 0x10, ['unsigned long']],
} ],
  '_LOADER_PARAMETER_EXTENSION' : [ 0x148, {
    'Size' : [ 0x0, ['unsigned long']],
    'Profile' : [ 0x4, ['_PROFILE_PARAMETER_BLOCK']],
    'EmInfFileImage' : [ 0x18, ['pointer64', ['void']]],
    'EmInfFileSize' : [ 0x20, ['unsigned long']],
    'TriageDumpBlock' : [ 0x28, ['pointer64', ['void']]],
    'LoaderPagesSpanned' : [ 0x30, ['unsigned long long']],
    'HeadlessLoaderBlock' : [ 0x38, ['pointer64', ['_HEADLESS_LOADER_BLOCK']]],
    'SMBiosEPSHeader' : [ 0x40, ['pointer64', ['_SMBIOS_TABLE_HEADER']]],
    'DrvDBImage' : [ 0x48, ['pointer64', ['void']]],
    'DrvDBSize' : [ 0x50, ['unsigned long']],
    'NetworkLoaderBlock' : [ 0x58, ['pointer64', ['_NETWORK_LOADER_BLOCK']]],
    'FirmwareDescriptorListHead' : [ 0x60, ['_LIST_ENTRY']],
    'AcpiTable' : [ 0x70, ['pointer64', ['void']]],
    'AcpiTableSize' : [ 0x78, ['unsigned long']],
    'LastBootSucceeded' : [ 0x7c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'LastBootShutdown' : [ 0x7c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'IoPortAccessSupported' : [ 0x7c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Reserved' : [ 0x7c, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'LoaderPerformanceData' : [ 0x80, ['pointer64', ['_LOADER_PERFORMANCE_DATA']]],
    'BootApplicationPersistentData' : [ 0x88, ['_LIST_ENTRY']],
    'WmdTestResult' : [ 0x98, ['pointer64', ['void']]],
    'BootIdentifier' : [ 0xa0, ['_GUID']],
    'ResumePages' : [ 0xb0, ['unsigned long']],
    'DumpHeader' : [ 0xb8, ['pointer64', ['void']]],
    'BgContext' : [ 0xc0, ['pointer64', ['void']]],
    'NumaLocalityInfo' : [ 0xc8, ['pointer64', ['void']]],
    'NumaGroupAssignment' : [ 0xd0, ['pointer64', ['void']]],
    'AttachedHives' : [ 0xd8, ['_LIST_ENTRY']],
    'MemoryCachingRequirementsCount' : [ 0xe8, ['unsigned long']],
    'MemoryCachingRequirements' : [ 0xf0, ['pointer64', ['void']]],
    'TpmBootEntropyResult' : [ 0xf8, ['_TPM_BOOT_ENTROPY_LDR_RESULT']],
    'ProcessorCounterFrequency' : [ 0x140, ['unsigned long long']],
} ],
  '_PI_RESOURCE_ARBITER_ENTRY' : [ 0x70, {
    'DeviceArbiterList' : [ 0x0, ['_LIST_ENTRY']],
    'ResourceType' : [ 0x10, ['unsigned char']],
    'ArbiterInterface' : [ 0x18, ['pointer64', ['_ARBITER_INTERFACE']]],
    'DeviceNode' : [ 0x20, ['pointer64', ['_DEVICE_NODE']]],
    'ResourceList' : [ 0x28, ['_LIST_ENTRY']],
    'BestResourceList' : [ 0x38, ['_LIST_ENTRY']],
    'BestConfig' : [ 0x48, ['_LIST_ENTRY']],
    'ActiveArbiterList' : [ 0x58, ['_LIST_ENTRY']],
    'State' : [ 0x68, ['unsigned char']],
    'ResourcesChanged' : [ 0x69, ['unsigned char']],
} ],
  '_SECURITY_DESCRIPTOR' : [ 0x28, {
    'Revision' : [ 0x0, ['unsigned char']],
    'Sbz1' : [ 0x1, ['unsigned char']],
    'Control' : [ 0x2, ['unsigned short']],
    'Owner' : [ 0x8, ['pointer64', ['void']]],
    'Group' : [ 0x10, ['pointer64', ['void']]],
    'Sacl' : [ 0x18, ['pointer64', ['_ACL']]],
    'Dacl' : [ 0x20, ['pointer64', ['_ACL']]],
} ],
  '_KUMS_CONTEXT_HEADER' : [ 0x70, {
    'P1Home' : [ 0x0, ['unsigned long long']],
    'P2Home' : [ 0x8, ['unsigned long long']],
    'P3Home' : [ 0x10, ['unsigned long long']],
    'P4Home' : [ 0x18, ['unsigned long long']],
    'StackTop' : [ 0x20, ['pointer64', ['void']]],
    'StackSize' : [ 0x28, ['unsigned long long']],
    'RspOffset' : [ 0x30, ['unsigned long long']],
    'Rip' : [ 0x38, ['unsigned long long']],
    'FltSave' : [ 0x40, ['pointer64', ['_XSAVE_FORMAT']]],
    'Volatile' : [ 0x48, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Reserved' : [ 0x48, ['BitField', dict(start_bit = 1, end_bit = 64, native_type='unsigned long long')]],
    'Flags' : [ 0x48, ['unsigned long long']],
    'TrapFrame' : [ 0x50, ['pointer64', ['_KTRAP_FRAME']]],
    'ExceptionFrame' : [ 0x58, ['pointer64', ['_KEXCEPTION_FRAME']]],
    'SourceThread' : [ 0x60, ['pointer64', ['_KTHREAD']]],
    'Return' : [ 0x68, ['unsigned long long']],
} ],
  '_RTL_USER_PROCESS_PARAMETERS' : [ 0x400, {
    'MaximumLength' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x4, ['unsigned long']],
    'Flags' : [ 0x8, ['unsigned long']],
    'DebugFlags' : [ 0xc, ['unsigned long']],
    'ConsoleHandle' : [ 0x10, ['pointer64', ['void']]],
    'ConsoleFlags' : [ 0x18, ['unsigned long']],
    'StandardInput' : [ 0x20, ['pointer64', ['void']]],
    'StandardOutput' : [ 0x28, ['pointer64', ['void']]],
    'StandardError' : [ 0x30, ['pointer64', ['void']]],
    'CurrentDirectory' : [ 0x38, ['_CURDIR']],
    'DllPath' : [ 0x50, ['_UNICODE_STRING']],
    'ImagePathName' : [ 0x60, ['_UNICODE_STRING']],
    'CommandLine' : [ 0x70, ['_UNICODE_STRING']],
    'Environment' : [ 0x80, ['pointer64', ['void']]],
    'StartingX' : [ 0x88, ['unsigned long']],
    'StartingY' : [ 0x8c, ['unsigned long']],
    'CountX' : [ 0x90, ['unsigned long']],
    'CountY' : [ 0x94, ['unsigned long']],
    'CountCharsX' : [ 0x98, ['unsigned long']],
    'CountCharsY' : [ 0x9c, ['unsigned long']],
    'FillAttribute' : [ 0xa0, ['unsigned long']],
    'WindowFlags' : [ 0xa4, ['unsigned long']],
    'ShowWindowFlags' : [ 0xa8, ['unsigned long']],
    'WindowTitle' : [ 0xb0, ['_UNICODE_STRING']],
    'DesktopInfo' : [ 0xc0, ['_UNICODE_STRING']],
    'ShellInfo' : [ 0xd0, ['_UNICODE_STRING']],
    'RuntimeData' : [ 0xe0, ['_UNICODE_STRING']],
    'CurrentDirectores' : [ 0xf0, ['array', 32, ['_RTL_DRIVE_LETTER_CURDIR']]],
    'EnvironmentSize' : [ 0x3f0, ['unsigned long long']],
    'EnvironmentVersion' : [ 0x3f8, ['unsigned long long']],
} ],
  '_PHYSICAL_MEMORY_RUN' : [ 0x10, {
    'BasePage' : [ 0x0, ['unsigned long long']],
    'PageCount' : [ 0x8, ['unsigned long long']],
} ],
  '_RTL_SRWLOCK' : [ 0x8, {
    'Locked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Waiting' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Waking' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'MultipleShared' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'Shared' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 64, native_type='unsigned long long')]],
    'Value' : [ 0x0, ['unsigned long long']],
    'Ptr' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_ALPC_MESSAGE_ZONE' : [ 0x30, {
    'Mdl' : [ 0x0, ['pointer64', ['_MDL']]],
    'UserVa' : [ 0x8, ['pointer64', ['void']]],
    'UserLimit' : [ 0x10, ['pointer64', ['void']]],
    'SystemVa' : [ 0x18, ['pointer64', ['void']]],
    'SystemLimit' : [ 0x20, ['pointer64', ['void']]],
    'Size' : [ 0x28, ['unsigned long long']],
} ],
  '_KTMOBJECT_NAMESPACE_LINK' : [ 0x28, {
    'Links' : [ 0x0, ['_RTL_BALANCED_LINKS']],
    'Expired' : [ 0x20, ['unsigned char']],
} ],
  '_CACHE_MANAGER_CALLBACKS' : [ 0x20, {
    'AcquireForLazyWrite' : [ 0x0, ['pointer64', ['void']]],
    'ReleaseFromLazyWrite' : [ 0x8, ['pointer64', ['void']]],
    'AcquireForReadAhead' : [ 0x10, ['pointer64', ['void']]],
    'ReleaseFromReadAhead' : [ 0x18, ['pointer64', ['void']]],
} ],
  '_PROC_PERF_LOAD' : [ 0x2, {
    'BusyPercentage' : [ 0x0, ['unsigned char']],
    'FrequencyPercentage' : [ 0x1, ['unsigned char']],
} ],
  '_PROC_HISTORY_ENTRY' : [ 0x4, {
    'Utility' : [ 0x0, ['unsigned short']],
    'Frequency' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
} ],
  '_RTL_RANGE' : [ 0x28, {
    'Start' : [ 0x0, ['unsigned long long']],
    'End' : [ 0x8, ['unsigned long long']],
    'UserData' : [ 0x10, ['pointer64', ['void']]],
    'Owner' : [ 0x18, ['pointer64', ['void']]],
    'Attributes' : [ 0x20, ['unsigned char']],
    'Flags' : [ 0x21, ['unsigned char']],
} ],
  '_KSPECIAL_REGISTERS' : [ 0xd8, {
    'Cr0' : [ 0x0, ['unsigned long long']],
    'Cr2' : [ 0x8, ['unsigned long long']],
    'Cr3' : [ 0x10, ['unsigned long long']],
    'Cr4' : [ 0x18, ['unsigned long long']],
    'KernelDr0' : [ 0x20, ['unsigned long long']],
    'KernelDr1' : [ 0x28, ['unsigned long long']],
    'KernelDr2' : [ 0x30, ['unsigned long long']],
    'KernelDr3' : [ 0x38, ['unsigned long long']],
    'KernelDr6' : [ 0x40, ['unsigned long long']],
    'KernelDr7' : [ 0x48, ['unsigned long long']],
    'Gdtr' : [ 0x50, ['_KDESCRIPTOR']],
    'Idtr' : [ 0x60, ['_KDESCRIPTOR']],
    'Tr' : [ 0x70, ['unsigned short']],
    'Ldtr' : [ 0x72, ['unsigned short']],
    'MxCsr' : [ 0x74, ['unsigned long']],
    'DebugControl' : [ 0x78, ['unsigned long long']],
    'LastBranchToRip' : [ 0x80, ['unsigned long long']],
    'LastBranchFromRip' : [ 0x88, ['unsigned long long']],
    'LastExceptionToRip' : [ 0x90, ['unsigned long long']],
    'LastExceptionFromRip' : [ 0x98, ['unsigned long long']],
    'Cr8' : [ 0xa0, ['unsigned long long']],
    'MsrGsBase' : [ 0xa8, ['unsigned long long']],
    'MsrGsSwap' : [ 0xb0, ['unsigned long long']],
    'MsrStar' : [ 0xb8, ['unsigned long long']],
    'MsrLStar' : [ 0xc0, ['unsigned long long']],
    'MsrCStar' : [ 0xc8, ['unsigned long long']],
    'MsrSyscallMask' : [ 0xd0, ['unsigned long long']],
} ],
  '_SYSTEM_POWER_POLICY' : [ 0xe8, {
    'Revision' : [ 0x0, ['unsigned long']],
    'PowerButton' : [ 0x4, ['POWER_ACTION_POLICY']],
    'SleepButton' : [ 0x10, ['POWER_ACTION_POLICY']],
    'LidClose' : [ 0x1c, ['POWER_ACTION_POLICY']],
    'LidOpenWake' : [ 0x28, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'Reserved' : [ 0x2c, ['unsigned long']],
    'Idle' : [ 0x30, ['POWER_ACTION_POLICY']],
    'IdleTimeout' : [ 0x3c, ['unsigned long']],
    'IdleSensitivity' : [ 0x40, ['unsigned char']],
    'DynamicThrottle' : [ 0x41, ['unsigned char']],
    'Spare2' : [ 0x42, ['array', 2, ['unsigned char']]],
    'MinSleep' : [ 0x44, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'MaxSleep' : [ 0x48, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'ReducedLatencySleep' : [ 0x4c, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'WinLogonFlags' : [ 0x50, ['unsigned long']],
    'Spare3' : [ 0x54, ['unsigned long']],
    'DozeS4Timeout' : [ 0x58, ['unsigned long']],
    'BroadcastCapacityResolution' : [ 0x5c, ['unsigned long']],
    'DischargePolicy' : [ 0x60, ['array', 4, ['SYSTEM_POWER_LEVEL']]],
    'VideoTimeout' : [ 0xc0, ['unsigned long']],
    'VideoDimDisplay' : [ 0xc4, ['unsigned char']],
    'VideoReserved' : [ 0xc8, ['array', 3, ['unsigned long']]],
    'SpindownTimeout' : [ 0xd4, ['unsigned long']],
    'OptimizeForPower' : [ 0xd8, ['unsigned char']],
    'FanThrottleTolerance' : [ 0xd9, ['unsigned char']],
    'ForcedThrottle' : [ 0xda, ['unsigned char']],
    'MinThrottle' : [ 0xdb, ['unsigned char']],
    'OverThrottled' : [ 0xdc, ['POWER_ACTION_POLICY']],
} ],
  '_POOL_HEADER' : [ 0x10, {
    'PreviousSize' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
    'PoolIndex' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned long')]],
    'BlockSize' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 24, native_type='unsigned long')]],
    'PoolType' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'Ulong1' : [ 0x0, ['unsigned long']],
    'PoolTag' : [ 0x4, ['unsigned long']],
    'ProcessBilled' : [ 0x8, ['pointer64', ['_EPROCESS']]],
    'AllocatorBackTraceIndex' : [ 0x8, ['unsigned short']],
    'PoolTagHash' : [ 0xa, ['unsigned short']],
} ],
  '_ETW_PROVIDER_TABLE_ENTRY' : [ 0x18, {
    'RefCount' : [ 0x0, ['long']],
    'State' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'EtwProviderStateFree', 1: 'EtwProviderStateTransition', 2: 'EtwProviderStateActive', 3: 'EtwProviderStateMax'})]],
    'RegEntry' : [ 0x8, ['pointer64', ['_ETW_REG_ENTRY']]],
    'Caller' : [ 0x10, ['pointer64', ['void']]],
} ],
  '_PEB64' : [ 0x380, {
    'InheritedAddressSpace' : [ 0x0, ['unsigned char']],
    'ReadImageFileExecOptions' : [ 0x1, ['unsigned char']],
    'BeingDebugged' : [ 0x2, ['unsigned char']],
    'BitField' : [ 0x3, ['unsigned char']],
    'ImageUsesLargePages' : [ 0x3, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'IsProtectedProcess' : [ 0x3, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'IsLegacyProcess' : [ 0x3, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'IsImageDynamicallyRelocated' : [ 0x3, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'SkipPatchingUser32Forwarders' : [ 0x3, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'SpareBits' : [ 0x3, ['BitField', dict(start_bit = 5, end_bit = 8, native_type='unsigned char')]],
    'Mutant' : [ 0x8, ['unsigned long long']],
    'ImageBaseAddress' : [ 0x10, ['unsigned long long']],
    'Ldr' : [ 0x18, ['unsigned long long']],
    'ProcessParameters' : [ 0x20, ['unsigned long long']],
    'SubSystemData' : [ 0x28, ['unsigned long long']],
    'ProcessHeap' : [ 0x30, ['unsigned long long']],
    'FastPebLock' : [ 0x38, ['unsigned long long']],
    'AtlThunkSListPtr' : [ 0x40, ['unsigned long long']],
    'IFEOKey' : [ 0x48, ['unsigned long long']],
    'CrossProcessFlags' : [ 0x50, ['unsigned long']],
    'ProcessInJob' : [ 0x50, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ProcessInitializing' : [ 0x50, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessUsingVEH' : [ 0x50, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ProcessUsingVCH' : [ 0x50, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ProcessUsingFTH' : [ 0x50, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'ReservedBits0' : [ 0x50, ['BitField', dict(start_bit = 5, end_bit = 32, native_type='unsigned long')]],
    'KernelCallbackTable' : [ 0x58, ['unsigned long long']],
    'UserSharedInfoPtr' : [ 0x58, ['unsigned long long']],
    'SystemReserved' : [ 0x60, ['array', 1, ['unsigned long']]],
    'AtlThunkSListPtr32' : [ 0x64, ['unsigned long']],
    'ApiSetMap' : [ 0x68, ['unsigned long long']],
    'TlsExpansionCounter' : [ 0x70, ['unsigned long']],
    'TlsBitmap' : [ 0x78, ['unsigned long long']],
    'TlsBitmapBits' : [ 0x80, ['array', 2, ['unsigned long']]],
    'ReadOnlySharedMemoryBase' : [ 0x88, ['unsigned long long']],
    'HotpatchInformation' : [ 0x90, ['unsigned long long']],
    'ReadOnlyStaticServerData' : [ 0x98, ['unsigned long long']],
    'AnsiCodePageData' : [ 0xa0, ['unsigned long long']],
    'OemCodePageData' : [ 0xa8, ['unsigned long long']],
    'UnicodeCaseTableData' : [ 0xb0, ['unsigned long long']],
    'NumberOfProcessors' : [ 0xb8, ['unsigned long']],
    'NtGlobalFlag' : [ 0xbc, ['unsigned long']],
    'CriticalSectionTimeout' : [ 0xc0, ['_LARGE_INTEGER']],
    'HeapSegmentReserve' : [ 0xc8, ['unsigned long long']],
    'HeapSegmentCommit' : [ 0xd0, ['unsigned long long']],
    'HeapDeCommitTotalFreeThreshold' : [ 0xd8, ['unsigned long long']],
    'HeapDeCommitFreeBlockThreshold' : [ 0xe0, ['unsigned long long']],
    'NumberOfHeaps' : [ 0xe8, ['unsigned long']],
    'MaximumNumberOfHeaps' : [ 0xec, ['unsigned long']],
    'ProcessHeaps' : [ 0xf0, ['unsigned long long']],
    'GdiSharedHandleTable' : [ 0xf8, ['unsigned long long']],
    'ProcessStarterHelper' : [ 0x100, ['unsigned long long']],
    'GdiDCAttributeList' : [ 0x108, ['unsigned long']],
    'LoaderLock' : [ 0x110, ['unsigned long long']],
    'OSMajorVersion' : [ 0x118, ['unsigned long']],
    'OSMinorVersion' : [ 0x11c, ['unsigned long']],
    'OSBuildNumber' : [ 0x120, ['unsigned short']],
    'OSCSDVersion' : [ 0x122, ['unsigned short']],
    'OSPlatformId' : [ 0x124, ['unsigned long']],
    'ImageSubsystem' : [ 0x128, ['unsigned long']],
    'ImageSubsystemMajorVersion' : [ 0x12c, ['unsigned long']],
    'ImageSubsystemMinorVersion' : [ 0x130, ['unsigned long']],
    'ActiveProcessAffinityMask' : [ 0x138, ['unsigned long long']],
    'GdiHandleBuffer' : [ 0x140, ['array', 60, ['unsigned long']]],
    'PostProcessInitRoutine' : [ 0x230, ['unsigned long long']],
    'TlsExpansionBitmap' : [ 0x238, ['unsigned long long']],
    'TlsExpansionBitmapBits' : [ 0x240, ['array', 32, ['unsigned long']]],
    'SessionId' : [ 0x2c0, ['unsigned long']],
    'AppCompatFlags' : [ 0x2c8, ['_ULARGE_INTEGER']],
    'AppCompatFlagsUser' : [ 0x2d0, ['_ULARGE_INTEGER']],
    'pShimData' : [ 0x2d8, ['unsigned long long']],
    'AppCompatInfo' : [ 0x2e0, ['unsigned long long']],
    'CSDVersion' : [ 0x2e8, ['_STRING64']],
    'ActivationContextData' : [ 0x2f8, ['unsigned long long']],
    'ProcessAssemblyStorageMap' : [ 0x300, ['unsigned long long']],
    'SystemDefaultActivationContextData' : [ 0x308, ['unsigned long long']],
    'SystemAssemblyStorageMap' : [ 0x310, ['unsigned long long']],
    'MinimumStackCommit' : [ 0x318, ['unsigned long long']],
    'FlsCallback' : [ 0x320, ['unsigned long long']],
    'FlsListHead' : [ 0x328, ['LIST_ENTRY64']],
    'FlsBitmap' : [ 0x338, ['unsigned long long']],
    'FlsBitmapBits' : [ 0x340, ['array', 4, ['unsigned long']]],
    'FlsHighIndex' : [ 0x350, ['unsigned long']],
    'WerRegistrationData' : [ 0x358, ['unsigned long long']],
    'WerShipAssertPtr' : [ 0x360, ['unsigned long long']],
    'pContextData' : [ 0x368, ['unsigned long long']],
    'pImageHeaderHash' : [ 0x370, ['unsigned long long']],
    'TracingFlags' : [ 0x378, ['unsigned long']],
    'HeapTracingEnabled' : [ 0x378, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'CritSecTracingEnabled' : [ 0x378, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'SpareTracingBits' : [ 0x378, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
} ],
  '_SE_AUDIT_PROCESS_CREATION_INFO' : [ 0x8, {
    'ImageFileName' : [ 0x0, ['pointer64', ['_OBJECT_NAME_INFORMATION']]],
} ],
  '_HEAP_ENTRY_EXTRA' : [ 0x10, {
    'AllocatorBackTraceIndex' : [ 0x0, ['unsigned short']],
    'TagIndex' : [ 0x2, ['unsigned short']],
    'Settable' : [ 0x8, ['unsigned long long']],
    'ZeroInit' : [ 0x0, ['unsigned long long']],
    'ZeroInit1' : [ 0x8, ['unsigned long long']],
} ],
  '_VF_POOL_TRACE' : [ 0x80, {
    'Address' : [ 0x0, ['pointer64', ['void']]],
    'Size' : [ 0x8, ['unsigned long long']],
    'Thread' : [ 0x10, ['pointer64', ['_ETHREAD']]],
    'StackTrace' : [ 0x18, ['array', 13, ['pointer64', ['void']]]],
} ],
  '__unnamed_2145' : [ 0x4, {
    'LongFlags' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x0, ['_MM_SESSION_SPACE_FLAGS']],
} ],
  '_MM_SESSION_SPACE' : [ 0x1f80, {
    'ReferenceCount' : [ 0x0, ['long']],
    'u' : [ 0x4, ['__unnamed_2145']],
    'SessionId' : [ 0x8, ['unsigned long']],
    'ProcessReferenceToSession' : [ 0xc, ['long']],
    'ProcessList' : [ 0x10, ['_LIST_ENTRY']],
    'LastProcessSwappedOutTime' : [ 0x20, ['_LARGE_INTEGER']],
    'SessionPageDirectoryIndex' : [ 0x28, ['unsigned long long']],
    'NonPagablePages' : [ 0x30, ['unsigned long long']],
    'CommittedPages' : [ 0x38, ['unsigned long long']],
    'PagedPoolStart' : [ 0x40, ['pointer64', ['void']]],
    'PagedPoolEnd' : [ 0x48, ['pointer64', ['void']]],
    'SessionObject' : [ 0x50, ['pointer64', ['void']]],
    'SessionObjectHandle' : [ 0x58, ['pointer64', ['void']]],
    'ResidentProcessCount' : [ 0x60, ['long']],
    'SessionPoolAllocationFailures' : [ 0x64, ['array', 4, ['unsigned long']]],
    'ImageList' : [ 0x78, ['_LIST_ENTRY']],
    'LocaleId' : [ 0x88, ['unsigned long']],
    'AttachCount' : [ 0x8c, ['unsigned long']],
    'AttachGate' : [ 0x90, ['_KGATE']],
    'WsListEntry' : [ 0xa8, ['_LIST_ENTRY']],
    'Lookaside' : [ 0xc0, ['array', 21, ['_GENERAL_LOOKASIDE']]],
    'Session' : [ 0xb40, ['_MMSESSION']],
    'PagedPoolInfo' : [ 0xb98, ['_MM_PAGED_POOL_INFO']],
    'Vm' : [ 0xc00, ['_MMSUPPORT']],
    'Wsle' : [ 0xc88, ['pointer64', ['_MMWSLE']]],
    'DriverUnload' : [ 0xc90, ['pointer64', ['void']]],
    'PagedPool' : [ 0xcc0, ['_POOL_DESCRIPTOR']],
    'PageDirectory' : [ 0x1e00, ['_MMPTE']],
    'SessionVaLock' : [ 0x1e08, ['_KGUARDED_MUTEX']],
    'DynamicVaBitMap' : [ 0x1e40, ['_RTL_BITMAP']],
    'DynamicVaHint' : [ 0x1e50, ['unsigned long']],
    'SpecialPool' : [ 0x1e58, ['_MI_SPECIAL_POOL']],
    'SessionPteLock' : [ 0x1ea0, ['_KGUARDED_MUTEX']],
    'PoolBigEntriesInUse' : [ 0x1ed8, ['long']],
    'PagedPoolPdeCount' : [ 0x1edc, ['unsigned long']],
    'SpecialPoolPdeCount' : [ 0x1ee0, ['unsigned long']],
    'DynamicSessionPdeCount' : [ 0x1ee4, ['unsigned long']],
    'SystemPteInfo' : [ 0x1ee8, ['_MI_SYSTEM_PTE_TYPE']],
    'PoolTrackTableExpansion' : [ 0x1f30, ['pointer64', ['void']]],
    'PoolTrackTableExpansionSize' : [ 0x1f38, ['unsigned long long']],
    'PoolTrackBigPages' : [ 0x1f40, ['pointer64', ['void']]],
    'PoolTrackBigPagesSize' : [ 0x1f48, ['unsigned long long']],
    'IoState' : [ 0x1f50, ['Enumeration', dict(target = 'long', choices = {1: 'IoSessionStateCreated', 2: 'IoSessionStateInitialized', 3: 'IoSessionStateConnected', 4: 'IoSessionStateDisconnected', 5: 'IoSessionStateDisconnectedLoggedOn', 6: 'IoSessionStateLoggedOn', 7: 'IoSessionStateLoggedOff', 8: 'IoSessionStateTerminated', 9: 'IoSessionStateMax'})]],
    'IoStateSequence' : [ 0x1f54, ['unsigned long']],
    'IoNotificationEvent' : [ 0x1f58, ['_KEVENT']],
    'CpuQuotaBlock' : [ 0x1f70, ['pointer64', ['_PS_CPU_QUOTA_BLOCK']]],
} ],
  '_OBJECT_HANDLE_COUNT_ENTRY' : [ 0x10, {
    'Process' : [ 0x0, ['pointer64', ['_EPROCESS']]],
    'HandleCount' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 24, native_type='unsigned long')]],
    'LockCount' : [ 0x8, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
} ],
  '_CLIENT_ID' : [ 0x10, {
    'UniqueProcess' : [ 0x0, ['pointer64', ['void']]],
    'UniqueThread' : [ 0x8, ['pointer64', ['void']]],
} ],
  '_WHEA_MEMORY_ERROR_SECTION' : [ 0x49, {
    'ValidBits' : [ 0x0, ['_WHEA_MEMORY_ERROR_SECTION_VALIDBITS']],
    'ErrorStatus' : [ 0x8, ['_WHEA_ERROR_STATUS']],
    'PhysicalAddress' : [ 0x10, ['unsigned long long']],
    'PhysicalAddressMask' : [ 0x18, ['unsigned long long']],
    'Node' : [ 0x20, ['unsigned short']],
    'Card' : [ 0x22, ['unsigned short']],
    'Module' : [ 0x24, ['unsigned short']],
    'Bank' : [ 0x26, ['unsigned short']],
    'Device' : [ 0x28, ['unsigned short']],
    'Row' : [ 0x2a, ['unsigned short']],
    'Column' : [ 0x2c, ['unsigned short']],
    'BitPosition' : [ 0x2e, ['unsigned short']],
    'RequesterId' : [ 0x30, ['unsigned long long']],
    'ResponderId' : [ 0x38, ['unsigned long long']],
    'TargetId' : [ 0x40, ['unsigned long long']],
    'ErrorType' : [ 0x48, ['unsigned char']],
} ],
  '_KWAIT_STATUS_REGISTER' : [ 0x1, {
    'Flags' : [ 0x0, ['unsigned char']],
    'State' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'Affinity' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Priority' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Apc' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'UserApc' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'Alert' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'Unused' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
} ],
  '_VI_DEADLOCK_RESOURCE' : [ 0xf8, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'VfDeadlockUnknown', 1: 'VfDeadlockMutex', 2: 'VfDeadlockMutexAbandoned', 3: 'VfDeadlockFastMutex', 4: 'VfDeadlockFastMutexUnsafe', 5: 'VfDeadlockSpinLock', 6: 'VfDeadlockInStackQueuedSpinLock', 7: 'VfDeadlockUnusedSpinLock', 8: 'VfDeadlockEresource', 9: 'VfDeadlockTypeMaximum'})]],
    'NodeCount' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'RecursionCount' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
    'ResourceAddress' : [ 0x8, ['pointer64', ['void']]],
    'ThreadOwner' : [ 0x10, ['pointer64', ['_VI_DEADLOCK_THREAD']]],
    'ResourceList' : [ 0x18, ['_LIST_ENTRY']],
    'HashChainList' : [ 0x28, ['_LIST_ENTRY']],
    'FreeListEntry' : [ 0x28, ['_LIST_ENTRY']],
    'StackTrace' : [ 0x38, ['array', 8, ['pointer64', ['void']]]],
    'LastAcquireTrace' : [ 0x78, ['array', 8, ['pointer64', ['void']]]],
    'LastReleaseTrace' : [ 0xb8, ['array', 8, ['pointer64', ['void']]]],
} ],
  '_DBGKD_GET_SET_BUS_DATA' : [ 0x14, {
    'BusDataType' : [ 0x0, ['unsigned long']],
    'BusNumber' : [ 0x4, ['unsigned long']],
    'SlotNumber' : [ 0x8, ['unsigned long']],
    'Offset' : [ 0xc, ['unsigned long']],
    'Length' : [ 0x10, ['unsigned long']],
} ],
  '_MMSECTION_FLAGS' : [ 0x4, {
    'BeingDeleted' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'BeingCreated' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'BeingPurged' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'NoModifiedWriting' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'FailAllIo' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Image' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Based' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'File' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'Networked' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Rom' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'PhysicalMemory' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'CopyOnWrite' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'Reserve' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'Commit' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'Accessed' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'WasPurged' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'UserReference' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'GlobalMemory' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'DeleteOnClose' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'FilePointerNull' : [ 0x0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'GlobalOnlyPerSession' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'SetMappedFileIoComplete' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'CollidedFlush' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'NoChange' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'Spare' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'UserWritable' : [ 0x0, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'PreferredNode' : [ 0x0, ['BitField', dict(start_bit = 26, end_bit = 32, native_type='unsigned long')]],
} ],
  '_SECURITY_CLIENT_CONTEXT' : [ 0x48, {
    'SecurityQos' : [ 0x0, ['_SECURITY_QUALITY_OF_SERVICE']],
    'ClientToken' : [ 0x10, ['pointer64', ['void']]],
    'DirectlyAccessClientToken' : [ 0x18, ['unsigned char']],
    'DirectAccessEffectiveOnly' : [ 0x19, ['unsigned char']],
    'ServerIsRemote' : [ 0x1a, ['unsigned char']],
    'ClientTokenControl' : [ 0x1c, ['_TOKEN_CONTROL']],
} ],
  '_MM_PAGED_POOL_INFO' : [ 0x68, {
    'Mutex' : [ 0x0, ['_KGUARDED_MUTEX']],
    'PagedPoolAllocationMap' : [ 0x38, ['_RTL_BITMAP']],
    'FirstPteForPagedPool' : [ 0x48, ['pointer64', ['_MMPTE']]],
    'PagedPoolHint' : [ 0x50, ['unsigned long']],
    'PagedPoolCommit' : [ 0x58, ['unsigned long long']],
    'AllocatedPagedPool' : [ 0x60, ['unsigned long long']],
} ],
  '_BITMAP_RANGE' : [ 0x30, {
    'Links' : [ 0x0, ['_LIST_ENTRY']],
    'BasePage' : [ 0x10, ['long long']],
    'FirstDirtyPage' : [ 0x18, ['unsigned long']],
    'LastDirtyPage' : [ 0x1c, ['unsigned long']],
    'DirtyPages' : [ 0x20, ['unsigned long']],
    'Bitmap' : [ 0x28, ['pointer64', ['unsigned long']]],
} ],
  '_NT_TIB64' : [ 0x38, {
    'ExceptionList' : [ 0x0, ['unsigned long long']],
    'StackBase' : [ 0x8, ['unsigned long long']],
    'StackLimit' : [ 0x10, ['unsigned long long']],
    'SubSystemTib' : [ 0x18, ['unsigned long long']],
    'FiberData' : [ 0x20, ['unsigned long long']],
    'Version' : [ 0x20, ['unsigned long']],
    'ArbitraryUserPointer' : [ 0x28, ['unsigned long long']],
    'Self' : [ 0x30, ['unsigned long long']],
} ],
  '_IO_SECURITY_CONTEXT' : [ 0x18, {
    'SecurityQos' : [ 0x0, ['pointer64', ['_SECURITY_QUALITY_OF_SERVICE']]],
    'AccessState' : [ 0x8, ['pointer64', ['_ACCESS_STATE']]],
    'DesiredAccess' : [ 0x10, ['unsigned long']],
    'FullCreateOptions' : [ 0x14, ['unsigned long']],
} ],
  '_PROC_PERF_DOMAIN' : [ 0xb8, {
    'Link' : [ 0x0, ['_LIST_ENTRY']],
    'Master' : [ 0x10, ['pointer64', ['_KPRCB']]],
    'Members' : [ 0x18, ['_KAFFINITY_EX']],
    'FeedbackHandler' : [ 0x40, ['pointer64', ['void']]],
    'GetFFHThrottleState' : [ 0x48, ['pointer64', ['void']]],
    'BoostPolicyHandler' : [ 0x50, ['pointer64', ['void']]],
    'PerfSelectionHandler' : [ 0x58, ['pointer64', ['void']]],
    'PerfHandler' : [ 0x60, ['pointer64', ['void']]],
    'Processors' : [ 0x68, ['pointer64', ['_PROC_PERF_CONSTRAINT']]],
    'PerfChangeTime' : [ 0x70, ['unsigned long long']],
    'ProcessorCount' : [ 0x78, ['unsigned long']],
    'PreviousFrequencyMhz' : [ 0x7c, ['unsigned long']],
    'CurrentFrequencyMhz' : [ 0x80, ['unsigned long']],
    'PreviousFrequency' : [ 0x84, ['unsigned long']],
    'CurrentFrequency' : [ 0x88, ['unsigned long']],
    'CurrentPerfContext' : [ 0x8c, ['unsigned long']],
    'DesiredFrequency' : [ 0x90, ['unsigned long']],
    'MaxFrequency' : [ 0x94, ['unsigned long']],
    'MinPerfPercent' : [ 0x98, ['unsigned long']],
    'MinThrottlePercent' : [ 0x9c, ['unsigned long']],
    'MaxPercent' : [ 0xa0, ['unsigned long']],
    'MinPercent' : [ 0xa4, ['unsigned long']],
    'ConstrainedMaxPercent' : [ 0xa8, ['unsigned long']],
    'ConstrainedMinPercent' : [ 0xac, ['unsigned long']],
    'Coordination' : [ 0xb0, ['unsigned char']],
    'PerfChangeIntervalCount' : [ 0xb4, ['long']],
} ],
  '_X86_DBGKD_CONTROL_SET' : [ 0x10, {
    'TraceFlag' : [ 0x0, ['unsigned long']],
    'Dr7' : [ 0x4, ['unsigned long']],
    'CurrentSymbolStart' : [ 0x8, ['unsigned long']],
    'CurrentSymbolEnd' : [ 0xc, ['unsigned long']],
} ],
  '_HANDLE_TRACE_DB_ENTRY' : [ 0xa0, {
    'ClientId' : [ 0x0, ['_CLIENT_ID']],
    'Handle' : [ 0x10, ['pointer64', ['void']]],
    'Type' : [ 0x18, ['unsigned long']],
    'StackTrace' : [ 0x20, ['array', 16, ['pointer64', ['void']]]],
} ],
  '_TP_NBQ_GUARD' : [ 0x20, {
    'GuardLinks' : [ 0x0, ['_LIST_ENTRY']],
    'Guards' : [ 0x10, ['array', 2, ['pointer64', ['void']]]],
} ],
  '_DUMMY_FILE_OBJECT' : [ 0x110, {
    'ObjectHeader' : [ 0x0, ['_OBJECT_HEADER']],
    'FileObjectBody' : [ 0x38, ['array', 216, ['unsigned char']]],
} ],
  '_POP_TRIGGER_WAIT' : [ 0x38, {
    'Event' : [ 0x0, ['_KEVENT']],
    'Status' : [ 0x18, ['long']],
    'Link' : [ 0x20, ['_LIST_ENTRY']],
    'Trigger' : [ 0x30, ['pointer64', ['_POP_ACTION_TRIGGER']]],
} ],
  '_RELATION_LIST' : [ 0x18, {
    'Count' : [ 0x0, ['unsigned long']],
    'TagCount' : [ 0x4, ['unsigned long']],
    'FirstLevel' : [ 0x8, ['unsigned long']],
    'MaxLevel' : [ 0xc, ['unsigned long']],
    'Entries' : [ 0x10, ['array', 1, ['pointer64', ['_RELATION_LIST_ENTRY']]]],
} ],
  '_IO_TIMER' : [ 0x30, {
    'Type' : [ 0x0, ['short']],
    'TimerFlag' : [ 0x2, ['short']],
    'TimerList' : [ 0x8, ['_LIST_ENTRY']],
    'TimerRoutine' : [ 0x18, ['pointer64', ['void']]],
    'Context' : [ 0x20, ['pointer64', ['void']]],
    'DeviceObject' : [ 0x28, ['pointer64', ['_DEVICE_OBJECT']]],
} ],
  '_ARBITER_TEST_ALLOCATION_PARAMETERS' : [ 0x18, {
    'ArbitrationList' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
    'AllocateFromCount' : [ 0x8, ['unsigned long']],
    'AllocateFrom' : [ 0x10, ['pointer64', ['_CM_PARTIAL_RESOURCE_DESCRIPTOR']]],
} ],
  '_MI_SPECIAL_POOL' : [ 0x48, {
    'PteBase' : [ 0x0, ['pointer64', ['_MMPTE']]],
    'Lock' : [ 0x8, ['unsigned long long']],
    'Paged' : [ 0x10, ['_MI_SPECIAL_POOL_PTE_LIST']],
    'NonPaged' : [ 0x20, ['_MI_SPECIAL_POOL_PTE_LIST']],
    'PagesInUse' : [ 0x30, ['long long']],
    'SpecialPoolPdes' : [ 0x38, ['_RTL_BITMAP']],
} ],
  '_ARBITER_QUERY_CONFLICT_PARAMETERS' : [ 0x20, {
    'PhysicalDeviceObject' : [ 0x0, ['pointer64', ['_DEVICE_OBJECT']]],
    'ConflictingResource' : [ 0x8, ['pointer64', ['_IO_RESOURCE_DESCRIPTOR']]],
    'ConflictCount' : [ 0x10, ['pointer64', ['unsigned long']]],
    'Conflicts' : [ 0x18, ['pointer64', ['pointer64', ['_ARBITER_CONFLICT_INFO']]]],
} ],
  '_PHYSICAL_MEMORY_DESCRIPTOR' : [ 0x20, {
    'NumberOfRuns' : [ 0x0, ['unsigned long']],
    'NumberOfPages' : [ 0x8, ['unsigned long long']],
    'Run' : [ 0x10, ['array', 1, ['_PHYSICAL_MEMORY_RUN']]],
} ],
  '__unnamed_21be' : [ 0x4, {
    'BaseMiddle' : [ 0x0, ['unsigned char']],
    'Flags1' : [ 0x1, ['unsigned char']],
    'Flags2' : [ 0x2, ['unsigned char']],
    'BaseHigh' : [ 0x3, ['unsigned char']],
} ],
  '__unnamed_21c2' : [ 0x4, {
    'BaseMiddle' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long')]],
    'Type' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 13, native_type='unsigned long')]],
    'Dpl' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 15, native_type='unsigned long')]],
    'Present' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'LimitHigh' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 20, native_type='unsigned long')]],
    'System' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'LongMode' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'DefaultBig' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'Granularity' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'BaseHigh' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
} ],
  '_KGDTENTRY64' : [ 0x10, {
    'LimitLow' : [ 0x0, ['unsigned short']],
    'BaseLow' : [ 0x2, ['unsigned short']],
    'Bytes' : [ 0x4, ['__unnamed_21be']],
    'Bits' : [ 0x4, ['__unnamed_21c2']],
    'BaseUpper' : [ 0x8, ['unsigned long']],
    'MustBeZero' : [ 0xc, ['unsigned long']],
    'Alignment' : [ 0x0, ['unsigned long long']],
} ],
  '_PNP_DEVICE_EVENT_LIST' : [ 0x88, {
    'Status' : [ 0x0, ['long']],
    'EventQueueMutex' : [ 0x8, ['_KMUTANT']],
    'Lock' : [ 0x40, ['_KGUARDED_MUTEX']],
    'List' : [ 0x78, ['_LIST_ENTRY']],
} ],
  '_MAILSLOT_CREATE_PARAMETERS' : [ 0x18, {
    'MailslotQuota' : [ 0x0, ['unsigned long']],
    'MaximumMessageSize' : [ 0x4, ['unsigned long']],
    'ReadTimeout' : [ 0x8, ['_LARGE_INTEGER']],
    'TimeoutSpecified' : [ 0x10, ['unsigned char']],
} ],
  '_PO_IRP_MANAGER' : [ 0x20, {
    'DeviceIrpQueue' : [ 0x0, ['_PO_IRP_QUEUE']],
    'SystemIrpQueue' : [ 0x10, ['_PO_IRP_QUEUE']],
} ],
  '_PPM_PERF_STATE' : [ 0x28, {
    'Frequency' : [ 0x0, ['unsigned long']],
    'Power' : [ 0x4, ['unsigned long']],
    'PercentFrequency' : [ 0x8, ['unsigned char']],
    'IncreaseLevel' : [ 0x9, ['unsigned char']],
    'DecreaseLevel' : [ 0xa, ['unsigned char']],
    'Type' : [ 0xb, ['unsigned char']],
    'Control' : [ 0x10, ['unsigned long long']],
    'Status' : [ 0x18, ['unsigned long long']],
    'TotalHitCount' : [ 0x20, ['unsigned long']],
    'DesiredCount' : [ 0x24, ['unsigned long']],
} ],
  '_PPM_FFH_THROTTLE_STATE_INFO' : [ 0x20, {
    'EnableLogging' : [ 0x0, ['unsigned char']],
    'MismatchCount' : [ 0x4, ['unsigned long']],
    'Initialized' : [ 0x8, ['unsigned char']],
    'LastValue' : [ 0x10, ['unsigned long long']],
    'LastLogTickCount' : [ 0x18, ['_LARGE_INTEGER']],
} ],
  '_SECURITY_DESCRIPTOR_RELATIVE' : [ 0x14, {
    'Revision' : [ 0x0, ['unsigned char']],
    'Sbz1' : [ 0x1, ['unsigned char']],
    'Control' : [ 0x2, ['unsigned short']],
    'Owner' : [ 0x4, ['unsigned long']],
    'Group' : [ 0x8, ['unsigned long']],
    'Sacl' : [ 0xc, ['unsigned long']],
    'Dacl' : [ 0x10, ['unsigned long']],
} ],
  '_CLIENT_ID64' : [ 0x10, {
    'UniqueProcess' : [ 0x0, ['unsigned long long']],
    'UniqueThread' : [ 0x8, ['unsigned long long']],
} ],
  '_KDPC_DATA' : [ 0x20, {
    'DpcListHead' : [ 0x0, ['_LIST_ENTRY']],
    'DpcLock' : [ 0x10, ['unsigned long long']],
    'DpcQueueDepth' : [ 0x18, ['long']],
    'DpcCount' : [ 0x1c, ['unsigned long']],
} ],
  '_NAMED_PIPE_CREATE_PARAMETERS' : [ 0x28, {
    'NamedPipeType' : [ 0x0, ['unsigned long']],
    'ReadMode' : [ 0x4, ['unsigned long']],
    'CompletionMode' : [ 0x8, ['unsigned long']],
    'MaximumInstances' : [ 0xc, ['unsigned long']],
    'InboundQuota' : [ 0x10, ['unsigned long']],
    'OutboundQuota' : [ 0x14, ['unsigned long']],
    'DefaultTimeout' : [ 0x18, ['_LARGE_INTEGER']],
    'TimeoutSpecified' : [ 0x20, ['unsigned char']],
} ],
  '_CM_BIG_DATA' : [ 0x8, {
    'Signature' : [ 0x0, ['unsigned short']],
    'Count' : [ 0x2, ['unsigned short']],
    'List' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_21de' : [ 0x10, {
    'UserData' : [ 0x0, ['pointer64', ['void']]],
    'Owner' : [ 0x8, ['pointer64', ['void']]],
} ],
  '__unnamed_21e0' : [ 0x10, {
    'ListHead' : [ 0x0, ['_LIST_ENTRY']],
} ],
  '_RTLP_RANGE_LIST_ENTRY' : [ 0x38, {
    'Start' : [ 0x0, ['unsigned long long']],
    'End' : [ 0x8, ['unsigned long long']],
    'Allocated' : [ 0x10, ['__unnamed_21de']],
    'Merged' : [ 0x10, ['__unnamed_21e0']],
    'Attributes' : [ 0x20, ['unsigned char']],
    'PublicFlags' : [ 0x21, ['unsigned char']],
    'PrivateFlags' : [ 0x22, ['unsigned short']],
    'ListEntry' : [ 0x28, ['_LIST_ENTRY']],
} ],
  '_ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY' : [ 0x18, {
    'ListEntry' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Packet' : [ 0x8, ['pointer64', ['_IO_MINI_COMPLETION_PACKET_USER']]],
    'Lookaside' : [ 0x10, ['pointer64', ['_ALPC_COMPLETION_PACKET_LOOKASIDE']]],
} ],
  '__unnamed_21e8' : [ 0x2, {
    'AsUSHORT' : [ 0x0, ['unsigned short']],
    'AllowScaling' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'Disabled' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 16, native_type='unsigned short')]],
} ],
  'PROCESSOR_IDLESTATE_POLICY' : [ 0x20, {
    'Revision' : [ 0x0, ['unsigned short']],
    'Flags' : [ 0x2, ['__unnamed_21e8']],
    'PolicyCount' : [ 0x4, ['unsigned long']],
    'Policy' : [ 0x8, ['array', 3, ['PROCESSOR_IDLESTATE_INFO']]],
} ],
  '_ACTIVATION_CONTEXT_STACK' : [ 0x28, {
    'ActiveFrame' : [ 0x0, ['pointer64', ['_RTL_ACTIVATION_CONTEXT_STACK_FRAME']]],
    'FrameListCache' : [ 0x8, ['_LIST_ENTRY']],
    'Flags' : [ 0x18, ['unsigned long']],
    'NextCookieSequenceNumber' : [ 0x1c, ['unsigned long']],
    'StackId' : [ 0x20, ['unsigned long']],
} ],
  '_MSUBSECTION' : [ 0x68, {
    'ControlArea' : [ 0x0, ['pointer64', ['_CONTROL_AREA']]],
    'SubsectionBase' : [ 0x8, ['pointer64', ['_MMPTE']]],
    'NextSubsection' : [ 0x10, ['pointer64', ['_SUBSECTION']]],
    'NextMappedSubsection' : [ 0x10, ['pointer64', ['_MSUBSECTION']]],
    'PtesInSubsection' : [ 0x18, ['unsigned long']],
    'UnusedPtes' : [ 0x20, ['unsigned long']],
    'GlobalPerSessionHead' : [ 0x20, ['pointer64', ['_MM_AVL_TABLE']]],
    'u' : [ 0x28, ['__unnamed_1f31']],
    'StartingSector' : [ 0x2c, ['unsigned long']],
    'NumberOfFullSectors' : [ 0x30, ['unsigned long']],
    'u1' : [ 0x38, ['__unnamed_1fd3']],
    'LeftChild' : [ 0x40, ['pointer64', ['_MMSUBSECTION_NODE']]],
    'RightChild' : [ 0x48, ['pointer64', ['_MMSUBSECTION_NODE']]],
    'DereferenceList' : [ 0x50, ['_LIST_ENTRY']],
    'NumberOfMappedViews' : [ 0x60, ['unsigned long long']],
} ],
  '_RTL_DRIVE_LETTER_CURDIR' : [ 0x18, {
    'Flags' : [ 0x0, ['unsigned short']],
    'Length' : [ 0x2, ['unsigned short']],
    'TimeStamp' : [ 0x4, ['unsigned long']],
    'DosPath' : [ 0x8, ['_STRING']],
} ],
  '_VIRTUAL_EFI_RUNTIME_SERVICES' : [ 0x70, {
    'GetTime' : [ 0x0, ['unsigned long long']],
    'SetTime' : [ 0x8, ['unsigned long long']],
    'GetWakeupTime' : [ 0x10, ['unsigned long long']],
    'SetWakeupTime' : [ 0x18, ['unsigned long long']],
    'SetVirtualAddressMap' : [ 0x20, ['unsigned long long']],
    'ConvertPointer' : [ 0x28, ['unsigned long long']],
    'GetVariable' : [ 0x30, ['unsigned long long']],
    'GetNextVariableName' : [ 0x38, ['unsigned long long']],
    'SetVariable' : [ 0x40, ['unsigned long long']],
    'GetNextHighMonotonicCount' : [ 0x48, ['unsigned long long']],
    'ResetSystem' : [ 0x50, ['unsigned long long']],
    'UpdateCapsule' : [ 0x58, ['unsigned long long']],
    'QueryCapsuleCapabilities' : [ 0x60, ['unsigned long long']],
    'QueryVariableInfo' : [ 0x68, ['unsigned long long']],
} ],
  '_MI_SPECIAL_POOL_PTE_LIST' : [ 0x10, {
    'FreePteHead' : [ 0x0, ['_MMPTE']],
    'FreePteTail' : [ 0x8, ['_MMPTE']],
} ],
  'SYSTEM_POWER_CAPABILITIES' : [ 0x4c, {
    'PowerButtonPresent' : [ 0x0, ['unsigned char']],
    'SleepButtonPresent' : [ 0x1, ['unsigned char']],
    'LidPresent' : [ 0x2, ['unsigned char']],
    'SystemS1' : [ 0x3, ['unsigned char']],
    'SystemS2' : [ 0x4, ['unsigned char']],
    'SystemS3' : [ 0x5, ['unsigned char']],
    'SystemS4' : [ 0x6, ['unsigned char']],
    'SystemS5' : [ 0x7, ['unsigned char']],
    'HiberFilePresent' : [ 0x8, ['unsigned char']],
    'FullWake' : [ 0x9, ['unsigned char']],
    'VideoDimPresent' : [ 0xa, ['unsigned char']],
    'ApmPresent' : [ 0xb, ['unsigned char']],
    'UpsPresent' : [ 0xc, ['unsigned char']],
    'ThermalControl' : [ 0xd, ['unsigned char']],
    'ProcessorThrottle' : [ 0xe, ['unsigned char']],
    'ProcessorMinThrottle' : [ 0xf, ['unsigned char']],
    'ProcessorMaxThrottle' : [ 0x10, ['unsigned char']],
    'FastSystemS4' : [ 0x11, ['unsigned char']],
    'spare2' : [ 0x12, ['array', 3, ['unsigned char']]],
    'DiskSpinDown' : [ 0x15, ['unsigned char']],
    'spare3' : [ 0x16, ['array', 8, ['unsigned char']]],
    'SystemBatteriesPresent' : [ 0x1e, ['unsigned char']],
    'BatteriesAreShortTerm' : [ 0x1f, ['unsigned char']],
    'BatteryScale' : [ 0x20, ['array', 3, ['BATTERY_REPORTING_SCALE']]],
    'AcOnLineWake' : [ 0x38, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'SoftLidWake' : [ 0x3c, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'RtcWake' : [ 0x40, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'MinDeviceWakeState' : [ 0x44, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'DefaultLowLatencyWake' : [ 0x48, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
} ],
  '__unnamed_21fe' : [ 0x8, {
    'ImageCommitment' : [ 0x0, ['unsigned long long']],
    'CreatingProcess' : [ 0x0, ['pointer64', ['_EPROCESS']]],
} ],
  '__unnamed_2202' : [ 0x8, {
    'ImageInformation' : [ 0x0, ['pointer64', ['_MI_SECTION_IMAGE_INFORMATION']]],
    'FirstMappedVa' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_SEGMENT' : [ 0x50, {
    'ControlArea' : [ 0x0, ['pointer64', ['_CONTROL_AREA']]],
    'TotalNumberOfPtes' : [ 0x8, ['unsigned long']],
    'SegmentFlags' : [ 0xc, ['_SEGMENT_FLAGS']],
    'NumberOfCommittedPages' : [ 0x10, ['unsigned long long']],
    'SizeOfSegment' : [ 0x18, ['unsigned long long']],
    'ExtendInfo' : [ 0x20, ['pointer64', ['_MMEXTEND_INFO']]],
    'BasedAddress' : [ 0x20, ['pointer64', ['void']]],
    'SegmentLock' : [ 0x28, ['_EX_PUSH_LOCK']],
    'u1' : [ 0x30, ['__unnamed_21fe']],
    'u2' : [ 0x38, ['__unnamed_2202']],
    'PrototypePte' : [ 0x40, ['pointer64', ['_MMPTE']]],
    'ThePtes' : [ 0x48, ['array', 1, ['_MMPTE']]],
} ],
  '_DIAGNOSTIC_CONTEXT' : [ 0x20, {
    'CallerType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'KernelRequester', 1: 'UserProcessRequester', 2: 'UserSharedServiceRequester'})]],
    'Process' : [ 0x8, ['pointer64', ['_EPROCESS']]],
    'ServiceTag' : [ 0x10, ['unsigned long']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'ReasonSize' : [ 0x18, ['unsigned long long']],
} ],
  '__unnamed_220b' : [ 0x4, {
    'MissedEtwRegistration' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Spare' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_220d' : [ 0x4, {
    'Flags' : [ 0x0, ['__unnamed_220b']],
    'Whole' : [ 0x0, ['unsigned long']],
} ],
  '_VF_TARGET_VERIFIED_DRIVER_DATA' : [ 0x100, {
    'SuspectDriverEntry' : [ 0x0, ['pointer64', ['_VF_SUSPECT_DRIVER_ENTRY']]],
    'WMICallback' : [ 0x8, ['pointer64', ['void']]],
    'EtwHandlesListHead' : [ 0x10, ['_LIST_ENTRY']],
    'u1' : [ 0x20, ['__unnamed_220d']],
    'Signature' : [ 0x28, ['unsigned long long']],
    'PoolPageHeaders' : [ 0x30, ['_SLIST_HEADER']],
    'PoolTrackers' : [ 0x40, ['_SLIST_HEADER']],
    'CurrentPagedPoolAllocations' : [ 0x50, ['unsigned long']],
    'CurrentNonPagedPoolAllocations' : [ 0x54, ['unsigned long']],
    'PeakPagedPoolAllocations' : [ 0x58, ['unsigned long']],
    'PeakNonPagedPoolAllocations' : [ 0x5c, ['unsigned long']],
    'PagedBytes' : [ 0x60, ['unsigned long long']],
    'NonPagedBytes' : [ 0x68, ['unsigned long long']],
    'PeakPagedBytes' : [ 0x70, ['unsigned long long']],
    'PeakNonPagedBytes' : [ 0x78, ['unsigned long long']],
    'RaiseIrqls' : [ 0x80, ['unsigned long']],
    'AcquireSpinLocks' : [ 0x84, ['unsigned long']],
    'SynchronizeExecutions' : [ 0x88, ['unsigned long']],
    'AllocationsWithNoTag' : [ 0x8c, ['unsigned long']],
    'AllocationsFailed' : [ 0x90, ['unsigned long']],
    'AllocationsFailedDeliberately' : [ 0x94, ['unsigned long']],
    'LockedBytes' : [ 0x98, ['unsigned long long']],
    'PeakLockedBytes' : [ 0xa0, ['unsigned long long']],
    'MappedLockedBytes' : [ 0xa8, ['unsigned long long']],
    'PeakMappedLockedBytes' : [ 0xb0, ['unsigned long long']],
    'MappedIoSpaceBytes' : [ 0xb8, ['unsigned long long']],
    'PeakMappedIoSpaceBytes' : [ 0xc0, ['unsigned long long']],
    'PagesForMdlBytes' : [ 0xc8, ['unsigned long long']],
    'PeakPagesForMdlBytes' : [ 0xd0, ['unsigned long long']],
    'ContiguousMemoryBytes' : [ 0xd8, ['unsigned long long']],
    'PeakContiguousMemoryBytes' : [ 0xe0, ['unsigned long long']],
    'ContiguousMemoryListHead' : [ 0xe8, ['_LIST_ENTRY']],
} ],
  '_PCAT_FIRMWARE_INFORMATION' : [ 0x4, {
    'PlaceHolder' : [ 0x0, ['unsigned long']],
} ],
  '_PRIVATE_CACHE_MAP' : [ 0x68, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'Flags' : [ 0x0, ['_PRIVATE_CACHE_MAP_FLAGS']],
    'UlongFlags' : [ 0x0, ['unsigned long']],
    'ReadAheadMask' : [ 0x4, ['unsigned long']],
    'FileObject' : [ 0x8, ['pointer64', ['_FILE_OBJECT']]],
    'FileOffset1' : [ 0x10, ['_LARGE_INTEGER']],
    'BeyondLastByte1' : [ 0x18, ['_LARGE_INTEGER']],
    'FileOffset2' : [ 0x20, ['_LARGE_INTEGER']],
    'BeyondLastByte2' : [ 0x28, ['_LARGE_INTEGER']],
    'SequentialReadCount' : [ 0x30, ['unsigned long']],
    'ReadAheadLength' : [ 0x34, ['unsigned long']],
    'ReadAheadOffset' : [ 0x38, ['_LARGE_INTEGER']],
    'ReadAheadBeyondLastByte' : [ 0x40, ['_LARGE_INTEGER']],
    'ReadAheadSpinLock' : [ 0x48, ['unsigned long long']],
    'PrivateLinks' : [ 0x50, ['_LIST_ENTRY']],
    'ReadAheadWorkItem' : [ 0x60, ['pointer64', ['void']]],
} ],
  '_CM_KEY_NODE' : [ 0x50, {
    'Signature' : [ 0x0, ['unsigned short']],
    'Flags' : [ 0x2, ['unsigned short']],
    'LastWriteTime' : [ 0x4, ['_LARGE_INTEGER']],
    'Spare' : [ 0xc, ['unsigned long']],
    'Parent' : [ 0x10, ['unsigned long']],
    'SubKeyCounts' : [ 0x14, ['array', 2, ['unsigned long']]],
    'SubKeyLists' : [ 0x1c, ['array', 2, ['unsigned long']]],
    'ValueList' : [ 0x24, ['_CHILD_LIST']],
    'ChildHiveReference' : [ 0x1c, ['_CM_KEY_REFERENCE']],
    'Security' : [ 0x2c, ['unsigned long']],
    'Class' : [ 0x30, ['unsigned long']],
    'MaxNameLen' : [ 0x34, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'UserFlags' : [ 0x34, ['BitField', dict(start_bit = 16, end_bit = 20, native_type='unsigned long')]],
    'VirtControlFlags' : [ 0x34, ['BitField', dict(start_bit = 20, end_bit = 24, native_type='unsigned long')]],
    'Debug' : [ 0x34, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'MaxClassLen' : [ 0x38, ['unsigned long']],
    'MaxValueNameLen' : [ 0x3c, ['unsigned long']],
    'MaxValueDataLen' : [ 0x40, ['unsigned long']],
    'WorkVar' : [ 0x44, ['unsigned long']],
    'NameLength' : [ 0x48, ['unsigned short']],
    'ClassLength' : [ 0x4a, ['unsigned short']],
    'Name' : [ 0x4c, ['array', 1, ['wchar']]],
} ],
  '_TPM_BOOT_ENTROPY_LDR_RESULT' : [ 0x48, {
    'Policy' : [ 0x0, ['unsigned long long']],
    'ResultCode' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'TpmBootEntropyStructureUninitialized', 1: 'TpmBootEntropyDisabledByPolicy', 2: 'TpmBootEntropyNoTpmFound', 3: 'TpmBootEntropyTpmError', 4: 'TpmBootEntropySuccess'})]],
    'ResultStatus' : [ 0xc, ['long']],
    'Time' : [ 0x10, ['unsigned long long']],
    'EntropyLength' : [ 0x18, ['unsigned long']],
    'EntropyData' : [ 0x1c, ['array', 40, ['unsigned char']]],
} ],
  '_RTL_HANDLE_TABLE' : [ 0x30, {
    'MaximumNumberOfHandles' : [ 0x0, ['unsigned long']],
    'SizeOfHandleTableEntry' : [ 0x4, ['unsigned long']],
    'Reserved' : [ 0x8, ['array', 2, ['unsigned long']]],
    'FreeHandles' : [ 0x10, ['pointer64', ['_RTL_HANDLE_TABLE_ENTRY']]],
    'CommittedHandles' : [ 0x18, ['pointer64', ['_RTL_HANDLE_TABLE_ENTRY']]],
    'UnCommittedHandles' : [ 0x20, ['pointer64', ['_RTL_HANDLE_TABLE_ENTRY']]],
    'MaxReservedHandles' : [ 0x28, ['pointer64', ['_RTL_HANDLE_TABLE_ENTRY']]],
} ],
  '_PTE_TRACKER' : [ 0x58, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Mdl' : [ 0x10, ['pointer64', ['_MDL']]],
    'Count' : [ 0x18, ['unsigned long long']],
    'SystemVa' : [ 0x20, ['pointer64', ['void']]],
    'StartVa' : [ 0x28, ['pointer64', ['void']]],
    'Offset' : [ 0x30, ['unsigned long']],
    'Length' : [ 0x34, ['unsigned long']],
    'Page' : [ 0x38, ['unsigned long long']],
    'IoMapping' : [ 0x40, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Matched' : [ 0x40, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'CacheAttribute' : [ 0x40, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned long')]],
    'Spare' : [ 0x40, ['BitField', dict(start_bit = 4, end_bit = 32, native_type='unsigned long')]],
    'CallingAddress' : [ 0x48, ['pointer64', ['void']]],
    'CallersCaller' : [ 0x50, ['pointer64', ['void']]],
} ],
  '_KTHREAD_COUNTERS' : [ 0x1a8, {
    'WaitReasonBitMap' : [ 0x0, ['unsigned long long']],
    'UserData' : [ 0x8, ['pointer64', ['_THREAD_PERFORMANCE_DATA']]],
    'Flags' : [ 0x10, ['unsigned long']],
    'ContextSwitches' : [ 0x14, ['unsigned long']],
    'CycleTimeBias' : [ 0x18, ['unsigned long long']],
    'HardwareCounters' : [ 0x20, ['unsigned long long']],
    'HwCounter' : [ 0x28, ['array', 16, ['_COUNTER_READING']]],
} ],
  '_SHARED_CACHE_MAP_LIST_CURSOR' : [ 0x18, {
    'SharedCacheMapLinks' : [ 0x0, ['_LIST_ENTRY']],
    'Flags' : [ 0x10, ['unsigned long']],
} ],
  '_DBGKD_GET_VERSION64' : [ 0x28, {
    'MajorVersion' : [ 0x0, ['unsigned short']],
    'MinorVersion' : [ 0x2, ['unsigned short']],
    'ProtocolVersion' : [ 0x4, ['unsigned char']],
    'KdSecondaryVersion' : [ 0x5, ['unsigned char']],
    'Flags' : [ 0x6, ['unsigned short']],
    'MachineType' : [ 0x8, ['unsigned short']],
    'MaxPacketType' : [ 0xa, ['unsigned char']],
    'MaxStateChange' : [ 0xb, ['unsigned char']],
    'MaxManipulate' : [ 0xc, ['unsigned char']],
    'Simulation' : [ 0xd, ['unsigned char']],
    'Unused' : [ 0xe, ['array', 1, ['unsigned short']]],
    'KernBase' : [ 0x10, ['unsigned long long']],
    'PsLoadedModuleList' : [ 0x18, ['unsigned long long']],
    'DebuggerDataList' : [ 0x20, ['unsigned long long']],
} ],
  '_STRING32' : [ 0x8, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x4, ['unsigned long']],
} ],
  '_HMAP_ENTRY' : [ 0x20, {
    'BlockAddress' : [ 0x0, ['unsigned long long']],
    'BinAddress' : [ 0x8, ['unsigned long long']],
    'CmView' : [ 0x10, ['pointer64', ['_CM_VIEW_OF_FILE']]],
    'MemAlloc' : [ 0x18, ['unsigned long']],
} ],
  '_RTL_ATOM_TABLE_ENTRY' : [ 0x18, {
    'HashLink' : [ 0x0, ['pointer64', ['_RTL_ATOM_TABLE_ENTRY']]],
    'HandleIndex' : [ 0x8, ['unsigned short']],
    'Atom' : [ 0xa, ['unsigned short']],
    'ReferenceCount' : [ 0xc, ['unsigned short']],
    'Flags' : [ 0xe, ['unsigned char']],
    'NameLength' : [ 0xf, ['unsigned char']],
    'Name' : [ 0x10, ['array', 1, ['wchar']]],
} ],
  '_TXN_PARAMETER_BLOCK' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned short']],
    'TxFsContext' : [ 0x2, ['unsigned short']],
    'TransactionObject' : [ 0x8, ['pointer64', ['void']]],
} ],
  '_LOADER_PERFORMANCE_DATA' : [ 0x10, {
    'StartTime' : [ 0x0, ['unsigned long long']],
    'EndTime' : [ 0x8, ['unsigned long long']],
} ],
  '_PNP_DEVICE_ACTION_ENTRY' : [ 0x38, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'DeviceObject' : [ 0x10, ['pointer64', ['_DEVICE_OBJECT']]],
    'RequestType' : [ 0x18, ['Enumeration', dict(target = 'long', choices = {0: 'AssignResources', 1: 'ClearDeviceProblem', 2: 'ClearProblem', 3: 'ClearEjectProblem', 4: 'HaltDevice', 5: 'QueryPowerRelations', 6: 'Rebalance', 7: 'ReenumerateBootDevices', 8: 'ReenumerateDeviceOnly', 9: 'ReenumerateDeviceTree', 10: 'ReenumerateRootDevices', 11: 'RequeryDeviceState', 12: 'ResetDevice', 13: 'ResourceRequirementsChanged', 14: 'RestartEnumeration', 15: 'SetDeviceProblem', 16: 'StartDevice', 17: 'StartSystemDevicesPass0', 18: 'StartSystemDevicesPass1'})]],
    'ReorderingBarrier' : [ 0x1c, ['unsigned char']],
    'RequestArgument' : [ 0x20, ['unsigned long long']],
    'CompletionEvent' : [ 0x28, ['pointer64', ['_KEVENT']]],
    'CompletionStatus' : [ 0x30, ['pointer64', ['long']]],
} ],
  '_COUNTER_READING' : [ 0x18, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'PMCCounter', 1: 'MaxHardwareCounterType'})]],
    'Index' : [ 0x4, ['unsigned long']],
    'Start' : [ 0x8, ['unsigned long long']],
    'Total' : [ 0x10, ['unsigned long long']],
} ],
  '_MMSESSION' : [ 0x58, {
    'SystemSpaceViewLock' : [ 0x0, ['_KGUARDED_MUTEX']],
    'SystemSpaceViewLockPointer' : [ 0x38, ['pointer64', ['_KGUARDED_MUTEX']]],
    'SystemSpaceViewTable' : [ 0x40, ['pointer64', ['_MMVIEW']]],
    'SystemSpaceHashSize' : [ 0x48, ['unsigned long']],
    'SystemSpaceHashEntries' : [ 0x4c, ['unsigned long']],
    'SystemSpaceHashKey' : [ 0x50, ['unsigned long']],
    'BitmapFailures' : [ 0x54, ['unsigned long']],
} ],
  '_ETW_REG_ENTRY' : [ 0x50, {
    'RegList' : [ 0x0, ['_LIST_ENTRY']],
    'GuidEntry' : [ 0x10, ['pointer64', ['_ETW_GUID_ENTRY']]],
    'Index' : [ 0x18, ['unsigned short']],
    'Flags' : [ 0x1a, ['unsigned short']],
    'EnableMask' : [ 0x1c, ['unsigned char']],
    'SessionId' : [ 0x20, ['unsigned long']],
    'ReplyQueue' : [ 0x20, ['pointer64', ['_ETW_REPLY_QUEUE']]],
    'ReplySlot' : [ 0x20, ['array', 4, ['pointer64', ['_ETW_REG_ENTRY']]]],
    'Process' : [ 0x40, ['pointer64', ['_EPROCESS']]],
    'Callback' : [ 0x40, ['pointer64', ['void']]],
    'CallbackContext' : [ 0x48, ['pointer64', ['void']]],
} ],
  '_LPCP_PORT_OBJECT' : [ 0x100, {
    'ConnectionPort' : [ 0x0, ['pointer64', ['_LPCP_PORT_OBJECT']]],
    'ConnectedPort' : [ 0x8, ['pointer64', ['_LPCP_PORT_OBJECT']]],
    'MsgQueue' : [ 0x10, ['_LPCP_PORT_QUEUE']],
    'Creator' : [ 0x30, ['_CLIENT_ID']],
    'ClientSectionBase' : [ 0x40, ['pointer64', ['void']]],
    'ServerSectionBase' : [ 0x48, ['pointer64', ['void']]],
    'PortContext' : [ 0x50, ['pointer64', ['void']]],
    'ClientThread' : [ 0x58, ['pointer64', ['_ETHREAD']]],
    'SecurityQos' : [ 0x60, ['_SECURITY_QUALITY_OF_SERVICE']],
    'StaticSecurity' : [ 0x70, ['_SECURITY_CLIENT_CONTEXT']],
    'LpcReplyChainHead' : [ 0xb8, ['_LIST_ENTRY']],
    'LpcDataInfoChainHead' : [ 0xc8, ['_LIST_ENTRY']],
    'ServerProcess' : [ 0xd8, ['pointer64', ['_EPROCESS']]],
    'MappingProcess' : [ 0xd8, ['pointer64', ['_EPROCESS']]],
    'MaxMessageLength' : [ 0xe0, ['unsigned short']],
    'MaxConnectionInfoLength' : [ 0xe2, ['unsigned short']],
    'Flags' : [ 0xe4, ['unsigned long']],
    'WaitEvent' : [ 0xe8, ['_KEVENT']],
} ],
  '_ARBITER_LIST_ENTRY' : [ 0x60, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'AlternativeCount' : [ 0x10, ['unsigned long']],
    'Alternatives' : [ 0x18, ['pointer64', ['_IO_RESOURCE_DESCRIPTOR']]],
    'PhysicalDeviceObject' : [ 0x20, ['pointer64', ['_DEVICE_OBJECT']]],
    'RequestSource' : [ 0x28, ['Enumeration', dict(target = 'long', choices = {0: 'ArbiterRequestLegacyReported', 1: 'ArbiterRequestHalReported', 2: 'ArbiterRequestLegacyAssigned', 3: 'ArbiterRequestPnpDetected', 4: 'ArbiterRequestPnpEnumerated', -1: 'ArbiterRequestUndefined'})]],
    'Flags' : [ 0x2c, ['unsigned long']],
    'WorkSpace' : [ 0x30, ['long long']],
    'InterfaceType' : [ 0x38, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'SlotNumber' : [ 0x3c, ['unsigned long']],
    'BusNumber' : [ 0x40, ['unsigned long']],
    'Assignment' : [ 0x48, ['pointer64', ['_CM_PARTIAL_RESOURCE_DESCRIPTOR']]],
    'SelectedAlternative' : [ 0x50, ['pointer64', ['_IO_RESOURCE_DESCRIPTOR']]],
    'Result' : [ 0x58, ['Enumeration', dict(target = 'long', choices = {0: 'ArbiterResultSuccess', 1: 'ArbiterResultExternalConflict', 2: 'ArbiterResultNullRequest', -1: 'ArbiterResultUndefined'})]],
} ],
  '_POP_DEVICE_SYS_STATE' : [ 0x2f8, {
    'IrpMinor' : [ 0x0, ['unsigned char']],
    'SystemState' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'SpinLock' : [ 0x8, ['unsigned long long']],
    'Thread' : [ 0x10, ['pointer64', ['_KTHREAD']]],
    'AbortEvent' : [ 0x18, ['pointer64', ['_KEVENT']]],
    'ReadySemaphore' : [ 0x20, ['pointer64', ['_KSEMAPHORE']]],
    'FinishedSemaphore' : [ 0x28, ['pointer64', ['_KSEMAPHORE']]],
    'GetNewDeviceList' : [ 0x30, ['unsigned char']],
    'Order' : [ 0x38, ['_PO_DEVICE_NOTIFY_ORDER']],
    'Pending' : [ 0x2d0, ['_LIST_ENTRY']],
    'Status' : [ 0x2e0, ['long']],
    'FailedDevice' : [ 0x2e8, ['pointer64', ['_DEVICE_OBJECT']]],
    'Waking' : [ 0x2f0, ['unsigned char']],
    'Cancelled' : [ 0x2f1, ['unsigned char']],
    'IgnoreErrors' : [ 0x2f2, ['unsigned char']],
    'IgnoreNotImplemented' : [ 0x2f3, ['unsigned char']],
    'TimeRefreshLockAcquired' : [ 0x2f4, ['unsigned char']],
} ],
  '_SEGMENT_FLAGS' : [ 0x4, {
    'TotalNumberOfPtes4132' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 10, native_type='unsigned long')]],
    'ExtraSharedWowSubsections' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'LargePages' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'WatchProto' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'DebugSymbolsLoaded' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'WriteCombined' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'NoCache' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'FloppyMedia' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'DefaultProtectionMask' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 22, native_type='unsigned long')]],
    'Binary32' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'ContainsDebug' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'Spare' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
} ],
  '_VF_KE_CRITICAL_REGION_TRACE' : [ 0x40, {
    'Thread' : [ 0x0, ['pointer64', ['_ETHREAD']]],
    'StackTrace' : [ 0x8, ['array', 7, ['pointer64', ['void']]]],
} ],
  '_DIAGNOSTIC_BUFFER' : [ 0x28, {
    'Size' : [ 0x0, ['unsigned long long']],
    'CallerType' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'KernelRequester', 1: 'UserProcessRequester', 2: 'UserSharedServiceRequester'})]],
    'ProcessImageNameOffset' : [ 0x10, ['unsigned long long']],
    'ProcessId' : [ 0x18, ['unsigned long']],
    'ServiceTag' : [ 0x1c, ['unsigned long']],
    'DeviceDescriptionOffset' : [ 0x10, ['unsigned long long']],
    'DevicePathOffset' : [ 0x18, ['unsigned long long']],
    'ReasonOffset' : [ 0x20, ['unsigned long long']],
} ],
  '_EX_WORK_QUEUE' : [ 0x58, {
    'WorkerQueue' : [ 0x0, ['_KQUEUE']],
    'DynamicThreadCount' : [ 0x40, ['unsigned long']],
    'WorkItemsProcessed' : [ 0x44, ['unsigned long']],
    'WorkItemsProcessedLastPass' : [ 0x48, ['unsigned long']],
    'QueueDepthLastPass' : [ 0x4c, ['unsigned long']],
    'Info' : [ 0x50, ['EX_QUEUE_WORKER_INFO']],
} ],
  '_CLIENT_ID32' : [ 0x8, {
    'UniqueProcess' : [ 0x0, ['unsigned long']],
    'UniqueThread' : [ 0x4, ['unsigned long']],
} ],
  '_TEB32' : [ 0xfe4, {
    'NtTib' : [ 0x0, ['_NT_TIB32']],
    'EnvironmentPointer' : [ 0x1c, ['unsigned long']],
    'ClientId' : [ 0x20, ['_CLIENT_ID32']],
    'ActiveRpcHandle' : [ 0x28, ['unsigned long']],
    'ThreadLocalStoragePointer' : [ 0x2c, ['unsigned long']],
    'ProcessEnvironmentBlock' : [ 0x30, ['unsigned long']],
    'LastErrorValue' : [ 0x34, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x38, ['unsigned long']],
    'CsrClientThread' : [ 0x3c, ['unsigned long']],
    'Win32ThreadInfo' : [ 0x40, ['unsigned long']],
    'User32Reserved' : [ 0x44, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xac, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0xc0, ['unsigned long']],
    'CurrentLocale' : [ 0xc4, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0xc8, ['unsigned long']],
    'SystemReserved1' : [ 0xcc, ['array', 54, ['unsigned long']]],
    'ExceptionCode' : [ 0x1a4, ['long']],
    'ActivationContextStackPointer' : [ 0x1a8, ['unsigned long']],
    'SpareBytes' : [ 0x1ac, ['array', 36, ['unsigned char']]],
    'TxFsContext' : [ 0x1d0, ['unsigned long']],
    'GdiTebBatch' : [ 0x1d4, ['_GDI_TEB_BATCH32']],
    'RealClientId' : [ 0x6b4, ['_CLIENT_ID32']],
    'GdiCachedProcessHandle' : [ 0x6bc, ['unsigned long']],
    'GdiClientPID' : [ 0x6c0, ['unsigned long']],
    'GdiClientTID' : [ 0x6c4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x6c8, ['unsigned long']],
    'Win32ClientInfo' : [ 0x6cc, ['array', 62, ['unsigned long']]],
    'glDispatchTable' : [ 0x7c4, ['array', 233, ['unsigned long']]],
    'glReserved1' : [ 0xb68, ['array', 29, ['unsigned long']]],
    'glReserved2' : [ 0xbdc, ['unsigned long']],
    'glSectionInfo' : [ 0xbe0, ['unsigned long']],
    'glSection' : [ 0xbe4, ['unsigned long']],
    'glTable' : [ 0xbe8, ['unsigned long']],
    'glCurrentRC' : [ 0xbec, ['unsigned long']],
    'glContext' : [ 0xbf0, ['unsigned long']],
    'LastStatusValue' : [ 0xbf4, ['unsigned long']],
    'StaticUnicodeString' : [ 0xbf8, ['_STRING32']],
    'StaticUnicodeBuffer' : [ 0xc00, ['array', 261, ['wchar']]],
    'DeallocationStack' : [ 0xe0c, ['unsigned long']],
    'TlsSlots' : [ 0xe10, ['array', 64, ['unsigned long']]],
    'TlsLinks' : [ 0xf10, ['LIST_ENTRY32']],
    'Vdm' : [ 0xf18, ['unsigned long']],
    'ReservedForNtRpc' : [ 0xf1c, ['unsigned long']],
    'DbgSsReserved' : [ 0xf20, ['array', 2, ['unsigned long']]],
    'HardErrorMode' : [ 0xf28, ['unsigned long']],
    'Instrumentation' : [ 0xf2c, ['array', 9, ['unsigned long']]],
    'ActivityId' : [ 0xf50, ['_GUID']],
    'SubProcessTag' : [ 0xf60, ['unsigned long']],
    'EtwLocalData' : [ 0xf64, ['unsigned long']],
    'EtwTraceData' : [ 0xf68, ['unsigned long']],
    'WinSockData' : [ 0xf6c, ['unsigned long']],
    'GdiBatchCount' : [ 0xf70, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0xf74, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0xf74, ['unsigned long']],
    'ReservedPad0' : [ 0xf74, ['unsigned char']],
    'ReservedPad1' : [ 0xf75, ['unsigned char']],
    'ReservedPad2' : [ 0xf76, ['unsigned char']],
    'IdealProcessor' : [ 0xf77, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0xf78, ['unsigned long']],
    'ReservedForPerf' : [ 0xf7c, ['unsigned long']],
    'ReservedForOle' : [ 0xf80, ['unsigned long']],
    'WaitingOnLoaderLock' : [ 0xf84, ['unsigned long']],
    'SavedPriorityState' : [ 0xf88, ['unsigned long']],
    'SoftPatchPtr1' : [ 0xf8c, ['unsigned long']],
    'ThreadPoolData' : [ 0xf90, ['unsigned long']],
    'TlsExpansionSlots' : [ 0xf94, ['unsigned long']],
    'MuiGeneration' : [ 0xf98, ['unsigned long']],
    'IsImpersonating' : [ 0xf9c, ['unsigned long']],
    'NlsCache' : [ 0xfa0, ['unsigned long']],
    'pShimData' : [ 0xfa4, ['unsigned long']],
    'HeapVirtualAffinity' : [ 0xfa8, ['unsigned long']],
    'CurrentTransactionHandle' : [ 0xfac, ['unsigned long']],
    'ActiveFrame' : [ 0xfb0, ['unsigned long']],
    'FlsData' : [ 0xfb4, ['unsigned long']],
    'PreferredLanguages' : [ 0xfb8, ['unsigned long']],
    'UserPrefLanguages' : [ 0xfbc, ['unsigned long']],
    'MergedPrefLanguages' : [ 0xfc0, ['unsigned long']],
    'MuiImpersonation' : [ 0xfc4, ['unsigned long']],
    'CrossTebFlags' : [ 0xfc8, ['unsigned short']],
    'SpareCrossTebBits' : [ 0xfc8, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0xfca, ['unsigned short']],
    'SafeThunkCall' : [ 0xfca, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0xfca, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0xfca, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0xfca, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0xfca, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0xfca, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0xfca, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0xfca, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0xfca, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0xfca, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0xfca, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0xfca, ['BitField', dict(start_bit = 11, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0xfcc, ['unsigned long']],
    'TxnScopeExitCallback' : [ 0xfd0, ['unsigned long']],
    'TxnScopeContext' : [ 0xfd4, ['unsigned long']],
    'LockCount' : [ 0xfd8, ['unsigned long']],
    'SpareUlong0' : [ 0xfdc, ['unsigned long']],
    'ResourceRetValue' : [ 0xfe0, ['unsigned long']],
} ],
  '_CM_KEY_INDEX' : [ 0x8, {
    'Signature' : [ 0x0, ['unsigned short']],
    'Count' : [ 0x2, ['unsigned short']],
    'List' : [ 0x4, ['array', 1, ['unsigned long']]],
} ],
  '_VI_DEADLOCK_THREAD' : [ 0x38, {
    'Thread' : [ 0x0, ['pointer64', ['_KTHREAD']]],
    'CurrentSpinNode' : [ 0x8, ['pointer64', ['_VI_DEADLOCK_NODE']]],
    'CurrentOtherNode' : [ 0x10, ['pointer64', ['_VI_DEADLOCK_NODE']]],
    'ListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'FreeListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'NodeCount' : [ 0x28, ['unsigned long']],
    'PagingCount' : [ 0x2c, ['unsigned long']],
    'ThreadUsesEresources' : [ 0x30, ['unsigned char']],
} ],
  '_PPM_IDLE_STATE' : [ 0x60, {
    'DomainMembers' : [ 0x0, ['_KAFFINITY_EX']],
    'IdleCheck' : [ 0x28, ['pointer64', ['void']]],
    'IdleHandler' : [ 0x30, ['pointer64', ['void']]],
    'HvConfig' : [ 0x38, ['unsigned long long']],
    'Context' : [ 0x40, ['pointer64', ['void']]],
    'Latency' : [ 0x48, ['unsigned long']],
    'Power' : [ 0x4c, ['unsigned long']],
    'TimeCheck' : [ 0x50, ['unsigned long']],
    'StateFlags' : [ 0x54, ['unsigned long']],
    'PromotePercent' : [ 0x58, ['unsigned char']],
    'DemotePercent' : [ 0x59, ['unsigned char']],
    'PromotePercentBase' : [ 0x5a, ['unsigned char']],
    'DemotePercentBase' : [ 0x5b, ['unsigned char']],
    'StateType' : [ 0x5c, ['unsigned char']],
} ],
  '_KRESOURCEMANAGER' : [ 0x250, {
    'NotificationAvailable' : [ 0x0, ['_KEVENT']],
    'cookie' : [ 0x18, ['unsigned long']],
    'State' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: 'KResourceManagerUninitialized', 1: 'KResourceManagerOffline', 2: 'KResourceManagerOnline'})]],
    'Flags' : [ 0x20, ['unsigned long']],
    'Mutex' : [ 0x28, ['_KMUTANT']],
    'NamespaceLink' : [ 0x60, ['_KTMOBJECT_NAMESPACE_LINK']],
    'RmId' : [ 0x88, ['_GUID']],
    'NotificationQueue' : [ 0x98, ['_KQUEUE']],
    'NotificationMutex' : [ 0xd8, ['_KMUTANT']],
    'EnlistmentHead' : [ 0x110, ['_LIST_ENTRY']],
    'EnlistmentCount' : [ 0x120, ['unsigned long']],
    'NotificationRoutine' : [ 0x128, ['pointer64', ['void']]],
    'Key' : [ 0x130, ['pointer64', ['void']]],
    'ProtocolListHead' : [ 0x138, ['_LIST_ENTRY']],
    'PendingPropReqListHead' : [ 0x148, ['_LIST_ENTRY']],
    'CRMListEntry' : [ 0x158, ['_LIST_ENTRY']],
    'Tm' : [ 0x168, ['pointer64', ['_KTM']]],
    'Description' : [ 0x170, ['_UNICODE_STRING']],
    'Enlistments' : [ 0x180, ['_KTMOBJECT_NAMESPACE']],
    'CompletionBinding' : [ 0x228, ['_KRESOURCEMANAGER_COMPLETION_BINDING']],
} ],
  '_GDI_TEB_BATCH64' : [ 0x4e8, {
    'Offset' : [ 0x0, ['unsigned long']],
    'HDC' : [ 0x8, ['unsigned long long']],
    'Buffer' : [ 0x10, ['array', 310, ['unsigned long']]],
} ],
  '__unnamed_2292' : [ 0x4, {
    'NodeSize' : [ 0x0, ['unsigned long']],
    'UseLookaside' : [ 0x0, ['unsigned long']],
} ],
  '_VF_AVL_TREE' : [ 0x40, {
    'Lock' : [ 0x0, ['long']],
    'NodeToFree' : [ 0x8, ['pointer64', ['void']]],
    'NodeRangeSize' : [ 0x10, ['unsigned long long']],
    'NodeCount' : [ 0x18, ['unsigned long long']],
    'Tables' : [ 0x20, ['pointer64', ['_VF_AVL_TABLE']]],
    'TablesNo' : [ 0x28, ['unsigned long']],
    'u1' : [ 0x2c, ['__unnamed_2292']],
} ],
  '_FILE_NETWORK_OPEN_INFORMATION' : [ 0x38, {
    'CreationTime' : [ 0x0, ['_LARGE_INTEGER']],
    'LastAccessTime' : [ 0x8, ['_LARGE_INTEGER']],
    'LastWriteTime' : [ 0x10, ['_LARGE_INTEGER']],
    'ChangeTime' : [ 0x18, ['_LARGE_INTEGER']],
    'AllocationSize' : [ 0x20, ['_LARGE_INTEGER']],
    'EndOfFile' : [ 0x28, ['_LARGE_INTEGER']],
    'FileAttributes' : [ 0x30, ['unsigned long']],
} ],
  '_WHEA_MEMORY_ERROR_SECTION_VALIDBITS' : [ 0x8, {
    'ErrorStatus' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'PhysicalAddress' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'PhysicalAddressMask' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'Node' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'Card' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'Module' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
    'Bank' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long long')]],
    'Device' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long long')]],
    'Row' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'Column' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'BitPosition' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'RequesterId' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'ResponderId' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long long')]],
    'TargetId' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long long')]],
    'ErrorType' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 64, native_type='unsigned long long')]],
    'ValidBits' : [ 0x0, ['unsigned long long']],
} ],
  '_RELATION_LIST_ENTRY' : [ 0x10, {
    'Count' : [ 0x0, ['unsigned long']],
    'MaxCount' : [ 0x4, ['unsigned long']],
    'Devices' : [ 0x8, ['array', 1, ['pointer64', ['_DEVICE_OBJECT']]]],
} ],
  '_HEAP_FREE_ENTRY_EXTRA' : [ 0x4, {
    'TagIndex' : [ 0x0, ['unsigned short']],
    'FreeBackTraceIndex' : [ 0x2, ['unsigned short']],
} ],
  '_VI_DEADLOCK_GLOBALS' : [ 0x8168, {
    'TimeAcquire' : [ 0x0, ['long long']],
    'TimeRelease' : [ 0x8, ['long long']],
    'ResourceDatabase' : [ 0x10, ['pointer64', ['_LIST_ENTRY']]],
    'ResourceDatabaseCount' : [ 0x18, ['unsigned long long']],
    'ResourceAddressRange' : [ 0x20, ['array', 1023, ['_VF_ADDRESS_RANGE']]],
    'ThreadDatabase' : [ 0x4010, ['pointer64', ['_LIST_ENTRY']]],
    'ThreadDatabaseCount' : [ 0x4018, ['unsigned long long']],
    'ThreadAddressRange' : [ 0x4020, ['array', 1023, ['_VF_ADDRESS_RANGE']]],
    'AllocationFailures' : [ 0x8010, ['unsigned long']],
    'NodesTrimmedBasedOnAge' : [ 0x8014, ['unsigned long']],
    'NodesTrimmedBasedOnCount' : [ 0x8018, ['unsigned long']],
    'NodesSearched' : [ 0x801c, ['unsigned long']],
    'MaxNodesSearched' : [ 0x8020, ['unsigned long']],
    'SequenceNumber' : [ 0x8024, ['unsigned long']],
    'RecursionDepthLimit' : [ 0x8028, ['unsigned long']],
    'SearchedNodesLimit' : [ 0x802c, ['unsigned long']],
    'DepthLimitHits' : [ 0x8030, ['unsigned long']],
    'SearchLimitHits' : [ 0x8034, ['unsigned long']],
    'ABC_ACB_Skipped' : [ 0x8038, ['unsigned long']],
    'OutOfOrderReleases' : [ 0x803c, ['unsigned long']],
    'NodesReleasedOutOfOrder' : [ 0x8040, ['unsigned long']],
    'TotalReleases' : [ 0x8044, ['unsigned long']],
    'RootNodesDeleted' : [ 0x8048, ['unsigned long']],
    'ForgetHistoryCounter' : [ 0x804c, ['unsigned long']],
    'Instigator' : [ 0x8050, ['pointer64', ['void']]],
    'NumberOfParticipants' : [ 0x8058, ['unsigned long']],
    'Participant' : [ 0x8060, ['array', 32, ['pointer64', ['_VI_DEADLOCK_NODE']]]],
    'ChildrenCountWatermark' : [ 0x8160, ['long']],
} ],
  '_KTM' : [ 0x3c0, {
    'cookie' : [ 0x0, ['unsigned long']],
    'Mutex' : [ 0x8, ['_KMUTANT']],
    'State' : [ 0x40, ['Enumeration', dict(target = 'long', choices = {0: 'KKtmUninitialized', 1: 'KKtmInitialized', 2: 'KKtmRecovering', 3: 'KKtmOnline', 4: 'KKtmRecoveryFailed', 5: 'KKtmOffline'})]],
    'NamespaceLink' : [ 0x48, ['_KTMOBJECT_NAMESPACE_LINK']],
    'TmIdentity' : [ 0x70, ['_GUID']],
    'Flags' : [ 0x80, ['unsigned long']],
    'VolatileFlags' : [ 0x84, ['unsigned long']],
    'LogFileName' : [ 0x88, ['_UNICODE_STRING']],
    'LogFileObject' : [ 0x98, ['pointer64', ['_FILE_OBJECT']]],
    'MarshallingContext' : [ 0xa0, ['pointer64', ['void']]],
    'LogManagementContext' : [ 0xa8, ['pointer64', ['void']]],
    'Transactions' : [ 0xb0, ['_KTMOBJECT_NAMESPACE']],
    'ResourceManagers' : [ 0x158, ['_KTMOBJECT_NAMESPACE']],
    'LsnOrderedMutex' : [ 0x200, ['_KMUTANT']],
    'LsnOrderedList' : [ 0x238, ['_LIST_ENTRY']],
    'CommitVirtualClock' : [ 0x248, ['_LARGE_INTEGER']],
    'CommitVirtualClockMutex' : [ 0x250, ['_FAST_MUTEX']],
    'BaseLsn' : [ 0x288, ['_CLS_LSN']],
    'CurrentReadLsn' : [ 0x290, ['_CLS_LSN']],
    'LastRecoveredLsn' : [ 0x298, ['_CLS_LSN']],
    'TmRmHandle' : [ 0x2a0, ['pointer64', ['void']]],
    'TmRm' : [ 0x2a8, ['pointer64', ['_KRESOURCEMANAGER']]],
    'LogFullNotifyEvent' : [ 0x2b0, ['_KEVENT']],
    'CheckpointWorkItem' : [ 0x2c8, ['_WORK_QUEUE_ITEM']],
    'CheckpointTargetLsn' : [ 0x2e8, ['_CLS_LSN']],
    'LogFullCompletedWorkItem' : [ 0x2f0, ['_WORK_QUEUE_ITEM']],
    'LogWriteResource' : [ 0x310, ['_ERESOURCE']],
    'LogFlags' : [ 0x378, ['unsigned long']],
    'LogFullStatus' : [ 0x37c, ['long']],
    'RecoveryStatus' : [ 0x380, ['long']],
    'LastCheckBaseLsn' : [ 0x388, ['_CLS_LSN']],
    'RestartOrderedList' : [ 0x390, ['_LIST_ENTRY']],
    'OfflineWorkItem' : [ 0x3a0, ['_WORK_QUEUE_ITEM']],
} ],
  '_CONFIGURATION_COMPONENT' : [ 0x28, {
    'Class' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'SystemClass', 1: 'ProcessorClass', 2: 'CacheClass', 3: 'AdapterClass', 4: 'ControllerClass', 5: 'PeripheralClass', 6: 'MemoryClass', 7: 'MaximumClass'})]],
    'Type' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'ArcSystem', 1: 'CentralProcessor', 2: 'FloatingPointProcessor', 3: 'PrimaryIcache', 4: 'PrimaryDcache', 5: 'SecondaryIcache', 6: 'SecondaryDcache', 7: 'SecondaryCache', 8: 'EisaAdapter', 9: 'TcAdapter', 10: 'ScsiAdapter', 11: 'DtiAdapter', 12: 'MultiFunctionAdapter', 13: 'DiskController', 14: 'TapeController', 15: 'CdromController', 16: 'WormController', 17: 'SerialController', 18: 'NetworkController', 19: 'DisplayController', 20: 'ParallelController', 21: 'PointerController', 22: 'KeyboardController', 23: 'AudioController', 24: 'OtherController', 25: 'DiskPeripheral', 26: 'FloppyDiskPeripheral', 27: 'TapePeripheral', 28: 'ModemPeripheral', 29: 'MonitorPeripheral', 30: 'PrinterPeripheral', 31: 'PointerPeripheral', 32: 'KeyboardPeripheral', 33: 'TerminalPeripheral', 34: 'OtherPeripheral', 35: 'LinePeripheral', 36: 'NetworkPeripheral', 37: 'SystemMemory', 38: 'DockingInformation', 39: 'RealModeIrqRoutingTable', 40: 'RealModePCIEnumeration', 41: 'MaximumType'})]],
    'Flags' : [ 0x8, ['_DEVICE_FLAGS']],
    'Version' : [ 0xc, ['unsigned short']],
    'Revision' : [ 0xe, ['unsigned short']],
    'Key' : [ 0x10, ['unsigned long']],
    'AffinityMask' : [ 0x14, ['unsigned long']],
    'Group' : [ 0x14, ['unsigned short']],
    'GroupIndex' : [ 0x16, ['unsigned short']],
    'ConfigurationDataLength' : [ 0x18, ['unsigned long']],
    'IdentifierLength' : [ 0x1c, ['unsigned long']],
    'Identifier' : [ 0x20, ['pointer64', ['unsigned char']]],
} ],
  '_KTRANSACTION' : [ 0x2d8, {
    'OutcomeEvent' : [ 0x0, ['_KEVENT']],
    'cookie' : [ 0x18, ['unsigned long']],
    'Mutex' : [ 0x20, ['_KMUTANT']],
    'TreeTx' : [ 0x58, ['pointer64', ['_KTRANSACTION']]],
    'GlobalNamespaceLink' : [ 0x60, ['_KTMOBJECT_NAMESPACE_LINK']],
    'TmNamespaceLink' : [ 0x88, ['_KTMOBJECT_NAMESPACE_LINK']],
    'UOW' : [ 0xb0, ['_GUID']],
    'State' : [ 0xc0, ['Enumeration', dict(target = 'long', choices = {0: 'KTransactionUninitialized', 1: 'KTransactionActive', 2: 'KTransactionPreparing', 3: 'KTransactionPrepared', 4: 'KTransactionInDoubt', 5: 'KTransactionCommitted', 6: 'KTransactionAborted', 7: 'KTransactionDelegated', 8: 'KTransactionPrePreparing', 9: 'KTransactionForgotten', 10: 'KTransactionRecovering', 11: 'KTransactionPrePrepared'})]],
    'Flags' : [ 0xc4, ['unsigned long']],
    'EnlistmentHead' : [ 0xc8, ['_LIST_ENTRY']],
    'EnlistmentCount' : [ 0xd8, ['unsigned long']],
    'RecoverableEnlistmentCount' : [ 0xdc, ['unsigned long']],
    'PrePrepareRequiredEnlistmentCount' : [ 0xe0, ['unsigned long']],
    'PrepareRequiredEnlistmentCount' : [ 0xe4, ['unsigned long']],
    'OutcomeRequiredEnlistmentCount' : [ 0xe8, ['unsigned long']],
    'PendingResponses' : [ 0xec, ['unsigned long']],
    'SuperiorEnlistment' : [ 0xf0, ['pointer64', ['_KENLISTMENT']]],
    'LastLsn' : [ 0xf8, ['_CLS_LSN']],
    'PromotedEntry' : [ 0x100, ['_LIST_ENTRY']],
    'PromoterTransaction' : [ 0x110, ['pointer64', ['_KTRANSACTION']]],
    'PromotePropagation' : [ 0x118, ['pointer64', ['void']]],
    'IsolationLevel' : [ 0x120, ['unsigned long']],
    'IsolationFlags' : [ 0x124, ['unsigned long']],
    'Timeout' : [ 0x128, ['_LARGE_INTEGER']],
    'Description' : [ 0x130, ['_UNICODE_STRING']],
    'RollbackThread' : [ 0x140, ['pointer64', ['_KTHREAD']]],
    'RollbackWorkItem' : [ 0x148, ['_WORK_QUEUE_ITEM']],
    'RollbackDpc' : [ 0x168, ['_KDPC']],
    'RollbackTimer' : [ 0x1a8, ['_KTIMER']],
    'LsnOrderedEntry' : [ 0x1e8, ['_LIST_ENTRY']],
    'Outcome' : [ 0x1f8, ['Enumeration', dict(target = 'long', choices = {0: 'KTxOutcomeUninitialized', 1: 'KTxOutcomeUndetermined', 2: 'KTxOutcomeCommitted', 3: 'KTxOutcomeAborted', 4: 'KTxOutcomeUnavailable'})]],
    'Tm' : [ 0x200, ['pointer64', ['_KTM']]],
    'CommitReservation' : [ 0x208, ['long long']],
    'TransactionHistory' : [ 0x210, ['array', 10, ['_KTRANSACTION_HISTORY']]],
    'TransactionHistoryCount' : [ 0x260, ['unsigned long']],
    'DTCPrivateInformation' : [ 0x268, ['pointer64', ['void']]],
    'DTCPrivateInformationLength' : [ 0x270, ['unsigned long']],
    'DTCPrivateInformationMutex' : [ 0x278, ['_KMUTANT']],
    'PromotedTxSelfHandle' : [ 0x2b0, ['pointer64', ['void']]],
    'PendingPromotionCount' : [ 0x2b8, ['unsigned long']],
    'PromotionCompletedEvent' : [ 0x2c0, ['_KEVENT']],
} ],
  '_PRIVATE_CACHE_MAP_FLAGS' : [ 0x4, {
    'DontUse' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'ReadAheadActive' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'ReadAheadEnabled' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'PagePriority' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 21, native_type='unsigned long')]],
    'Available' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 32, native_type='unsigned long')]],
} ],
  '_CM_KCB_UOW' : [ 0x60, {
    'TransactionListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'KCBLock' : [ 0x10, ['pointer64', ['_CM_INTENT_LOCK']]],
    'KeyLock' : [ 0x18, ['pointer64', ['_CM_INTENT_LOCK']]],
    'KCBListEntry' : [ 0x20, ['_LIST_ENTRY']],
    'KeyControlBlock' : [ 0x30, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
    'Transaction' : [ 0x38, ['pointer64', ['_CM_TRANS']]],
    'UoWState' : [ 0x40, ['unsigned long']],
    'ActionType' : [ 0x44, ['Enumeration', dict(target = 'long', choices = {0: 'UoWAddThisKey', 1: 'UoWAddChildKey', 2: 'UoWDeleteThisKey', 3: 'UoWDeleteChildKey', 4: 'UoWSetValueNew', 5: 'UoWSetValueExisting', 6: 'UoWDeleteValue', 7: 'UoWSetKeyUserFlags', 8: 'UoWSetLastWriteTime', 9: 'UoWSetSecurityDescriptor', 10: 'UoWRenameSubKey', 11: 'UoWRenameOldSubKey', 12: 'UoWRenameNewSubKey', 13: 'UoWIsolation', 14: 'UoWInvalid'})]],
    'StorageType' : [ 0x48, ['Enumeration', dict(target = 'long', choices = {0: 'Stable', 1: 'Volatile', 2: 'InvalidStorage'})]],
    'ChildKCB' : [ 0x50, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
    'VolatileKeyCell' : [ 0x50, ['unsigned long']],
    'OldValueCell' : [ 0x50, ['unsigned long']],
    'NewValueCell' : [ 0x54, ['unsigned long']],
    'UserFlags' : [ 0x50, ['unsigned long']],
    'LastWriteTime' : [ 0x50, ['_LARGE_INTEGER']],
    'TxSecurityCell' : [ 0x50, ['unsigned long']],
    'OldChildKCB' : [ 0x50, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
    'NewChildKCB' : [ 0x58, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
    'OtherChildKCB' : [ 0x50, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
    'ThisVolatileKeyCell' : [ 0x58, ['unsigned long']],
} ],
  '_MMPTE_TRANSITION' : [ 0x8, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Write' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Owner' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'WriteThrough' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'CacheDisable' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'Protection' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 10, native_type='unsigned long long')]],
    'Prototype' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'Transition' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'PageFrameNumber' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 48, native_type='unsigned long long')]],
    'Unused' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_KREQUEST_PACKET' : [ 0x20, {
    'CurrentPacket' : [ 0x0, ['array', 3, ['pointer64', ['void']]]],
    'WorkerRoutine' : [ 0x18, ['pointer64', ['void']]],
} ],
  '_VF_WATCHDOG_IRP' : [ 0x20, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Irp' : [ 0x10, ['pointer64', ['_IRP']]],
    'DueTickCount' : [ 0x18, ['unsigned long']],
    'Inserted' : [ 0x1c, ['unsigned char']],
    'TrackedStackLocation' : [ 0x1d, ['unsigned char']],
    'CancelTimeoutTicks' : [ 0x1e, ['unsigned short']],
} ],
  '_flags' : [ 0x1, {
    'Removable' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'GroupAssigned' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'GroupCommitted' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'GroupAssignmentFixed' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Fill' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
} ],
  '__unnamed_22df' : [ 0x8, {
    'Head' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 24, native_type='unsigned long long')]],
    'Tail' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 48, native_type='unsigned long long')]],
    'ActiveThreadCount' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 64, native_type='unsigned long long')]],
} ],
  '__unnamed_22e1' : [ 0x8, {
    's1' : [ 0x0, ['__unnamed_22df']],
    'Value' : [ 0x0, ['unsigned long long']],
} ],
  '_ALPC_COMPLETION_LIST_STATE' : [ 0x8, {
    'u1' : [ 0x0, ['__unnamed_22e1']],
} ],
  '_PSP_CPU_SHARE_CAPTURED_WEIGHT_DATA' : [ 0x8, {
    'CapturedCpuShareWeight' : [ 0x0, ['unsigned long']],
    'CapturedTotalWeight' : [ 0x4, ['unsigned long']],
    'CombinedData' : [ 0x0, ['long long']],
} ],
  '_CM_NAME_HASH' : [ 0x18, {
    'ConvKey' : [ 0x0, ['unsigned long']],
    'NextHash' : [ 0x8, ['pointer64', ['_CM_NAME_HASH']]],
    'NameLength' : [ 0x10, ['unsigned short']],
    'Name' : [ 0x12, ['array', 1, ['wchar']]],
} ],
  '_PROC_IDLE_STATE_BUCKET' : [ 0x20, {
    'TotalTime' : [ 0x0, ['unsigned long long']],
    'MinTime' : [ 0x8, ['unsigned long long']],
    'MaxTime' : [ 0x10, ['unsigned long long']],
    'Count' : [ 0x18, ['unsigned long']],
} ],
  '_MMSECURE_FLAGS' : [ 0x4, {
    'ReadOnly' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'NoWrite' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Spare' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 12, native_type='unsigned long')]],
} ],
  '_PO_IRP_QUEUE' : [ 0x10, {
    'CurrentIrp' : [ 0x0, ['pointer64', ['_IRP']]],
    'PendingIrpList' : [ 0x8, ['pointer64', ['_IRP']]],
} ],
  '__unnamed_22f4' : [ 0x4, {
    'Active' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'OnlyTryAcquireUsed' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ReleasedOutOfOrder' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'SequenceNumber' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'Whole' : [ 0x0, ['unsigned long']],
} ],
  '_VI_DEADLOCK_NODE' : [ 0xd0, {
    'Parent' : [ 0x0, ['pointer64', ['_VI_DEADLOCK_NODE']]],
    'ChildrenList' : [ 0x8, ['_LIST_ENTRY']],
    'SiblingsList' : [ 0x18, ['_LIST_ENTRY']],
    'ResourceList' : [ 0x28, ['_LIST_ENTRY']],
    'FreeListEntry' : [ 0x28, ['_LIST_ENTRY']],
    'Root' : [ 0x38, ['pointer64', ['_VI_DEADLOCK_RESOURCE']]],
    'ThreadEntry' : [ 0x40, ['pointer64', ['_VI_DEADLOCK_THREAD']]],
    'u1' : [ 0x48, ['__unnamed_22f4']],
    'ChildrenCount' : [ 0x4c, ['long']],
    'StackTrace' : [ 0x50, ['array', 8, ['pointer64', ['void']]]],
    'ParentStackTrace' : [ 0x90, ['array', 8, ['pointer64', ['void']]]],
} ],
  'PROCESSOR_IDLESTATE_INFO' : [ 0x8, {
    'TimeCheck' : [ 0x0, ['unsigned long']],
    'DemotePercent' : [ 0x4, ['unsigned char']],
    'PromotePercent' : [ 0x5, ['unsigned char']],
    'Spare' : [ 0x6, ['array', 2, ['unsigned char']]],
} ],
  '_KTMOBJECT_NAMESPACE' : [ 0xa8, {
    'Table' : [ 0x0, ['_RTL_AVL_TABLE']],
    'Mutex' : [ 0x68, ['_KMUTANT']],
    'LinksOffset' : [ 0xa0, ['unsigned short']],
    'GuidOffset' : [ 0xa2, ['unsigned short']],
    'Expired' : [ 0xa4, ['unsigned char']],
} ],
  '_LPCP_PORT_QUEUE' : [ 0x20, {
    'NonPagedPortQueue' : [ 0x0, ['pointer64', ['_LPCP_NONPAGED_PORT_QUEUE']]],
    'Semaphore' : [ 0x8, ['pointer64', ['_KSEMAPHORE']]],
    'ReceiveHead' : [ 0x10, ['_LIST_ENTRY']],
} ],
  '_CM_KEY_REFERENCE' : [ 0x10, {
    'KeyCell' : [ 0x0, ['unsigned long']],
    'KeyHive' : [ 0x8, ['pointer64', ['_HHIVE']]],
} ],
  'SYSTEM_POWER_LEVEL' : [ 0x18, {
    'Enable' : [ 0x0, ['unsigned char']],
    'Spare' : [ 0x1, ['array', 3, ['unsigned char']]],
    'BatteryLevel' : [ 0x4, ['unsigned long']],
    'PowerPolicy' : [ 0x8, ['POWER_ACTION_POLICY']],
    'MinSystemState' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
} ],
  '_OBJECT_DUMP_CONTROL' : [ 0x10, {
    'Stream' : [ 0x0, ['pointer64', ['void']]],
    'Detail' : [ 0x8, ['unsigned long']],
} ],
  '_VF_ADDRESS_RANGE' : [ 0x10, {
    'Start' : [ 0x0, ['pointer64', ['unsigned char']]],
    'End' : [ 0x8, ['pointer64', ['unsigned char']]],
} ],
  '_OBJECT_SYMBOLIC_LINK' : [ 0x20, {
    'CreationTime' : [ 0x0, ['_LARGE_INTEGER']],
    'LinkTarget' : [ 0x8, ['_UNICODE_STRING']],
    'DosDeviceDriveIndex' : [ 0x18, ['unsigned long']],
} ],
  '_LPCP_NONPAGED_PORT_QUEUE' : [ 0x28, {
    'Semaphore' : [ 0x0, ['_KSEMAPHORE']],
    'BackPointer' : [ 0x20, ['pointer64', ['_LPCP_PORT_OBJECT']]],
} ],
  '_KRESOURCEMANAGER_COMPLETION_BINDING' : [ 0x28, {
    'NotificationListHead' : [ 0x0, ['_LIST_ENTRY']],
    'Port' : [ 0x10, ['pointer64', ['void']]],
    'Key' : [ 0x18, ['unsigned long long']],
    'BindingProcess' : [ 0x20, ['pointer64', ['_EPROCESS']]],
} ],
  '_VF_TRACKER' : [ 0x10, {
    'TrackerFlags' : [ 0x0, ['unsigned long']],
    'TrackerSize' : [ 0x4, ['unsigned long']],
    'TrackerIndex' : [ 0x8, ['unsigned long']],
    'TraceDepth' : [ 0xc, ['unsigned long']],
} ],
  '_CALL_PERFORMANCE_DATA' : [ 0x408, {
    'SpinLock' : [ 0x0, ['unsigned long long']],
    'HashTable' : [ 0x8, ['array', 64, ['_LIST_ENTRY']]],
} ],
  '_ARBITER_ALTERNATIVE' : [ 0x40, {
    'Minimum' : [ 0x0, ['unsigned long long']],
    'Maximum' : [ 0x8, ['unsigned long long']],
    'Length' : [ 0x10, ['unsigned long long']],
    'Alignment' : [ 0x18, ['unsigned long long']],
    'Priority' : [ 0x20, ['long']],
    'Flags' : [ 0x24, ['unsigned long']],
    'Descriptor' : [ 0x28, ['pointer64', ['_IO_RESOURCE_DESCRIPTOR']]],
    'Reserved' : [ 0x30, ['array', 3, ['unsigned long']]],
} ],
  '_WHEA_ERROR_STATUS' : [ 0x8, {
    'ErrorStatus' : [ 0x0, ['unsigned long long']],
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned long long')]],
    'ErrorType' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned long long')]],
    'Address' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long long')]],
    'Control' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long long')]],
    'Data' : [ 0x0, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long long')]],
    'Responder' : [ 0x0, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long long')]],
    'Requester' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long long')]],
    'FirstError' : [ 0x0, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long long')]],
    'Overflow' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_WHEA_PERSISTENCE_INFO' : [ 0x8, {
    'Signature' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'Length' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 40, native_type='unsigned long long')]],
    'Identifier' : [ 0x0, ['BitField', dict(start_bit = 40, end_bit = 56, native_type='unsigned long long')]],
    'Attributes' : [ 0x0, ['BitField', dict(start_bit = 56, end_bit = 58, native_type='unsigned long long')]],
    'DoNotLog' : [ 0x0, ['BitField', dict(start_bit = 58, end_bit = 59, native_type='unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 59, end_bit = 64, native_type='unsigned long long')]],
    'AsULONGLONG' : [ 0x0, ['unsigned long long']],
} ],
  '_MI_SECTION_IMAGE_INFORMATION' : [ 0x48, {
    'ExportedImageInformation' : [ 0x0, ['_SECTION_IMAGE_INFORMATION']],
    'InternalImageInformation' : [ 0x40, ['_MI_EXTRA_IMAGE_INFORMATION']],
} ],
  '_HEAP_USERDATA_HEADER' : [ 0x20, {
    'SFreeListEntry' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'SubSegment' : [ 0x0, ['pointer64', ['_HEAP_SUBSEGMENT']]],
    'Reserved' : [ 0x8, ['pointer64', ['void']]],
    'SizeIndex' : [ 0x10, ['unsigned long long']],
    'Signature' : [ 0x18, ['unsigned long long']],
} ],
  '_STRING64' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x8, ['unsigned long long']],
} ],
  '_STACK_TABLE' : [ 0x8088, {
    'NumStackTraces' : [ 0x0, ['unsigned short']],
    'TraceCapacity' : [ 0x2, ['unsigned short']],
    'StackTrace' : [ 0x8, ['array', 16, ['pointer64', ['_OBJECT_REF_TRACE']]]],
    'StackTableHash' : [ 0x88, ['array', 16381, ['unsigned short']]],
} ],
  '_TOKEN_CONTROL' : [ 0x28, {
    'TokenId' : [ 0x0, ['_LUID']],
    'AuthenticationId' : [ 0x8, ['_LUID']],
    'ModifiedId' : [ 0x10, ['_LUID']],
    'TokenSource' : [ 0x18, ['_TOKEN_SOURCE']],
} ],
  '_DEFERRED_WRITE' : [ 0x48, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'FileObject' : [ 0x8, ['pointer64', ['_FILE_OBJECT']]],
    'BytesToWrite' : [ 0x10, ['unsigned long']],
    'DeferredWriteLinks' : [ 0x18, ['_LIST_ENTRY']],
    'Event' : [ 0x28, ['pointer64', ['_KEVENT']]],
    'PostRoutine' : [ 0x30, ['pointer64', ['void']]],
    'Context1' : [ 0x38, ['pointer64', ['void']]],
    'Context2' : [ 0x40, ['pointer64', ['void']]],
} ],
  '_ARBITER_ORDERING_LIST' : [ 0x10, {
    'Count' : [ 0x0, ['unsigned short']],
    'Maximum' : [ 0x2, ['unsigned short']],
    'Orderings' : [ 0x8, ['pointer64', ['_ARBITER_ORDERING']]],
} ],
  '_SECTION_IMAGE_INFORMATION' : [ 0x40, {
    'TransferAddress' : [ 0x0, ['pointer64', ['void']]],
    'ZeroBits' : [ 0x8, ['unsigned long']],
    'MaximumStackSize' : [ 0x10, ['unsigned long long']],
    'CommittedStackSize' : [ 0x18, ['unsigned long long']],
    'SubSystemType' : [ 0x20, ['unsigned long']],
    'SubSystemMinorVersion' : [ 0x24, ['unsigned short']],
    'SubSystemMajorVersion' : [ 0x26, ['unsigned short']],
    'SubSystemVersion' : [ 0x24, ['unsigned long']],
    'GpValue' : [ 0x28, ['unsigned long']],
    'ImageCharacteristics' : [ 0x2c, ['unsigned short']],
    'DllCharacteristics' : [ 0x2e, ['unsigned short']],
    'Machine' : [ 0x30, ['unsigned short']],
    'ImageContainsCode' : [ 0x32, ['unsigned char']],
    'ImageFlags' : [ 0x33, ['unsigned char']],
    'ComPlusNativeReady' : [ 0x33, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'ComPlusILOnly' : [ 0x33, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'ImageDynamicallyRelocated' : [ 0x33, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'ImageMappedFlat' : [ 0x33, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Reserved' : [ 0x33, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'LoaderFlags' : [ 0x34, ['unsigned long']],
    'ImageFileSize' : [ 0x38, ['unsigned long']],
    'CheckSum' : [ 0x3c, ['unsigned long']],
} ],
  '_VF_AVL_TABLE' : [ 0x70, {
    'RtlTable' : [ 0x0, ['_RTL_AVL_TABLE']],
    'ReservedNode' : [ 0x68, ['pointer64', ['_VF_AVL_TREE_NODE']]],
} ],
  '_TOKEN_AUDIT_POLICY' : [ 0x1b, {
    'PerUserPolicy' : [ 0x0, ['array', 27, ['unsigned char']]],
} ],
  '__unnamed_234a' : [ 0x10, {
    'EndingOffset' : [ 0x0, ['pointer64', ['_LARGE_INTEGER']]],
    'ResourceToRelease' : [ 0x8, ['pointer64', ['pointer64', ['_ERESOURCE']]]],
} ],
  '__unnamed_234c' : [ 0x8, {
    'ResourceToRelease' : [ 0x0, ['pointer64', ['_ERESOURCE']]],
} ],
  '__unnamed_2350' : [ 0x8, {
    'SyncType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'SyncTypeOther', 1: 'SyncTypeCreateSection'})]],
    'PageProtection' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_2354' : [ 0x10, {
    'NotificationType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'NotifyTypeCreate', 1: 'NotifyTypeRetired'})]],
    'SafeToRecurse' : [ 0x8, ['unsigned char']],
} ],
  '__unnamed_2356' : [ 0x28, {
    'Argument1' : [ 0x0, ['pointer64', ['void']]],
    'Argument2' : [ 0x8, ['pointer64', ['void']]],
    'Argument3' : [ 0x10, ['pointer64', ['void']]],
    'Argument4' : [ 0x18, ['pointer64', ['void']]],
    'Argument5' : [ 0x20, ['pointer64', ['void']]],
} ],
  '_FS_FILTER_PARAMETERS' : [ 0x28, {
    'AcquireForModifiedPageWriter' : [ 0x0, ['__unnamed_234a']],
    'ReleaseForModifiedPageWriter' : [ 0x0, ['__unnamed_234c']],
    'AcquireForSectionSynchronization' : [ 0x0, ['__unnamed_2350']],
    'NotifyStreamFileObject' : [ 0x0, ['__unnamed_2354']],
    'Others' : [ 0x0, ['__unnamed_2356']],
} ],
  '_PROFILE_PARAMETER_BLOCK' : [ 0x10, {
    'Status' : [ 0x0, ['unsigned short']],
    'Reserved' : [ 0x2, ['unsigned short']],
    'DockingState' : [ 0x4, ['unsigned short']],
    'Capabilities' : [ 0x6, ['unsigned short']],
    'DockID' : [ 0x8, ['unsigned long']],
    'SerialNumber' : [ 0xc, ['unsigned long']],
} ],
  '_COMPRESSED_DATA_INFO' : [ 0xc, {
    'CompressionFormatAndEngine' : [ 0x0, ['unsigned short']],
    'CompressionUnitShift' : [ 0x2, ['unsigned char']],
    'ChunkShift' : [ 0x3, ['unsigned char']],
    'ClusterShift' : [ 0x4, ['unsigned char']],
    'Reserved' : [ 0x5, ['unsigned char']],
    'NumberOfChunks' : [ 0x6, ['unsigned short']],
    'CompressedChunkSizes' : [ 0x8, ['array', 1, ['unsigned long']]],
} ],
  '_POP_HIBER_CONTEXT' : [ 0x110, {
    'WriteToFile' : [ 0x0, ['unsigned char']],
    'ReserveLoaderMemory' : [ 0x1, ['unsigned char']],
    'ReserveFreeMemory' : [ 0x2, ['unsigned char']],
    'Reset' : [ 0x3, ['unsigned char']],
    'HiberFlags' : [ 0x4, ['unsigned char']],
    'WroteHiberFile' : [ 0x5, ['unsigned char']],
    'MapFrozen' : [ 0x6, ['unsigned char']],
    'MemoryMap' : [ 0x8, ['_RTL_BITMAP']],
    'DiscardedMemoryPages' : [ 0x18, ['_RTL_BITMAP']],
    'ClonedRanges' : [ 0x28, ['_LIST_ENTRY']],
    'ClonedRangeCount' : [ 0x38, ['unsigned long']],
    'NextCloneRange' : [ 0x40, ['pointer64', ['_LIST_ENTRY']]],
    'NextPreserve' : [ 0x48, ['unsigned long long']],
    'LoaderMdl' : [ 0x50, ['pointer64', ['_MDL']]],
    'AllocatedMdl' : [ 0x58, ['pointer64', ['_MDL']]],
    'PagesOut' : [ 0x60, ['unsigned long long']],
    'IoPages' : [ 0x68, ['pointer64', ['void']]],
    'IoPagesCount' : [ 0x70, ['unsigned long']],
    'CurrentMcb' : [ 0x78, ['pointer64', ['void']]],
    'DumpStack' : [ 0x80, ['pointer64', ['_DUMP_STACK_CONTEXT']]],
    'WakeState' : [ 0x88, ['pointer64', ['_KPROCESSOR_STATE']]],
    'PreferredIoWriteSize' : [ 0x90, ['unsigned long']],
    'IoProgress' : [ 0x94, ['unsigned long']],
    'HiberVa' : [ 0x98, ['unsigned long long']],
    'HiberPte' : [ 0xa0, ['_LARGE_INTEGER']],
    'Status' : [ 0xa8, ['long']],
    'MemoryImage' : [ 0xb0, ['pointer64', ['PO_MEMORY_IMAGE']]],
    'CompressionWorkspace' : [ 0xb8, ['pointer64', ['void']]],
    'CompressedWriteBuffer' : [ 0xc0, ['pointer64', ['unsigned char']]],
    'CompressedWriteBufferSize' : [ 0xc8, ['unsigned long']],
    'MaxCompressedOutputSize' : [ 0xcc, ['unsigned long']],
    'PerformanceStats' : [ 0xd0, ['pointer64', ['unsigned long']]],
    'CompressionBlock' : [ 0xd8, ['pointer64', ['void']]],
    'DmaIO' : [ 0xe0, ['pointer64', ['void']]],
    'TemporaryHeap' : [ 0xe8, ['pointer64', ['void']]],
    'BootLoaderLogMdl' : [ 0xf0, ['pointer64', ['_MDL']]],
    'FirmwareRuntimeInformationMdl' : [ 0xf8, ['pointer64', ['_MDL']]],
    'ResumeContext' : [ 0x100, ['pointer64', ['void']]],
    'ResumeContextPages' : [ 0x108, ['unsigned long']],
} ],
  '_OBJECT_REF_TRACE' : [ 0x80, {
    'StackTrace' : [ 0x0, ['array', 16, ['pointer64', ['void']]]],
} ],
  '_OBJECT_NAME_INFORMATION' : [ 0x10, {
    'Name' : [ 0x0, ['_UNICODE_STRING']],
} ],
  '_KDESCRIPTOR' : [ 0x10, {
    'Pad' : [ 0x0, ['array', 3, ['unsigned short']]],
    'Limit' : [ 0x6, ['unsigned short']],
    'Base' : [ 0x8, ['pointer64', ['void']]],
} ],
  '_PCW_COUNTER_INFORMATION' : [ 0x10, {
    'CounterMask' : [ 0x0, ['unsigned long long']],
    'InstanceMask' : [ 0x8, ['pointer64', ['_UNICODE_STRING']]],
} ],
  '_DUMP_STACK_CONTEXT' : [ 0x110, {
    'Init' : [ 0x0, ['_DUMP_INITIALIZATION_CONTEXT']],
    'PartitionOffset' : [ 0xa0, ['_LARGE_INTEGER']],
    'DumpPointers' : [ 0xa8, ['pointer64', ['void']]],
    'PointersLength' : [ 0xb0, ['unsigned long']],
    'ModulePrefix' : [ 0xb8, ['pointer64', ['unsigned short']]],
    'DriverList' : [ 0xc0, ['_LIST_ENTRY']],
    'InitMsg' : [ 0xd0, ['_STRING']],
    'ProgMsg' : [ 0xe0, ['_STRING']],
    'DoneMsg' : [ 0xf0, ['_STRING']],
    'FileObject' : [ 0x100, ['pointer64', ['void']]],
    'UsageType' : [ 0x108, ['Enumeration', dict(target = 'long', choices = {0: 'DeviceUsageTypeUndefined', 1: 'DeviceUsageTypePaging', 2: 'DeviceUsageTypeHibernation', 3: 'DeviceUsageTypeDumpFile'})]],
} ],
  '_FILE_STANDARD_INFORMATION' : [ 0x18, {
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
    'EndOfFile' : [ 0x8, ['_LARGE_INTEGER']],
    'NumberOfLinks' : [ 0x10, ['unsigned long']],
    'DeletePending' : [ 0x14, ['unsigned char']],
    'Directory' : [ 0x15, ['unsigned char']],
} ],
  '_POP_SHUTDOWN_BUG_CHECK' : [ 0x40, {
    'ThreadHandle' : [ 0x0, ['pointer64', ['void']]],
    'ThreadId' : [ 0x8, ['pointer64', ['void']]],
    'ProcessId' : [ 0x10, ['pointer64', ['void']]],
    'Code' : [ 0x18, ['unsigned long']],
    'Parameter1' : [ 0x20, ['unsigned long long']],
    'Parameter2' : [ 0x28, ['unsigned long long']],
    'Parameter3' : [ 0x30, ['unsigned long long']],
    'Parameter4' : [ 0x38, ['unsigned long long']],
} ],
  '_MI_EXTRA_IMAGE_INFORMATION' : [ 0x8, {
    'SizeOfHeaders' : [ 0x0, ['unsigned long']],
    'SizeOfImage' : [ 0x4, ['unsigned long']],
} ],
  '_PCW_MASK_INFORMATION' : [ 0x28, {
    'CounterMask' : [ 0x0, ['unsigned long long']],
    'InstanceMask' : [ 0x8, ['pointer64', ['_UNICODE_STRING']]],
    'InstanceId' : [ 0x10, ['unsigned long']],
    'CollectMultiple' : [ 0x14, ['unsigned char']],
    'Buffer' : [ 0x18, ['pointer64', ['_PCW_BUFFER']]],
    'CancelEvent' : [ 0x20, ['pointer64', ['_KEVENT']]],
} ],
  '_RTL_HANDLE_TABLE_ENTRY' : [ 0x8, {
    'Flags' : [ 0x0, ['unsigned long']],
    'NextFree' : [ 0x0, ['pointer64', ['_RTL_HANDLE_TABLE_ENTRY']]],
} ],
  '__unnamed_237c' : [ 0x20, {
    'TestAllocation' : [ 0x0, ['_ARBITER_TEST_ALLOCATION_PARAMETERS']],
    'RetestAllocation' : [ 0x0, ['_ARBITER_RETEST_ALLOCATION_PARAMETERS']],
    'BootAllocation' : [ 0x0, ['_ARBITER_BOOT_ALLOCATION_PARAMETERS']],
    'QueryAllocatedResources' : [ 0x0, ['_ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS']],
    'QueryConflict' : [ 0x0, ['_ARBITER_QUERY_CONFLICT_PARAMETERS']],
    'QueryArbitrate' : [ 0x0, ['_ARBITER_QUERY_ARBITRATE_PARAMETERS']],
    'AddReserved' : [ 0x0, ['_ARBITER_ADD_RESERVED_PARAMETERS']],
} ],
  '_ARBITER_PARAMETERS' : [ 0x20, {
    'Parameters' : [ 0x0, ['__unnamed_237c']],
} ],
  '__unnamed_2380' : [ 0x8, {
    'idxRecord' : [ 0x0, ['unsigned long']],
    'cidContainer' : [ 0x4, ['unsigned long']],
} ],
  '_CLS_LSN' : [ 0x8, {
    'offset' : [ 0x0, ['__unnamed_2380']],
    'ullOffset' : [ 0x0, ['unsigned long long']],
} ],
  '_NT_TIB32' : [ 0x1c, {
    'ExceptionList' : [ 0x0, ['unsigned long']],
    'StackBase' : [ 0x4, ['unsigned long']],
    'StackLimit' : [ 0x8, ['unsigned long']],
    'SubSystemTib' : [ 0xc, ['unsigned long']],
    'FiberData' : [ 0x10, ['unsigned long']],
    'Version' : [ 0x10, ['unsigned long']],
    'ArbitraryUserPointer' : [ 0x14, ['unsigned long']],
    'Self' : [ 0x18, ['unsigned long']],
} ],
  'POWER_ACTION_POLICY' : [ 0xc, {
    'Action' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'PowerActionNone', 1: 'PowerActionReserved', 2: 'PowerActionSleep', 3: 'PowerActionHibernate', 4: 'PowerActionShutdown', 5: 'PowerActionShutdownReset', 6: 'PowerActionShutdownOff', 7: 'PowerActionWarmEject'})]],
    'Flags' : [ 0x4, ['unsigned long']],
    'EventCode' : [ 0x8, ['unsigned long']],
} ],
  'PO_MEMORY_IMAGE' : [ 0x128, {
    'Signature' : [ 0x0, ['unsigned long']],
    'ImageType' : [ 0x4, ['unsigned long']],
    'CheckSum' : [ 0x8, ['unsigned long']],
    'LengthSelf' : [ 0xc, ['unsigned long']],
    'PageSelf' : [ 0x10, ['unsigned long long']],
    'PageSize' : [ 0x18, ['unsigned long']],
    'SystemTime' : [ 0x20, ['_LARGE_INTEGER']],
    'InterruptTime' : [ 0x28, ['unsigned long long']],
    'FeatureFlags' : [ 0x30, ['unsigned long']],
    'HiberFlags' : [ 0x34, ['unsigned char']],
    'spare' : [ 0x35, ['array', 3, ['unsigned char']]],
    'NoHiberPtes' : [ 0x38, ['unsigned long']],
    'HiberVa' : [ 0x40, ['unsigned long long']],
    'HiberPte' : [ 0x48, ['_LARGE_INTEGER']],
    'NoFreePages' : [ 0x50, ['unsigned long']],
    'FreeMapCheck' : [ 0x54, ['unsigned long']],
    'WakeCheck' : [ 0x58, ['unsigned long']],
    'FirstTablePage' : [ 0x60, ['unsigned long long']],
    'PerfInfo' : [ 0x68, ['_PO_HIBER_PERF']],
    'FirmwareRuntimeInformationPages' : [ 0xc0, ['unsigned long']],
    'FirmwareRuntimeInformation' : [ 0xc8, ['array', 1, ['unsigned long long']]],
    'NoBootLoaderLogPages' : [ 0xd0, ['unsigned long']],
    'BootLoaderLogPages' : [ 0xd8, ['array', 8, ['unsigned long long']]],
    'NotUsed' : [ 0x118, ['unsigned long']],
    'ResumeContextCheck' : [ 0x11c, ['unsigned long']],
    'ResumeContextPages' : [ 0x120, ['unsigned long']],
} ],
  'EX_QUEUE_WORKER_INFO' : [ 0x4, {
    'QueueDisabled' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MakeThreadsAsNecessary' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'WaitMode' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'WorkerCount' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'QueueWorkerInfo' : [ 0x0, ['long']],
} ],
  'BATTERY_REPORTING_SCALE' : [ 0x8, {
    'Granularity' : [ 0x0, ['unsigned long']],
    'Capacity' : [ 0x4, ['unsigned long']],
} ],
  '_CURDIR' : [ 0x18, {
    'DosPath' : [ 0x0, ['_UNICODE_STRING']],
    'Handle' : [ 0x10, ['pointer64', ['void']]],
} ],
  '_PO_HIBER_PERF' : [ 0x58, {
    'IoTicks' : [ 0x0, ['unsigned long long']],
    'InitTicks' : [ 0x8, ['unsigned long long']],
    'CopyTicks' : [ 0x10, ['unsigned long long']],
    'ElapsedTicks' : [ 0x18, ['unsigned long long']],
    'CompressTicks' : [ 0x20, ['unsigned long long']],
    'ResumeAppTime' : [ 0x28, ['unsigned long long']],
    'HiberFileResumeTime' : [ 0x30, ['unsigned long long']],
    'BytesCopied' : [ 0x38, ['unsigned long long']],
    'PagesProcessed' : [ 0x40, ['unsigned long long']],
    'PagesWritten' : [ 0x48, ['unsigned long']],
    'DumpCount' : [ 0x4c, ['unsigned long']],
    'FileRuns' : [ 0x50, ['unsigned long']],
} ],
  '_DEVICE_FLAGS' : [ 0x4, {
    'Failed' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReadOnly' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Removable' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ConsoleIn' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ConsoleOut' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Input' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Output' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
} ],
  '_RTL_BALANCED_LINKS' : [ 0x20, {
    'Parent' : [ 0x0, ['pointer64', ['_RTL_BALANCED_LINKS']]],
    'LeftChild' : [ 0x8, ['pointer64', ['_RTL_BALANCED_LINKS']]],
    'RightChild' : [ 0x10, ['pointer64', ['_RTL_BALANCED_LINKS']]],
    'Balance' : [ 0x18, ['unsigned char']],
    'Reserved' : [ 0x19, ['array', 3, ['unsigned char']]],
} ],
  '_MMVIEW' : [ 0x30, {
    'Entry' : [ 0x0, ['unsigned long long']],
    'Writable' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'ControlArea' : [ 0x8, ['pointer64', ['_CONTROL_AREA']]],
    'ViewLinks' : [ 0x10, ['_LIST_ENTRY']],
    'SessionViewVa' : [ 0x20, ['pointer64', ['void']]],
    'SessionId' : [ 0x28, ['unsigned long']],
} ],
  '_MM_SESSION_SPACE_FLAGS' : [ 0x4, {
    'Initialized' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DeletePending' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'PoolInitialized' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DynamicVaInitialized' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'WsInitialized' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'PoolDestroyed' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ObjectInitialized' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Filler' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 32, native_type='unsigned long')]],
} ],
  '_HEADLESS_LOADER_BLOCK' : [ 0x40, {
    'UsedBiosSettings' : [ 0x0, ['unsigned char']],
    'DataBits' : [ 0x1, ['unsigned char']],
    'StopBits' : [ 0x2, ['unsigned char']],
    'Parity' : [ 0x3, ['unsigned char']],
    'BaudRate' : [ 0x4, ['unsigned long']],
    'PortNumber' : [ 0x8, ['unsigned long']],
    'PortAddress' : [ 0x10, ['pointer64', ['unsigned char']]],
    'PciDeviceId' : [ 0x18, ['unsigned short']],
    'PciVendorId' : [ 0x1a, ['unsigned short']],
    'PciBusNumber' : [ 0x1c, ['unsigned char']],
    'PciBusSegment' : [ 0x1e, ['unsigned short']],
    'PciSlotNumber' : [ 0x20, ['unsigned char']],
    'PciFunctionNumber' : [ 0x21, ['unsigned char']],
    'PciFlags' : [ 0x24, ['unsigned long']],
    'SystemGUID' : [ 0x28, ['_GUID']],
    'IsMMIODevice' : [ 0x38, ['unsigned char']],
    'TerminalType' : [ 0x39, ['unsigned char']],
} ],
  '__unnamed_23aa' : [ 0x8, {
    'Signature' : [ 0x0, ['unsigned long']],
    'CheckSum' : [ 0x4, ['unsigned long']],
} ],
  '__unnamed_23ac' : [ 0x10, {
    'DiskId' : [ 0x0, ['_GUID']],
} ],
  '__unnamed_23ae' : [ 0x10, {
    'Mbr' : [ 0x0, ['__unnamed_23aa']],
    'Gpt' : [ 0x0, ['__unnamed_23ac']],
} ],
  '_DUMP_INITIALIZATION_CONTEXT' : [ 0xa0, {
    'Length' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'MemoryBlock' : [ 0x8, ['pointer64', ['void']]],
    'CommonBuffer' : [ 0x10, ['array', 2, ['pointer64', ['void']]]],
    'PhysicalAddress' : [ 0x20, ['array', 2, ['_LARGE_INTEGER']]],
    'StallRoutine' : [ 0x30, ['pointer64', ['void']]],
    'OpenRoutine' : [ 0x38, ['pointer64', ['void']]],
    'WriteRoutine' : [ 0x40, ['pointer64', ['void']]],
    'FinishRoutine' : [ 0x48, ['pointer64', ['void']]],
    'AdapterObject' : [ 0x50, ['pointer64', ['_ADAPTER_OBJECT']]],
    'MappedRegisterBase' : [ 0x58, ['pointer64', ['void']]],
    'PortConfiguration' : [ 0x60, ['pointer64', ['void']]],
    'CrashDump' : [ 0x68, ['unsigned char']],
    'MaximumTransferSize' : [ 0x6c, ['unsigned long']],
    'CommonBufferSize' : [ 0x70, ['unsigned long']],
    'TargetAddress' : [ 0x78, ['pointer64', ['void']]],
    'WritePendingRoutine' : [ 0x80, ['pointer64', ['void']]],
    'PartitionStyle' : [ 0x88, ['unsigned long']],
    'DiskInfo' : [ 0x8c, ['__unnamed_23ae']],
} ],
  '_MI_SYSTEM_PTE_TYPE' : [ 0x48, {
    'Bitmap' : [ 0x0, ['_RTL_BITMAP']],
    'Flags' : [ 0x10, ['unsigned long']],
    'Hint' : [ 0x14, ['unsigned long']],
    'BasePte' : [ 0x18, ['pointer64', ['_MMPTE']]],
    'FailureCount' : [ 0x20, ['pointer64', ['unsigned long']]],
    'Vm' : [ 0x28, ['pointer64', ['_MMSUPPORT']]],
    'TotalSystemPtes' : [ 0x30, ['long']],
    'TotalFreeSystemPtes' : [ 0x34, ['long']],
    'CachedPteCount' : [ 0x38, ['long']],
    'PteFailures' : [ 0x3c, ['unsigned long']],
    'SpinLock' : [ 0x40, ['unsigned long long']],
    'GlobalMutex' : [ 0x40, ['pointer64', ['_KGUARDED_MUTEX']]],
} ],
  '_NETWORK_LOADER_BLOCK' : [ 0x20, {
    'DHCPServerACK' : [ 0x0, ['pointer64', ['unsigned char']]],
    'DHCPServerACKLength' : [ 0x8, ['unsigned long']],
    'BootServerReplyPacket' : [ 0x10, ['pointer64', ['unsigned char']]],
    'BootServerReplyPacketLength' : [ 0x18, ['unsigned long']],
} ],
  '_CM_KEY_SECURITY' : [ 0x28, {
    'Signature' : [ 0x0, ['unsigned short']],
    'Reserved' : [ 0x2, ['unsigned short']],
    'Flink' : [ 0x4, ['unsigned long']],
    'Blink' : [ 0x8, ['unsigned long']],
    'ReferenceCount' : [ 0xc, ['unsigned long']],
    'DescriptorLength' : [ 0x10, ['unsigned long']],
    'Descriptor' : [ 0x14, ['_SECURITY_DESCRIPTOR_RELATIVE']],
} ],
  '_PO_DEVICE_NOTIFY_ORDER' : [ 0x298, {
    'Locked' : [ 0x0, ['unsigned char']],
    'WarmEjectPdoPointer' : [ 0x8, ['pointer64', ['pointer64', ['_DEVICE_OBJECT']]]],
    'OrderLevel' : [ 0x10, ['array', 9, ['_PO_NOTIFY_ORDER_LEVEL']]],
} ],
  '_ARBITER_CONFLICT_INFO' : [ 0x18, {
    'OwningObject' : [ 0x0, ['pointer64', ['_DEVICE_OBJECT']]],
    'Start' : [ 0x8, ['unsigned long long']],
    'End' : [ 0x10, ['unsigned long long']],
} ],
  '_PO_NOTIFY_ORDER_LEVEL' : [ 0x48, {
    'DeviceCount' : [ 0x0, ['unsigned long']],
    'ActiveCount' : [ 0x4, ['unsigned long']],
    'WaitSleep' : [ 0x8, ['_LIST_ENTRY']],
    'ReadySleep' : [ 0x18, ['_LIST_ENTRY']],
    'ReadyS0' : [ 0x28, ['_LIST_ENTRY']],
    'WaitS0' : [ 0x38, ['_LIST_ENTRY']],
} ],
  '_THREAD_PERFORMANCE_DATA' : [ 0x1c0, {
    'Size' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned short']],
    'ProcessorNumber' : [ 0x4, ['_PROCESSOR_NUMBER']],
    'ContextSwitches' : [ 0x8, ['unsigned long']],
    'HwCountersCount' : [ 0xc, ['unsigned long']],
    'UpdateCount' : [ 0x10, ['unsigned long long']],
    'WaitReasonBitMap' : [ 0x18, ['unsigned long long']],
    'HardwareCounters' : [ 0x20, ['unsigned long long']],
    'CycleTime' : [ 0x28, ['_COUNTER_READING']],
    'HwCounters' : [ 0x40, ['array', 16, ['_COUNTER_READING']]],
} ],
  '_GDI_TEB_BATCH32' : [ 0x4e0, {
    'Offset' : [ 0x0, ['unsigned long']],
    'HDC' : [ 0x4, ['unsigned long']],
    'Buffer' : [ 0x8, ['array', 310, ['unsigned long']]],
} ],
  '_ETW_REPLY_QUEUE' : [ 0x48, {
    'Queue' : [ 0x0, ['_KQUEUE']],
    'EventsLost' : [ 0x40, ['long']],
} ],
  '_ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS' : [ 0x8, {
    'AllocatedResources' : [ 0x0, ['pointer64', ['pointer64', ['_CM_PARTIAL_RESOURCE_LIST']]]],
} ],
  '_RTL_ACTIVATION_CONTEXT_STACK_FRAME' : [ 0x18, {
    'Previous' : [ 0x0, ['pointer64', ['_RTL_ACTIVATION_CONTEXT_STACK_FRAME']]],
    'ActivationContext' : [ 0x8, ['pointer64', ['_ACTIVATION_CONTEXT']]],
    'Flags' : [ 0x10, ['unsigned long']],
} ],
  '_ARBITER_ORDERING' : [ 0x10, {
    'Start' : [ 0x0, ['unsigned long long']],
    'End' : [ 0x8, ['unsigned long long']],
} ],
  '_RTL_AVL_TABLE' : [ 0x68, {
    'BalancedRoot' : [ 0x0, ['_RTL_BALANCED_LINKS']],
    'OrderedPointer' : [ 0x20, ['pointer64', ['void']]],
    'WhichOrderedElement' : [ 0x28, ['unsigned long']],
    'NumberGenericTableElements' : [ 0x2c, ['unsigned long']],
    'DepthOfTree' : [ 0x30, ['unsigned long']],
    'RestartKey' : [ 0x38, ['pointer64', ['_RTL_BALANCED_LINKS']]],
    'DeleteCount' : [ 0x40, ['unsigned long']],
    'CompareRoutine' : [ 0x48, ['pointer64', ['void']]],
    'AllocateRoutine' : [ 0x50, ['pointer64', ['void']]],
    'FreeRoutine' : [ 0x58, ['pointer64', ['void']]],
    'TableContext' : [ 0x60, ['pointer64', ['void']]],
} ],
  '_KTRANSACTION_HISTORY' : [ 0x8, {
    'RecordType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {1: 'KTMOH_CommitTransaction_Result', 2: 'KTMOH_RollbackTransaction_Result'})]],
    'Payload' : [ 0x4, ['unsigned long']],
} ],
  'LIST_ENTRY64' : [ 0x10, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'Blink' : [ 0x8, ['unsigned long long']],
} ],
  'LIST_ENTRY32' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long']],
    'Blink' : [ 0x4, ['unsigned long']],
} ],
  '_KUSER_SHARED_DATA' : [ 0x5f0, {
    'TickCountLowDeprecated' : [ 0x0, ['unsigned long']],
    'TickCountMultiplier' : [ 0x4, ['unsigned long']],
    'InterruptTime' : [ 0x8, ['_KSYSTEM_TIME']],
    'SystemTime' : [ 0x14, ['_KSYSTEM_TIME']],
    'TimeZoneBias' : [ 0x20, ['_KSYSTEM_TIME']],
    'ImageNumberLow' : [ 0x2c, ['unsigned short']],
    'ImageNumberHigh' : [ 0x2e, ['unsigned short']],
    'NtSystemRoot' : [ 0x30, ['array', 260, ['wchar']]],
    'MaxStackTraceDepth' : [ 0x238, ['unsigned long']],
    'CryptoExponent' : [ 0x23c, ['unsigned long']],
    'TimeZoneId' : [ 0x240, ['unsigned long']],
    'LargePageMinimum' : [ 0x244, ['unsigned long']],
    'Reserved2' : [ 0x248, ['array', 7, ['unsigned long']]],
    'NtProductType' : [ 0x264, ['Enumeration', dict(target = 'long', choices = {1: 'NtProductWinNt', 2: 'NtProductLanManNt', 3: 'NtProductServer'})]],
    'ProductTypeIsValid' : [ 0x268, ['unsigned char']],
    'NtMajorVersion' : [ 0x26c, ['unsigned long']],
    'NtMinorVersion' : [ 0x270, ['unsigned long']],
    'ProcessorFeatures' : [ 0x274, ['array', 64, ['unsigned char']]],
    'Reserved1' : [ 0x2b4, ['unsigned long']],
    'Reserved3' : [ 0x2b8, ['unsigned long']],
    'TimeSlip' : [ 0x2bc, ['unsigned long']],
    'AlternativeArchitecture' : [ 0x2c0, ['Enumeration', dict(target = 'long', choices = {0: 'StandardDesign', 1: 'NEC98x86', 2: 'EndAlternatives'})]],
    'AltArchitecturePad' : [ 0x2c4, ['array', 1, ['unsigned long']]],
    'SystemExpirationDate' : [ 0x2c8, ['_LARGE_INTEGER']],
    'SuiteMask' : [ 0x2d0, ['unsigned long']],
    'KdDebuggerEnabled' : [ 0x2d4, ['unsigned char']],
    'NXSupportPolicy' : [ 0x2d5, ['unsigned char']],
    'ActiveConsoleId' : [ 0x2d8, ['unsigned long']],
    'DismountCount' : [ 0x2dc, ['unsigned long']],
    'ComPlusPackage' : [ 0x2e0, ['unsigned long']],
    'LastSystemRITEventTickCount' : [ 0x2e4, ['unsigned long']],
    'NumberOfPhysicalPages' : [ 0x2e8, ['unsigned long']],
    'SafeBootMode' : [ 0x2ec, ['unsigned char']],
    'TscQpcData' : [ 0x2ed, ['unsigned char']],
    'TscQpcEnabled' : [ 0x2ed, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'TscQpcSpareFlag' : [ 0x2ed, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'TscQpcShift' : [ 0x2ed, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'TscQpcPad' : [ 0x2ee, ['array', 2, ['unsigned char']]],
    'SharedDataFlags' : [ 0x2f0, ['unsigned long']],
    'DbgErrorPortPresent' : [ 0x2f0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DbgElevationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DbgVirtEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DbgInstallerDetectEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DbgSystemDllRelocated' : [ 0x2f0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DbgDynProcessorEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DbgSEHValidationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'SpareBits' : [ 0x2f0, ['BitField', dict(start_bit = 7, end_bit = 32, native_type='unsigned long')]],
    'DataFlagsPad' : [ 0x2f4, ['array', 1, ['unsigned long']]],
    'TestRetInstruction' : [ 0x2f8, ['unsigned long long']],
    'SystemCall' : [ 0x300, ['unsigned long']],
    'SystemCallReturn' : [ 0x304, ['unsigned long']],
    'SystemCallPad' : [ 0x308, ['array', 3, ['unsigned long long']]],
    'TickCount' : [ 0x320, ['_KSYSTEM_TIME']],
    'TickCountQuad' : [ 0x320, ['unsigned long long']],
    'ReservedTickCountOverlay' : [ 0x320, ['array', 3, ['unsigned long']]],
    'TickCountPad' : [ 0x32c, ['array', 1, ['unsigned long']]],
    'Cookie' : [ 0x330, ['unsigned long']],
    'CookiePad' : [ 0x334, ['array', 1, ['unsigned long']]],
    'ConsoleSessionForegroundProcessId' : [ 0x338, ['long long']],
    'Wow64SharedInformation' : [ 0x340, ['array', 16, ['unsigned long']]],
    'UserModeGlobalLogger' : [ 0x380, ['array', 16, ['unsigned short']]],
    'ImageFileExecutionOptions' : [ 0x3a0, ['unsigned long']],
    'LangGenerationCount' : [ 0x3a4, ['unsigned long']],
    'Reserved5' : [ 0x3a8, ['unsigned long long']],
    'InterruptTimeBias' : [ 0x3b0, ['unsigned long long']],
    'TscQpcBias' : [ 0x3b8, ['unsigned long long']],
    'ActiveProcessorCount' : [ 0x3c0, ['unsigned long']],
    'ActiveGroupCount' : [ 0x3c4, ['unsigned short']],
    'Reserved4' : [ 0x3c6, ['unsigned short']],
    'AitSamplingValue' : [ 0x3c8, ['unsigned long']],
    'AppCompatFlag' : [ 0x3cc, ['unsigned long']],
    'SystemDllNativeRelocation' : [ 0x3d0, ['unsigned long long']],
    'SystemDllWowRelocation' : [ 0x3d8, ['unsigned long']],
    'XStatePad' : [ 0x3dc, ['array', 1, ['unsigned long']]],
    'XState' : [ 0x3e0, ['_XSTATE_CONFIGURATION']],
} ],
  '__unnamed_1043' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
} ],
  '_ULARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
    'u' : [ 0x0, ['__unnamed_1043']],
    'QuadPart' : [ 0x0, ['unsigned long long']],
} ],
  '__unnamed_1047' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_LARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
    'u' : [ 0x0, ['__unnamed_1047']],
    'QuadPart' : [ 0x0, ['long long']],
} ],
  '__unnamed_105f' : [ 0x4, {
    'LongFunction' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Persistent' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Private' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_1061' : [ 0x4, {
    'Flags' : [ 0x0, ['unsigned long']],
    's' : [ 0x0, ['__unnamed_105f']],
} ],
  '_TP_CALLBACK_ENVIRON_V3' : [ 0x48, {
    'Version' : [ 0x0, ['unsigned long']],
    'Pool' : [ 0x8, ['pointer64', ['_TP_POOL']]],
    'CleanupGroup' : [ 0x10, ['pointer64', ['_TP_CLEANUP_GROUP']]],
    'CleanupGroupCancelCallback' : [ 0x18, ['pointer64', ['void']]],
    'RaceDll' : [ 0x20, ['pointer64', ['void']]],
    'ActivationContext' : [ 0x28, ['pointer64', ['_ACTIVATION_CONTEXT']]],
    'FinalizationCallback' : [ 0x30, ['pointer64', ['void']]],
    'u' : [ 0x38, ['__unnamed_1061']],
    'CallbackPriority' : [ 0x3c, ['Enumeration', dict(target = 'long', choices = {0: 'TP_CALLBACK_PRIORITY_HIGH', 1: 'TP_CALLBACK_PRIORITY_NORMAL', 2: 'TP_CALLBACK_PRIORITY_LOW', 3: 'TP_CALLBACK_PRIORITY_INVALID'})]],
    'Size' : [ 0x40, ['unsigned long']],
} ],
  '_TP_TASK' : [ 0x38, {
    'Callbacks' : [ 0x0, ['pointer64', ['_TP_TASK_CALLBACKS']]],
    'NumaNode' : [ 0x8, ['unsigned long']],
    'IdealProcessor' : [ 0xc, ['unsigned char']],
    'PostGuard' : [ 0x10, ['_TP_NBQ_GUARD']],
    'NBQNode' : [ 0x30, ['pointer64', ['void']]],
} ],
  '_TP_TASK_CALLBACKS' : [ 0x10, {
    'ExecuteCallback' : [ 0x0, ['pointer64', ['void']]],
    'Unposted' : [ 0x8, ['pointer64', ['void']]],
} ],
  '_TP_DIRECT' : [ 0x10, {
    'Callback' : [ 0x0, ['pointer64', ['void']]],
    'NumaNode' : [ 0x8, ['unsigned long']],
    'IdealProcessor' : [ 0xc, ['unsigned char']],
} ],
  '_TEB' : [ 0x1818, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'EnvironmentPointer' : [ 0x38, ['pointer64', ['void']]],
    'ClientId' : [ 0x40, ['_CLIENT_ID']],
    'ActiveRpcHandle' : [ 0x50, ['pointer64', ['void']]],
    'ThreadLocalStoragePointer' : [ 0x58, ['pointer64', ['void']]],
    'ProcessEnvironmentBlock' : [ 0x60, ['pointer64', ['_PEB']]],
    'LastErrorValue' : [ 0x68, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x6c, ['unsigned long']],
    'CsrClientThread' : [ 0x70, ['pointer64', ['void']]],
    'Win32ThreadInfo' : [ 0x78, ['pointer64', ['void']]],
    'User32Reserved' : [ 0x80, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xe8, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0x100, ['pointer64', ['void']]],
    'CurrentLocale' : [ 0x108, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0x10c, ['unsigned long']],
    'SystemReserved1' : [ 0x110, ['array', 54, ['pointer64', ['void']]]],
    'ExceptionCode' : [ 0x2c0, ['long']],
    'ActivationContextStackPointer' : [ 0x2c8, ['pointer64', ['_ACTIVATION_CONTEXT_STACK']]],
    'SpareBytes' : [ 0x2d0, ['array', 24, ['unsigned char']]],
    'TxFsContext' : [ 0x2e8, ['unsigned long']],
    'GdiTebBatch' : [ 0x2f0, ['_GDI_TEB_BATCH']],
    'RealClientId' : [ 0x7d8, ['_CLIENT_ID']],
    'GdiCachedProcessHandle' : [ 0x7e8, ['pointer64', ['void']]],
    'GdiClientPID' : [ 0x7f0, ['unsigned long']],
    'GdiClientTID' : [ 0x7f4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x7f8, ['pointer64', ['void']]],
    'Win32ClientInfo' : [ 0x800, ['array', 62, ['unsigned long long']]],
    'glDispatchTable' : [ 0x9f0, ['array', 233, ['pointer64', ['void']]]],
    'glReserved1' : [ 0x1138, ['array', 29, ['unsigned long long']]],
    'glReserved2' : [ 0x1220, ['pointer64', ['void']]],
    'glSectionInfo' : [ 0x1228, ['pointer64', ['void']]],
    'glSection' : [ 0x1230, ['pointer64', ['void']]],
    'glTable' : [ 0x1238, ['pointer64', ['void']]],
    'glCurrentRC' : [ 0x1240, ['pointer64', ['void']]],
    'glContext' : [ 0x1248, ['pointer64', ['void']]],
    'LastStatusValue' : [ 0x1250, ['unsigned long']],
    'StaticUnicodeString' : [ 0x1258, ['_UNICODE_STRING']],
    'StaticUnicodeBuffer' : [ 0x1268, ['array', 261, ['wchar']]],
    'DeallocationStack' : [ 0x1478, ['pointer64', ['void']]],
    'TlsSlots' : [ 0x1480, ['array', 64, ['pointer64', ['void']]]],
    'TlsLinks' : [ 0x1680, ['_LIST_ENTRY']],
    'Vdm' : [ 0x1690, ['pointer64', ['void']]],
    'ReservedForNtRpc' : [ 0x1698, ['pointer64', ['void']]],
    'DbgSsReserved' : [ 0x16a0, ['array', 2, ['pointer64', ['void']]]],
    'HardErrorMode' : [ 0x16b0, ['unsigned long']],
    'Instrumentation' : [ 0x16b8, ['array', 11, ['pointer64', ['void']]]],
    'ActivityId' : [ 0x1710, ['_GUID']],
    'SubProcessTag' : [ 0x1720, ['pointer64', ['void']]],
    'EtwLocalData' : [ 0x1728, ['pointer64', ['void']]],
    'EtwTraceData' : [ 0x1730, ['pointer64', ['void']]],
    'WinSockData' : [ 0x1738, ['pointer64', ['void']]],
    'GdiBatchCount' : [ 0x1740, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0x1744, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0x1744, ['unsigned long']],
    'ReservedPad0' : [ 0x1744, ['unsigned char']],
    'ReservedPad1' : [ 0x1745, ['unsigned char']],
    'ReservedPad2' : [ 0x1746, ['unsigned char']],
    'IdealProcessor' : [ 0x1747, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0x1748, ['unsigned long']],
    'ReservedForPerf' : [ 0x1750, ['pointer64', ['void']]],
    'ReservedForOle' : [ 0x1758, ['pointer64', ['void']]],
    'WaitingOnLoaderLock' : [ 0x1760, ['unsigned long']],
    'SavedPriorityState' : [ 0x1768, ['pointer64', ['void']]],
    'SoftPatchPtr1' : [ 0x1770, ['unsigned long long']],
    'ThreadPoolData' : [ 0x1778, ['pointer64', ['void']]],
    'TlsExpansionSlots' : [ 0x1780, ['pointer64', ['pointer64', ['void']]]],
    'DeallocationBStore' : [ 0x1788, ['pointer64', ['void']]],
    'BStoreLimit' : [ 0x1790, ['pointer64', ['void']]],
    'MuiGeneration' : [ 0x1798, ['unsigned long']],
    'IsImpersonating' : [ 0x179c, ['unsigned long']],
    'NlsCache' : [ 0x17a0, ['pointer64', ['void']]],
    'pShimData' : [ 0x17a8, ['pointer64', ['void']]],
    'HeapVirtualAffinity' : [ 0x17b0, ['unsigned long']],
    'CurrentTransactionHandle' : [ 0x17b8, ['pointer64', ['void']]],
    'ActiveFrame' : [ 0x17c0, ['pointer64', ['_TEB_ACTIVE_FRAME']]],
    'FlsData' : [ 0x17c8, ['pointer64', ['void']]],
    'PreferredLanguages' : [ 0x17d0, ['pointer64', ['void']]],
    'UserPrefLanguages' : [ 0x17d8, ['pointer64', ['void']]],
    'MergedPrefLanguages' : [ 0x17e0, ['pointer64', ['void']]],
    'MuiImpersonation' : [ 0x17e8, ['unsigned long']],
    'CrossTebFlags' : [ 0x17ec, ['unsigned short']],
    'SpareCrossTebBits' : [ 0x17ec, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0x17ee, ['unsigned short']],
    'SafeThunkCall' : [ 0x17ee, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0x17ee, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0x17ee, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0x17ee, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0x17ee, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0x17ee, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0x17ee, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0x17ee, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0x17ee, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0x17ee, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0x17ee, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0x17ee, ['BitField', dict(start_bit = 11, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0x17f0, ['pointer64', ['void']]],
    'TxnScopeExitCallback' : [ 0x17f8, ['pointer64', ['void']]],
    'TxnScopeContext' : [ 0x1800, ['pointer64', ['void']]],
    'LockCount' : [ 0x1808, ['unsigned long']],
    'SpareUlong0' : [ 0x180c, ['unsigned long']],
    'ResourceRetValue' : [ 0x1810, ['pointer64', ['void']]],
} ],
  '_LIST_ENTRY' : [ 0x10, {
    'Flink' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
    'Blink' : [ 0x8, ['pointer64', ['_LIST_ENTRY']]],
} ],
  '_SINGLE_LIST_ENTRY' : [ 0x8, {
    'Next' : [ 0x0, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_CONTEXT' : [ 0x18, {
    'ChainHead' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
    'PrevLinkage' : [ 0x8, ['pointer64', ['_LIST_ENTRY']]],
    'Signature' : [ 0x10, ['unsigned long long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_ENUMERATOR' : [ 0x28, {
    'HashEntry' : [ 0x0, ['_RTL_DYNAMIC_HASH_TABLE_ENTRY']],
    'ChainHead' : [ 0x18, ['pointer64', ['_LIST_ENTRY']]],
    'BucketIndex' : [ 0x20, ['unsigned long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE' : [ 0x28, {
    'Flags' : [ 0x0, ['unsigned long']],
    'Shift' : [ 0x4, ['unsigned long']],
    'TableSize' : [ 0x8, ['unsigned long']],
    'Pivot' : [ 0xc, ['unsigned long']],
    'DivisorMask' : [ 0x10, ['unsigned long']],
    'NumEntries' : [ 0x14, ['unsigned long']],
    'NonEmptyBuckets' : [ 0x18, ['unsigned long']],
    'NumEnumerators' : [ 0x1c, ['unsigned long']],
    'Directory' : [ 0x20, ['pointer64', ['void']]],
} ],
  '_UNICODE_STRING' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x8, ['pointer64', ['unsigned short']]],
} ],
  '_STRING' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x8, ['pointer64', ['unsigned char']]],
} ],
  '_RTL_BITMAP' : [ 0x10, {
    'SizeOfBitMap' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x8, ['pointer64', ['unsigned long']]],
} ],
  '_LUID' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_IMAGE_NT_HEADERS64' : [ 0x108, {
    'Signature' : [ 0x0, ['unsigned long']],
    'FileHeader' : [ 0x4, ['_IMAGE_FILE_HEADER']],
    'OptionalHeader' : [ 0x18, ['_IMAGE_OPTIONAL_HEADER64']],
} ],
  '_IMAGE_DOS_HEADER' : [ 0x40, {
    'e_magic' : [ 0x0, ['unsigned short']],
    'e_cblp' : [ 0x2, ['unsigned short']],
    'e_cp' : [ 0x4, ['unsigned short']],
    'e_crlc' : [ 0x6, ['unsigned short']],
    'e_cparhdr' : [ 0x8, ['unsigned short']],
    'e_minalloc' : [ 0xa, ['unsigned short']],
    'e_maxalloc' : [ 0xc, ['unsigned short']],
    'e_ss' : [ 0xe, ['unsigned short']],
    'e_sp' : [ 0x10, ['unsigned short']],
    'e_csum' : [ 0x12, ['unsigned short']],
    'e_ip' : [ 0x14, ['unsigned short']],
    'e_cs' : [ 0x16, ['unsigned short']],
    'e_lfarlc' : [ 0x18, ['unsigned short']],
    'e_ovno' : [ 0x1a, ['unsigned short']],
    'e_res' : [ 0x1c, ['array', 4, ['unsigned short']]],
    'e_oemid' : [ 0x24, ['unsigned short']],
    'e_oeminfo' : [ 0x26, ['unsigned short']],
    'e_res2' : [ 0x28, ['array', 10, ['unsigned short']]],
    'e_lfanew' : [ 0x3c, ['long']],
} ],
  '_KPCR' : [ 0x4e80, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'GdtBase' : [ 0x0, ['pointer64', ['_KGDTENTRY64']]],
    'TssBase' : [ 0x8, ['pointer64', ['_KTSS64']]],
    'UserRsp' : [ 0x10, ['unsigned long long']],
    'Self' : [ 0x18, ['pointer64', ['_KPCR']]],
    'CurrentPrcb' : [ 0x20, ['pointer64', ['_KPRCB']]],
    'LockArray' : [ 0x28, ['pointer64', ['_KSPIN_LOCK_QUEUE']]],
    'Used_Self' : [ 0x30, ['pointer64', ['void']]],
    'IdtBase' : [ 0x38, ['pointer64', ['_KIDTENTRY64']]],
    'Unused' : [ 0x40, ['array', 2, ['unsigned long long']]],
    'Irql' : [ 0x50, ['unsigned char']],
    'SecondLevelCacheAssociativity' : [ 0x51, ['unsigned char']],
    'ObsoleteNumber' : [ 0x52, ['unsigned char']],
    'Fill0' : [ 0x53, ['unsigned char']],
    'Unused0' : [ 0x54, ['array', 3, ['unsigned long']]],
    'MajorVersion' : [ 0x60, ['unsigned short']],
    'MinorVersion' : [ 0x62, ['unsigned short']],
    'StallScaleFactor' : [ 0x64, ['unsigned long']],
    'Unused1' : [ 0x68, ['array', 3, ['pointer64', ['void']]]],
    'KernelReserved' : [ 0x80, ['array', 15, ['unsigned long']]],
    'SecondLevelCacheSize' : [ 0xbc, ['unsigned long']],
    'HalReserved' : [ 0xc0, ['array', 16, ['unsigned long']]],
    'Unused2' : [ 0x100, ['unsigned long']],
    'KdVersionBlock' : [ 0x108, ['pointer64', ['void']]],
    'Unused3' : [ 0x110, ['pointer64', ['void']]],
    'PcrAlign1' : [ 0x118, ['array', 24, ['unsigned long']]],
    'Prcb' : [ 0x180, ['_KPRCB']],
} ],
  '_KPRCB' : [ 0x4d00, {
    'MxCsr' : [ 0x0, ['unsigned long']],
    'LegacyNumber' : [ 0x4, ['unsigned char']],
    'ReservedMustBeZero' : [ 0x5, ['unsigned char']],
    'InterruptRequest' : [ 0x6, ['unsigned char']],
    'IdleHalt' : [ 0x7, ['unsigned char']],
    'CurrentThread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
    'NextThread' : [ 0x10, ['pointer64', ['_KTHREAD']]],
    'IdleThread' : [ 0x18, ['pointer64', ['_KTHREAD']]],
    'NestingLevel' : [ 0x20, ['unsigned char']],
    'PrcbPad00' : [ 0x21, ['array', 3, ['unsigned char']]],
    'Number' : [ 0x24, ['unsigned long']],
    'RspBase' : [ 0x28, ['unsigned long long']],
    'PrcbLock' : [ 0x30, ['unsigned long long']],
    'PrcbPad01' : [ 0x38, ['unsigned long long']],
    'ProcessorState' : [ 0x40, ['_KPROCESSOR_STATE']],
    'CpuType' : [ 0x5f0, ['unsigned char']],
    'CpuID' : [ 0x5f1, ['unsigned char']],
    'CpuStep' : [ 0x5f2, ['unsigned short']],
    'CpuStepping' : [ 0x5f2, ['unsigned char']],
    'CpuModel' : [ 0x5f3, ['unsigned char']],
    'MHz' : [ 0x5f4, ['unsigned long']],
    'HalReserved' : [ 0x5f8, ['array', 8, ['unsigned long long']]],
    'MinorVersion' : [ 0x638, ['unsigned short']],
    'MajorVersion' : [ 0x63a, ['unsigned short']],
    'BuildType' : [ 0x63c, ['unsigned char']],
    'CpuVendor' : [ 0x63d, ['unsigned char']],
    'CoresPerPhysicalProcessor' : [ 0x63e, ['unsigned char']],
    'LogicalProcessorsPerCore' : [ 0x63f, ['unsigned char']],
    'ApicMask' : [ 0x640, ['unsigned long']],
    'CFlushSize' : [ 0x644, ['unsigned long']],
    'AcpiReserved' : [ 0x648, ['pointer64', ['void']]],
    'InitialApicId' : [ 0x650, ['unsigned long']],
    'Stride' : [ 0x654, ['unsigned long']],
    'Group' : [ 0x658, ['unsigned short']],
    'GroupSetMember' : [ 0x660, ['unsigned long long']],
    'GroupIndex' : [ 0x668, ['unsigned char']],
    'LockQueue' : [ 0x670, ['array', 17, ['_KSPIN_LOCK_QUEUE']]],
    'PPLookasideList' : [ 0x780, ['array', 16, ['_PP_LOOKASIDE_LIST']]],
    'PPNPagedLookasideList' : [ 0x880, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PPPagedLookasideList' : [ 0x1480, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PacketBarrier' : [ 0x2080, ['long']],
    'DeferredReadyListHead' : [ 0x2088, ['_SINGLE_LIST_ENTRY']],
    'MmPageFaultCount' : [ 0x2090, ['long']],
    'MmCopyOnWriteCount' : [ 0x2094, ['long']],
    'MmTransitionCount' : [ 0x2098, ['long']],
    'MmDemandZeroCount' : [ 0x209c, ['long']],
    'MmPageReadCount' : [ 0x20a0, ['long']],
    'MmPageReadIoCount' : [ 0x20a4, ['long']],
    'MmDirtyPagesWriteCount' : [ 0x20a8, ['long']],
    'MmDirtyWriteIoCount' : [ 0x20ac, ['long']],
    'MmMappedPagesWriteCount' : [ 0x20b0, ['long']],
    'MmMappedWriteIoCount' : [ 0x20b4, ['long']],
    'KeSystemCalls' : [ 0x20b8, ['unsigned long']],
    'KeContextSwitches' : [ 0x20bc, ['unsigned long']],
    'CcFastReadNoWait' : [ 0x20c0, ['unsigned long']],
    'CcFastReadWait' : [ 0x20c4, ['unsigned long']],
    'CcFastReadNotPossible' : [ 0x20c8, ['unsigned long']],
    'CcCopyReadNoWait' : [ 0x20cc, ['unsigned long']],
    'CcCopyReadWait' : [ 0x20d0, ['unsigned long']],
    'CcCopyReadNoWaitMiss' : [ 0x20d4, ['unsigned long']],
    'LookasideIrpFloat' : [ 0x20d8, ['long']],
    'IoReadOperationCount' : [ 0x20dc, ['long']],
    'IoWriteOperationCount' : [ 0x20e0, ['long']],
    'IoOtherOperationCount' : [ 0x20e4, ['long']],
    'IoReadTransferCount' : [ 0x20e8, ['_LARGE_INTEGER']],
    'IoWriteTransferCount' : [ 0x20f0, ['_LARGE_INTEGER']],
    'IoOtherTransferCount' : [ 0x20f8, ['_LARGE_INTEGER']],
    'TargetCount' : [ 0x2100, ['long']],
    'IpiFrozen' : [ 0x2104, ['unsigned long']],
    'DpcData' : [ 0x2180, ['array', 2, ['_KDPC_DATA']]],
    'DpcStack' : [ 0x21c0, ['pointer64', ['void']]],
    'MaximumDpcQueueDepth' : [ 0x21c8, ['long']],
    'DpcRequestRate' : [ 0x21cc, ['unsigned long']],
    'MinimumDpcRate' : [ 0x21d0, ['unsigned long']],
    'DpcLastCount' : [ 0x21d4, ['unsigned long']],
    'ThreadDpcEnable' : [ 0x21d8, ['unsigned char']],
    'QuantumEnd' : [ 0x21d9, ['unsigned char']],
    'DpcRoutineActive' : [ 0x21da, ['unsigned char']],
    'IdleSchedule' : [ 0x21db, ['unsigned char']],
    'DpcRequestSummary' : [ 0x21dc, ['long']],
    'DpcRequestSlot' : [ 0x21dc, ['array', 2, ['short']]],
    'NormalDpcState' : [ 0x21dc, ['short']],
    'DpcThreadActive' : [ 0x21de, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'ThreadDpcState' : [ 0x21de, ['short']],
    'TimerHand' : [ 0x21e0, ['unsigned long']],
    'MasterOffset' : [ 0x21e4, ['long']],
    'LastTick' : [ 0x21e8, ['unsigned long']],
    'UnusedPad' : [ 0x21ec, ['unsigned long']],
    'PrcbPad50' : [ 0x21f0, ['array', 2, ['unsigned long long']]],
    'TimerTable' : [ 0x2200, ['_KTIMER_TABLE']],
    'DpcGate' : [ 0x4400, ['_KGATE']],
    'PrcbPad52' : [ 0x4418, ['pointer64', ['void']]],
    'CallDpc' : [ 0x4420, ['_KDPC']],
    'ClockKeepAlive' : [ 0x4460, ['long']],
    'ClockCheckSlot' : [ 0x4464, ['unsigned char']],
    'ClockPollCycle' : [ 0x4465, ['unsigned char']],
    'NmiActive' : [ 0x4466, ['unsigned short']],
    'DpcWatchdogPeriod' : [ 0x4468, ['long']],
    'DpcWatchdogCount' : [ 0x446c, ['long']],
    'TickOffset' : [ 0x4470, ['unsigned long long']],
    'KeSpinLockOrdering' : [ 0x4478, ['long']],
    'PrcbPad70' : [ 0x447c, ['unsigned long']],
    'WaitListHead' : [ 0x4480, ['_LIST_ENTRY']],
    'WaitLock' : [ 0x4490, ['unsigned long long']],
    'ReadySummary' : [ 0x4498, ['unsigned long']],
    'QueueIndex' : [ 0x449c, ['unsigned long']],
    'TimerExpirationDpc' : [ 0x44a0, ['_KDPC']],
    'PrcbPad72' : [ 0x44e0, ['array', 4, ['unsigned long long']]],
    'DispatcherReadyListHead' : [ 0x4500, ['array', 32, ['_LIST_ENTRY']]],
    'InterruptCount' : [ 0x4700, ['unsigned long']],
    'KernelTime' : [ 0x4704, ['unsigned long']],
    'UserTime' : [ 0x4708, ['unsigned long']],
    'DpcTime' : [ 0x470c, ['unsigned long']],
    'InterruptTime' : [ 0x4710, ['unsigned long']],
    'AdjustDpcThreshold' : [ 0x4714, ['unsigned long']],
    'DebuggerSavedIRQL' : [ 0x4718, ['unsigned char']],
    'PrcbPad80' : [ 0x4719, ['array', 7, ['unsigned char']]],
    'DpcTimeCount' : [ 0x4720, ['unsigned long']],
    'DpcTimeLimit' : [ 0x4724, ['unsigned long']],
    'PeriodicCount' : [ 0x4728, ['unsigned long']],
    'PeriodicBias' : [ 0x472c, ['unsigned long']],
    'AvailableTime' : [ 0x4730, ['unsigned long']],
    'KeExceptionDispatchCount' : [ 0x4734, ['unsigned long']],
    'ParentNode' : [ 0x4738, ['pointer64', ['_KNODE']]],
    'StartCycles' : [ 0x4740, ['unsigned long long']],
    'PrcbPad82' : [ 0x4748, ['array', 3, ['unsigned long long']]],
    'MmSpinLockOrdering' : [ 0x4760, ['long']],
    'PageColor' : [ 0x4764, ['unsigned long']],
    'NodeColor' : [ 0x4768, ['unsigned long']],
    'NodeShiftedColor' : [ 0x476c, ['unsigned long']],
    'SecondaryColorMask' : [ 0x4770, ['unsigned long']],
    'PrcbPad83' : [ 0x4774, ['unsigned long']],
    'CycleTime' : [ 0x4778, ['unsigned long long']],
    'CcFastMdlReadNoWait' : [ 0x4780, ['unsigned long']],
    'CcFastMdlReadWait' : [ 0x4784, ['unsigned long']],
    'CcFastMdlReadNotPossible' : [ 0x4788, ['unsigned long']],
    'CcMapDataNoWait' : [ 0x478c, ['unsigned long']],
    'CcMapDataWait' : [ 0x4790, ['unsigned long']],
    'CcPinMappedDataCount' : [ 0x4794, ['unsigned long']],
    'CcPinReadNoWait' : [ 0x4798, ['unsigned long']],
    'CcPinReadWait' : [ 0x479c, ['unsigned long']],
    'CcMdlReadNoWait' : [ 0x47a0, ['unsigned long']],
    'CcMdlReadWait' : [ 0x47a4, ['unsigned long']],
    'CcLazyWriteHotSpots' : [ 0x47a8, ['unsigned long']],
    'CcLazyWriteIos' : [ 0x47ac, ['unsigned long']],
    'CcLazyWritePages' : [ 0x47b0, ['unsigned long']],
    'CcDataFlushes' : [ 0x47b4, ['unsigned long']],
    'CcDataPages' : [ 0x47b8, ['unsigned long']],
    'CcLostDelayedWrites' : [ 0x47bc, ['unsigned long']],
    'CcFastReadResourceMiss' : [ 0x47c0, ['unsigned long']],
    'CcCopyReadWaitMiss' : [ 0x47c4, ['unsigned long']],
    'CcFastMdlReadResourceMiss' : [ 0x47c8, ['unsigned long']],
    'CcMapDataNoWaitMiss' : [ 0x47cc, ['unsigned long']],
    'CcMapDataWaitMiss' : [ 0x47d0, ['unsigned long']],
    'CcPinReadNoWaitMiss' : [ 0x47d4, ['unsigned long']],
    'CcPinReadWaitMiss' : [ 0x47d8, ['unsigned long']],
    'CcMdlReadNoWaitMiss' : [ 0x47dc, ['unsigned long']],
    'CcMdlReadWaitMiss' : [ 0x47e0, ['unsigned long']],
    'CcReadAheadIos' : [ 0x47e4, ['unsigned long']],
    'MmCacheTransitionCount' : [ 0x47e8, ['long']],
    'MmCacheReadCount' : [ 0x47ec, ['long']],
    'MmCacheIoCount' : [ 0x47f0, ['long']],
    'PrcbPad91' : [ 0x47f4, ['array', 1, ['unsigned long']]],
    'RuntimeAccumulation' : [ 0x47f8, ['unsigned long long']],
    'PowerState' : [ 0x4800, ['_PROCESSOR_POWER_STATE']],
    'PrcbPad92' : [ 0x4900, ['array', 16, ['unsigned char']]],
    'KeAlignmentFixupCount' : [ 0x4910, ['unsigned long']],
    'DpcWatchdogDpc' : [ 0x4918, ['_KDPC']],
    'DpcWatchdogTimer' : [ 0x4958, ['_KTIMER']],
    'Cache' : [ 0x4998, ['array', 5, ['_CACHE_DESCRIPTOR']]],
    'CacheCount' : [ 0x49d4, ['unsigned long']],
    'CachedCommit' : [ 0x49d8, ['unsigned long']],
    'CachedResidentAvailable' : [ 0x49dc, ['unsigned long']],
    'HyperPte' : [ 0x49e0, ['pointer64', ['void']]],
    'WheaInfo' : [ 0x49e8, ['pointer64', ['void']]],
    'EtwSupport' : [ 0x49f0, ['pointer64', ['void']]],
    'InterruptObjectPool' : [ 0x4a00, ['_SLIST_HEADER']],
    'HypercallPageList' : [ 0x4a10, ['_SLIST_HEADER']],
    'HypercallPageVirtual' : [ 0x4a20, ['pointer64', ['void']]],
    'VirtualApicAssist' : [ 0x4a28, ['pointer64', ['void']]],
    'StatisticsPage' : [ 0x4a30, ['pointer64', ['unsigned long long']]],
    'RateControl' : [ 0x4a38, ['pointer64', ['void']]],
    'CacheProcessorMask' : [ 0x4a40, ['array', 5, ['unsigned long long']]],
    'PackageProcessorSet' : [ 0x4a68, ['_KAFFINITY_EX']],
    'CoreProcessorSet' : [ 0x4a90, ['unsigned long long']],
    'PebsIndexAddress' : [ 0x4a98, ['pointer64', ['void']]],
    'PrcbPad93' : [ 0x4aa0, ['array', 12, ['unsigned long long']]],
    'SpinLockAcquireCount' : [ 0x4b00, ['unsigned long']],
    'SpinLockContentionCount' : [ 0x4b04, ['unsigned long']],
    'SpinLockSpinCount' : [ 0x4b08, ['unsigned long']],
    'IpiSendRequestBroadcastCount' : [ 0x4b0c, ['unsigned long']],
    'IpiSendRequestRoutineCount' : [ 0x4b10, ['unsigned long']],
    'IpiSendSoftwareInterruptCount' : [ 0x4b14, ['unsigned long']],
    'ExInitializeResourceCount' : [ 0x4b18, ['unsigned long']],
    'ExReInitializeResourceCount' : [ 0x4b1c, ['unsigned long']],
    'ExDeleteResourceCount' : [ 0x4b20, ['unsigned long']],
    'ExecutiveResourceAcquiresCount' : [ 0x4b24, ['unsigned long']],
    'ExecutiveResourceContentionsCount' : [ 0x4b28, ['unsigned long']],
    'ExecutiveResourceReleaseExclusiveCount' : [ 0x4b2c, ['unsigned long']],
    'ExecutiveResourceReleaseSharedCount' : [ 0x4b30, ['unsigned long']],
    'ExecutiveResourceConvertsCount' : [ 0x4b34, ['unsigned long']],
    'ExAcqResExclusiveAttempts' : [ 0x4b38, ['unsigned long']],
    'ExAcqResExclusiveAcquiresExclusive' : [ 0x4b3c, ['unsigned long']],
    'ExAcqResExclusiveAcquiresExclusiveRecursive' : [ 0x4b40, ['unsigned long']],
    'ExAcqResExclusiveWaits' : [ 0x4b44, ['unsigned long']],
    'ExAcqResExclusiveNotAcquires' : [ 0x4b48, ['unsigned long']],
    'ExAcqResSharedAttempts' : [ 0x4b4c, ['unsigned long']],
    'ExAcqResSharedAcquiresExclusive' : [ 0x4b50, ['unsigned long']],
    'ExAcqResSharedAcquiresShared' : [ 0x4b54, ['unsigned long']],
    'ExAcqResSharedAcquiresSharedRecursive' : [ 0x4b58, ['unsigned long']],
    'ExAcqResSharedWaits' : [ 0x4b5c, ['unsigned long']],
    'ExAcqResSharedNotAcquires' : [ 0x4b60, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAttempts' : [ 0x4b64, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresExclusive' : [ 0x4b68, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresShared' : [ 0x4b6c, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresSharedRecursive' : [ 0x4b70, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveWaits' : [ 0x4b74, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveNotAcquires' : [ 0x4b78, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAttempts' : [ 0x4b7c, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresExclusive' : [ 0x4b80, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresShared' : [ 0x4b84, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresSharedRecursive' : [ 0x4b88, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveWaits' : [ 0x4b8c, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveNotAcquires' : [ 0x4b90, ['unsigned long']],
    'ExSetResOwnerPointerExclusive' : [ 0x4b94, ['unsigned long']],
    'ExSetResOwnerPointerSharedNew' : [ 0x4b98, ['unsigned long']],
    'ExSetResOwnerPointerSharedOld' : [ 0x4b9c, ['unsigned long']],
    'ExTryToAcqExclusiveAttempts' : [ 0x4ba0, ['unsigned long']],
    'ExTryToAcqExclusiveAcquires' : [ 0x4ba4, ['unsigned long']],
    'ExBoostExclusiveOwner' : [ 0x4ba8, ['unsigned long']],
    'ExBoostSharedOwners' : [ 0x4bac, ['unsigned long']],
    'ExEtwSynchTrackingNotificationsCount' : [ 0x4bb0, ['unsigned long']],
    'ExEtwSynchTrackingNotificationsAccountedCount' : [ 0x4bb4, ['unsigned long']],
    'VendorString' : [ 0x4bb8, ['array', 13, ['unsigned char']]],
    'PrcbPad10' : [ 0x4bc5, ['array', 3, ['unsigned char']]],
    'FeatureBits' : [ 0x4bc8, ['unsigned long']],
    'UpdateSignature' : [ 0x4bd0, ['_LARGE_INTEGER']],
    'Context' : [ 0x4bd8, ['pointer64', ['_CONTEXT']]],
    'ContextFlags' : [ 0x4be0, ['unsigned long']],
    'ExtendedState' : [ 0x4be8, ['pointer64', ['_XSAVE_AREA']]],
    'Mailbox' : [ 0x4c00, ['pointer64', ['_REQUEST_MAILBOX']]],
    'RequestMailbox' : [ 0x4c80, ['array', 1, ['_REQUEST_MAILBOX']]],
} ],
  '_SINGLE_LIST_ENTRY32' : [ 0x4, {
    'Next' : [ 0x0, ['unsigned long']],
} ],
  '_KTHREAD' : [ 0x360, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'CycleTime' : [ 0x18, ['unsigned long long']],
    'QuantumTarget' : [ 0x20, ['unsigned long long']],
    'InitialStack' : [ 0x28, ['pointer64', ['void']]],
    'StackLimit' : [ 0x30, ['pointer64', ['void']]],
    'KernelStack' : [ 0x38, ['pointer64', ['void']]],
    'ThreadLock' : [ 0x40, ['unsigned long long']],
    'WaitRegister' : [ 0x48, ['_KWAIT_STATUS_REGISTER']],
    'Running' : [ 0x49, ['unsigned char']],
    'Alerted' : [ 0x4a, ['array', 2, ['unsigned char']]],
    'KernelStackResident' : [ 0x4c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReadyTransition' : [ 0x4c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessReadyQueue' : [ 0x4c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'WaitNext' : [ 0x4c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'SystemAffinityActive' : [ 0x4c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Alertable' : [ 0x4c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'GdiFlushActive' : [ 0x4c, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'UserStackWalkActive' : [ 0x4c, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ApcInterruptRequest' : [ 0x4c, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'ForceDeferSchedule' : [ 0x4c, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'QuantumEndMigrate' : [ 0x4c, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'UmsDirectedSwitchEnable' : [ 0x4c, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'TimerActive' : [ 0x4c, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'SystemThread' : [ 0x4c, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'Reserved' : [ 0x4c, ['BitField', dict(start_bit = 14, end_bit = 32, native_type='unsigned long')]],
    'MiscFlags' : [ 0x4c, ['long']],
    'ApcState' : [ 0x50, ['_KAPC_STATE']],
    'ApcStateFill' : [ 0x50, ['array', 43, ['unsigned char']]],
    'Priority' : [ 0x7b, ['unsigned char']],
    'NextProcessor' : [ 0x7c, ['unsigned long']],
    'DeferredProcessor' : [ 0x80, ['unsigned long']],
    'ApcQueueLock' : [ 0x88, ['unsigned long long']],
    'WaitStatus' : [ 0x90, ['long long']],
    'WaitBlockList' : [ 0x98, ['pointer64', ['_KWAIT_BLOCK']]],
    'WaitListEntry' : [ 0xa0, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0xa0, ['_SINGLE_LIST_ENTRY']],
    'Queue' : [ 0xb0, ['pointer64', ['_KQUEUE']]],
    'Teb' : [ 0xb8, ['pointer64', ['void']]],
    'Timer' : [ 0xc0, ['_KTIMER']],
    'AutoAlignment' : [ 0x100, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DisableBoost' : [ 0x100, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'EtwStackTraceApc1Inserted' : [ 0x100, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'EtwStackTraceApc2Inserted' : [ 0x100, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'CalloutActive' : [ 0x100, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'ApcQueueable' : [ 0x100, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'EnableStackSwap' : [ 0x100, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'GuiThread' : [ 0x100, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'UmsPerformingSyscall' : [ 0x100, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'VdmSafe' : [ 0x100, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'UmsDispatched' : [ 0x100, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ReservedFlags' : [ 0x100, ['BitField', dict(start_bit = 11, end_bit = 32, native_type='unsigned long')]],
    'ThreadFlags' : [ 0x100, ['long']],
    'Spare0' : [ 0x104, ['unsigned long']],
    'WaitBlock' : [ 0x108, ['array', 4, ['_KWAIT_BLOCK']]],
    'WaitBlockFill4' : [ 0x108, ['array', 44, ['unsigned char']]],
    'ContextSwitches' : [ 0x134, ['unsigned long']],
    'WaitBlockFill5' : [ 0x108, ['array', 92, ['unsigned char']]],
    'State' : [ 0x164, ['unsigned char']],
    'NpxState' : [ 0x165, ['unsigned char']],
    'WaitIrql' : [ 0x166, ['unsigned char']],
    'WaitMode' : [ 0x167, ['unsigned char']],
    'WaitBlockFill6' : [ 0x108, ['array', 140, ['unsigned char']]],
    'WaitTime' : [ 0x194, ['unsigned long']],
    'WaitBlockFill7' : [ 0x108, ['array', 168, ['unsigned char']]],
    'TebMappedLowVa' : [ 0x1b0, ['pointer64', ['void']]],
    'Ucb' : [ 0x1b8, ['pointer64', ['_UMS_CONTROL_BLOCK']]],
    'WaitBlockFill8' : [ 0x108, ['array', 188, ['unsigned char']]],
    'KernelApcDisable' : [ 0x1c4, ['short']],
    'SpecialApcDisable' : [ 0x1c6, ['short']],
    'CombinedApcDisable' : [ 0x1c4, ['unsigned long']],
    'QueueListEntry' : [ 0x1c8, ['_LIST_ENTRY']],
    'TrapFrame' : [ 0x1d8, ['pointer64', ['_KTRAP_FRAME']]],
    'FirstArgument' : [ 0x1e0, ['pointer64', ['void']]],
    'CallbackStack' : [ 0x1e8, ['pointer64', ['void']]],
    'CallbackDepth' : [ 0x1e8, ['unsigned long long']],
    'ApcStateIndex' : [ 0x1f0, ['unsigned char']],
    'BasePriority' : [ 0x1f1, ['unsigned char']],
    'PriorityDecrement' : [ 0x1f2, ['unsigned char']],
    'ForegroundBoost' : [ 0x1f2, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'UnusualBoost' : [ 0x1f2, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Preempted' : [ 0x1f3, ['unsigned char']],
    'AdjustReason' : [ 0x1f4, ['unsigned char']],
    'AdjustIncrement' : [ 0x1f5, ['unsigned char']],
    'PreviousMode' : [ 0x1f6, ['unsigned char']],
    'Saturation' : [ 0x1f7, ['unsigned char']],
    'SystemCallNumber' : [ 0x1f8, ['unsigned long']],
    'FreezeCount' : [ 0x1fc, ['unsigned long']],
    'UserAffinity' : [ 0x200, ['_GROUP_AFFINITY']],
    'Process' : [ 0x210, ['pointer64', ['_KPROCESS']]],
    'Affinity' : [ 0x218, ['_GROUP_AFFINITY']],
    'IdealProcessor' : [ 0x228, ['unsigned long']],
    'UserIdealProcessor' : [ 0x22c, ['unsigned long']],
    'ApcStatePointer' : [ 0x230, ['array', 2, ['pointer64', ['_KAPC_STATE']]]],
    'SavedApcState' : [ 0x240, ['_KAPC_STATE']],
    'SavedApcStateFill' : [ 0x240, ['array', 43, ['unsigned char']]],
    'WaitReason' : [ 0x26b, ['unsigned char']],
    'SuspendCount' : [ 0x26c, ['unsigned char']],
    'Spare1' : [ 0x26d, ['unsigned char']],
    'CodePatchInProgress' : [ 0x26e, ['unsigned char']],
    'Win32Thread' : [ 0x270, ['pointer64', ['void']]],
    'StackBase' : [ 0x278, ['pointer64', ['void']]],
    'SuspendApc' : [ 0x280, ['_KAPC']],
    'SuspendApcFill0' : [ 0x280, ['array', 1, ['unsigned char']]],
    'ResourceIndex' : [ 0x281, ['unsigned char']],
    'SuspendApcFill1' : [ 0x280, ['array', 3, ['unsigned char']]],
    'QuantumReset' : [ 0x283, ['unsigned char']],
    'SuspendApcFill2' : [ 0x280, ['array', 4, ['unsigned char']]],
    'KernelTime' : [ 0x284, ['unsigned long']],
    'SuspendApcFill3' : [ 0x280, ['array', 64, ['unsigned char']]],
    'WaitPrcb' : [ 0x2c0, ['pointer64', ['_KPRCB']]],
    'SuspendApcFill4' : [ 0x280, ['array', 72, ['unsigned char']]],
    'LegoData' : [ 0x2c8, ['pointer64', ['void']]],
    'SuspendApcFill5' : [ 0x280, ['array', 83, ['unsigned char']]],
    'LargeStack' : [ 0x2d3, ['unsigned char']],
    'UserTime' : [ 0x2d4, ['unsigned long']],
    'SuspendSemaphore' : [ 0x2d8, ['_KSEMAPHORE']],
    'SuspendSemaphorefill' : [ 0x2d8, ['array', 28, ['unsigned char']]],
    'SListFaultCount' : [ 0x2f4, ['unsigned long']],
    'ThreadListEntry' : [ 0x2f8, ['_LIST_ENTRY']],
    'MutantListHead' : [ 0x308, ['_LIST_ENTRY']],
    'SListFaultAddress' : [ 0x318, ['pointer64', ['void']]],
    'ReadOperationCount' : [ 0x320, ['long long']],
    'WriteOperationCount' : [ 0x328, ['long long']],
    'OtherOperationCount' : [ 0x330, ['long long']],
    'ReadTransferCount' : [ 0x338, ['long long']],
    'WriteTransferCount' : [ 0x340, ['long long']],
    'OtherTransferCount' : [ 0x348, ['long long']],
    'ThreadCounters' : [ 0x350, ['pointer64', ['_KTHREAD_COUNTERS']]],
    'XStateSave' : [ 0x358, ['pointer64', ['_XSTATE_SAVE']]],
} ],
  '_KSTACK_AREA' : [ 0x250, {
    'StackControl' : [ 0x0, ['_KERNEL_STACK_CONTROL']],
    'NpxFrame' : [ 0x50, ['_XSAVE_FORMAT']],
} ],
  '_KERNEL_STACK_CONTROL' : [ 0x50, {
    'Current' : [ 0x0, ['_KERNEL_STACK_SEGMENT']],
    'Previous' : [ 0x28, ['_KERNEL_STACK_SEGMENT']],
} ],
  '_UMS_CONTROL_BLOCK' : [ 0x98, {
    'UmsContext' : [ 0x0, ['pointer64', ['_RTL_UMS_CONTEXT']]],
    'CompletionListEntry' : [ 0x8, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
    'CompletionListEvent' : [ 0x10, ['pointer64', ['_KEVENT']]],
    'ServiceSequenceNumber' : [ 0x18, ['unsigned long']],
    'UmsQueue' : [ 0x20, ['_KQUEUE']],
    'QueueEntry' : [ 0x60, ['_LIST_ENTRY']],
    'YieldingUmsContext' : [ 0x70, ['pointer64', ['_RTL_UMS_CONTEXT']]],
    'YieldingParam' : [ 0x78, ['pointer64', ['void']]],
    'UmsTeb' : [ 0x80, ['pointer64', ['void']]],
    'PrimaryFlags' : [ 0x88, ['unsigned long']],
    'UmsContextHeaderReady' : [ 0x88, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'UmsAssociatedQueue' : [ 0x20, ['pointer64', ['_KQUEUE']]],
    'UmsQueueListEntry' : [ 0x28, ['pointer64', ['_LIST_ENTRY']]],
    'UmsContextHeader' : [ 0x30, ['pointer64', ['_KUMS_CONTEXT_HEADER']]],
    'UmsWaitGate' : [ 0x38, ['_KGATE']],
    'StagingArea' : [ 0x50, ['pointer64', ['void']]],
    'Flags' : [ 0x58, ['long']],
    'UmsForceQueueTermination' : [ 0x58, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'UmsAssociatedQueueUsed' : [ 0x58, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'UmsThreadParked' : [ 0x58, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'UmsPrimaryDeliveredContext' : [ 0x58, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'UmsPerformingSingleStep' : [ 0x58, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'TebSelector' : [ 0x90, ['unsigned short']],
} ],
  '_KSPIN_LOCK_QUEUE' : [ 0x10, {
    'Next' : [ 0x0, ['pointer64', ['_KSPIN_LOCK_QUEUE']]],
    'Lock' : [ 0x8, ['pointer64', ['unsigned long long']]],
} ],
  '_FAST_MUTEX' : [ 0x38, {
    'Count' : [ 0x0, ['long']],
    'Owner' : [ 0x8, ['pointer64', ['_KTHREAD']]],
    'Contention' : [ 0x10, ['unsigned long']],
    'Event' : [ 0x18, ['_KEVENT']],
    'OldIrql' : [ 0x30, ['unsigned long']],
} ],
  '_KEVENT' : [ 0x18, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
} ],
  '__unnamed_11cd' : [ 0x10, {
    'Depth' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'Sequence' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 25, native_type='unsigned long long')]],
    'NextEntry' : [ 0x0, ['BitField', dict(start_bit = 25, end_bit = 64, native_type='unsigned long long')]],
    'HeaderType' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Init' : [ 0x8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Reserved' : [ 0x8, ['BitField', dict(start_bit = 2, end_bit = 61, native_type='unsigned long long')]],
    'Region' : [ 0x8, ['BitField', dict(start_bit = 61, end_bit = 64, native_type='unsigned long long')]],
} ],
  '__unnamed_11d2' : [ 0x10, {
    'Depth' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'Sequence' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 64, native_type='unsigned long long')]],
    'HeaderType' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Init' : [ 0x8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Reserved' : [ 0x8, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned long long')]],
    'NextEntry' : [ 0x8, ['BitField', dict(start_bit = 4, end_bit = 64, native_type='unsigned long long')]],
} ],
  '__unnamed_11d5' : [ 0x10, {
    'Depth' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'Sequence' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 64, native_type='unsigned long long')]],
    'HeaderType' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Reserved' : [ 0x8, ['BitField', dict(start_bit = 1, end_bit = 4, native_type='unsigned long long')]],
    'NextEntry' : [ 0x8, ['BitField', dict(start_bit = 4, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_SLIST_HEADER' : [ 0x10, {
    'Alignment' : [ 0x0, ['unsigned long long']],
    'Region' : [ 0x8, ['unsigned long long']],
    'Header8' : [ 0x0, ['__unnamed_11cd']],
    'Header16' : [ 0x0, ['__unnamed_11d2']],
    'HeaderX64' : [ 0x0, ['__unnamed_11d5']],
} ],
  '_LOOKASIDE_LIST_EX' : [ 0x60, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE_POOL']],
} ],
  '_SLIST_ENTRY' : [ 0x10, {
    'Next' : [ 0x0, ['pointer64', ['_SLIST_ENTRY']]],
} ],
  '_NPAGED_LOOKASIDE_LIST' : [ 0x80, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
} ],
  '_PAGED_LOOKASIDE_LIST' : [ 0x80, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
} ],
  '_QUAD' : [ 0x8, {
    'UseThisFieldToCopy' : [ 0x0, ['long long']],
    'DoNotUseThisField' : [ 0x0, ['double']],
} ],
  '_IO_STATUS_BLOCK' : [ 0x10, {
    'Status' : [ 0x0, ['long']],
    'Pointer' : [ 0x0, ['pointer64', ['void']]],
    'Information' : [ 0x8, ['unsigned long long']],
} ],
  '_IO_STATUS_BLOCK32' : [ 0x8, {
    'Status' : [ 0x0, ['long']],
    'Information' : [ 0x4, ['unsigned long']],
} ],
  '_EX_PUSH_LOCK' : [ 0x8, {
    'Locked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Waiting' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Waking' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'MultipleShared' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'Shared' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 64, native_type='unsigned long long')]],
    'Value' : [ 0x0, ['unsigned long long']],
    'Ptr' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_PROCESSOR_NUMBER' : [ 0x4, {
    'Group' : [ 0x0, ['unsigned short']],
    'Number' : [ 0x2, ['unsigned char']],
    'Reserved' : [ 0x3, ['unsigned char']],
} ],
  '_EX_PUSH_LOCK_CACHE_AWARE' : [ 0x100, {
    'Locks' : [ 0x0, ['array', 32, ['pointer64', ['_EX_PUSH_LOCK']]]],
} ],
  '_PP_LOOKASIDE_LIST' : [ 0x10, {
    'P' : [ 0x0, ['pointer64', ['_GENERAL_LOOKASIDE']]],
    'L' : [ 0x8, ['pointer64', ['_GENERAL_LOOKASIDE']]],
} ],
  '_GENERAL_LOOKASIDE' : [ 0x80, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'SingleListHead' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x10, ['unsigned short']],
    'MaximumDepth' : [ 0x12, ['unsigned short']],
    'TotalAllocates' : [ 0x14, ['unsigned long']],
    'AllocateMisses' : [ 0x18, ['unsigned long']],
    'AllocateHits' : [ 0x18, ['unsigned long']],
    'TotalFrees' : [ 0x1c, ['unsigned long']],
    'FreeMisses' : [ 0x20, ['unsigned long']],
    'FreeHits' : [ 0x20, ['unsigned long']],
    'Type' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: 'NonPagedPool', 1: 'PagedPool', 2: 'NonPagedPoolMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolCacheAlignedMustS', 7: 'MaxPoolType', 34: 'NonPagedPoolMustSucceedSession', 35: 'DontUseThisTypeSession', 32: 'NonPagedPoolSession', 36: 'NonPagedPoolCacheAlignedSession', 33: 'PagedPoolSession', 38: 'NonPagedPoolCacheAlignedMustSSession', 37: 'PagedPoolCacheAlignedSession'})]],
    'Tag' : [ 0x28, ['unsigned long']],
    'Size' : [ 0x2c, ['unsigned long']],
    'AllocateEx' : [ 0x30, ['pointer64', ['void']]],
    'Allocate' : [ 0x30, ['pointer64', ['void']]],
    'FreeEx' : [ 0x38, ['pointer64', ['void']]],
    'Free' : [ 0x38, ['pointer64', ['void']]],
    'ListEntry' : [ 0x40, ['_LIST_ENTRY']],
    'LastTotalAllocates' : [ 0x50, ['unsigned long']],
    'LastAllocateMisses' : [ 0x54, ['unsigned long']],
    'LastAllocateHits' : [ 0x54, ['unsigned long']],
    'Future' : [ 0x58, ['array', 2, ['unsigned long']]],
} ],
  '_EX_FAST_REF' : [ 0x8, {
    'Object' : [ 0x0, ['pointer64', ['void']]],
    'RefCnt' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long long')]],
    'Value' : [ 0x0, ['unsigned long long']],
} ],
  '_EX_PUSH_LOCK_WAIT_BLOCK' : [ 0x40, {
    'WakeEvent' : [ 0x0, ['_KEVENT']],
    'Next' : [ 0x18, ['pointer64', ['_EX_PUSH_LOCK_WAIT_BLOCK']]],
    'Last' : [ 0x20, ['pointer64', ['_EX_PUSH_LOCK_WAIT_BLOCK']]],
    'Previous' : [ 0x28, ['pointer64', ['_EX_PUSH_LOCK_WAIT_BLOCK']]],
    'ShareCount' : [ 0x30, ['long']],
    'Flags' : [ 0x34, ['long']],
} ],
  '_ETHREAD' : [ 0x498, {
    'Tcb' : [ 0x0, ['_KTHREAD']],
    'CreateTime' : [ 0x360, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0x368, ['_LARGE_INTEGER']],
    'KeyedWaitChain' : [ 0x368, ['_LIST_ENTRY']],
    'ExitStatus' : [ 0x378, ['long']],
    'PostBlockList' : [ 0x380, ['_LIST_ENTRY']],
    'ForwardLinkShadow' : [ 0x380, ['pointer64', ['void']]],
    'StartAddress' : [ 0x388, ['pointer64', ['void']]],
    'TerminationPort' : [ 0x390, ['pointer64', ['_TERMINATION_PORT']]],
    'ReaperLink' : [ 0x390, ['pointer64', ['_ETHREAD']]],
    'KeyedWaitValue' : [ 0x390, ['pointer64', ['void']]],
    'ActiveTimerListLock' : [ 0x398, ['unsigned long long']],
    'ActiveTimerListHead' : [ 0x3a0, ['_LIST_ENTRY']],
    'Cid' : [ 0x3b0, ['_CLIENT_ID']],
    'KeyedWaitSemaphore' : [ 0x3c0, ['_KSEMAPHORE']],
    'AlpcWaitSemaphore' : [ 0x3c0, ['_KSEMAPHORE']],
    'ClientSecurity' : [ 0x3e0, ['_PS_CLIENT_SECURITY_CONTEXT']],
    'IrpList' : [ 0x3e8, ['_LIST_ENTRY']],
    'TopLevelIrp' : [ 0x3f8, ['unsigned long long']],
    'DeviceToVerify' : [ 0x400, ['pointer64', ['_DEVICE_OBJECT']]],
    'CpuQuotaApc' : [ 0x408, ['pointer64', ['_PSP_CPU_QUOTA_APC']]],
    'Win32StartAddress' : [ 0x410, ['pointer64', ['void']]],
    'LegacyPowerObject' : [ 0x418, ['pointer64', ['void']]],
    'ThreadListEntry' : [ 0x420, ['_LIST_ENTRY']],
    'RundownProtect' : [ 0x430, ['_EX_RUNDOWN_REF']],
    'ThreadLock' : [ 0x438, ['_EX_PUSH_LOCK']],
    'ReadClusterSize' : [ 0x440, ['unsigned long']],
    'MmLockOrdering' : [ 0x444, ['long']],
    'CrossThreadFlags' : [ 0x448, ['unsigned long']],
    'Terminated' : [ 0x448, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ThreadInserted' : [ 0x448, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'HideFromDebugger' : [ 0x448, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ActiveImpersonationInfo' : [ 0x448, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Reserved' : [ 0x448, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'HardErrorsAreDisabled' : [ 0x448, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0x448, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'SkipCreationMsg' : [ 0x448, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'SkipTerminationMsg' : [ 0x448, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'CopyTokenOnOpen' : [ 0x448, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'ThreadIoPriority' : [ 0x448, ['BitField', dict(start_bit = 10, end_bit = 13, native_type='unsigned long')]],
    'ThreadPagePriority' : [ 0x448, ['BitField', dict(start_bit = 13, end_bit = 16, native_type='unsigned long')]],
    'RundownFail' : [ 0x448, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'NeedsWorkingSetAging' : [ 0x448, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'SameThreadPassiveFlags' : [ 0x44c, ['unsigned long']],
    'ActiveExWorker' : [ 0x44c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ExWorkerCanWaitUser' : [ 0x44c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'MemoryMaker' : [ 0x44c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ClonedThread' : [ 0x44c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'KeyedEventInUse' : [ 0x44c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'RateApcState' : [ 0x44c, ['BitField', dict(start_bit = 5, end_bit = 7, native_type='unsigned long')]],
    'SelfTerminate' : [ 0x44c, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'SameThreadApcFlags' : [ 0x450, ['unsigned long']],
    'Spare' : [ 0x450, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'StartAddressInvalid' : [ 0x450, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'EtwPageFaultCalloutActive' : [ 0x450, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'OwnsProcessWorkingSetExclusive' : [ 0x450, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'OwnsProcessWorkingSetShared' : [ 0x450, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'OwnsSystemCacheWorkingSetExclusive' : [ 0x450, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'OwnsSystemCacheWorkingSetShared' : [ 0x450, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'OwnsSessionWorkingSetExclusive' : [ 0x450, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'OwnsSessionWorkingSetShared' : [ 0x451, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'OwnsProcessAddressSpaceExclusive' : [ 0x451, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'OwnsProcessAddressSpaceShared' : [ 0x451, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'SuppressSymbolLoad' : [ 0x451, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Prefetching' : [ 0x451, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'OwnsDynamicMemoryShared' : [ 0x451, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'OwnsChangeControlAreaExclusive' : [ 0x451, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'OwnsChangeControlAreaShared' : [ 0x451, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'OwnsPagedPoolWorkingSetExclusive' : [ 0x452, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'OwnsPagedPoolWorkingSetShared' : [ 0x452, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'OwnsSystemPtesWorkingSetExclusive' : [ 0x452, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'OwnsSystemPtesWorkingSetShared' : [ 0x452, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'TrimTrigger' : [ 0x452, ['BitField', dict(start_bit = 4, end_bit = 6, native_type='unsigned char')]],
    'Spare1' : [ 0x452, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'PriorityRegionActive' : [ 0x453, ['unsigned char']],
    'CacheManagerActive' : [ 0x454, ['unsigned char']],
    'DisablePageFaultClustering' : [ 0x455, ['unsigned char']],
    'ActiveFaultCount' : [ 0x456, ['unsigned char']],
    'LockOrderState' : [ 0x457, ['unsigned char']],
    'AlpcMessageId' : [ 0x458, ['unsigned long long']],
    'AlpcMessage' : [ 0x460, ['pointer64', ['void']]],
    'AlpcReceiveAttributeSet' : [ 0x460, ['unsigned long']],
    'AlpcWaitListEntry' : [ 0x468, ['_LIST_ENTRY']],
    'CacheManagerCount' : [ 0x478, ['unsigned long']],
    'IoBoostCount' : [ 0x47c, ['unsigned long']],
    'IrpListLock' : [ 0x480, ['unsigned long long']],
    'ReservedForSynchTracking' : [ 0x488, ['pointer64', ['void']]],
    'CmCallbackListHead' : [ 0x490, ['_SINGLE_LIST_ENTRY']],
} ],
  '_EPROCESS' : [ 0x4d0, {
    'Pcb' : [ 0x0, ['_KPROCESS']],
    'ProcessLock' : [ 0x160, ['_EX_PUSH_LOCK']],
    'CreateTime' : [ 0x168, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0x170, ['_LARGE_INTEGER']],
    'RundownProtect' : [ 0x178, ['_EX_RUNDOWN_REF']],
    'UniqueProcessId' : [ 0x180, ['pointer64', ['void']]],
    'ActiveProcessLinks' : [ 0x188, ['_LIST_ENTRY']],
    'ProcessQuotaUsage' : [ 0x198, ['array', 2, ['unsigned long long']]],
    'ProcessQuotaPeak' : [ 0x1a8, ['array', 2, ['unsigned long long']]],
    'CommitCharge' : [ 0x1b8, ['unsigned long long']],
    'QuotaBlock' : [ 0x1c0, ['pointer64', ['_EPROCESS_QUOTA_BLOCK']]],
    'CpuQuotaBlock' : [ 0x1c8, ['pointer64', ['_PS_CPU_QUOTA_BLOCK']]],
    'PeakVirtualSize' : [ 0x1d0, ['unsigned long long']],
    'VirtualSize' : [ 0x1d8, ['unsigned long long']],
    'SessionProcessLinks' : [ 0x1e0, ['_LIST_ENTRY']],
    'DebugPort' : [ 0x1f0, ['pointer64', ['void']]],
    'ExceptionPortData' : [ 0x1f8, ['pointer64', ['void']]],
    'ExceptionPortValue' : [ 0x1f8, ['unsigned long long']],
    'ExceptionPortState' : [ 0x1f8, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long long')]],
    'ObjectTable' : [ 0x200, ['pointer64', ['_HANDLE_TABLE']]],
    'Token' : [ 0x208, ['_EX_FAST_REF']],
    'WorkingSetPage' : [ 0x210, ['unsigned long long']],
    'AddressCreationLock' : [ 0x218, ['_EX_PUSH_LOCK']],
    'RotateInProgress' : [ 0x220, ['pointer64', ['_ETHREAD']]],
    'ForkInProgress' : [ 0x228, ['pointer64', ['_ETHREAD']]],
    'HardwareTrigger' : [ 0x230, ['unsigned long long']],
    'PhysicalVadRoot' : [ 0x238, ['pointer64', ['_MM_AVL_TABLE']]],
    'CloneRoot' : [ 0x240, ['pointer64', ['void']]],
    'NumberOfPrivatePages' : [ 0x248, ['unsigned long long']],
    'NumberOfLockedPages' : [ 0x250, ['unsigned long long']],
    'Win32Process' : [ 0x258, ['pointer64', ['void']]],
    'Job' : [ 0x260, ['pointer64', ['_EJOB']]],
    'SectionObject' : [ 0x268, ['pointer64', ['void']]],
    'SectionBaseAddress' : [ 0x270, ['pointer64', ['void']]],
    'Cookie' : [ 0x278, ['unsigned long']],
    'UmsScheduledThreads' : [ 0x27c, ['unsigned long']],
    'WorkingSetWatch' : [ 0x280, ['pointer64', ['_PAGEFAULT_HISTORY']]],
    'Win32WindowStation' : [ 0x288, ['pointer64', ['void']]],
    'InheritedFromUniqueProcessId' : [ 0x290, ['pointer64', ['void']]],
    'LdtInformation' : [ 0x298, ['pointer64', ['void']]],
    'Spare' : [ 0x2a0, ['pointer64', ['void']]],
    'ConsoleHostProcess' : [ 0x2a8, ['unsigned long long']],
    'DeviceMap' : [ 0x2b0, ['pointer64', ['void']]],
    'EtwDataSource' : [ 0x2b8, ['pointer64', ['void']]],
    'FreeTebHint' : [ 0x2c0, ['pointer64', ['void']]],
    'FreeUmsTebHint' : [ 0x2c8, ['pointer64', ['void']]],
    'PageDirectoryPte' : [ 0x2d0, ['_HARDWARE_PTE']],
    'Filler' : [ 0x2d0, ['unsigned long long']],
    'Session' : [ 0x2d8, ['pointer64', ['void']]],
    'ImageFileName' : [ 0x2e0, ['array', 15, ['unsigned char']]],
    'PriorityClass' : [ 0x2ef, ['unsigned char']],
    'JobLinks' : [ 0x2f0, ['_LIST_ENTRY']],
    'LockedPagesList' : [ 0x300, ['pointer64', ['void']]],
    'ThreadListHead' : [ 0x308, ['_LIST_ENTRY']],
    'SecurityPort' : [ 0x318, ['pointer64', ['void']]],
    'Wow64Process' : [ 0x320, ['pointer64', ['void']]],
    'ActiveThreads' : [ 0x328, ['unsigned long']],
    'ImagePathHash' : [ 0x32c, ['unsigned long']],
    'DefaultHardErrorProcessing' : [ 0x330, ['unsigned long']],
    'LastThreadExitStatus' : [ 0x334, ['long']],
    'Peb' : [ 0x338, ['pointer64', ['_PEB']]],
    'PrefetchTrace' : [ 0x340, ['_EX_FAST_REF']],
    'ReadOperationCount' : [ 0x348, ['_LARGE_INTEGER']],
    'WriteOperationCount' : [ 0x350, ['_LARGE_INTEGER']],
    'OtherOperationCount' : [ 0x358, ['_LARGE_INTEGER']],
    'ReadTransferCount' : [ 0x360, ['_LARGE_INTEGER']],
    'WriteTransferCount' : [ 0x368, ['_LARGE_INTEGER']],
    'OtherTransferCount' : [ 0x370, ['_LARGE_INTEGER']],
    'CommitChargeLimit' : [ 0x378, ['unsigned long long']],
    'CommitChargePeak' : [ 0x380, ['unsigned long long']],
    'AweInfo' : [ 0x388, ['pointer64', ['void']]],
    'SeAuditProcessCreationInfo' : [ 0x390, ['_SE_AUDIT_PROCESS_CREATION_INFO']],
    'Vm' : [ 0x398, ['_MMSUPPORT']],
    'MmProcessLinks' : [ 0x420, ['_LIST_ENTRY']],
    'HighestUserAddress' : [ 0x430, ['pointer64', ['void']]],
    'ModifiedPageCount' : [ 0x438, ['unsigned long']],
    'Flags2' : [ 0x43c, ['unsigned long']],
    'JobNotReallyActive' : [ 0x43c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AccountingFolded' : [ 0x43c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'NewProcessReported' : [ 0x43c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ExitProcessReported' : [ 0x43c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ReportCommitChanges' : [ 0x43c, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'LastReportMemory' : [ 0x43c, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ReportPhysicalPageChanges' : [ 0x43c, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'HandleTableRundown' : [ 0x43c, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'NeedsHandleRundown' : [ 0x43c, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'RefTraceEnabled' : [ 0x43c, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'NumaAware' : [ 0x43c, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ProtectedProcess' : [ 0x43c, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DefaultPagePriority' : [ 0x43c, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
    'PrimaryTokenFrozen' : [ 0x43c, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessVerifierTarget' : [ 0x43c, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'StackRandomizationDisabled' : [ 0x43c, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'AffinityPermanent' : [ 0x43c, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'AffinityUpdateEnable' : [ 0x43c, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'PropagateNode' : [ 0x43c, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'ExplicitAffinity' : [ 0x43c, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'Flags' : [ 0x440, ['unsigned long']],
    'CreateReported' : [ 0x440, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'NoDebugInherit' : [ 0x440, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessExiting' : [ 0x440, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ProcessDelete' : [ 0x440, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Wow64SplitPages' : [ 0x440, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'VmDeleted' : [ 0x440, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'OutswapEnabled' : [ 0x440, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Outswapped' : [ 0x440, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ForkFailed' : [ 0x440, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Wow64VaSpace4Gb' : [ 0x440, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'AddressSpaceInitialized' : [ 0x440, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
    'SetTimerResolution' : [ 0x440, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0x440, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'DeprioritizeViews' : [ 0x440, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'WriteWatch' : [ 0x440, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessInSession' : [ 0x440, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'OverrideAddressSpace' : [ 0x440, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HasAddressSpace' : [ 0x440, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'LaunchPrefetched' : [ 0x440, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'InjectInpageErrors' : [ 0x440, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'VmTopDown' : [ 0x440, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ImageNotifyDone' : [ 0x440, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'PdeUpdateNeeded' : [ 0x440, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'VdmAllowed' : [ 0x440, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'CrossSessionCreate' : [ 0x440, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'ProcessInserted' : [ 0x440, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'DefaultIoPriority' : [ 0x440, ['BitField', dict(start_bit = 27, end_bit = 30, native_type='unsigned long')]],
    'ProcessSelfDelete' : [ 0x440, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'SetTimerResolutionLink' : [ 0x440, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'ExitStatus' : [ 0x444, ['long']],
    'VadRoot' : [ 0x448, ['_MM_AVL_TABLE']],
    'AlpcContext' : [ 0x488, ['_ALPC_PROCESS_CONTEXT']],
    'TimerResolutionLink' : [ 0x4a8, ['_LIST_ENTRY']],
    'RequestedTimerResolution' : [ 0x4b8, ['unsigned long']],
    'ActiveThreadsHighWatermark' : [ 0x4bc, ['unsigned long']],
    'SmallestTimerResolution' : [ 0x4c0, ['unsigned long']],
    'TimerResolutionStackRecord' : [ 0x4c8, ['pointer64', ['_PO_DIAG_STACK_RECORD']]],
} ],
  '_KPROCESS' : [ 0x160, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'ProfileListHead' : [ 0x18, ['_LIST_ENTRY']],
    'DirectoryTableBase' : [ 0x28, ['unsigned long long']],
    'ThreadListHead' : [ 0x30, ['_LIST_ENTRY']],
    'ProcessLock' : [ 0x40, ['unsigned long long']],
    'Affinity' : [ 0x48, ['_KAFFINITY_EX']],
    'ReadyListHead' : [ 0x70, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0x80, ['_SINGLE_LIST_ENTRY']],
    'ActiveProcessors' : [ 0x88, ['_KAFFINITY_EX']],
    'AutoAlignment' : [ 0xb0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='long')]],
    'DisableBoost' : [ 0xb0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='long')]],
    'DisableQuantum' : [ 0xb0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='long')]],
    'ActiveGroupsMask' : [ 0xb0, ['BitField', dict(start_bit = 3, end_bit = 7, native_type='unsigned long')]],
    'ReservedFlags' : [ 0xb0, ['BitField', dict(start_bit = 7, end_bit = 32, native_type='long')]],
    'ProcessFlags' : [ 0xb0, ['long']],
    'BasePriority' : [ 0xb4, ['unsigned char']],
    'QuantumReset' : [ 0xb5, ['unsigned char']],
    'Visited' : [ 0xb6, ['unsigned char']],
    'Unused3' : [ 0xb7, ['unsigned char']],
    'ThreadSeed' : [ 0xb8, ['array', 4, ['unsigned long']]],
    'IdealNode' : [ 0xc8, ['array', 4, ['unsigned short']]],
    'IdealGlobalNode' : [ 0xd0, ['unsigned short']],
    'Flags' : [ 0xd2, ['_KEXECUTE_OPTIONS']],
    'Unused1' : [ 0xd3, ['unsigned char']],
    'Unused2' : [ 0xd4, ['unsigned long']],
    'Unused4' : [ 0xd8, ['unsigned long']],
    'StackCount' : [ 0xdc, ['_KSTACK_COUNT']],
    'ProcessListEntry' : [ 0xe0, ['_LIST_ENTRY']],
    'CycleTime' : [ 0xf0, ['unsigned long long']],
    'KernelTime' : [ 0xf8, ['unsigned long']],
    'UserTime' : [ 0xfc, ['unsigned long']],
    'InstrumentationCallback' : [ 0x100, ['pointer64', ['void']]],
    'LdtSystemDescriptor' : [ 0x108, ['_KGDTENTRY64']],
    'LdtBaseAddress' : [ 0x118, ['pointer64', ['void']]],
    'LdtProcessLock' : [ 0x120, ['_KGUARDED_MUTEX']],
    'LdtFreeSelectorHint' : [ 0x158, ['unsigned short']],
    'LdtTableLength' : [ 0x15a, ['unsigned short']],
} ],
  '__unnamed_12d9' : [ 0x2c, {
    'InitialPrivilegeSet' : [ 0x0, ['_INITIAL_PRIVILEGE_SET']],
    'PrivilegeSet' : [ 0x0, ['_PRIVILEGE_SET']],
} ],
  '_ACCESS_STATE' : [ 0xa0, {
    'OperationID' : [ 0x0, ['_LUID']],
    'SecurityEvaluated' : [ 0x8, ['unsigned char']],
    'GenerateAudit' : [ 0x9, ['unsigned char']],
    'GenerateOnClose' : [ 0xa, ['unsigned char']],
    'PrivilegesAllocated' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['unsigned long']],
    'RemainingDesiredAccess' : [ 0x10, ['unsigned long']],
    'PreviouslyGrantedAccess' : [ 0x14, ['unsigned long']],
    'OriginalDesiredAccess' : [ 0x18, ['unsigned long']],
    'SubjectSecurityContext' : [ 0x20, ['_SECURITY_SUBJECT_CONTEXT']],
    'SecurityDescriptor' : [ 0x40, ['pointer64', ['void']]],
    'AuxData' : [ 0x48, ['pointer64', ['void']]],
    'Privileges' : [ 0x50, ['__unnamed_12d9']],
    'AuditPrivileges' : [ 0x7c, ['unsigned char']],
    'ObjectName' : [ 0x80, ['_UNICODE_STRING']],
    'ObjectTypeName' : [ 0x90, ['_UNICODE_STRING']],
} ],
  '_AUX_ACCESS_DATA' : [ 0xd8, {
    'PrivilegesUsed' : [ 0x0, ['pointer64', ['_PRIVILEGE_SET']]],
    'GenericMapping' : [ 0x8, ['_GENERIC_MAPPING']],
    'AccessesToAudit' : [ 0x18, ['unsigned long']],
    'MaximumAuditMask' : [ 0x1c, ['unsigned long']],
    'TransactionId' : [ 0x20, ['_GUID']],
    'NewSecurityDescriptor' : [ 0x30, ['pointer64', ['void']]],
    'ExistingSecurityDescriptor' : [ 0x38, ['pointer64', ['void']]],
    'ParentSecurityDescriptor' : [ 0x40, ['pointer64', ['void']]],
    'DeRefSecurityDescriptor' : [ 0x48, ['pointer64', ['void']]],
    'SDLock' : [ 0x50, ['pointer64', ['void']]],
    'AccessReasons' : [ 0x58, ['_ACCESS_REASONS']],
} ],
  '__unnamed_12e8' : [ 0x8, {
    'MasterIrp' : [ 0x0, ['pointer64', ['_IRP']]],
    'IrpCount' : [ 0x0, ['long']],
    'SystemBuffer' : [ 0x0, ['pointer64', ['void']]],
} ],
  '__unnamed_12ed' : [ 0x10, {
    'UserApcRoutine' : [ 0x0, ['pointer64', ['void']]],
    'IssuingProcess' : [ 0x0, ['pointer64', ['void']]],
    'UserApcContext' : [ 0x8, ['pointer64', ['void']]],
} ],
  '__unnamed_12ef' : [ 0x10, {
    'AsynchronousParameters' : [ 0x0, ['__unnamed_12ed']],
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
} ],
  '__unnamed_12fa' : [ 0x50, {
    'DeviceQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DriverContext' : [ 0x0, ['array', 4, ['pointer64', ['void']]]],
    'Thread' : [ 0x20, ['pointer64', ['_ETHREAD']]],
    'AuxiliaryBuffer' : [ 0x28, ['pointer64', ['unsigned char']]],
    'ListEntry' : [ 0x30, ['_LIST_ENTRY']],
    'CurrentStackLocation' : [ 0x40, ['pointer64', ['_IO_STACK_LOCATION']]],
    'PacketType' : [ 0x40, ['unsigned long']],
    'OriginalFileObject' : [ 0x48, ['pointer64', ['_FILE_OBJECT']]],
} ],
  '__unnamed_12fc' : [ 0x58, {
    'Overlay' : [ 0x0, ['__unnamed_12fa']],
    'Apc' : [ 0x0, ['_KAPC']],
    'CompletionKey' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_IRP' : [ 0xd0, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'MdlAddress' : [ 0x8, ['pointer64', ['_MDL']]],
    'Flags' : [ 0x10, ['unsigned long']],
    'AssociatedIrp' : [ 0x18, ['__unnamed_12e8']],
    'ThreadListEntry' : [ 0x20, ['_LIST_ENTRY']],
    'IoStatus' : [ 0x30, ['_IO_STATUS_BLOCK']],
    'RequestorMode' : [ 0x40, ['unsigned char']],
    'PendingReturned' : [ 0x41, ['unsigned char']],
    'StackCount' : [ 0x42, ['unsigned char']],
    'CurrentLocation' : [ 0x43, ['unsigned char']],
    'Cancel' : [ 0x44, ['unsigned char']],
    'CancelIrql' : [ 0x45, ['unsigned char']],
    'ApcEnvironment' : [ 0x46, ['unsigned char']],
    'AllocationFlags' : [ 0x47, ['unsigned char']],
    'UserIosb' : [ 0x48, ['pointer64', ['_IO_STATUS_BLOCK']]],
    'UserEvent' : [ 0x50, ['pointer64', ['_KEVENT']]],
    'Overlay' : [ 0x58, ['__unnamed_12ef']],
    'CancelRoutine' : [ 0x68, ['pointer64', ['void']]],
    'UserBuffer' : [ 0x70, ['pointer64', ['void']]],
    'Tail' : [ 0x78, ['__unnamed_12fc']],
} ],
  '__unnamed_1303' : [ 0x20, {
    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x8, ['unsigned long']],
    'FileAttributes' : [ 0x10, ['unsigned short']],
    'ShareAccess' : [ 0x12, ['unsigned short']],
    'EaLength' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1307' : [ 0x20, {
    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0x10, ['unsigned short']],
    'ShareAccess' : [ 0x12, ['unsigned short']],
    'Parameters' : [ 0x18, ['pointer64', ['_NAMED_PIPE_CREATE_PARAMETERS']]],
} ],
  '__unnamed_130b' : [ 0x20, {
    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0x10, ['unsigned short']],
    'ShareAccess' : [ 0x12, ['unsigned short']],
    'Parameters' : [ 0x18, ['pointer64', ['_MAILSLOT_CREATE_PARAMETERS']]],
} ],
  '__unnamed_130d' : [ 0x18, {
    'Length' : [ 0x0, ['unsigned long']],
    'Key' : [ 0x8, ['unsigned long']],
    'ByteOffset' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1311' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileName' : [ 0x8, ['pointer64', ['_UNICODE_STRING']]],
    'FileInformationClass' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileIsRemoteDeviceInformation', 52: 'FileAttributeCacheInformation', 53: 'FileNumaNodeInformation', 54: 'FileStandardLinkInformation', 55: 'FileRemoteProtocolInformation', 56: 'FileMaximumInformation'})]],
    'FileIndex' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1313' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'CompletionFilter' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1315' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileIsRemoteDeviceInformation', 52: 'FileAttributeCacheInformation', 53: 'FileNumaNodeInformation', 54: 'FileStandardLinkInformation', 55: 'FileRemoteProtocolInformation', 56: 'FileMaximumInformation'})]],
} ],
  '__unnamed_1317' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileIsRemoteDeviceInformation', 52: 'FileAttributeCacheInformation', 53: 'FileNumaNodeInformation', 54: 'FileStandardLinkInformation', 55: 'FileRemoteProtocolInformation', 56: 'FileMaximumInformation'})]],
    'FileObject' : [ 0x10, ['pointer64', ['_FILE_OBJECT']]],
    'ReplaceIfExists' : [ 0x18, ['unsigned char']],
    'AdvanceOnly' : [ 0x19, ['unsigned char']],
    'ClusterCount' : [ 0x18, ['unsigned long']],
    'DeleteHandle' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1319' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'EaList' : [ 0x8, ['pointer64', ['void']]],
    'EaListLength' : [ 0x10, ['unsigned long']],
    'EaIndex' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_131b' : [ 0x4, {
    'Length' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_131f' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FsInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: 'FileFsVolumeInformation', 2: 'FileFsLabelInformation', 3: 'FileFsSizeInformation', 4: 'FileFsDeviceInformation', 5: 'FileFsAttributeInformation', 6: 'FileFsControlInformation', 7: 'FileFsFullSizeInformation', 8: 'FileFsObjectIdInformation', 9: 'FileFsDriverPathInformation', 10: 'FileFsVolumeFlagsInformation', 11: 'FileFsMaximumInformation'})]],
} ],
  '__unnamed_1321' : [ 0x20, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x8, ['unsigned long']],
    'FsControlCode' : [ 0x10, ['unsigned long']],
    'Type3InputBuffer' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1323' : [ 0x18, {
    'Length' : [ 0x0, ['pointer64', ['_LARGE_INTEGER']]],
    'Key' : [ 0x8, ['unsigned long']],
    'ByteOffset' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1325' : [ 0x20, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x8, ['unsigned long']],
    'IoControlCode' : [ 0x10, ['unsigned long']],
    'Type3InputBuffer' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1327' : [ 0x10, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1329' : [ 0x10, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'SecurityDescriptor' : [ 0x8, ['pointer64', ['void']]],
} ],
  '__unnamed_132d' : [ 0x10, {
    'Vpb' : [ 0x0, ['pointer64', ['_VPB']]],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
} ],
  '__unnamed_1331' : [ 0x8, {
    'Srb' : [ 0x0, ['pointer64', ['_SCSI_REQUEST_BLOCK']]],
} ],
  '__unnamed_1335' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'StartSid' : [ 0x8, ['pointer64', ['void']]],
    'SidList' : [ 0x10, ['pointer64', ['_FILE_GET_QUOTA_INFORMATION']]],
    'SidListLength' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1339' : [ 0x4, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'BusRelations', 1: 'EjectionRelations', 2: 'PowerRelations', 3: 'RemovalRelations', 4: 'TargetDeviceRelation', 5: 'SingleBusRelations', 6: 'TransportRelations'})]],
} ],
  '__unnamed_133f' : [ 0x20, {
    'InterfaceType' : [ 0x0, ['pointer64', ['_GUID']]],
    'Size' : [ 0x8, ['unsigned short']],
    'Version' : [ 0xa, ['unsigned short']],
    'Interface' : [ 0x10, ['pointer64', ['_INTERFACE']]],
    'InterfaceSpecificData' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1343' : [ 0x8, {
    'Capabilities' : [ 0x0, ['pointer64', ['_DEVICE_CAPABILITIES']]],
} ],
  '__unnamed_1347' : [ 0x8, {
    'IoResourceRequirementList' : [ 0x0, ['pointer64', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
} ],
  '__unnamed_1349' : [ 0x20, {
    'WhichSpace' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x8, ['pointer64', ['void']]],
    'Offset' : [ 0x10, ['unsigned long']],
    'Length' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_134b' : [ 0x1, {
    'Lock' : [ 0x0, ['unsigned char']],
} ],
  '__unnamed_134f' : [ 0x4, {
    'IdType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'BusQueryDeviceID', 1: 'BusQueryHardwareIDs', 2: 'BusQueryCompatibleIDs', 3: 'BusQueryInstanceID', 4: 'BusQueryDeviceSerialNumber', 5: 'BusQueryContainerID'})]],
} ],
  '__unnamed_1353' : [ 0x10, {
    'DeviceTextType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'DeviceTextDescription', 1: 'DeviceTextLocationInformation'})]],
    'LocaleId' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1357' : [ 0x10, {
    'InPath' : [ 0x0, ['unsigned char']],
    'Reserved' : [ 0x1, ['array', 3, ['unsigned char']]],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'DeviceUsageTypeUndefined', 1: 'DeviceUsageTypePaging', 2: 'DeviceUsageTypeHibernation', 3: 'DeviceUsageTypeDumpFile'})]],
} ],
  '__unnamed_135b' : [ 0x4, {
    'PowerState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
} ],
  '__unnamed_135f' : [ 0x8, {
    'PowerSequence' : [ 0x0, ['pointer64', ['_POWER_SEQUENCE']]],
} ],
  '__unnamed_1367' : [ 0x20, {
    'SystemContext' : [ 0x0, ['unsigned long']],
    'SystemPowerStateContext' : [ 0x0, ['_SYSTEM_POWER_STATE_CONTEXT']],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'SystemPowerState', 1: 'DevicePowerState'})]],
    'State' : [ 0x10, ['_POWER_STATE']],
    'ShutdownType' : [ 0x18, ['Enumeration', dict(target = 'long', choices = {0: 'PowerActionNone', 1: 'PowerActionReserved', 2: 'PowerActionSleep', 3: 'PowerActionHibernate', 4: 'PowerActionShutdown', 5: 'PowerActionShutdownReset', 6: 'PowerActionShutdownOff', 7: 'PowerActionWarmEject'})]],
} ],
  '__unnamed_136b' : [ 0x10, {
    'AllocatedResources' : [ 0x0, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'AllocatedResourcesTranslated' : [ 0x8, ['pointer64', ['_CM_RESOURCE_LIST']]],
} ],
  '__unnamed_136d' : [ 0x20, {
    'ProviderId' : [ 0x0, ['unsigned long long']],
    'DataPath' : [ 0x8, ['pointer64', ['void']]],
    'BufferSize' : [ 0x10, ['unsigned long']],
    'Buffer' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_136f' : [ 0x20, {
    'Argument1' : [ 0x0, ['pointer64', ['void']]],
    'Argument2' : [ 0x8, ['pointer64', ['void']]],
    'Argument3' : [ 0x10, ['pointer64', ['void']]],
    'Argument4' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1371' : [ 0x20, {
    'Create' : [ 0x0, ['__unnamed_1303']],
    'CreatePipe' : [ 0x0, ['__unnamed_1307']],
    'CreateMailslot' : [ 0x0, ['__unnamed_130b']],
    'Read' : [ 0x0, ['__unnamed_130d']],
    'Write' : [ 0x0, ['__unnamed_130d']],
    'QueryDirectory' : [ 0x0, ['__unnamed_1311']],
    'NotifyDirectory' : [ 0x0, ['__unnamed_1313']],
    'QueryFile' : [ 0x0, ['__unnamed_1315']],
    'SetFile' : [ 0x0, ['__unnamed_1317']],
    'QueryEa' : [ 0x0, ['__unnamed_1319']],
    'SetEa' : [ 0x0, ['__unnamed_131b']],
    'QueryVolume' : [ 0x0, ['__unnamed_131f']],
    'SetVolume' : [ 0x0, ['__unnamed_131f']],
    'FileSystemControl' : [ 0x0, ['__unnamed_1321']],
    'LockControl' : [ 0x0, ['__unnamed_1323']],
    'DeviceIoControl' : [ 0x0, ['__unnamed_1325']],
    'QuerySecurity' : [ 0x0, ['__unnamed_1327']],
    'SetSecurity' : [ 0x0, ['__unnamed_1329']],
    'MountVolume' : [ 0x0, ['__unnamed_132d']],
    'VerifyVolume' : [ 0x0, ['__unnamed_132d']],
    'Scsi' : [ 0x0, ['__unnamed_1331']],
    'QueryQuota' : [ 0x0, ['__unnamed_1335']],
    'SetQuota' : [ 0x0, ['__unnamed_131b']],
    'QueryDeviceRelations' : [ 0x0, ['__unnamed_1339']],
    'QueryInterface' : [ 0x0, ['__unnamed_133f']],
    'DeviceCapabilities' : [ 0x0, ['__unnamed_1343']],
    'FilterResourceRequirements' : [ 0x0, ['__unnamed_1347']],
    'ReadWriteConfig' : [ 0x0, ['__unnamed_1349']],
    'SetLock' : [ 0x0, ['__unnamed_134b']],
    'QueryId' : [ 0x0, ['__unnamed_134f']],
    'QueryDeviceText' : [ 0x0, ['__unnamed_1353']],
    'UsageNotification' : [ 0x0, ['__unnamed_1357']],
    'WaitWake' : [ 0x0, ['__unnamed_135b']],
    'PowerSequence' : [ 0x0, ['__unnamed_135f']],
    'Power' : [ 0x0, ['__unnamed_1367']],
    'StartDevice' : [ 0x0, ['__unnamed_136b']],
    'WMI' : [ 0x0, ['__unnamed_136d']],
    'Others' : [ 0x0, ['__unnamed_136f']],
} ],
  '_IO_STACK_LOCATION' : [ 0x48, {
    'MajorFunction' : [ 0x0, ['unsigned char']],
    'MinorFunction' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned char']],
    'Control' : [ 0x3, ['unsigned char']],
    'Parameters' : [ 0x8, ['__unnamed_1371']],
    'DeviceObject' : [ 0x28, ['pointer64', ['_DEVICE_OBJECT']]],
    'FileObject' : [ 0x30, ['pointer64', ['_FILE_OBJECT']]],
    'CompletionRoutine' : [ 0x38, ['pointer64', ['void']]],
    'Context' : [ 0x40, ['pointer64', ['void']]],
} ],
  '__unnamed_1387' : [ 0x48, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Wcb' : [ 0x0, ['_WAIT_CONTEXT_BLOCK']],
} ],
  '_DEVICE_OBJECT' : [ 0x150, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'ReferenceCount' : [ 0x4, ['long']],
    'DriverObject' : [ 0x8, ['pointer64', ['_DRIVER_OBJECT']]],
    'NextDevice' : [ 0x10, ['pointer64', ['_DEVICE_OBJECT']]],
    'AttachedDevice' : [ 0x18, ['pointer64', ['_DEVICE_OBJECT']]],
    'CurrentIrp' : [ 0x20, ['pointer64', ['_IRP']]],
    'Timer' : [ 0x28, ['pointer64', ['_IO_TIMER']]],
    'Flags' : [ 0x30, ['unsigned long']],
    'Characteristics' : [ 0x34, ['unsigned long']],
    'Vpb' : [ 0x38, ['pointer64', ['_VPB']]],
    'DeviceExtension' : [ 0x40, ['pointer64', ['void']]],
    'DeviceType' : [ 0x48, ['unsigned long']],
    'StackSize' : [ 0x4c, ['unsigned char']],
    'Queue' : [ 0x50, ['__unnamed_1387']],
    'AlignmentRequirement' : [ 0x98, ['unsigned long']],
    'DeviceQueue' : [ 0xa0, ['_KDEVICE_QUEUE']],
    'Dpc' : [ 0xc8, ['_KDPC']],
    'ActiveThreadCount' : [ 0x108, ['unsigned long']],
    'SecurityDescriptor' : [ 0x110, ['pointer64', ['void']]],
    'DeviceLock' : [ 0x118, ['_KEVENT']],
    'SectorSize' : [ 0x130, ['unsigned short']],
    'Spare1' : [ 0x132, ['unsigned short']],
    'DeviceObjectExtension' : [ 0x138, ['pointer64', ['_DEVOBJ_EXTENSION']]],
    'Reserved' : [ 0x140, ['pointer64', ['void']]],
} ],
  '_KDPC' : [ 0x40, {
    'Type' : [ 0x0, ['unsigned char']],
    'Importance' : [ 0x1, ['unsigned char']],
    'Number' : [ 0x2, ['unsigned short']],
    'DpcListEntry' : [ 0x8, ['_LIST_ENTRY']],
    'DeferredRoutine' : [ 0x18, ['pointer64', ['void']]],
    'DeferredContext' : [ 0x20, ['pointer64', ['void']]],
    'SystemArgument1' : [ 0x28, ['pointer64', ['void']]],
    'SystemArgument2' : [ 0x30, ['pointer64', ['void']]],
    'DpcData' : [ 0x38, ['pointer64', ['void']]],
} ],
  '_IO_DRIVER_CREATE_CONTEXT' : [ 0x20, {
    'Size' : [ 0x0, ['short']],
    'ExtraCreateParameter' : [ 0x8, ['pointer64', ['_ECP_LIST']]],
    'DeviceObjectHint' : [ 0x10, ['pointer64', ['void']]],
    'TxnParameters' : [ 0x18, ['pointer64', ['_TXN_PARAMETER_BLOCK']]],
} ],
  '_IO_PRIORITY_INFO' : [ 0x10, {
    'Size' : [ 0x0, ['unsigned long']],
    'ThreadPriority' : [ 0x4, ['unsigned long']],
    'PagePriority' : [ 0x8, ['unsigned long']],
    'IoPriority' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: 'IoPriorityVeryLow', 1: 'IoPriorityLow', 2: 'IoPriorityNormal', 3: 'IoPriorityHigh', 4: 'IoPriorityCritical', 5: 'MaxIoPriorityTypes'})]],
} ],
  '_OBJECT_ATTRIBUTES' : [ 0x30, {
    'Length' : [ 0x0, ['unsigned long']],
    'RootDirectory' : [ 0x8, ['pointer64', ['void']]],
    'ObjectName' : [ 0x10, ['pointer64', ['_UNICODE_STRING']]],
    'Attributes' : [ 0x18, ['unsigned long']],
    'SecurityDescriptor' : [ 0x20, ['pointer64', ['void']]],
    'SecurityQualityOfService' : [ 0x28, ['pointer64', ['void']]],
} ],
  '_OBJECT_HANDLE_INFORMATION' : [ 0x8, {
    'HandleAttributes' : [ 0x0, ['unsigned long']],
    'GrantedAccess' : [ 0x4, ['unsigned long']],
} ],
  '_EVENT_DATA_DESCRIPTOR' : [ 0x10, {
    'Ptr' : [ 0x0, ['unsigned long long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
} ],
  '_EVENT_DESCRIPTOR' : [ 0x10, {
    'Id' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned char']],
    'Channel' : [ 0x3, ['unsigned char']],
    'Level' : [ 0x4, ['unsigned char']],
    'Opcode' : [ 0x5, ['unsigned char']],
    'Task' : [ 0x6, ['unsigned short']],
    'Keyword' : [ 0x8, ['unsigned long long']],
} ],
  '_PERFINFO_GROUPMASK' : [ 0x20, {
    'Masks' : [ 0x0, ['array', 8, ['unsigned long']]],
} ],
  '_FILE_OBJECT' : [ 0xd8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'Vpb' : [ 0x10, ['pointer64', ['_VPB']]],
    'FsContext' : [ 0x18, ['pointer64', ['void']]],
    'FsContext2' : [ 0x20, ['pointer64', ['void']]],
    'SectionObjectPointer' : [ 0x28, ['pointer64', ['_SECTION_OBJECT_POINTERS']]],
    'PrivateCacheMap' : [ 0x30, ['pointer64', ['void']]],
    'FinalStatus' : [ 0x38, ['long']],
    'RelatedFileObject' : [ 0x40, ['pointer64', ['_FILE_OBJECT']]],
    'LockOperation' : [ 0x48, ['unsigned char']],
    'DeletePending' : [ 0x49, ['unsigned char']],
    'ReadAccess' : [ 0x4a, ['unsigned char']],
    'WriteAccess' : [ 0x4b, ['unsigned char']],
    'DeleteAccess' : [ 0x4c, ['unsigned char']],
    'SharedRead' : [ 0x4d, ['unsigned char']],
    'SharedWrite' : [ 0x4e, ['unsigned char']],
    'SharedDelete' : [ 0x4f, ['unsigned char']],
    'Flags' : [ 0x50, ['unsigned long']],
    'FileName' : [ 0x58, ['_UNICODE_STRING']],
    'CurrentByteOffset' : [ 0x68, ['_LARGE_INTEGER']],
    'Waiters' : [ 0x70, ['unsigned long']],
    'Busy' : [ 0x74, ['unsigned long']],
    'LastLock' : [ 0x78, ['pointer64', ['void']]],
    'Lock' : [ 0x80, ['_KEVENT']],
    'Event' : [ 0x98, ['_KEVENT']],
    'CompletionContext' : [ 0xb0, ['pointer64', ['_IO_COMPLETION_CONTEXT']]],
    'IrpListLock' : [ 0xb8, ['unsigned long long']],
    'IrpList' : [ 0xc0, ['_LIST_ENTRY']],
    'FileObjectExtension' : [ 0xd0, ['pointer64', ['void']]],
} ],
  '_EX_RUNDOWN_REF' : [ 0x8, {
    'Count' : [ 0x0, ['unsigned long long']],
    'Ptr' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_MM_PAGE_ACCESS_INFO_HEADER' : [ 0x48, {
    'Link' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'MmPteAccessType', 1: 'MmCcReadAheadType', 2: 'MmPfnRepurposeType', 3: 'MmMaximumPageAccessType'})]],
    'EmptySequenceNumber' : [ 0xc, ['unsigned long']],
    'CurrentFileIndex' : [ 0xc, ['unsigned long']],
    'CreateTime' : [ 0x10, ['unsigned long long']],
    'EmptyTime' : [ 0x18, ['unsigned long long']],
    'TempEntry' : [ 0x18, ['pointer64', ['_MM_PAGE_ACCESS_INFO']]],
    'PageEntry' : [ 0x20, ['pointer64', ['_MM_PAGE_ACCESS_INFO']]],
    'FileEntry' : [ 0x28, ['pointer64', ['unsigned long long']]],
    'FirstFileEntry' : [ 0x30, ['pointer64', ['unsigned long long']]],
    'Process' : [ 0x38, ['pointer64', ['_EPROCESS']]],
    'SessionId' : [ 0x40, ['unsigned long']],
    'PageFrameEntry' : [ 0x20, ['pointer64', ['unsigned long long']]],
    'LastPageFrameEntry' : [ 0x28, ['pointer64', ['unsigned long long']]],
} ],
  '_WHEA_ERROR_PACKET_V2' : [ 0x50, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'Length' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_PACKET_FLAGS']],
    'ErrorType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrTypeProcessor', 1: 'WheaErrTypeMemory', 2: 'WheaErrTypePCIExpress', 3: 'WheaErrTypeNMI', 4: 'WheaErrTypePCIXBus', 5: 'WheaErrTypePCIXDevice', 6: 'WheaErrTypeGeneric'})]],
    'ErrorSeverity' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSevRecoverable', 1: 'WheaErrSevFatal', 2: 'WheaErrSevCorrected', 3: 'WheaErrSevInformational'})]],
    'ErrorSourceId' : [ 0x18, ['unsigned long']],
    'ErrorSourceType' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSrcTypeMCE', 1: 'WheaErrSrcTypeCMC', 2: 'WheaErrSrcTypeCPE', 3: 'WheaErrSrcTypeNMI', 4: 'WheaErrSrcTypePCIe', 5: 'WheaErrSrcTypeGeneric', 6: 'WheaErrSrcTypeINIT', 7: 'WheaErrSrcTypeBOOT', 8: 'WheaErrSrcTypeSCIGeneric', 9: 'WheaErrSrcTypeIPFMCA', 10: 'WheaErrSrcTypeIPFCMC', 11: 'WheaErrSrcTypeIPFCPE', 12: 'WheaErrSrcTypeMax'})]],
    'NotifyType' : [ 0x20, ['_GUID']],
    'Context' : [ 0x30, ['unsigned long long']],
    'DataFormat' : [ 0x38, ['Enumeration', dict(target = 'long', choices = {0: 'WheaDataFormatIPFSalRecord', 1: 'WheaDataFormatXPFMCA', 2: 'WheaDataFormatMemory', 3: 'WheaDataFormatPCIExpress', 4: 'WheaDataFormatNMIPort', 5: 'WheaDataFormatPCIXBus', 6: 'WheaDataFormatPCIXDevice', 7: 'WheaDataFormatGeneric', 8: 'WheaDataFormatMax'})]],
    'Reserved1' : [ 0x3c, ['unsigned long']],
    'DataOffset' : [ 0x40, ['unsigned long']],
    'DataLength' : [ 0x44, ['unsigned long']],
    'PshedDataOffset' : [ 0x48, ['unsigned long']],
    'PshedDataLength' : [ 0x4c, ['unsigned long']],
} ],
  '_WHEA_ERROR_RECORD' : [ 0xc8, {
    'Header' : [ 0x0, ['_WHEA_ERROR_RECORD_HEADER']],
    'SectionDescriptor' : [ 0x80, ['array', 1, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR']]],
} ],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR' : [ 0x48, {
    'SectionOffset' : [ 0x0, ['unsigned long']],
    'SectionLength' : [ 0x4, ['unsigned long']],
    'Revision' : [ 0x8, ['_WHEA_REVISION']],
    'ValidBits' : [ 0xa, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS']],
    'Reserved' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS']],
    'SectionType' : [ 0x10, ['_GUID']],
    'FRUId' : [ 0x20, ['_GUID']],
    'SectionSeverity' : [ 0x30, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSevRecoverable', 1: 'WheaErrSevFatal', 2: 'WheaErrSevCorrected', 3: 'WheaErrSevInformational'})]],
    'FRUText' : [ 0x34, ['array', 20, ['unsigned char']]],
} ],
  '_GUID' : [ 0x10, {
    'Data1' : [ 0x0, ['unsigned long']],
    'Data2' : [ 0x4, ['unsigned short']],
    'Data3' : [ 0x6, ['unsigned short']],
    'Data4' : [ 0x8, ['array', 8, ['unsigned char']]],
} ],
  '_FSRTL_ADVANCED_FCB_HEADER' : [ 0x58, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'Flags' : [ 0x4, ['unsigned char']],
    'IsFastIoPossible' : [ 0x5, ['unsigned char']],
    'Flags2' : [ 0x6, ['unsigned char']],
    'Reserved' : [ 0x7, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'Version' : [ 0x7, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Resource' : [ 0x8, ['pointer64', ['_ERESOURCE']]],
    'PagingIoResource' : [ 0x10, ['pointer64', ['_ERESOURCE']]],
    'AllocationSize' : [ 0x18, ['_LARGE_INTEGER']],
    'FileSize' : [ 0x20, ['_LARGE_INTEGER']],
    'ValidDataLength' : [ 0x28, ['_LARGE_INTEGER']],
    'FastMutex' : [ 0x30, ['pointer64', ['_FAST_MUTEX']]],
    'FilterContexts' : [ 0x38, ['_LIST_ENTRY']],
    'PushLock' : [ 0x48, ['_EX_PUSH_LOCK']],
    'FileContextSupportPointer' : [ 0x50, ['pointer64', ['pointer64', ['void']]]],
} ],
  '_iobuf' : [ 0x30, {
    '_ptr' : [ 0x0, ['pointer64', ['unsigned char']]],
    '_cnt' : [ 0x8, ['long']],
    '_base' : [ 0x10, ['pointer64', ['unsigned char']]],
    '_flag' : [ 0x18, ['long']],
    '_file' : [ 0x1c, ['long']],
    '_charbuf' : [ 0x20, ['long']],
    '_bufsiz' : [ 0x24, ['long']],
    '_tmpfname' : [ 0x28, ['pointer64', ['unsigned char']]],
} ],
  '__unnamed_14ef' : [ 0x8, {
    'Long' : [ 0x0, ['unsigned long long']],
    'VolatileLong' : [ 0x0, ['unsigned long long']],
    'Hard' : [ 0x0, ['_MMPTE_HARDWARE']],
    'Flush' : [ 0x0, ['_HARDWARE_PTE']],
    'Proto' : [ 0x0, ['_MMPTE_PROTOTYPE']],
    'Soft' : [ 0x0, ['_MMPTE_SOFTWARE']],
    'TimeStamp' : [ 0x0, ['_MMPTE_TIMESTAMP']],
    'Trans' : [ 0x0, ['_MMPTE_TRANSITION']],
    'Subsect' : [ 0x0, ['_MMPTE_SUBSECTION']],
    'List' : [ 0x0, ['_MMPTE_LIST']],
} ],
  '_MMPTE' : [ 0x8, {
    'u' : [ 0x0, ['__unnamed_14ef']],
} ],
  '__unnamed_1500' : [ 0x10, {
    'I386' : [ 0x0, ['_I386_LOADER_BLOCK']],
    'Ia64' : [ 0x0, ['_IA64_LOADER_BLOCK']],
} ],
  '_LOADER_PARAMETER_BLOCK' : [ 0xf0, {
    'OsMajorVersion' : [ 0x0, ['unsigned long']],
    'OsMinorVersion' : [ 0x4, ['unsigned long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'LoadOrderListHead' : [ 0x10, ['_LIST_ENTRY']],
    'MemoryDescriptorListHead' : [ 0x20, ['_LIST_ENTRY']],
    'BootDriverListHead' : [ 0x30, ['_LIST_ENTRY']],
    'KernelStack' : [ 0x40, ['unsigned long long']],
    'Prcb' : [ 0x48, ['unsigned long long']],
    'Process' : [ 0x50, ['unsigned long long']],
    'Thread' : [ 0x58, ['unsigned long long']],
    'RegistryLength' : [ 0x60, ['unsigned long']],
    'RegistryBase' : [ 0x68, ['pointer64', ['void']]],
    'ConfigurationRoot' : [ 0x70, ['pointer64', ['_CONFIGURATION_COMPONENT_DATA']]],
    'ArcBootDeviceName' : [ 0x78, ['pointer64', ['unsigned char']]],
    'ArcHalDeviceName' : [ 0x80, ['pointer64', ['unsigned char']]],
    'NtBootPathName' : [ 0x88, ['pointer64', ['unsigned char']]],
    'NtHalPathName' : [ 0x90, ['pointer64', ['unsigned char']]],
    'LoadOptions' : [ 0x98, ['pointer64', ['unsigned char']]],
    'NlsData' : [ 0xa0, ['pointer64', ['_NLS_DATA_BLOCK']]],
    'ArcDiskInformation' : [ 0xa8, ['pointer64', ['_ARC_DISK_INFORMATION']]],
    'OemFontFile' : [ 0xb0, ['pointer64', ['void']]],
    'Extension' : [ 0xb8, ['pointer64', ['_LOADER_PARAMETER_EXTENSION']]],
    'u' : [ 0xc0, ['__unnamed_1500']],
    'FirmwareInformation' : [ 0xd0, ['_FIRMWARE_INFORMATION_LOADER_BLOCK']],
} ],
  '_KLOCK_QUEUE_HANDLE' : [ 0x18, {
    'LockQueue' : [ 0x0, ['_KSPIN_LOCK_QUEUE']],
    'OldIrql' : [ 0x10, ['unsigned char']],
} ],
  '_MMPFNLIST' : [ 0x28, {
    'Total' : [ 0x0, ['unsigned long long']],
    'ListName' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'ZeroedPageList', 1: 'FreePageList', 2: 'StandbyPageList', 3: 'ModifiedPageList', 4: 'ModifiedNoWritePageList', 5: 'BadPageList', 6: 'ActiveAndValid', 7: 'TransitionPage'})]],
    'Flink' : [ 0x10, ['unsigned long long']],
    'Blink' : [ 0x18, ['unsigned long long']],
    'Lock' : [ 0x20, ['unsigned long long']],
} ],
  '__unnamed_152f' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'WsIndex' : [ 0x0, ['unsigned long']],
    'Event' : [ 0x0, ['pointer64', ['_KEVENT']]],
    'Next' : [ 0x0, ['pointer64', ['void']]],
    'VolatileNext' : [ 0x0, ['pointer64', ['void']]],
    'KernelStackOwner' : [ 0x0, ['pointer64', ['_KTHREAD']]],
    'NextStackPfn' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
} ],
  '__unnamed_1531' : [ 0x8, {
    'Blink' : [ 0x0, ['unsigned long long']],
    'ImageProtoPte' : [ 0x0, ['pointer64', ['_MMPTE']]],
    'ShareCount' : [ 0x0, ['unsigned long long']],
} ],
  '__unnamed_1534' : [ 0x4, {
    'ReferenceCount' : [ 0x0, ['unsigned short']],
    'VolatileReferenceCount' : [ 0x0, ['short']],
    'ShortFlags' : [ 0x2, ['unsigned short']],
} ],
  '__unnamed_1536' : [ 0x4, {
    'ReferenceCount' : [ 0x0, ['unsigned short']],
    'e1' : [ 0x2, ['_MMPFNENTRY']],
    'e2' : [ 0x0, ['__unnamed_1534']],
} ],
  '__unnamed_153e' : [ 0x8, {
    'PteFrame' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 52, native_type='unsigned long long')]],
    'Unused' : [ 0x0, ['BitField', dict(start_bit = 52, end_bit = 55, native_type='unsigned long long')]],
    'PfnImageVerified' : [ 0x0, ['BitField', dict(start_bit = 55, end_bit = 56, native_type='unsigned long long')]],
    'AweAllocation' : [ 0x0, ['BitField', dict(start_bit = 56, end_bit = 57, native_type='unsigned long long')]],
    'PrototypePte' : [ 0x0, ['BitField', dict(start_bit = 57, end_bit = 58, native_type='unsigned long long')]],
    'PageColor' : [ 0x0, ['BitField', dict(start_bit = 58, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_MMPFN' : [ 0x30, {
    'u1' : [ 0x0, ['__unnamed_152f']],
    'u2' : [ 0x8, ['__unnamed_1531']],
    'PteAddress' : [ 0x10, ['pointer64', ['_MMPTE']]],
    'VolatilePteAddress' : [ 0x10, ['pointer64', ['void']]],
    'Lock' : [ 0x10, ['long']],
    'PteLong' : [ 0x10, ['unsigned long long']],
    'u3' : [ 0x18, ['__unnamed_1536']],
    'UsedPageTableEntries' : [ 0x1c, ['unsigned short']],
    'VaType' : [ 0x1e, ['unsigned char']],
    'ViewCount' : [ 0x1f, ['unsigned char']],
    'OriginalPte' : [ 0x20, ['_MMPTE']],
    'AweReferenceCount' : [ 0x20, ['long']],
    'u4' : [ 0x28, ['__unnamed_153e']],
} ],
  '_MI_COLOR_BASE' : [ 0x10, {
    'ColorPointer' : [ 0x0, ['pointer64', ['unsigned short']]],
    'ColorMask' : [ 0x8, ['unsigned short']],
    'ColorNode' : [ 0xa, ['unsigned short']],
} ],
  '_MMSUPPORT' : [ 0x88, {
    'WorkingSetMutex' : [ 0x0, ['_EX_PUSH_LOCK']],
    'ExitGate' : [ 0x8, ['pointer64', ['_KGATE']]],
    'AccessLog' : [ 0x10, ['pointer64', ['void']]],
    'WorkingSetExpansionLinks' : [ 0x18, ['_LIST_ENTRY']],
    'AgeDistribution' : [ 0x28, ['array', 7, ['unsigned long']]],
    'MinimumWorkingSetSize' : [ 0x44, ['unsigned long']],
    'WorkingSetSize' : [ 0x48, ['unsigned long']],
    'WorkingSetPrivateSize' : [ 0x4c, ['unsigned long']],
    'MaximumWorkingSetSize' : [ 0x50, ['unsigned long']],
    'ChargedWslePages' : [ 0x54, ['unsigned long']],
    'ActualWslePages' : [ 0x58, ['unsigned long']],
    'WorkingSetSizeOverhead' : [ 0x5c, ['unsigned long']],
    'PeakWorkingSetSize' : [ 0x60, ['unsigned long']],
    'HardFaultCount' : [ 0x64, ['unsigned long']],
    'VmWorkingSetList' : [ 0x68, ['pointer64', ['_MMWSL']]],
    'NextPageColor' : [ 0x70, ['unsigned short']],
    'LastTrimStamp' : [ 0x72, ['unsigned short']],
    'PageFaultCount' : [ 0x74, ['unsigned long']],
    'RepurposeCount' : [ 0x78, ['unsigned long']],
    'Spare' : [ 0x7c, ['array', 2, ['unsigned long']]],
    'Flags' : [ 0x84, ['_MMSUPPORT_FLAGS']],
} ],
  '_MMWSL' : [ 0x488, {
    'FirstFree' : [ 0x0, ['unsigned long']],
    'FirstDynamic' : [ 0x4, ['unsigned long']],
    'LastEntry' : [ 0x8, ['unsigned long']],
    'NextSlot' : [ 0xc, ['unsigned long']],
    'Wsle' : [ 0x10, ['pointer64', ['_MMWSLE']]],
    'LowestPagableAddress' : [ 0x18, ['pointer64', ['void']]],
    'LastInitializedWsle' : [ 0x20, ['unsigned long']],
    'NextAgingSlot' : [ 0x24, ['unsigned long']],
    'NumberOfCommittedPageTables' : [ 0x28, ['unsigned long']],
    'VadBitMapHint' : [ 0x2c, ['unsigned long']],
    'NonDirectCount' : [ 0x30, ['unsigned long']],
    'LastVadBit' : [ 0x34, ['unsigned long']],
    'MaximumLastVadBit' : [ 0x38, ['unsigned long']],
    'LastAllocationSizeHint' : [ 0x3c, ['unsigned long']],
    'LastAllocationSize' : [ 0x40, ['unsigned long']],
    'NonDirectHash' : [ 0x48, ['pointer64', ['_MMWSLE_NONDIRECT_HASH']]],
    'HashTableStart' : [ 0x50, ['pointer64', ['_MMWSLE_HASH']]],
    'HighestPermittedHashAddress' : [ 0x58, ['pointer64', ['_MMWSLE_HASH']]],
    'MaximumUserPageTablePages' : [ 0x60, ['unsigned long']],
    'MaximumUserPageDirectoryPages' : [ 0x64, ['unsigned long']],
    'CommittedPageTables' : [ 0x68, ['pointer64', ['unsigned long']]],
    'NumberOfCommittedPageDirectories' : [ 0x70, ['unsigned long']],
    'CommittedPageDirectories' : [ 0x78, ['array', 128, ['unsigned long long']]],
    'NumberOfCommittedPageDirectoryParents' : [ 0x478, ['unsigned long']],
    'CommittedPageDirectoryParents' : [ 0x480, ['array', 1, ['unsigned long long']]],
} ],
  '__unnamed_156c' : [ 0x8, {
    'VirtualAddress' : [ 0x0, ['pointer64', ['void']]],
    'Long' : [ 0x0, ['unsigned long long']],
    'e1' : [ 0x0, ['_MMWSLENTRY']],
    'e2' : [ 0x0, ['_MMWSLE_FREE_ENTRY']],
} ],
  '_MMWSLE' : [ 0x8, {
    'u1' : [ 0x0, ['__unnamed_156c']],
} ],
  '__unnamed_157b' : [ 0x4, {
    'LongFlags' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x0, ['_MMSECTION_FLAGS']],
} ],
  '__unnamed_1585' : [ 0x10, {
    'NumberOfSystemCacheViews' : [ 0x0, ['unsigned long']],
    'ImageRelocationStartBit' : [ 0x0, ['unsigned long']],
    'WritableUserReferences' : [ 0x4, ['long']],
    'ImageRelocationSizeIn64k' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'Unused' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 30, native_type='unsigned long')]],
    'BitMap64' : [ 0x4, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'ImageActive' : [ 0x4, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'SubsectionRoot' : [ 0x8, ['pointer64', ['_MM_SUBSECTION_AVL_TABLE']]],
    'SeImageStub' : [ 0x8, ['pointer64', ['_MI_IMAGE_SECURITY_REFERENCE']]],
} ],
  '__unnamed_1587' : [ 0x10, {
    'e2' : [ 0x0, ['__unnamed_1585']],
} ],
  '_CONTROL_AREA' : [ 0x80, {
    'Segment' : [ 0x0, ['pointer64', ['_SEGMENT']]],
    'DereferenceList' : [ 0x8, ['_LIST_ENTRY']],
    'NumberOfSectionReferences' : [ 0x18, ['unsigned long long']],
    'NumberOfPfnReferences' : [ 0x20, ['unsigned long long']],
    'NumberOfMappedViews' : [ 0x28, ['unsigned long long']],
    'NumberOfUserReferences' : [ 0x30, ['unsigned long long']],
    'u' : [ 0x38, ['__unnamed_157b']],
    'FlushInProgressCount' : [ 0x3c, ['unsigned long']],
    'FilePointer' : [ 0x40, ['_EX_FAST_REF']],
    'ControlAreaLock' : [ 0x48, ['long']],
    'ModifiedWriteCount' : [ 0x4c, ['unsigned long']],
    'StartingFrame' : [ 0x4c, ['unsigned long']],
    'WaitingForDeletion' : [ 0x50, ['pointer64', ['_MI_SECTION_CREATION_GATE']]],
    'u2' : [ 0x58, ['__unnamed_1587']],
    'LockedPages' : [ 0x68, ['long long']],
    'ViewList' : [ 0x70, ['_LIST_ENTRY']],
} ],
  '_MM_STORE_KEY' : [ 0x8, {
    'KeyLow' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 60, native_type='unsigned long long')]],
    'KeyHigh' : [ 0x0, ['BitField', dict(start_bit = 60, end_bit = 64, native_type='unsigned long long')]],
    'EntireKey' : [ 0x0, ['unsigned long long']],
} ],
  '_MMPAGING_FILE' : [ 0x90, {
    'Size' : [ 0x0, ['unsigned long long']],
    'MaximumSize' : [ 0x8, ['unsigned long long']],
    'MinimumSize' : [ 0x10, ['unsigned long long']],
    'FreeSpace' : [ 0x18, ['unsigned long long']],
    'PeakUsage' : [ 0x20, ['unsigned long long']],
    'HighestPage' : [ 0x28, ['unsigned long long']],
    'File' : [ 0x30, ['pointer64', ['_FILE_OBJECT']]],
    'Entry' : [ 0x38, ['array', 2, ['pointer64', ['_MMMOD_WRITER_MDL_ENTRY']]]],
    'PageFileName' : [ 0x48, ['_UNICODE_STRING']],
    'Bitmap' : [ 0x58, ['pointer64', ['_RTL_BITMAP']]],
    'EvictStoreBitmap' : [ 0x60, ['pointer64', ['_RTL_BITMAP']]],
    'BitmapHint' : [ 0x68, ['unsigned long']],
    'LastAllocationSize' : [ 0x6c, ['unsigned long']],
    'ToBeEvictedCount' : [ 0x70, ['unsigned long']],
    'PageFileNumber' : [ 0x74, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned short')]],
    'BootPartition' : [ 0x74, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'Spare0' : [ 0x74, ['BitField', dict(start_bit = 5, end_bit = 16, native_type='unsigned short')]],
    'AdriftMdls' : [ 0x76, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'Spare1' : [ 0x76, ['BitField', dict(start_bit = 1, end_bit = 16, native_type='unsigned short')]],
    'FileHandle' : [ 0x78, ['pointer64', ['void']]],
    'Lock' : [ 0x80, ['unsigned long long']],
    'LockOwner' : [ 0x88, ['pointer64', ['_ETHREAD']]],
} ],
  '_MM_AVL_TABLE' : [ 0x40, {
    'BalancedRoot' : [ 0x0, ['_MMADDRESS_NODE']],
    'DepthOfTree' : [ 0x28, ['BitField', dict(start_bit = 0, end_bit = 5, native_type='unsigned long long')]],
    'Unused' : [ 0x28, ['BitField', dict(start_bit = 5, end_bit = 8, native_type='unsigned long long')]],
    'NumberGenericTableElements' : [ 0x28, ['BitField', dict(start_bit = 8, end_bit = 64, native_type='unsigned long long')]],
    'NodeHint' : [ 0x30, ['pointer64', ['void']]],
    'NodeFreeHint' : [ 0x38, ['pointer64', ['void']]],
} ],
  '__unnamed_15bf' : [ 0x8, {
    'Balance' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='long long')]],
    'Parent' : [ 0x0, ['pointer64', ['_MMVAD']]],
} ],
  '__unnamed_15c2' : [ 0x8, {
    'LongFlags' : [ 0x0, ['unsigned long long']],
    'VadFlags' : [ 0x0, ['_MMVAD_FLAGS']],
} ],
  '__unnamed_15c5' : [ 0x8, {
    'LongFlags3' : [ 0x0, ['unsigned long long']],
    'VadFlags3' : [ 0x0, ['_MMVAD_FLAGS3']],
} ],
  '_MMVAD_SHORT' : [ 0x40, {
    'u1' : [ 0x0, ['__unnamed_15bf']],
    'LeftChild' : [ 0x8, ['pointer64', ['_MMVAD']]],
    'RightChild' : [ 0x10, ['pointer64', ['_MMVAD']]],
    'StartingVpn' : [ 0x18, ['unsigned long long']],
    'EndingVpn' : [ 0x20, ['unsigned long long']],
    'u' : [ 0x28, ['__unnamed_15c2']],
    'PushLock' : [ 0x30, ['_EX_PUSH_LOCK']],
    'u5' : [ 0x38, ['__unnamed_15c5']],
} ],
  '__unnamed_15cd' : [ 0x8, {
    'Balance' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='long long')]],
    'Parent' : [ 0x0, ['pointer64', ['_MMADDRESS_NODE']]],
} ],
  '_MMADDRESS_NODE' : [ 0x28, {
    'u1' : [ 0x0, ['__unnamed_15cd']],
    'LeftChild' : [ 0x8, ['pointer64', ['_MMADDRESS_NODE']]],
    'RightChild' : [ 0x10, ['pointer64', ['_MMADDRESS_NODE']]],
    'StartingVpn' : [ 0x18, ['unsigned long long']],
    'EndingVpn' : [ 0x20, ['unsigned long long']],
} ],
  '__unnamed_15d2' : [ 0x4, {
    'LongFlags2' : [ 0x0, ['unsigned long']],
    'VadFlags2' : [ 0x0, ['_MMVAD_FLAGS2']],
} ],
  '_MMVAD' : [ 0x78, {
    'u1' : [ 0x0, ['__unnamed_15bf']],
    'LeftChild' : [ 0x8, ['pointer64', ['_MMVAD']]],
    'RightChild' : [ 0x10, ['pointer64', ['_MMVAD']]],
    'StartingVpn' : [ 0x18, ['unsigned long long']],
    'EndingVpn' : [ 0x20, ['unsigned long long']],
    'u' : [ 0x28, ['__unnamed_15c2']],
    'PushLock' : [ 0x30, ['_EX_PUSH_LOCK']],
    'u5' : [ 0x38, ['__unnamed_15c5']],
    'u2' : [ 0x40, ['__unnamed_15d2']],
    'Subsection' : [ 0x48, ['pointer64', ['_SUBSECTION']]],
    'MappedSubsection' : [ 0x48, ['pointer64', ['_MSUBSECTION']]],
    'FirstPrototypePte' : [ 0x50, ['pointer64', ['_MMPTE']]],
    'LastContiguousPte' : [ 0x58, ['pointer64', ['_MMPTE']]],
    'ViewLinks' : [ 0x60, ['_LIST_ENTRY']],
    'VadsProcess' : [ 0x70, ['pointer64', ['_EPROCESS']]],
} ],
  '__unnamed_15dd' : [ 0x38, {
    'Mdl' : [ 0x0, ['_MDL']],
    'Page' : [ 0x30, ['array', 1, ['unsigned long long']]],
} ],
  '_MI_PAGEFILE_TRACES' : [ 0x68, {
    'Status' : [ 0x0, ['long']],
    'Priority' : [ 0x4, ['unsigned char']],
    'IrpPriority' : [ 0x5, ['unsigned char']],
    'CurrentTime' : [ 0x8, ['_LARGE_INTEGER']],
    'AvailablePages' : [ 0x10, ['unsigned long long']],
    'ModifiedPagesTotal' : [ 0x18, ['unsigned long long']],
    'ModifiedPagefilePages' : [ 0x20, ['unsigned long long']],
    'ModifiedNoWritePages' : [ 0x28, ['unsigned long long']],
    'MdlHack' : [ 0x30, ['__unnamed_15dd']],
} ],
  '__unnamed_15e3' : [ 0x10, {
    'IoStatus' : [ 0x0, ['_IO_STATUS_BLOCK']],
} ],
  '__unnamed_15e5' : [ 0x8, {
    'KeepForever' : [ 0x0, ['unsigned long long']],
} ],
  '_MMMOD_WRITER_MDL_ENTRY' : [ 0xa0, {
    'Links' : [ 0x0, ['_LIST_ENTRY']],
    'u' : [ 0x10, ['__unnamed_15e3']],
    'Irp' : [ 0x20, ['pointer64', ['_IRP']]],
    'u1' : [ 0x28, ['__unnamed_15e5']],
    'PagingFile' : [ 0x30, ['pointer64', ['_MMPAGING_FILE']]],
    'File' : [ 0x38, ['pointer64', ['_FILE_OBJECT']]],
    'ControlArea' : [ 0x40, ['pointer64', ['_CONTROL_AREA']]],
    'FileResource' : [ 0x48, ['pointer64', ['_ERESOURCE']]],
    'WriteOffset' : [ 0x50, ['_LARGE_INTEGER']],
    'IssueTime' : [ 0x58, ['_LARGE_INTEGER']],
    'PointerMdl' : [ 0x60, ['pointer64', ['_MDL']]],
    'Mdl' : [ 0x68, ['_MDL']],
    'Page' : [ 0x98, ['array', 1, ['unsigned long long']]],
} ],
  '_MDL' : [ 0x30, {
    'Next' : [ 0x0, ['pointer64', ['_MDL']]],
    'Size' : [ 0x8, ['short']],
    'MdlFlags' : [ 0xa, ['short']],
    'Process' : [ 0x10, ['pointer64', ['_EPROCESS']]],
    'MappedSystemVa' : [ 0x18, ['pointer64', ['void']]],
    'StartVa' : [ 0x20, ['pointer64', ['void']]],
    'ByteCount' : [ 0x28, ['unsigned long']],
    'ByteOffset' : [ 0x2c, ['unsigned long']],
} ],
  '_HHIVE' : [ 0x598, {
    'Signature' : [ 0x0, ['unsigned long']],
    'GetCellRoutine' : [ 0x8, ['pointer64', ['void']]],
    'ReleaseCellRoutine' : [ 0x10, ['pointer64', ['void']]],
    'Allocate' : [ 0x18, ['pointer64', ['void']]],
    'Free' : [ 0x20, ['pointer64', ['void']]],
    'FileSetSize' : [ 0x28, ['pointer64', ['void']]],
    'FileWrite' : [ 0x30, ['pointer64', ['void']]],
    'FileRead' : [ 0x38, ['pointer64', ['void']]],
    'FileFlush' : [ 0x40, ['pointer64', ['void']]],
    'HiveLoadFailure' : [ 0x48, ['pointer64', ['void']]],
    'BaseBlock' : [ 0x50, ['pointer64', ['_HBASE_BLOCK']]],
    'DirtyVector' : [ 0x58, ['_RTL_BITMAP']],
    'DirtyCount' : [ 0x68, ['unsigned long']],
    'DirtyAlloc' : [ 0x6c, ['unsigned long']],
    'BaseBlockAlloc' : [ 0x70, ['unsigned long']],
    'Cluster' : [ 0x74, ['unsigned long']],
    'Flat' : [ 0x78, ['unsigned char']],
    'ReadOnly' : [ 0x79, ['unsigned char']],
    'DirtyFlag' : [ 0x7a, ['unsigned char']],
    'HvBinHeadersUse' : [ 0x7c, ['unsigned long']],
    'HvFreeCellsUse' : [ 0x80, ['unsigned long']],
    'HvUsedCellsUse' : [ 0x84, ['unsigned long']],
    'CmUsedCellsUse' : [ 0x88, ['unsigned long']],
    'HiveFlags' : [ 0x8c, ['unsigned long']],
    'CurrentLog' : [ 0x90, ['unsigned long']],
    'LogSize' : [ 0x94, ['array', 2, ['unsigned long']]],
    'RefreshCount' : [ 0x9c, ['unsigned long']],
    'StorageTypeCount' : [ 0xa0, ['unsigned long']],
    'Version' : [ 0xa4, ['unsigned long']],
    'Storage' : [ 0xa8, ['array', 2, ['_DUAL']]],
} ],
  '_CM_VIEW_OF_FILE' : [ 0x58, {
    'MappedViewLinks' : [ 0x0, ['_LIST_ENTRY']],
    'PinnedViewLinks' : [ 0x10, ['_LIST_ENTRY']],
    'FlushedViewLinks' : [ 0x20, ['_LIST_ENTRY']],
    'CmHive' : [ 0x30, ['pointer64', ['_CMHIVE']]],
    'Bcb' : [ 0x38, ['pointer64', ['void']]],
    'ViewAddress' : [ 0x40, ['pointer64', ['void']]],
    'FileOffset' : [ 0x48, ['unsigned long']],
    'Size' : [ 0x4c, ['unsigned long']],
    'UseCount' : [ 0x50, ['unsigned long']],
} ],
  '_CMHIVE' : [ 0xbe8, {
    'Hive' : [ 0x0, ['_HHIVE']],
    'FileHandles' : [ 0x598, ['array', 6, ['pointer64', ['void']]]],
    'NotifyList' : [ 0x5c8, ['_LIST_ENTRY']],
    'HiveList' : [ 0x5d8, ['_LIST_ENTRY']],
    'PreloadedHiveList' : [ 0x5e8, ['_LIST_ENTRY']],
    'HiveRundown' : [ 0x5f8, ['_EX_RUNDOWN_REF']],
    'ParseCacheEntries' : [ 0x600, ['_LIST_ENTRY']],
    'KcbCacheTable' : [ 0x610, ['pointer64', ['_CM_KEY_HASH_TABLE_ENTRY']]],
    'KcbCacheTableSize' : [ 0x618, ['unsigned long']],
    'Identity' : [ 0x61c, ['unsigned long']],
    'HiveLock' : [ 0x620, ['pointer64', ['_FAST_MUTEX']]],
    'ViewLock' : [ 0x628, ['_EX_PUSH_LOCK']],
    'ViewLockOwner' : [ 0x630, ['pointer64', ['_KTHREAD']]],
    'ViewLockLast' : [ 0x638, ['unsigned long']],
    'ViewUnLockLast' : [ 0x63c, ['unsigned long']],
    'WriterLock' : [ 0x640, ['pointer64', ['_FAST_MUTEX']]],
    'FlusherLock' : [ 0x648, ['pointer64', ['_ERESOURCE']]],
    'FlushDirtyVector' : [ 0x650, ['_RTL_BITMAP']],
    'FlushOffsetArray' : [ 0x660, ['pointer64', ['CMP_OFFSET_ARRAY']]],
    'FlushOffsetArrayCount' : [ 0x668, ['unsigned long']],
    'FlushHiveTruncated' : [ 0x66c, ['unsigned long']],
    'FlushLock2' : [ 0x670, ['pointer64', ['_FAST_MUTEX']]],
    'SecurityLock' : [ 0x678, ['_EX_PUSH_LOCK']],
    'MappedViewList' : [ 0x680, ['_LIST_ENTRY']],
    'PinnedViewList' : [ 0x690, ['_LIST_ENTRY']],
    'FlushedViewList' : [ 0x6a0, ['_LIST_ENTRY']],
    'MappedViewCount' : [ 0x6b0, ['unsigned short']],
    'PinnedViewCount' : [ 0x6b2, ['unsigned short']],
    'UseCount' : [ 0x6b4, ['unsigned long']],
    'ViewsPerHive' : [ 0x6b8, ['unsigned long']],
    'FileObject' : [ 0x6c0, ['pointer64', ['_FILE_OBJECT']]],
    'LastShrinkHiveSize' : [ 0x6c8, ['unsigned long']],
    'ActualFileSize' : [ 0x6d0, ['_LARGE_INTEGER']],
    'FileFullPath' : [ 0x6d8, ['_UNICODE_STRING']],
    'FileUserName' : [ 0x6e8, ['_UNICODE_STRING']],
    'HiveRootPath' : [ 0x6f8, ['_UNICODE_STRING']],
    'SecurityCount' : [ 0x708, ['unsigned long']],
    'SecurityCacheSize' : [ 0x70c, ['unsigned long']],
    'SecurityHitHint' : [ 0x710, ['long']],
    'SecurityCache' : [ 0x718, ['pointer64', ['_CM_KEY_SECURITY_CACHE_ENTRY']]],
    'SecurityHash' : [ 0x720, ['array', 64, ['_LIST_ENTRY']]],
    'UnloadEventCount' : [ 0xb20, ['unsigned long']],
    'UnloadEventArray' : [ 0xb28, ['pointer64', ['pointer64', ['_KEVENT']]]],
    'RootKcb' : [ 0xb30, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
    'Frozen' : [ 0xb38, ['unsigned char']],
    'UnloadWorkItem' : [ 0xb40, ['pointer64', ['_CM_WORKITEM']]],
    'UnloadWorkItemHolder' : [ 0xb48, ['_CM_WORKITEM']],
    'GrowOnlyMode' : [ 0xb70, ['unsigned char']],
    'GrowOffset' : [ 0xb74, ['unsigned long']],
    'KcbConvertListHead' : [ 0xb78, ['_LIST_ENTRY']],
    'KnodeConvertListHead' : [ 0xb88, ['_LIST_ENTRY']],
    'CellRemapArray' : [ 0xb98, ['pointer64', ['_CM_CELL_REMAP_BLOCK']]],
    'Flags' : [ 0xba0, ['unsigned long']],
    'TrustClassEntry' : [ 0xba8, ['_LIST_ENTRY']],
    'FlushCount' : [ 0xbb8, ['unsigned long']],
    'CmRm' : [ 0xbc0, ['pointer64', ['_CM_RM']]],
    'CmRmInitFailPoint' : [ 0xbc8, ['unsigned long']],
    'CmRmInitFailStatus' : [ 0xbcc, ['long']],
    'CreatorOwner' : [ 0xbd0, ['pointer64', ['_KTHREAD']]],
    'RundownThread' : [ 0xbd8, ['pointer64', ['_KTHREAD']]],
    'LastWriteTime' : [ 0xbe0, ['_LARGE_INTEGER']],
} ],
  '_CM_KEY_CONTROL_BLOCK' : [ 0x128, {
    'RefCount' : [ 0x0, ['unsigned long']],
    'ExtFlags' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'PrivateAlloc' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'Delete' : [ 0x4, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HiveUnloaded' : [ 0x4, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'Decommissioned' : [ 0x4, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'LockTablePresent' : [ 0x4, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'TotalLevels' : [ 0x4, ['BitField', dict(start_bit = 21, end_bit = 31, native_type='unsigned long')]],
    'DelayedDeref' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DelayedClose' : [ 0x8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Parking' : [ 0x8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'KeyHash' : [ 0x10, ['_CM_KEY_HASH']],
    'ConvKey' : [ 0x10, ['unsigned long']],
    'NextHash' : [ 0x18, ['pointer64', ['_CM_KEY_HASH']]],
    'KeyHive' : [ 0x20, ['pointer64', ['_HHIVE']]],
    'KeyCell' : [ 0x28, ['unsigned long']],
    'KcbPushlock' : [ 0x30, ['_EX_PUSH_LOCK']],
    'Owner' : [ 0x38, ['pointer64', ['_KTHREAD']]],
    'SharedCount' : [ 0x38, ['long']],
    'SlotHint' : [ 0x40, ['unsigned long']],
    'ParentKcb' : [ 0x48, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
    'NameBlock' : [ 0x50, ['pointer64', ['_CM_NAME_CONTROL_BLOCK']]],
    'CachedSecurity' : [ 0x58, ['pointer64', ['_CM_KEY_SECURITY_CACHE']]],
    'ValueCache' : [ 0x60, ['_CACHED_CHILD_LIST']],
    'IndexHint' : [ 0x70, ['pointer64', ['_CM_INDEX_HINT_BLOCK']]],
    'HashKey' : [ 0x70, ['unsigned long']],
    'SubKeyCount' : [ 0x70, ['unsigned long']],
    'KeyBodyListHead' : [ 0x78, ['_LIST_ENTRY']],
    'FreeListEntry' : [ 0x78, ['_LIST_ENTRY']],
    'KeyBodyArray' : [ 0x88, ['array', 4, ['pointer64', ['_CM_KEY_BODY']]]],
    'KcbLastWriteTime' : [ 0xa8, ['_LARGE_INTEGER']],
    'KcbMaxNameLen' : [ 0xb0, ['unsigned short']],
    'KcbMaxValueNameLen' : [ 0xb2, ['unsigned short']],
    'KcbMaxValueDataLen' : [ 0xb4, ['unsigned long']],
    'KcbUserFlags' : [ 0xb8, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long')]],
    'KcbVirtControlFlags' : [ 0xb8, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned long')]],
    'KcbDebug' : [ 0xb8, ['BitField', dict(start_bit = 8, end_bit = 16, native_type='unsigned long')]],
    'Flags' : [ 0xb8, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
    'RealKeyName' : [ 0xc0, ['pointer64', ['unsigned char']]],
    'KCBUoWListHead' : [ 0xc8, ['_LIST_ENTRY']],
    'DelayQueueEntry' : [ 0xd8, ['_LIST_ENTRY']],
    'Stolen' : [ 0xd8, ['pointer64', ['unsigned char']]],
    'TransKCBOwner' : [ 0xe8, ['pointer64', ['_CM_TRANS']]],
    'KCBLock' : [ 0xf0, ['_CM_INTENT_LOCK']],
    'KeyLock' : [ 0x100, ['_CM_INTENT_LOCK']],
    'TransValueCache' : [ 0x110, ['_CHILD_LIST']],
    'TransValueListOwner' : [ 0x118, ['pointer64', ['_CM_TRANS']]],
    'FullKCBName' : [ 0x120, ['pointer64', ['_UNICODE_STRING']]],
} ],
  '_CM_KEY_HASH_TABLE_ENTRY' : [ 0x18, {
    'Lock' : [ 0x0, ['_EX_PUSH_LOCK']],
    'Owner' : [ 0x8, ['pointer64', ['_KTHREAD']]],
    'Entry' : [ 0x10, ['pointer64', ['_CM_KEY_HASH']]],
} ],
  '__unnamed_1669' : [ 0xc, {
    'Failure' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: '_None', 1: '_CmInitializeHive', 2: '_HvInitializeHive', 3: '_HvpBuildMap', 4: '_HvpBuildMapAndCopy', 5: '_HvpInitMap', 6: '_HvLoadHive', 7: '_HvpReadFileImageAndBuildMap', 8: '_HvpRecoverData', 9: '_HvpRecoverWholeHive', 10: '_HvpMapFileImageAndBuildMap', 11: '_CmpValidateHiveSecurityDescriptors', 12: '_HvpEnlistBinInMap', 13: '_CmCheckRegistry', 14: '_CmRegistryIO', 15: '_CmCheckRegistry2', 16: '_CmpCheckKey', 17: '_CmpCheckValueList', 18: '_HvCheckHive', 19: '_HvCheckBin'})]],
    'Status' : [ 0x4, ['long']],
    'Point' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_166c' : [ 0x18, {
    'Action' : [ 0x0, ['unsigned long']],
    'Handle' : [ 0x8, ['pointer64', ['void']]],
    'Status' : [ 0x10, ['long']],
} ],
  '__unnamed_166e' : [ 0x8, {
    'CheckStack' : [ 0x0, ['pointer64', ['void']]],
} ],
  '__unnamed_1670' : [ 0x20, {
    'Cell' : [ 0x0, ['unsigned long']],
    'CellPoint' : [ 0x8, ['pointer64', ['_CELL_DATA']]],
    'RootPoint' : [ 0x10, ['pointer64', ['void']]],
    'Index' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1672' : [ 0x18, {
    'List' : [ 0x0, ['pointer64', ['_CELL_DATA']]],
    'Index' : [ 0x8, ['unsigned long']],
    'Cell' : [ 0xc, ['unsigned long']],
    'CellPoint' : [ 0x10, ['pointer64', ['_CELL_DATA']]],
} ],
  '__unnamed_1676' : [ 0x10, {
    'Space' : [ 0x0, ['unsigned long']],
    'MapPoint' : [ 0x4, ['unsigned long']],
    'BinPoint' : [ 0x8, ['pointer64', ['_HBIN']]],
} ],
  '__unnamed_167a' : [ 0x10, {
    'Bin' : [ 0x0, ['pointer64', ['_HBIN']]],
    'CellPoint' : [ 0x8, ['pointer64', ['_HCELL']]],
} ],
  '__unnamed_167c' : [ 0x4, {
    'FileOffset' : [ 0x0, ['unsigned long']],
} ],
  '_HIVE_LOAD_FAILURE' : [ 0x160, {
    'Hive' : [ 0x0, ['pointer64', ['_HHIVE']]],
    'Index' : [ 0x8, ['unsigned long']],
    'RecoverableIndex' : [ 0xc, ['unsigned long']],
    'Locations' : [ 0x10, ['array', 8, ['__unnamed_1669']]],
    'RecoverableLocations' : [ 0x70, ['array', 8, ['__unnamed_1669']]],
    'RegistryIO' : [ 0xd0, ['__unnamed_166c']],
    'CheckRegistry2' : [ 0xe8, ['__unnamed_166e']],
    'CheckKey' : [ 0xf0, ['__unnamed_1670']],
    'CheckValueList' : [ 0x110, ['__unnamed_1672']],
    'CheckHive' : [ 0x128, ['__unnamed_1676']],
    'CheckHive1' : [ 0x138, ['__unnamed_1676']],
    'CheckBin' : [ 0x148, ['__unnamed_167a']],
    'RecoverData' : [ 0x158, ['__unnamed_167c']],
} ],
  '_PCW_COUNTER_DESCRIPTOR' : [ 0x8, {
    'Id' : [ 0x0, ['unsigned short']],
    'StructIndex' : [ 0x2, ['unsigned short']],
    'Offset' : [ 0x4, ['unsigned short']],
    'Size' : [ 0x6, ['unsigned short']],
} ],
  '_PCW_REGISTRATION_INFORMATION' : [ 0x30, {
    'Version' : [ 0x0, ['unsigned long']],
    'Name' : [ 0x8, ['pointer64', ['_UNICODE_STRING']]],
    'CounterCount' : [ 0x10, ['unsigned long']],
    'Counters' : [ 0x18, ['pointer64', ['_PCW_COUNTER_DESCRIPTOR']]],
    'Callback' : [ 0x20, ['pointer64', ['void']]],
    'CallbackContext' : [ 0x28, ['pointer64', ['void']]],
} ],
  '_PCW_PROCESSOR_INFO' : [ 0x80, {
    'IdleTime' : [ 0x0, ['unsigned long long']],
    'AvailableTime' : [ 0x8, ['unsigned long long']],
    'UserTime' : [ 0x10, ['unsigned long long']],
    'KernelTime' : [ 0x18, ['unsigned long long']],
    'Interrupts' : [ 0x20, ['unsigned long']],
    'DpcTime' : [ 0x28, ['unsigned long long']],
    'InterruptTime' : [ 0x30, ['unsigned long long']],
    'DpcCount' : [ 0x38, ['unsigned long']],
    'DpcRate' : [ 0x3c, ['unsigned long']],
    'C1Time' : [ 0x40, ['unsigned long long']],
    'C2Time' : [ 0x48, ['unsigned long long']],
    'C3Time' : [ 0x50, ['unsigned long long']],
    'C1Transitions' : [ 0x58, ['unsigned long long']],
    'C2Transitions' : [ 0x60, ['unsigned long long']],
    'C3Transitions' : [ 0x68, ['unsigned long long']],
    'ParkingStatus' : [ 0x70, ['unsigned long']],
    'CurrentFrequency' : [ 0x74, ['unsigned long']],
    'PercentMaxFrequency' : [ 0x78, ['unsigned long']],
    'StateFlags' : [ 0x7c, ['unsigned long']],
} ],
  '_PCW_DATA' : [ 0x10, {
    'Data' : [ 0x0, ['pointer64', ['void']]],
    'Size' : [ 0x8, ['unsigned long']],
} ],
  '_ETW_PERF_COUNTERS' : [ 0x18, {
    'TotalActiveSessions' : [ 0x0, ['long']],
    'TotalBufferMemoryNonPagedPool' : [ 0x4, ['long']],
    'TotalBufferMemoryPagedPool' : [ 0x8, ['long']],
    'TotalGuidsEnabled' : [ 0xc, ['long']],
    'TotalGuidsNotEnabled' : [ 0x10, ['long']],
    'TotalGuidsPreEnabled' : [ 0x14, ['long']],
} ],
  '_ETW_SESSION_PERF_COUNTERS' : [ 0x18, {
    'BufferMemoryPagedPool' : [ 0x0, ['long']],
    'BufferMemoryNonPagedPool' : [ 0x4, ['long']],
    'EventsLoggedCount' : [ 0x8, ['unsigned long long']],
    'EventsLost' : [ 0x10, ['long']],
    'NumConsumers' : [ 0x14, ['long']],
} ],
  '_CONTEXT32_UPDATE' : [ 0x4, {
    'NumberEntries' : [ 0x0, ['unsigned long']],
} ],
  '_KTIMER_TABLE' : [ 0x2200, {
    'TimerExpiry' : [ 0x0, ['array', 64, ['pointer64', ['_KTIMER']]]],
    'TimerEntries' : [ 0x200, ['array', 256, ['_KTIMER_TABLE_ENTRY']]],
} ],
  '_KTIMER_TABLE_ENTRY' : [ 0x20, {
    'Lock' : [ 0x0, ['unsigned long long']],
    'Entry' : [ 0x8, ['_LIST_ENTRY']],
    'Time' : [ 0x18, ['_ULARGE_INTEGER']],
} ],
  '_KAFFINITY_EX' : [ 0x28, {
    'Count' : [ 0x0, ['unsigned short']],
    'Size' : [ 0x2, ['unsigned short']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Bitmap' : [ 0x8, ['array', 4, ['unsigned long long']]],
} ],
  '_KAFFINITY_ENUMERATION_CONTEXT' : [ 0x18, {
    'Affinity' : [ 0x0, ['pointer64', ['_KAFFINITY_EX']]],
    'CurrentMask' : [ 0x8, ['unsigned long long']],
    'CurrentIndex' : [ 0x10, ['unsigned short']],
} ],
  '_GROUP_AFFINITY' : [ 0x10, {
    'Mask' : [ 0x0, ['unsigned long long']],
    'Group' : [ 0x8, ['unsigned short']],
    'Reserved' : [ 0xa, ['array', 3, ['unsigned short']]],
} ],
  '_KTRAP_FRAME' : [ 0x190, {
    'P1Home' : [ 0x0, ['unsigned long long']],
    'P2Home' : [ 0x8, ['unsigned long long']],
    'P3Home' : [ 0x10, ['unsigned long long']],
    'P4Home' : [ 0x18, ['unsigned long long']],
    'P5' : [ 0x20, ['unsigned long long']],
    'PreviousMode' : [ 0x28, ['unsigned char']],
    'PreviousIrql' : [ 0x29, ['unsigned char']],
    'FaultIndicator' : [ 0x2a, ['unsigned char']],
    'ExceptionActive' : [ 0x2b, ['unsigned char']],
    'MxCsr' : [ 0x2c, ['unsigned long']],
    'Rax' : [ 0x30, ['unsigned long long']],
    'Rcx' : [ 0x38, ['unsigned long long']],
    'Rdx' : [ 0x40, ['unsigned long long']],
    'R8' : [ 0x48, ['unsigned long long']],
    'R9' : [ 0x50, ['unsigned long long']],
    'R10' : [ 0x58, ['unsigned long long']],
    'R11' : [ 0x60, ['unsigned long long']],
    'GsBase' : [ 0x68, ['unsigned long long']],
    'GsSwap' : [ 0x68, ['unsigned long long']],
    'Xmm0' : [ 0x70, ['_M128A']],
    'Xmm1' : [ 0x80, ['_M128A']],
    'Xmm2' : [ 0x90, ['_M128A']],
    'Xmm3' : [ 0xa0, ['_M128A']],
    'Xmm4' : [ 0xb0, ['_M128A']],
    'Xmm5' : [ 0xc0, ['_M128A']],
    'FaultAddress' : [ 0xd0, ['unsigned long long']],
    'ContextRecord' : [ 0xd0, ['unsigned long long']],
    'TimeStampCKCL' : [ 0xd0, ['unsigned long long']],
    'Dr0' : [ 0xd8, ['unsigned long long']],
    'Dr1' : [ 0xe0, ['unsigned long long']],
    'Dr2' : [ 0xe8, ['unsigned long long']],
    'Dr3' : [ 0xf0, ['unsigned long long']],
    'Dr6' : [ 0xf8, ['unsigned long long']],
    'Dr7' : [ 0x100, ['unsigned long long']],
    'DebugControl' : [ 0x108, ['unsigned long long']],
    'LastBranchToRip' : [ 0x110, ['unsigned long long']],
    'LastBranchFromRip' : [ 0x118, ['unsigned long long']],
    'LastExceptionToRip' : [ 0x120, ['unsigned long long']],
    'LastExceptionFromRip' : [ 0x128, ['unsigned long long']],
    'LastBranchControl' : [ 0x108, ['unsigned long long']],
    'LastBranchMSR' : [ 0x110, ['unsigned long']],
    'SegDs' : [ 0x130, ['unsigned short']],
    'SegEs' : [ 0x132, ['unsigned short']],
    'SegFs' : [ 0x134, ['unsigned short']],
    'SegGs' : [ 0x136, ['unsigned short']],
    'TrapFrame' : [ 0x138, ['unsigned long long']],
    'Rbx' : [ 0x140, ['unsigned long long']],
    'Rdi' : [ 0x148, ['unsigned long long']],
    'Rsi' : [ 0x150, ['unsigned long long']],
    'Rbp' : [ 0x158, ['unsigned long long']],
    'ErrorCode' : [ 0x160, ['unsigned long long']],
    'ExceptionFrame' : [ 0x160, ['unsigned long long']],
    'TimeStampKlog' : [ 0x160, ['unsigned long long']],
    'Rip' : [ 0x168, ['unsigned long long']],
    'SegCs' : [ 0x170, ['unsigned short']],
    'Fill0' : [ 0x172, ['unsigned char']],
    'Logging' : [ 0x173, ['unsigned char']],
    'Fill1' : [ 0x174, ['array', 2, ['unsigned short']]],
    'EFlags' : [ 0x178, ['unsigned long']],
    'Fill2' : [ 0x17c, ['unsigned long']],
    'Rsp' : [ 0x180, ['unsigned long long']],
    'SegSs' : [ 0x188, ['unsigned short']],
    'Fill3' : [ 0x18a, ['unsigned short']],
    'CodePatchCycle' : [ 0x18c, ['long']],
} ],
  '_XSTATE_SAVE' : [ 0x38, {
    'Prev' : [ 0x0, ['pointer64', ['_XSTATE_SAVE']]],
    'Thread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
    'Level' : [ 0x10, ['unsigned char']],
    'XStateContext' : [ 0x18, ['_XSTATE_CONTEXT']],
} ],
  '_XSAVE_AREA' : [ 0x240, {
    'LegacyState' : [ 0x0, ['_XSAVE_FORMAT']],
    'Header' : [ 0x200, ['_XSAVE_AREA_HEADER']],
} ],
  '_KEXCEPTION_FRAME' : [ 0x140, {
    'P1Home' : [ 0x0, ['unsigned long long']],
    'P2Home' : [ 0x8, ['unsigned long long']],
    'P3Home' : [ 0x10, ['unsigned long long']],
    'P4Home' : [ 0x18, ['unsigned long long']],
    'P5' : [ 0x20, ['unsigned long long']],
    'InitialStack' : [ 0x28, ['unsigned long long']],
    'Xmm6' : [ 0x30, ['_M128A']],
    'Xmm7' : [ 0x40, ['_M128A']],
    'Xmm8' : [ 0x50, ['_M128A']],
    'Xmm9' : [ 0x60, ['_M128A']],
    'Xmm10' : [ 0x70, ['_M128A']],
    'Xmm11' : [ 0x80, ['_M128A']],
    'Xmm12' : [ 0x90, ['_M128A']],
    'Xmm13' : [ 0xa0, ['_M128A']],
    'Xmm14' : [ 0xb0, ['_M128A']],
    'Xmm15' : [ 0xc0, ['_M128A']],
    'TrapFrame' : [ 0xd0, ['unsigned long long']],
    'CallbackStack' : [ 0xd8, ['unsigned long long']],
    'OutputBuffer' : [ 0xe0, ['unsigned long long']],
    'OutputLength' : [ 0xe8, ['unsigned long long']],
    'MxCsr' : [ 0xf0, ['unsigned long long']],
    'Rbp' : [ 0xf8, ['unsigned long long']],
    'Rbx' : [ 0x100, ['unsigned long long']],
    'Rdi' : [ 0x108, ['unsigned long long']],
    'Rsi' : [ 0x110, ['unsigned long long']],
    'R12' : [ 0x118, ['unsigned long long']],
    'R13' : [ 0x120, ['unsigned long long']],
    'R14' : [ 0x128, ['unsigned long long']],
    'R15' : [ 0x130, ['unsigned long long']],
    'Return' : [ 0x138, ['unsigned long long']],
} ],
  '_PNP_DEVICE_COMPLETION_QUEUE' : [ 0x50, {
    'DispatchedList' : [ 0x0, ['_LIST_ENTRY']],
    'DispatchedCount' : [ 0x10, ['unsigned long']],
    'CompletedList' : [ 0x18, ['_LIST_ENTRY']],
    'CompletedSemaphore' : [ 0x28, ['_KSEMAPHORE']],
    'SpinLock' : [ 0x48, ['unsigned long long']],
} ],
  '_KSEMAPHORE' : [ 0x20, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'Limit' : [ 0x18, ['long']],
} ],
  '_DEVOBJ_EXTENSION' : [ 0x70, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'PowerFlags' : [ 0x10, ['unsigned long']],
    'Dope' : [ 0x18, ['pointer64', ['_DEVICE_OBJECT_POWER_EXTENSION']]],
    'ExtensionFlags' : [ 0x20, ['unsigned long']],
    'DeviceNode' : [ 0x28, ['pointer64', ['void']]],
    'AttachedTo' : [ 0x30, ['pointer64', ['_DEVICE_OBJECT']]],
    'StartIoCount' : [ 0x38, ['long']],
    'StartIoKey' : [ 0x3c, ['long']],
    'StartIoFlags' : [ 0x40, ['unsigned long']],
    'Vpb' : [ 0x48, ['pointer64', ['_VPB']]],
    'DependentList' : [ 0x50, ['_LIST_ENTRY']],
    'ProviderList' : [ 0x60, ['_LIST_ENTRY']],
} ],
  '__unnamed_1763' : [ 0x8, {
    'LegacyDeviceNode' : [ 0x0, ['pointer64', ['_DEVICE_NODE']]],
    'PendingDeviceRelations' : [ 0x0, ['pointer64', ['_DEVICE_RELATIONS']]],
    'Information' : [ 0x0, ['pointer64', ['void']]],
} ],
  '__unnamed_1765' : [ 0x8, {
    'NextResourceDeviceNode' : [ 0x0, ['pointer64', ['_DEVICE_NODE']]],
} ],
  '__unnamed_1769' : [ 0x20, {
    'DockStatus' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'DOCK_NOTDOCKDEVICE', 1: 'DOCK_QUIESCENT', 2: 'DOCK_ARRIVING', 3: 'DOCK_DEPARTING', 4: 'DOCK_EJECTIRP_COMPLETED'})]],
    'ListEntry' : [ 0x8, ['_LIST_ENTRY']],
    'SerialNumber' : [ 0x18, ['pointer64', ['unsigned short']]],
} ],
  '_DEVICE_NODE' : [ 0x268, {
    'Sibling' : [ 0x0, ['pointer64', ['_DEVICE_NODE']]],
    'Child' : [ 0x8, ['pointer64', ['_DEVICE_NODE']]],
    'Parent' : [ 0x10, ['pointer64', ['_DEVICE_NODE']]],
    'LastChild' : [ 0x18, ['pointer64', ['_DEVICE_NODE']]],
    'PhysicalDeviceObject' : [ 0x20, ['pointer64', ['_DEVICE_OBJECT']]],
    'InstancePath' : [ 0x28, ['_UNICODE_STRING']],
    'ServiceName' : [ 0x38, ['_UNICODE_STRING']],
    'PendingIrp' : [ 0x48, ['pointer64', ['_IRP']]],
    'Level' : [ 0x50, ['unsigned long']],
    'Notify' : [ 0x58, ['_PO_DEVICE_NOTIFY']],
    'PoIrpManager' : [ 0xc0, ['_PO_IRP_MANAGER']],
    'State' : [ 0xe0, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]],
    'PreviousState' : [ 0xe4, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]],
    'StateHistory' : [ 0xe8, ['array', -80, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]]],
    'StateHistoryEntry' : [ 0x138, ['unsigned long']],
    'CompletionStatus' : [ 0x13c, ['long']],
    'Flags' : [ 0x140, ['unsigned long']],
    'UserFlags' : [ 0x144, ['unsigned long']],
    'Problem' : [ 0x148, ['unsigned long']],
    'ResourceList' : [ 0x150, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'ResourceListTranslated' : [ 0x158, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'DuplicatePDO' : [ 0x160, ['pointer64', ['_DEVICE_OBJECT']]],
    'ResourceRequirements' : [ 0x168, ['pointer64', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'InterfaceType' : [ 0x170, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x174, ['unsigned long']],
    'ChildInterfaceType' : [ 0x178, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'ChildBusNumber' : [ 0x17c, ['unsigned long']],
    'ChildBusTypeIndex' : [ 0x180, ['unsigned short']],
    'RemovalPolicy' : [ 0x182, ['unsigned char']],
    'HardwareRemovalPolicy' : [ 0x183, ['unsigned char']],
    'TargetDeviceNotify' : [ 0x188, ['_LIST_ENTRY']],
    'DeviceArbiterList' : [ 0x198, ['_LIST_ENTRY']],
    'DeviceTranslatorList' : [ 0x1a8, ['_LIST_ENTRY']],
    'NoTranslatorMask' : [ 0x1b8, ['unsigned short']],
    'QueryTranslatorMask' : [ 0x1ba, ['unsigned short']],
    'NoArbiterMask' : [ 0x1bc, ['unsigned short']],
    'QueryArbiterMask' : [ 0x1be, ['unsigned short']],
    'OverUsed1' : [ 0x1c0, ['__unnamed_1763']],
    'OverUsed2' : [ 0x1c8, ['__unnamed_1765']],
    'BootResources' : [ 0x1d0, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'BootResourcesTranslated' : [ 0x1d8, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'CapabilityFlags' : [ 0x1e0, ['unsigned long']],
    'DockInfo' : [ 0x1e8, ['__unnamed_1769']],
    'DisableableDepends' : [ 0x208, ['unsigned long']],
    'PendedSetInterfaceState' : [ 0x210, ['_LIST_ENTRY']],
    'LegacyBusListEntry' : [ 0x220, ['_LIST_ENTRY']],
    'DriverUnloadRetryCount' : [ 0x230, ['unsigned long']],
    'PreviousParent' : [ 0x238, ['pointer64', ['_DEVICE_NODE']]],
    'DeletedChildren' : [ 0x240, ['unsigned long']],
    'NumaNodeIndex' : [ 0x244, ['unsigned long']],
    'ContainerID' : [ 0x248, ['_GUID']],
    'OverrideFlags' : [ 0x258, ['unsigned char']],
    'RequiresUnloadedDriver' : [ 0x259, ['unsigned char']],
    'PendingEjectRelations' : [ 0x260, ['pointer64', ['_PENDING_RELATIONS_LIST_ENTRY']]],
} ],
  '_KNODE' : [ 0xc0, {
    'PagedPoolSListHead' : [ 0x0, ['_SLIST_HEADER']],
    'NonPagedPoolSListHead' : [ 0x10, ['array', 3, ['_SLIST_HEADER']]],
    'Affinity' : [ 0x40, ['_GROUP_AFFINITY']],
    'ProximityId' : [ 0x50, ['unsigned long']],
    'NodeNumber' : [ 0x54, ['unsigned short']],
    'PrimaryNodeNumber' : [ 0x56, ['unsigned short']],
    'MaximumProcessors' : [ 0x58, ['unsigned char']],
    'Color' : [ 0x59, ['unsigned char']],
    'Flags' : [ 0x5a, ['_flags']],
    'NodePad0' : [ 0x5b, ['unsigned char']],
    'Seed' : [ 0x5c, ['unsigned long']],
    'MmShiftedColor' : [ 0x60, ['unsigned long']],
    'FreeCount' : [ 0x68, ['array', 2, ['unsigned long long']]],
    'Right' : [ 0x78, ['unsigned long']],
    'Left' : [ 0x7c, ['unsigned long']],
    'CachedKernelStacks' : [ 0x80, ['_CACHED_KSTACK_LIST']],
    'ParkLock' : [ 0xa0, ['long']],
    'NodePad1' : [ 0xa4, ['unsigned long']],
} ],
  '_PNP_ASSIGN_RESOURCES_CONTEXT' : [ 0x10, {
    'IncludeFailedDevices' : [ 0x0, ['unsigned long']],
    'DeviceCount' : [ 0x4, ['unsigned long']],
    'DeviceList' : [ 0x8, ['array', 1, ['pointer64', ['_DEVICE_OBJECT']]]],
} ],
  '_PNP_RESOURCE_REQUEST' : [ 0x40, {
    'PhysicalDevice' : [ 0x0, ['pointer64', ['_DEVICE_OBJECT']]],
    'Flags' : [ 0x8, ['unsigned long']],
    'AllocationType' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: 'ArbiterRequestLegacyReported', 1: 'ArbiterRequestHalReported', 2: 'ArbiterRequestLegacyAssigned', 3: 'ArbiterRequestPnpDetected', 4: 'ArbiterRequestPnpEnumerated', -1: 'ArbiterRequestUndefined'})]],
    'Priority' : [ 0x10, ['unsigned long']],
    'Position' : [ 0x14, ['unsigned long']],
    'ResourceRequirements' : [ 0x18, ['pointer64', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'ReqList' : [ 0x20, ['pointer64', ['void']]],
    'ResourceAssignment' : [ 0x28, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'TranslatedResourceAssignment' : [ 0x30, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'Status' : [ 0x38, ['long']],
} ],
  '_IO_RESOURCE_REQUIREMENTS_LIST' : [ 0x48, {
    'ListSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'SlotNumber' : [ 0xc, ['unsigned long']],
    'Reserved' : [ 0x10, ['array', 3, ['unsigned long']]],
    'AlternativeLists' : [ 0x1c, ['unsigned long']],
    'List' : [ 0x20, ['array', 1, ['_IO_RESOURCE_LIST']]],
} ],
  '_EXCEPTION_RECORD64' : [ 0x98, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['unsigned long long']],
    'ExceptionAddress' : [ 0x10, ['unsigned long long']],
    'NumberParameters' : [ 0x18, ['unsigned long']],
    '__unusedAlignment' : [ 0x1c, ['unsigned long']],
    'ExceptionInformation' : [ 0x20, ['array', 15, ['unsigned long long']]],
} ],
  '_EXCEPTION_RECORD32' : [ 0x50, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['unsigned long']],
    'ExceptionAddress' : [ 0xc, ['unsigned long']],
    'NumberParameters' : [ 0x10, ['unsigned long']],
    'ExceptionInformation' : [ 0x14, ['array', 15, ['unsigned long']]],
} ],
  '_DBGKM_EXCEPTION64' : [ 0xa0, {
    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD64']],
    'FirstChance' : [ 0x98, ['unsigned long']],
} ],
  '_DBGKM_EXCEPTION32' : [ 0x54, {
    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD32']],
    'FirstChance' : [ 0x50, ['unsigned long']],
} ],
  '_DBGKD_LOAD_SYMBOLS64' : [ 0x28, {
    'PathNameLength' : [ 0x0, ['unsigned long']],
    'BaseOfDll' : [ 0x8, ['unsigned long long']],
    'ProcessId' : [ 0x10, ['unsigned long long']],
    'CheckSum' : [ 0x18, ['unsigned long']],
    'SizeOfImage' : [ 0x1c, ['unsigned long']],
    'UnloadSymbols' : [ 0x20, ['unsigned char']],
} ],
  '_DBGKD_LOAD_SYMBOLS32' : [ 0x18, {
    'PathNameLength' : [ 0x0, ['unsigned long']],
    'BaseOfDll' : [ 0x4, ['unsigned long']],
    'ProcessId' : [ 0x8, ['unsigned long']],
    'CheckSum' : [ 0xc, ['unsigned long']],
    'SizeOfImage' : [ 0x10, ['unsigned long']],
    'UnloadSymbols' : [ 0x14, ['unsigned char']],
} ],
  '_DBGKD_READ_MEMORY64' : [ 0x10, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
    'TransferCount' : [ 0x8, ['unsigned long']],
    'ActualBytesRead' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_READ_MEMORY32' : [ 0xc, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
    'TransferCount' : [ 0x4, ['unsigned long']],
    'ActualBytesRead' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_MEMORY64' : [ 0x10, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
    'TransferCount' : [ 0x8, ['unsigned long']],
    'ActualBytesWritten' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_WRITE_MEMORY32' : [ 0xc, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
    'TransferCount' : [ 0x4, ['unsigned long']],
    'ActualBytesWritten' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_BREAKPOINT64' : [ 0x10, {
    'BreakPointAddress' : [ 0x0, ['unsigned long long']],
    'BreakPointHandle' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_BREAKPOINT32' : [ 0x8, {
    'BreakPointAddress' : [ 0x0, ['unsigned long']],
    'BreakPointHandle' : [ 0x4, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO64' : [ 0x10, {
    'IoAddress' : [ 0x0, ['unsigned long long']],
    'DataSize' : [ 0x8, ['unsigned long']],
    'DataValue' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO32' : [ 0xc, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'IoAddress' : [ 0x4, ['unsigned long']],
    'DataValue' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO_EXTENDED64' : [ 0x20, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['unsigned long']],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'AddressSpace' : [ 0xc, ['unsigned long']],
    'IoAddress' : [ 0x10, ['unsigned long long']],
    'DataValue' : [ 0x18, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO_EXTENDED32' : [ 0x18, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['unsigned long']],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'AddressSpace' : [ 0xc, ['unsigned long']],
    'IoAddress' : [ 0x10, ['unsigned long']],
    'DataValue' : [ 0x14, ['unsigned long']],
} ],
  '_DBGKD_SET_SPECIAL_CALL32' : [ 0x4, {
    'SpecialCall' : [ 0x0, ['unsigned long']],
} ],
  '_DBGKD_SET_SPECIAL_CALL64' : [ 0x8, {
    'SpecialCall' : [ 0x0, ['unsigned long long']],
} ],
  '_DBGKD_SET_INTERNAL_BREAKPOINT32' : [ 0x8, {
    'BreakpointAddress' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
} ],
  '_DBGKD_SET_INTERNAL_BREAKPOINT64' : [ 0x10, {
    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_GET_INTERNAL_BREAKPOINT64' : [ 0x20, {
    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x8, ['unsigned long']],
    'Calls' : [ 0xc, ['unsigned long']],
    'MaxCallsPerPeriod' : [ 0x10, ['unsigned long']],
    'MinInstructions' : [ 0x14, ['unsigned long']],
    'MaxInstructions' : [ 0x18, ['unsigned long']],
    'TotalInstructions' : [ 0x1c, ['unsigned long']],
} ],
  '_DBGKD_GET_INTERNAL_BREAKPOINT32' : [ 0x1c, {
    'BreakpointAddress' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'Calls' : [ 0x8, ['unsigned long']],
    'MaxCallsPerPeriod' : [ 0xc, ['unsigned long']],
    'MinInstructions' : [ 0x10, ['unsigned long']],
    'MaxInstructions' : [ 0x14, ['unsigned long']],
    'TotalInstructions' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1811' : [ 0x28, {
    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT64']],
    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
