ntkrnlmp_types = {
  'LIST_ENTRY64' : [ 0x10, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'Blink' : [ 0x8, ['unsigned long long']],
} ],
  'LIST_ENTRY32' : [ 0x8, {
    'Flink' : [ 0x0, ['unsigned long']],
    'Blink' : [ 0x4, ['unsigned long']],
} ],
  '_KUSER_SHARED_DATA' : [ 0x5f0, {
    'TickCountLowDeprecated' : [ 0x0, ['unsigned long']],
    'TickCountMultiplier' : [ 0x4, ['unsigned long']],
    'InterruptTime' : [ 0x8, ['_KSYSTEM_TIME']],
    'SystemTime' : [ 0x14, ['_KSYSTEM_TIME']],
    'TimeZoneBias' : [ 0x20, ['_KSYSTEM_TIME']],
    'ImageNumberLow' : [ 0x2c, ['unsigned short']],
    'ImageNumberHigh' : [ 0x2e, ['unsigned short']],
    'NtSystemRoot' : [ 0x30, ['array', 260, ['wchar']]],
    'MaxStackTraceDepth' : [ 0x238, ['unsigned long']],
    'CryptoExponent' : [ 0x23c, ['unsigned long']],
    'TimeZoneId' : [ 0x240, ['unsigned long']],
    'LargePageMinimum' : [ 0x244, ['unsigned long']],
    'AitSamplingValue' : [ 0x248, ['unsigned long']],
    'AppCompatFlag' : [ 0x24c, ['unsigned long']],
    'RNGSeedVersion' : [ 0x250, ['unsigned long long']],
    'GlobalValidationRunlevel' : [ 0x258, ['unsigned long']],
    'TimeZoneBiasStamp' : [ 0x25c, ['long']],
    'Reserved2' : [ 0x260, ['unsigned long']],
    'NtProductType' : [ 0x264, ['Enumeration', dict(target = 'long', choices = {1: 'NtProductWinNt', 2: 'NtProductLanManNt', 3: 'NtProductServer'})]],
    'ProductTypeIsValid' : [ 0x268, ['unsigned char']],
    'Reserved0' : [ 0x269, ['array', 1, ['unsigned char']]],
    'NativeProcessorArchitecture' : [ 0x26a, ['unsigned short']],
    'NtMajorVersion' : [ 0x26c, ['unsigned long']],
    'NtMinorVersion' : [ 0x270, ['unsigned long']],
    'ProcessorFeatures' : [ 0x274, ['array', 64, ['unsigned char']]],
    'Reserved1' : [ 0x2b4, ['unsigned long']],
    'Reserved3' : [ 0x2b8, ['unsigned long']],
    'TimeSlip' : [ 0x2bc, ['unsigned long']],
    'AlternativeArchitecture' : [ 0x2c0, ['Enumeration', dict(target = 'long', choices = {0: 'StandardDesign', 1: 'NEC98x86', 2: 'EndAlternatives'})]],
    'AltArchitecturePad' : [ 0x2c4, ['array', 1, ['unsigned long']]],
    'SystemExpirationDate' : [ 0x2c8, ['_LARGE_INTEGER']],
    'SuiteMask' : [ 0x2d0, ['unsigned long']],
    'KdDebuggerEnabled' : [ 0x2d4, ['unsigned char']],
    'MitigationPolicies' : [ 0x2d5, ['unsigned char']],
    'NXSupportPolicy' : [ 0x2d5, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'SEHValidationPolicy' : [ 0x2d5, ['BitField', dict(start_bit = 2, end_bit = 4, native_type='unsigned char')]],
    'CurDirDevicesSkippedForDlls' : [ 0x2d5, ['BitField', dict(start_bit = 4, end_bit = 6, native_type='unsigned char')]],
    'Reserved' : [ 0x2d5, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'Reserved6' : [ 0x2d6, ['array', 2, ['unsigned char']]],
    'ActiveConsoleId' : [ 0x2d8, ['unsigned long']],
    'DismountCount' : [ 0x2dc, ['unsigned long']],
    'ComPlusPackage' : [ 0x2e0, ['unsigned long']],
    'LastSystemRITEventTickCount' : [ 0x2e4, ['unsigned long']],
    'NumberOfPhysicalPages' : [ 0x2e8, ['unsigned long']],
    'SafeBootMode' : [ 0x2ec, ['unsigned char']],
    'Reserved12' : [ 0x2ed, ['array', 3, ['unsigned char']]],
    'SharedDataFlags' : [ 0x2f0, ['unsigned long']],
    'DbgErrorPortPresent' : [ 0x2f0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DbgElevationEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DbgVirtEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DbgInstallerDetectEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DbgLkgEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DbgDynProcessorEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DbgConsoleBrokerEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DbgSecureBootEnabled' : [ 0x2f0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'SpareBits' : [ 0x2f0, ['BitField', dict(start_bit = 8, end_bit = 32, native_type='unsigned long')]],
    'DataFlagsPad' : [ 0x2f4, ['array', 1, ['unsigned long']]],
    'TestRetInstruction' : [ 0x2f8, ['unsigned long long']],
    'QpcFrequency' : [ 0x300, ['long long']],
    'SystemCallPad' : [ 0x308, ['array', 3, ['unsigned long long']]],
    'TickCount' : [ 0x320, ['_KSYSTEM_TIME']],
    'TickCountQuad' : [ 0x320, ['unsigned long long']],
    'ReservedTickCountOverlay' : [ 0x320, ['array', 3, ['unsigned long']]],
    'TickCountPad' : [ 0x32c, ['array', 1, ['unsigned long']]],
    'Cookie' : [ 0x330, ['unsigned long']],
    'CookiePad' : [ 0x334, ['array', 1, ['unsigned long']]],
    'ConsoleSessionForegroundProcessId' : [ 0x338, ['long long']],
    'TimeUpdateLock' : [ 0x340, ['unsigned long long']],
    'BaselineSystemTimeQpc' : [ 0x348, ['unsigned long long']],
    'BaselineInterruptTimeQpc' : [ 0x350, ['unsigned long long']],
    'QpcSystemTimeIncrement' : [ 0x358, ['unsigned long long']],
    'QpcInterruptTimeIncrement' : [ 0x360, ['unsigned long long']],
    'QpcSystemTimeIncrement32' : [ 0x368, ['unsigned long']],
    'QpcInterruptTimeIncrement32' : [ 0x36c, ['unsigned long']],
    'QpcSystemTimeIncrementShift' : [ 0x370, ['unsigned char']],
    'QpcInterruptTimeIncrementShift' : [ 0x371, ['unsigned char']],
    'UnparkedProcessorCount' : [ 0x372, ['unsigned short']],
    'Reserved8' : [ 0x374, ['array', 12, ['unsigned char']]],
    'UserModeGlobalLogger' : [ 0x380, ['array', 16, ['unsigned short']]],
    'ImageFileExecutionOptions' : [ 0x3a0, ['unsigned long']],
    'LangGenerationCount' : [ 0x3a4, ['unsigned long']],
    'Reserved4' : [ 0x3a8, ['unsigned long long']],
    'InterruptTimeBias' : [ 0x3b0, ['unsigned long long']],
    'QpcBias' : [ 0x3b8, ['unsigned long long']],
    'ActiveProcessorCount' : [ 0x3c0, ['unsigned long']],
    'ActiveGroupCount' : [ 0x3c4, ['unsigned char']],
    'Reserved9' : [ 0x3c5, ['unsigned char']],
    'QpcData' : [ 0x3c6, ['unsigned short']],
    'QpcBypassEnabled' : [ 0x3c6, ['unsigned char']],
    'QpcShift' : [ 0x3c7, ['unsigned char']],
    'TimeZoneBiasEffectiveStart' : [ 0x3c8, ['_LARGE_INTEGER']],
    'TimeZoneBiasEffectiveEnd' : [ 0x3d0, ['_LARGE_INTEGER']],
    'XState' : [ 0x3d8, ['_XSTATE_CONFIGURATION']],
} ],
  '__unnamed_107f' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
} ],
  '_ULARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['unsigned long']],
    'u' : [ 0x0, ['__unnamed_107f']],
    'QuadPart' : [ 0x0, ['unsigned long long']],
} ],
  '__unnamed_1083' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_LARGE_INTEGER' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
    'u' : [ 0x0, ['__unnamed_1083']],
    'QuadPart' : [ 0x0, ['long long']],
} ],
  '__unnamed_109b' : [ 0x4, {
    'LongFunction' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Persistent' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'Private' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 32, native_type='unsigned long')]],
} ],
  '__unnamed_109d' : [ 0x4, {
    'Flags' : [ 0x0, ['unsigned long']],
    's' : [ 0x0, ['__unnamed_109b']],
} ],
  '_TP_CALLBACK_ENVIRON_V3' : [ 0x48, {
    'Version' : [ 0x0, ['unsigned long']],
    'Pool' : [ 0x8, ['pointer64', ['_TP_POOL']]],
    'CleanupGroup' : [ 0x10, ['pointer64', ['_TP_CLEANUP_GROUP']]],
    'CleanupGroupCancelCallback' : [ 0x18, ['pointer64', ['void']]],
    'RaceDll' : [ 0x20, ['pointer64', ['void']]],
    'ActivationContext' : [ 0x28, ['pointer64', ['_ACTIVATION_CONTEXT']]],
    'FinalizationCallback' : [ 0x30, ['pointer64', ['void']]],
    'u' : [ 0x38, ['__unnamed_109d']],
    'CallbackPriority' : [ 0x3c, ['Enumeration', dict(target = 'long', choices = {0: 'TP_CALLBACK_PRIORITY_HIGH', 1: 'TP_CALLBACK_PRIORITY_NORMAL', 2: 'TP_CALLBACK_PRIORITY_LOW', 3: 'TP_CALLBACK_PRIORITY_COUNT'})]],
    'Size' : [ 0x40, ['unsigned long']],
} ],
  '_TEB' : [ 0x1820, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'EnvironmentPointer' : [ 0x38, ['pointer64', ['void']]],
    'ClientId' : [ 0x40, ['_CLIENT_ID']],
    'ActiveRpcHandle' : [ 0x50, ['pointer64', ['void']]],
    'ThreadLocalStoragePointer' : [ 0x58, ['pointer64', ['void']]],
    'ProcessEnvironmentBlock' : [ 0x60, ['pointer64', ['_PEB']]],
    'LastErrorValue' : [ 0x68, ['unsigned long']],
    'CountOfOwnedCriticalSections' : [ 0x6c, ['unsigned long']],
    'CsrClientThread' : [ 0x70, ['pointer64', ['void']]],
    'Win32ThreadInfo' : [ 0x78, ['pointer64', ['void']]],
    'User32Reserved' : [ 0x80, ['array', 26, ['unsigned long']]],
    'UserReserved' : [ 0xe8, ['array', 5, ['unsigned long']]],
    'WOW32Reserved' : [ 0x100, ['pointer64', ['void']]],
    'CurrentLocale' : [ 0x108, ['unsigned long']],
    'FpSoftwareStatusRegister' : [ 0x10c, ['unsigned long']],
    'SystemReserved1' : [ 0x110, ['array', 54, ['pointer64', ['void']]]],
    'ExceptionCode' : [ 0x2c0, ['long']],
    'Padding0' : [ 0x2c4, ['array', 4, ['unsigned char']]],
    'ActivationContextStackPointer' : [ 0x2c8, ['pointer64', ['_ACTIVATION_CONTEXT_STACK']]],
    'SpareBytes' : [ 0x2d0, ['array', 24, ['unsigned char']]],
    'TxFsContext' : [ 0x2e8, ['unsigned long']],
    'Padding1' : [ 0x2ec, ['array', 4, ['unsigned char']]],
    'GdiTebBatch' : [ 0x2f0, ['_GDI_TEB_BATCH']],
    'RealClientId' : [ 0x7d8, ['_CLIENT_ID']],
    'GdiCachedProcessHandle' : [ 0x7e8, ['pointer64', ['void']]],
    'GdiClientPID' : [ 0x7f0, ['unsigned long']],
    'GdiClientTID' : [ 0x7f4, ['unsigned long']],
    'GdiThreadLocalInfo' : [ 0x7f8, ['pointer64', ['void']]],
    'Win32ClientInfo' : [ 0x800, ['array', 62, ['unsigned long long']]],
    'glDispatchTable' : [ 0x9f0, ['array', 233, ['pointer64', ['void']]]],
    'glReserved1' : [ 0x1138, ['array', 29, ['unsigned long long']]],
    'glReserved2' : [ 0x1220, ['pointer64', ['void']]],
    'glSectionInfo' : [ 0x1228, ['pointer64', ['void']]],
    'glSection' : [ 0x1230, ['pointer64', ['void']]],
    'glTable' : [ 0x1238, ['pointer64', ['void']]],
    'glCurrentRC' : [ 0x1240, ['pointer64', ['void']]],
    'glContext' : [ 0x1248, ['pointer64', ['void']]],
    'LastStatusValue' : [ 0x1250, ['unsigned long']],
    'Padding2' : [ 0x1254, ['array', 4, ['unsigned char']]],
    'StaticUnicodeString' : [ 0x1258, ['_UNICODE_STRING']],
    'StaticUnicodeBuffer' : [ 0x1268, ['array', 261, ['wchar']]],
    'Padding3' : [ 0x1472, ['array', 6, ['unsigned char']]],
    'DeallocationStack' : [ 0x1478, ['pointer64', ['void']]],
    'TlsSlots' : [ 0x1480, ['array', 64, ['pointer64', ['void']]]],
    'TlsLinks' : [ 0x1680, ['_LIST_ENTRY']],
    'Vdm' : [ 0x1690, ['pointer64', ['void']]],
    'ReservedForNtRpc' : [ 0x1698, ['pointer64', ['void']]],
    'DbgSsReserved' : [ 0x16a0, ['array', 2, ['pointer64', ['void']]]],
    'HardErrorMode' : [ 0x16b0, ['unsigned long']],
    'Padding4' : [ 0x16b4, ['array', 4, ['unsigned char']]],
    'Instrumentation' : [ 0x16b8, ['array', 11, ['pointer64', ['void']]]],
    'ActivityId' : [ 0x1710, ['_GUID']],
    'SubProcessTag' : [ 0x1720, ['pointer64', ['void']]],
    'PerflibData' : [ 0x1728, ['pointer64', ['void']]],
    'EtwTraceData' : [ 0x1730, ['pointer64', ['void']]],
    'WinSockData' : [ 0x1738, ['pointer64', ['void']]],
    'GdiBatchCount' : [ 0x1740, ['unsigned long']],
    'CurrentIdealProcessor' : [ 0x1744, ['_PROCESSOR_NUMBER']],
    'IdealProcessorValue' : [ 0x1744, ['unsigned long']],
    'ReservedPad0' : [ 0x1744, ['unsigned char']],
    'ReservedPad1' : [ 0x1745, ['unsigned char']],
    'ReservedPad2' : [ 0x1746, ['unsigned char']],
    'IdealProcessor' : [ 0x1747, ['unsigned char']],
    'GuaranteedStackBytes' : [ 0x1748, ['unsigned long']],
    'Padding5' : [ 0x174c, ['array', 4, ['unsigned char']]],
    'ReservedForPerf' : [ 0x1750, ['pointer64', ['void']]],
    'ReservedForOle' : [ 0x1758, ['pointer64', ['void']]],
    'WaitingOnLoaderLock' : [ 0x1760, ['unsigned long']],
    'Padding6' : [ 0x1764, ['array', 4, ['unsigned char']]],
    'SavedPriorityState' : [ 0x1768, ['pointer64', ['void']]],
    'ReservedForCodeCoverage' : [ 0x1770, ['unsigned long long']],
    'ThreadPoolData' : [ 0x1778, ['pointer64', ['void']]],
    'TlsExpansionSlots' : [ 0x1780, ['pointer64', ['pointer64', ['void']]]],
    'DeallocationBStore' : [ 0x1788, ['pointer64', ['void']]],
    'BStoreLimit' : [ 0x1790, ['pointer64', ['void']]],
    'MuiGeneration' : [ 0x1798, ['unsigned long']],
    'IsImpersonating' : [ 0x179c, ['unsigned long']],
    'NlsCache' : [ 0x17a0, ['pointer64', ['void']]],
    'pShimData' : [ 0x17a8, ['pointer64', ['void']]],
    'HeapVirtualAffinity' : [ 0x17b0, ['unsigned short']],
    'LowFragHeapDataSlot' : [ 0x17b2, ['unsigned short']],
    'Padding7' : [ 0x17b4, ['array', 4, ['unsigned char']]],
    'CurrentTransactionHandle' : [ 0x17b8, ['pointer64', ['void']]],
    'ActiveFrame' : [ 0x17c0, ['pointer64', ['_TEB_ACTIVE_FRAME']]],
    'FlsData' : [ 0x17c8, ['pointer64', ['void']]],
    'PreferredLanguages' : [ 0x17d0, ['pointer64', ['void']]],
    'UserPrefLanguages' : [ 0x17d8, ['pointer64', ['void']]],
    'MergedPrefLanguages' : [ 0x17e0, ['pointer64', ['void']]],
    'MuiImpersonation' : [ 0x17e8, ['unsigned long']],
    'CrossTebFlags' : [ 0x17ec, ['unsigned short']],
    'SpareCrossTebBits' : [ 0x17ec, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned short')]],
    'SameTebFlags' : [ 0x17ee, ['unsigned short']],
    'SafeThunkCall' : [ 0x17ee, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'InDebugPrint' : [ 0x17ee, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'HasFiberData' : [ 0x17ee, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SkipThreadAttach' : [ 0x17ee, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'WerInShipAssertCode' : [ 0x17ee, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'RanProcessInit' : [ 0x17ee, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'ClonedThread' : [ 0x17ee, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'SuppressDebugMsg' : [ 0x17ee, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned short')]],
    'DisableUserStackWalk' : [ 0x17ee, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned short')]],
    'RtlExceptionAttached' : [ 0x17ee, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned short')]],
    'InitialThread' : [ 0x17ee, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned short')]],
    'SessionAware' : [ 0x17ee, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned short')]],
    'SpareSameTebBits' : [ 0x17ee, ['BitField', dict(start_bit = 12, end_bit = 16, native_type='unsigned short')]],
    'TxnScopeEnterCallback' : [ 0x17f0, ['pointer64', ['void']]],
    'TxnScopeExitCallback' : [ 0x17f8, ['pointer64', ['void']]],
    'TxnScopeContext' : [ 0x1800, ['pointer64', ['void']]],
    'LockCount' : [ 0x1808, ['unsigned long']],
    'SpareUlong0' : [ 0x180c, ['unsigned long']],
    'ResourceRetValue' : [ 0x1810, ['pointer64', ['void']]],
    'ReservedForWdf' : [ 0x1818, ['pointer64', ['void']]],
} ],
  '_LIST_ENTRY' : [ 0x10, {
    'Flink' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
    'Blink' : [ 0x8, ['pointer64', ['_LIST_ENTRY']]],
} ],
  '_SINGLE_LIST_ENTRY' : [ 0x8, {
    'Next' : [ 0x0, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
} ],
  '_RTL_SPLAY_LINKS' : [ 0x18, {
    'Parent' : [ 0x0, ['pointer64', ['_RTL_SPLAY_LINKS']]],
    'LeftChild' : [ 0x8, ['pointer64', ['_RTL_SPLAY_LINKS']]],
    'RightChild' : [ 0x10, ['pointer64', ['_RTL_SPLAY_LINKS']]],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_CONTEXT' : [ 0x18, {
    'ChainHead' : [ 0x0, ['pointer64', ['_LIST_ENTRY']]],
    'PrevLinkage' : [ 0x8, ['pointer64', ['_LIST_ENTRY']]],
    'Signature' : [ 0x10, ['unsigned long long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE_ENUMERATOR' : [ 0x28, {
    'HashEntry' : [ 0x0, ['_RTL_DYNAMIC_HASH_TABLE_ENTRY']],
    'ChainHead' : [ 0x18, ['pointer64', ['_LIST_ENTRY']]],
    'BucketIndex' : [ 0x20, ['unsigned long']],
} ],
  '_RTL_DYNAMIC_HASH_TABLE' : [ 0x28, {
    'Flags' : [ 0x0, ['unsigned long']],
    'Shift' : [ 0x4, ['unsigned long']],
    'TableSize' : [ 0x8, ['unsigned long']],
    'Pivot' : [ 0xc, ['unsigned long']],
    'DivisorMask' : [ 0x10, ['unsigned long']],
    'NumEntries' : [ 0x14, ['unsigned long']],
    'NonEmptyBuckets' : [ 0x18, ['unsigned long']],
    'NumEnumerators' : [ 0x1c, ['unsigned long']],
    'Directory' : [ 0x20, ['pointer64', ['void']]],
} ],
  '_UNICODE_STRING' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x8, ['pointer64', ['unsigned short']]],
} ],
  '_STRING' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned short']],
    'MaximumLength' : [ 0x2, ['unsigned short']],
    'Buffer' : [ 0x8, ['pointer64', ['unsigned char']]],
} ],
  '_RTL_BITMAP' : [ 0x10, {
    'SizeOfBitMap' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x8, ['pointer64', ['unsigned long']]],
} ],
  '_LUID' : [ 0x8, {
    'LowPart' : [ 0x0, ['unsigned long']],
    'HighPart' : [ 0x4, ['long']],
} ],
  '_IMAGE_NT_HEADERS64' : [ 0x108, {
    'Signature' : [ 0x0, ['unsigned long']],
    'FileHeader' : [ 0x4, ['_IMAGE_FILE_HEADER']],
    'OptionalHeader' : [ 0x18, ['_IMAGE_OPTIONAL_HEADER64']],
} ],
  '_IMAGE_DOS_HEADER' : [ 0x40, {
    'e_magic' : [ 0x0, ['unsigned short']],
    'e_cblp' : [ 0x2, ['unsigned short']],
    'e_cp' : [ 0x4, ['unsigned short']],
    'e_crlc' : [ 0x6, ['unsigned short']],
    'e_cparhdr' : [ 0x8, ['unsigned short']],
    'e_minalloc' : [ 0xa, ['unsigned short']],
    'e_maxalloc' : [ 0xc, ['unsigned short']],
    'e_ss' : [ 0xe, ['unsigned short']],
    'e_sp' : [ 0x10, ['unsigned short']],
    'e_csum' : [ 0x12, ['unsigned short']],
    'e_ip' : [ 0x14, ['unsigned short']],
    'e_cs' : [ 0x16, ['unsigned short']],
    'e_lfarlc' : [ 0x18, ['unsigned short']],
    'e_ovno' : [ 0x1a, ['unsigned short']],
    'e_res' : [ 0x1c, ['array', 4, ['unsigned short']]],
    'e_oemid' : [ 0x24, ['unsigned short']],
    'e_oeminfo' : [ 0x26, ['unsigned short']],
    'e_res2' : [ 0x28, ['array', 10, ['unsigned short']]],
    'e_lfanew' : [ 0x3c, ['long']],
} ],
  '_RTL_BALANCED_NODE' : [ 0x18, {
    'Children' : [ 0x0, ['array', 2, ['pointer64', ['_RTL_BALANCED_NODE']]]],
    'Left' : [ 0x0, ['pointer64', ['_RTL_BALANCED_NODE']]],
    'Right' : [ 0x8, ['pointer64', ['_RTL_BALANCED_NODE']]],
    'Red' : [ 0x10, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Balance' : [ 0x10, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned char')]],
    'ParentValue' : [ 0x10, ['unsigned long long']],
} ],
  '_RTL_RB_TREE' : [ 0x10, {
    'Root' : [ 0x0, ['pointer64', ['_RTL_BALANCED_NODE']]],
    'Min' : [ 0x8, ['pointer64', ['_RTL_BALANCED_NODE']]],
} ],
  '_RTL_AVL_TREE' : [ 0x8, {
    'Root' : [ 0x0, ['pointer64', ['_RTL_BALANCED_NODE']]],
} ],
  '_GUID' : [ 0x10, {
    'Data1' : [ 0x0, ['unsigned long']],
    'Data2' : [ 0x4, ['unsigned short']],
    'Data3' : [ 0x6, ['unsigned short']],
    'Data4' : [ 0x8, ['array', 8, ['unsigned char']]],
} ],
  '_KPCR' : [ 0x5f00, {
    'NtTib' : [ 0x0, ['_NT_TIB']],
    'GdtBase' : [ 0x0, ['pointer64', ['_KGDTENTRY64']]],
    'TssBase' : [ 0x8, ['pointer64', ['_KTSS64']]],
    'UserRsp' : [ 0x10, ['unsigned long long']],
    'Self' : [ 0x18, ['pointer64', ['_KPCR']]],
    'CurrentPrcb' : [ 0x20, ['pointer64', ['_KPRCB']]],
    'LockArray' : [ 0x28, ['pointer64', ['_KSPIN_LOCK_QUEUE']]],
    'Used_Self' : [ 0x30, ['pointer64', ['void']]],
    'IdtBase' : [ 0x38, ['pointer64', ['_KIDTENTRY64']]],
    'Unused' : [ 0x40, ['array', 2, ['unsigned long long']]],
    'Irql' : [ 0x50, ['unsigned char']],
    'SecondLevelCacheAssociativity' : [ 0x51, ['unsigned char']],
    'ObsoleteNumber' : [ 0x52, ['unsigned char']],
    'Fill0' : [ 0x53, ['unsigned char']],
    'Unused0' : [ 0x54, ['array', 3, ['unsigned long']]],
    'MajorVersion' : [ 0x60, ['unsigned short']],
    'MinorVersion' : [ 0x62, ['unsigned short']],
    'StallScaleFactor' : [ 0x64, ['unsigned long']],
    'Unused1' : [ 0x68, ['array', 3, ['pointer64', ['void']]]],
    'KernelReserved' : [ 0x80, ['array', 15, ['unsigned long']]],
    'SecondLevelCacheSize' : [ 0xbc, ['unsigned long']],
    'HalReserved' : [ 0xc0, ['array', 16, ['unsigned long']]],
    'Unused2' : [ 0x100, ['unsigned long']],
    'KdVersionBlock' : [ 0x108, ['pointer64', ['void']]],
    'Unused3' : [ 0x110, ['pointer64', ['void']]],
    'PcrAlign1' : [ 0x118, ['array', 24, ['unsigned long']]],
    'Prcb' : [ 0x180, ['_KPRCB']],
} ],
  '_KPRCB' : [ 0x5d80, {
    'MxCsr' : [ 0x0, ['unsigned long']],
    'LegacyNumber' : [ 0x4, ['unsigned char']],
    'ReservedMustBeZero' : [ 0x5, ['unsigned char']],
    'InterruptRequest' : [ 0x6, ['unsigned char']],
    'IdleHalt' : [ 0x7, ['unsigned char']],
    'CurrentThread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
    'NextThread' : [ 0x10, ['pointer64', ['_KTHREAD']]],
    'IdleThread' : [ 0x18, ['pointer64', ['_KTHREAD']]],
    'NestingLevel' : [ 0x20, ['unsigned char']],
    'ClockOwner' : [ 0x21, ['unsigned char']],
    'PendingTickFlags' : [ 0x22, ['unsigned char']],
    'PendingTick' : [ 0x22, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'PendingBackupTick' : [ 0x22, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'PrcbPad00' : [ 0x23, ['array', 1, ['unsigned char']]],
    'Number' : [ 0x24, ['unsigned long']],
    'RspBase' : [ 0x28, ['unsigned long long']],
    'PrcbLock' : [ 0x30, ['unsigned long long']],
    'PriorityState' : [ 0x38, ['pointer64', ['unsigned char']]],
    'ProcessorState' : [ 0x40, ['_KPROCESSOR_STATE']],
    'CpuType' : [ 0x5f0, ['unsigned char']],
    'CpuID' : [ 0x5f1, ['unsigned char']],
    'CpuStep' : [ 0x5f2, ['unsigned short']],
    'CpuStepping' : [ 0x5f2, ['unsigned char']],
    'CpuModel' : [ 0x5f3, ['unsigned char']],
    'MHz' : [ 0x5f4, ['unsigned long']],
    'HalReserved' : [ 0x5f8, ['array', 8, ['unsigned long long']]],
    'MinorVersion' : [ 0x638, ['unsigned short']],
    'MajorVersion' : [ 0x63a, ['unsigned short']],
    'BuildType' : [ 0x63c, ['unsigned char']],
    'CpuVendor' : [ 0x63d, ['unsigned char']],
    'CoresPerPhysicalProcessor' : [ 0x63e, ['unsigned char']],
    'LogicalProcessorsPerCore' : [ 0x63f, ['unsigned char']],
    'ParentNode' : [ 0x640, ['pointer64', ['_KNODE']]],
    'GroupSetMember' : [ 0x648, ['unsigned long long']],
    'Group' : [ 0x650, ['unsigned char']],
    'GroupIndex' : [ 0x651, ['unsigned char']],
    'PrcbPad05' : [ 0x652, ['array', 2, ['unsigned char']]],
    'ApicMask' : [ 0x654, ['unsigned long']],
    'CFlushSize' : [ 0x658, ['unsigned long']],
    'AcpiReserved' : [ 0x660, ['pointer64', ['void']]],
    'InitialApicId' : [ 0x668, ['unsigned long']],
    'LockQueue' : [ 0x670, ['array', 17, ['_KSPIN_LOCK_QUEUE']]],
    'PPLookasideList' : [ 0x780, ['array', 16, ['_PP_LOOKASIDE_LIST']]],
    'PPNxPagedLookasideList' : [ 0x880, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PPNPagedLookasideList' : [ 0x1480, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PPPagedLookasideList' : [ 0x2080, ['array', 32, ['_GENERAL_LOOKASIDE_POOL']]],
    'PrcbPad20' : [ 0x2c80, ['unsigned long long']],
    'DeferredReadyListHead' : [ 0x2c88, ['_SINGLE_LIST_ENTRY']],
    'MmPageFaultCount' : [ 0x2c90, ['long']],
    'MmCopyOnWriteCount' : [ 0x2c94, ['long']],
    'MmTransitionCount' : [ 0x2c98, ['long']],
    'MmDemandZeroCount' : [ 0x2c9c, ['long']],
    'MmPageReadCount' : [ 0x2ca0, ['long']],
    'MmPageReadIoCount' : [ 0x2ca4, ['long']],
    'MmDirtyPagesWriteCount' : [ 0x2ca8, ['long']],
    'MmDirtyWriteIoCount' : [ 0x2cac, ['long']],
    'MmMappedPagesWriteCount' : [ 0x2cb0, ['long']],
    'MmMappedWriteIoCount' : [ 0x2cb4, ['long']],
    'KeSystemCalls' : [ 0x2cb8, ['unsigned long']],
    'KeContextSwitches' : [ 0x2cbc, ['unsigned long']],
    'LdtSelector' : [ 0x2cc0, ['unsigned short']],
    'PrcbPad40' : [ 0x2cc2, ['unsigned short']],
    'CcFastReadNoWait' : [ 0x2cc4, ['unsigned long']],
    'CcFastReadWait' : [ 0x2cc8, ['unsigned long']],
    'CcFastReadNotPossible' : [ 0x2ccc, ['unsigned long']],
    'CcCopyReadNoWait' : [ 0x2cd0, ['unsigned long']],
    'CcCopyReadWait' : [ 0x2cd4, ['unsigned long']],
    'CcCopyReadNoWaitMiss' : [ 0x2cd8, ['unsigned long']],
    'IoReadOperationCount' : [ 0x2cdc, ['long']],
    'IoWriteOperationCount' : [ 0x2ce0, ['long']],
    'IoOtherOperationCount' : [ 0x2ce4, ['long']],
    'IoReadTransferCount' : [ 0x2ce8, ['_LARGE_INTEGER']],
    'IoWriteTransferCount' : [ 0x2cf0, ['_LARGE_INTEGER']],
    'IoOtherTransferCount' : [ 0x2cf8, ['_LARGE_INTEGER']],
    'PacketBarrier' : [ 0x2d00, ['long']],
    'TargetCount' : [ 0x2d04, ['long']],
    'IpiFrozen' : [ 0x2d08, ['unsigned long']],
    'IsrDpcStats' : [ 0x2d10, ['pointer64', ['void']]],
    'DeviceInterrupts' : [ 0x2d18, ['unsigned long']],
    'LookasideIrpFloat' : [ 0x2d1c, ['long']],
    'InterruptLastCount' : [ 0x2d20, ['unsigned long']],
    'InterruptRate' : [ 0x2d24, ['unsigned long']],
    'PrcbPad41' : [ 0x2d28, ['array', 22, ['unsigned long']]],
    'DpcData' : [ 0x2d80, ['array', 2, ['_KDPC_DATA']]],
    'DpcStack' : [ 0x2dd0, ['pointer64', ['void']]],
    'MaximumDpcQueueDepth' : [ 0x2dd8, ['long']],
    'DpcRequestRate' : [ 0x2ddc, ['unsigned long']],
    'MinimumDpcRate' : [ 0x2de0, ['unsigned long']],
    'DpcLastCount' : [ 0x2de4, ['unsigned long']],
    'ThreadDpcEnable' : [ 0x2de8, ['unsigned char']],
    'QuantumEnd' : [ 0x2de9, ['unsigned char']],
    'DpcRoutineActive' : [ 0x2dea, ['unsigned char']],
    'IdleSchedule' : [ 0x2deb, ['unsigned char']],
    'DpcRequestSummary' : [ 0x2dec, ['long']],
    'DpcRequestSlot' : [ 0x2dec, ['array', 2, ['short']]],
    'NormalDpcState' : [ 0x2dec, ['short']],
    'ThreadDpcState' : [ 0x2dee, ['short']],
    'DpcNormalProcessingActive' : [ 0x2dec, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DpcNormalProcessingRequested' : [ 0x2dec, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DpcNormalThreadSignal' : [ 0x2dec, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DpcNormalTimerExpiration' : [ 0x2dec, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DpcNormalDpcPresent' : [ 0x2dec, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DpcNormalLocalInterrupt' : [ 0x2dec, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DpcNormalSpare' : [ 0x2dec, ['BitField', dict(start_bit = 6, end_bit = 16, native_type='unsigned long')]],
    'DpcThreadActive' : [ 0x2dec, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'DpcThreadRequested' : [ 0x2dec, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'DpcThreadSpare' : [ 0x2dec, ['BitField', dict(start_bit = 18, end_bit = 32, native_type='unsigned long')]],
    'LastTimerHand' : [ 0x2df0, ['unsigned long']],
    'LastTick' : [ 0x2df4, ['unsigned long']],
    'ClockInterrupts' : [ 0x2df8, ['unsigned long']],
    'ReadyScanTick' : [ 0x2dfc, ['unsigned long']],
    'TimerTable' : [ 0x2e00, ['_KTIMER_TABLE']],
    'DpcGate' : [ 0x5000, ['_KGATE']],
    'PrcbPad52' : [ 0x5018, ['pointer64', ['void']]],
    'CallDpc' : [ 0x5020, ['_KDPC']],
    'ClockKeepAlive' : [ 0x5060, ['long']],
    'PrcbPad60' : [ 0x5064, ['array', 2, ['unsigned char']]],
    'NmiActive' : [ 0x5066, ['unsigned short']],
    'DpcWatchdogPeriod' : [ 0x5068, ['long']],
    'DpcWatchdogCount' : [ 0x506c, ['long']],
    'KeSpinLockOrdering' : [ 0x5070, ['long']],
    'PrcbPad70' : [ 0x5074, ['array', 1, ['unsigned long']]],
    'CachedPtes' : [ 0x5078, ['pointer64', ['void']]],
    'WaitListHead' : [ 0x5080, ['_LIST_ENTRY']],
    'WaitLock' : [ 0x5090, ['unsigned long long']],
    'ReadySummary' : [ 0x5098, ['unsigned long']],
    'AffinitizedSelectionMask' : [ 0x509c, ['long']],
    'QueueIndex' : [ 0x50a0, ['unsigned long']],
    'PrcbPad75' : [ 0x50a4, ['array', 3, ['unsigned long']]],
    'TimerExpirationDpc' : [ 0x50b0, ['_KDPC']],
    'ScbQueue' : [ 0x50f0, ['_RTL_RB_TREE']],
    'DispatcherReadyListHead' : [ 0x5100, ['array', 32, ['_LIST_ENTRY']]],
    'InterruptCount' : [ 0x5300, ['unsigned long']],
    'KernelTime' : [ 0x5304, ['unsigned long']],
    'UserTime' : [ 0x5308, ['unsigned long']],
    'DpcTime' : [ 0x530c, ['unsigned long']],
    'InterruptTime' : [ 0x5310, ['unsigned long']],
    'AdjustDpcThreshold' : [ 0x5314, ['unsigned long']],
    'DebuggerSavedIRQL' : [ 0x5318, ['unsigned char']],
    'GroupSchedulingOverQuota' : [ 0x5319, ['unsigned char']],
    'DeepSleep' : [ 0x531a, ['unsigned char']],
    'PrcbPad80' : [ 0x531b, ['array', 1, ['unsigned char']]],
    'ScbOffset' : [ 0x531c, ['unsigned long']],
    'DpcTimeCount' : [ 0x5320, ['unsigned long']],
    'DpcTimeLimit' : [ 0x5324, ['unsigned long']],
    'PeriodicCount' : [ 0x5328, ['unsigned long']],
    'PeriodicBias' : [ 0x532c, ['unsigned long']],
    'AvailableTime' : [ 0x5330, ['unsigned long']],
    'KeExceptionDispatchCount' : [ 0x5334, ['unsigned long']],
    'StartCycles' : [ 0x5338, ['unsigned long long']],
    'GenerationTarget' : [ 0x5340, ['unsigned long long']],
    'AffinitizedCycles' : [ 0x5348, ['unsigned long long']],
    'PrcbPad81' : [ 0x5350, ['array', 2, ['unsigned long long']]],
    'MmSpinLockOrdering' : [ 0x5360, ['long']],
    'PageColor' : [ 0x5364, ['unsigned long']],
    'NodeColor' : [ 0x5368, ['unsigned long']],
    'NodeShiftedColor' : [ 0x536c, ['unsigned long']],
    'SecondaryColorMask' : [ 0x5370, ['unsigned long']],
    'PrcbPad83' : [ 0x5374, ['unsigned long']],
    'CycleTime' : [ 0x5378, ['unsigned long long']],
    'CcFastMdlReadNoWait' : [ 0x5380, ['unsigned long']],
    'CcFastMdlReadWait' : [ 0x5384, ['unsigned long']],
    'CcFastMdlReadNotPossible' : [ 0x5388, ['unsigned long']],
    'CcMapDataNoWait' : [ 0x538c, ['unsigned long']],
    'CcMapDataWait' : [ 0x5390, ['unsigned long']],
    'CcPinMappedDataCount' : [ 0x5394, ['unsigned long']],
    'CcPinReadNoWait' : [ 0x5398, ['unsigned long']],
    'CcPinReadWait' : [ 0x539c, ['unsigned long']],
    'CcMdlReadNoWait' : [ 0x53a0, ['unsigned long']],
    'CcMdlReadWait' : [ 0x53a4, ['unsigned long']],
    'CcLazyWriteHotSpots' : [ 0x53a8, ['unsigned long']],
    'CcLazyWriteIos' : [ 0x53ac, ['unsigned long']],
    'CcLazyWritePages' : [ 0x53b0, ['unsigned long']],
    'CcDataFlushes' : [ 0x53b4, ['unsigned long']],
    'CcDataPages' : [ 0x53b8, ['unsigned long']],
    'CcLostDelayedWrites' : [ 0x53bc, ['unsigned long']],
    'CcFastReadResourceMiss' : [ 0x53c0, ['unsigned long']],
    'CcCopyReadWaitMiss' : [ 0x53c4, ['unsigned long']],
    'CcFastMdlReadResourceMiss' : [ 0x53c8, ['unsigned long']],
    'CcMapDataNoWaitMiss' : [ 0x53cc, ['unsigned long']],
    'CcMapDataWaitMiss' : [ 0x53d0, ['unsigned long']],
    'CcPinReadNoWaitMiss' : [ 0x53d4, ['unsigned long']],
    'CcPinReadWaitMiss' : [ 0x53d8, ['unsigned long']],
    'CcMdlReadNoWaitMiss' : [ 0x53dc, ['unsigned long']],
    'CcMdlReadWaitMiss' : [ 0x53e0, ['unsigned long']],
    'CcReadAheadIos' : [ 0x53e4, ['unsigned long']],
    'MmCacheTransitionCount' : [ 0x53e8, ['long']],
    'MmCacheReadCount' : [ 0x53ec, ['long']],
    'MmCacheIoCount' : [ 0x53f0, ['long']],
    'PrcbPad91' : [ 0x53f4, ['array', 3, ['unsigned long']]],
    'PowerState' : [ 0x5400, ['_PROCESSOR_POWER_STATE']],
    'ScbList' : [ 0x55e0, ['_LIST_ENTRY']],
    'PrcbPad92' : [ 0x55f0, ['array', 19, ['unsigned long']]],
    'KeAlignmentFixupCount' : [ 0x563c, ['unsigned long']],
    'DpcWatchdogDpc' : [ 0x5640, ['_KDPC']],
    'DpcWatchdogTimer' : [ 0x5680, ['_KTIMER']],
    'Cache' : [ 0x56c0, ['array', 5, ['_CACHE_DESCRIPTOR']]],
    'CacheCount' : [ 0x56fc, ['unsigned long']],
    'CachedCommit' : [ 0x5700, ['unsigned long']],
    'CachedResidentAvailable' : [ 0x5704, ['unsigned long']],
    'HyperPte' : [ 0x5708, ['pointer64', ['void']]],
    'WheaInfo' : [ 0x5710, ['pointer64', ['void']]],
    'EtwSupport' : [ 0x5718, ['pointer64', ['void']]],
    'InterruptObjectPool' : [ 0x5720, ['_SLIST_HEADER']],
    'HypercallPageList' : [ 0x5730, ['_SLIST_HEADER']],
    'HypercallPageVirtual' : [ 0x5740, ['pointer64', ['void']]],
    'VirtualApicAssist' : [ 0x5748, ['pointer64', ['void']]],
    'StatisticsPage' : [ 0x5750, ['pointer64', ['unsigned long long']]],
    'PackageProcessorSet' : [ 0x5758, ['_KAFFINITY_EX']],
    'SharedReadyQueueMask' : [ 0x5800, ['unsigned long long']],
    'SharedReadyQueue' : [ 0x5808, ['pointer64', ['_KSHARED_READY_QUEUE']]],
    'CoreProcessorSet' : [ 0x5810, ['unsigned long long']],
    'ScanSiblingMask' : [ 0x5818, ['unsigned long long']],
    'LLCMask' : [ 0x5820, ['unsigned long long']],
    'CacheProcessorMask' : [ 0x5828, ['array', 5, ['unsigned long long']]],
    'ScanSiblingIndex' : [ 0x5850, ['unsigned long']],
    'SharedReadyQueueOffset' : [ 0x5854, ['unsigned long']],
    'ProcessorProfileControlArea' : [ 0x5858, ['pointer64', ['_PROCESSOR_PROFILE_CONTROL_AREA']]],
    'ProfileEventIndexAddress' : [ 0x5860, ['pointer64', ['void']]],
    'PrcbPad94' : [ 0x5868, ['array', 3, ['unsigned long long']]],
    'SynchCounters' : [ 0x5880, ['_SYNCH_COUNTERS']],
    'PteBitCache' : [ 0x5938, ['unsigned long long']],
    'PteBitOffset' : [ 0x5940, ['unsigned long']],
    'FsCounters' : [ 0x5948, ['_FILESYSTEM_DISK_COUNTERS']],
    'VendorString' : [ 0x5958, ['array', 13, ['unsigned char']]],
    'PrcbPad10' : [ 0x5965, ['array', 3, ['unsigned char']]],
    'FeatureBits' : [ 0x5968, ['unsigned long long']],
    'PrcbPad11' : [ 0x5970, ['unsigned long']],
    'UpdateSignature' : [ 0x5978, ['_LARGE_INTEGER']],
    'Context' : [ 0x5980, ['pointer64', ['_CONTEXT']]],
    'ContextFlagsInit' : [ 0x5988, ['unsigned long']],
    'ExtendedState' : [ 0x5990, ['pointer64', ['_XSAVE_AREA']]],
    'IsrStack' : [ 0x5998, ['pointer64', ['void']]],
    'EntropyTimingState' : [ 0x59a0, ['_KENTROPY_TIMING_STATE']],
    'AbSelfIoBoostsList' : [ 0x5af0, ['_SINGLE_LIST_ENTRY']],
    'AbPropagateBoostsList' : [ 0x5af8, ['_SINGLE_LIST_ENTRY']],
    'AbDpc' : [ 0x5b00, ['_KDPC']],
    'IoIrpStackProfilerCurrent' : [ 0x5b40, ['_IOP_IRP_STACK_PROFILER']],
    'IoIrpStackProfilerPrevious' : [ 0x5b94, ['_IOP_IRP_STACK_PROFILER']],
    'TimerExpirationTrace' : [ 0x5be8, ['array', 16, ['_KTIMER_EXPIRATION_TRACE']]],
    'TimerExpirationTraceCount' : [ 0x5ce8, ['unsigned long']],
    'Mailbox' : [ 0x5d00, ['pointer64', ['_REQUEST_MAILBOX']]],
    'RequestMailbox' : [ 0x5d40, ['array', 1, ['_REQUEST_MAILBOX']]],
} ],
  '_KFLOATING_SAVE' : [ 0x4, {
    'Dummy' : [ 0x0, ['unsigned long']],
} ],
  '_SINGLE_LIST_ENTRY32' : [ 0x4, {
    'Next' : [ 0x0, ['unsigned long']],
} ],
  '_EXT_SET_PARAMETERS_V0' : [ 0x10, {
    'Version' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'NoWakeTolerance' : [ 0x8, ['long long']],
} ],
  '_KTHREAD' : [ 0x5d0, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'SListFaultAddress' : [ 0x18, ['pointer64', ['void']]],
    'QuantumTarget' : [ 0x20, ['unsigned long long']],
    'InitialStack' : [ 0x28, ['pointer64', ['void']]],
    'StackLimit' : [ 0x30, ['pointer64', ['void']]],
    'StackBase' : [ 0x38, ['pointer64', ['void']]],
    'ThreadLock' : [ 0x40, ['unsigned long long']],
    'CycleTime' : [ 0x48, ['unsigned long long']],
    'CurrentRunTime' : [ 0x50, ['unsigned long']],
    'ExpectedRunTime' : [ 0x54, ['unsigned long']],
    'KernelStack' : [ 0x58, ['pointer64', ['void']]],
    'StateSaveArea' : [ 0x60, ['pointer64', ['_XSAVE_FORMAT']]],
    'SchedulingGroup' : [ 0x68, ['pointer64', ['_KSCHEDULING_GROUP']]],
    'WaitRegister' : [ 0x70, ['_KWAIT_STATUS_REGISTER']],
    'Running' : [ 0x71, ['unsigned char']],
    'Alerted' : [ 0x72, ['array', 2, ['unsigned char']]],
    'SpareMiscFlag0' : [ 0x74, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ReadyTransition' : [ 0x74, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessReadyQueue' : [ 0x74, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'WaitNext' : [ 0x74, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'SystemAffinityActive' : [ 0x74, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Alertable' : [ 0x74, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'UserStackWalkActive' : [ 0x74, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'ApcInterruptRequest' : [ 0x74, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'QuantumEndMigrate' : [ 0x74, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'UmsDirectedSwitchEnable' : [ 0x74, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'TimerActive' : [ 0x74, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'SystemThread' : [ 0x74, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'ProcessDetachActive' : [ 0x74, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'CalloutActive' : [ 0x74, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'ScbReadyQueue' : [ 0x74, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'ApcQueueable' : [ 0x74, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ReservedStackInUse' : [ 0x74, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'UmsPerformingSyscall' : [ 0x74, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'ApcPendingReload' : [ 0x74, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'TimerSuspended' : [ 0x74, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'SuspendedWaitMode' : [ 0x74, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'Reserved' : [ 0x74, ['BitField', dict(start_bit = 21, end_bit = 32, native_type='unsigned long')]],
    'MiscFlags' : [ 0x74, ['long']],
    'AutoAlignment' : [ 0x78, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DisableBoost' : [ 0x78, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'UserAffinitySet' : [ 0x78, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'AlertedByThreadId' : [ 0x78, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'QuantumDonation' : [ 0x78, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'EnableStackSwap' : [ 0x78, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'GuiThread' : [ 0x78, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DisableQuantum' : [ 0x78, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ChargeOnlySchedulingGroup' : [ 0x78, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'DeferPreemption' : [ 0x78, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'QueueDeferPreemption' : [ 0x78, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'ForceDeferSchedule' : [ 0x78, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'SharedReadyQueueAffinity' : [ 0x78, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'FreezeCount' : [ 0x78, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'TerminationApcRequest' : [ 0x78, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'AutoBoostEntriesExhausted' : [ 0x78, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'KernelStackResident' : [ 0x78, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'EtwStackTraceApcInserted' : [ 0x78, ['BitField', dict(start_bit = 17, end_bit = 25, native_type='unsigned long')]],
    'ReservedFlags' : [ 0x78, ['BitField', dict(start_bit = 25, end_bit = 32, native_type='unsigned long')]],
    'ThreadFlags' : [ 0x78, ['long']],
    'Spare0' : [ 0x7c, ['unsigned long']],
    'SystemCallNumber' : [ 0x80, ['unsigned long']],
    'Spare1' : [ 0x84, ['unsigned long']],
    'FirstArgument' : [ 0x88, ['pointer64', ['void']]],
    'TrapFrame' : [ 0x90, ['pointer64', ['_KTRAP_FRAME']]],
    'ApcState' : [ 0x98, ['_KAPC_STATE']],
    'ApcStateFill' : [ 0x98, ['array', 43, ['unsigned char']]],
    'Priority' : [ 0xc3, ['unsigned char']],
    'UserIdealProcessor' : [ 0xc4, ['unsigned long']],
    'WaitStatus' : [ 0xc8, ['long long']],
    'WaitBlockList' : [ 0xd0, ['pointer64', ['_KWAIT_BLOCK']]],
    'WaitListEntry' : [ 0xd8, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0xd8, ['_SINGLE_LIST_ENTRY']],
    'Queue' : [ 0xe8, ['pointer64', ['_DISPATCHER_HEADER']]],
    'Teb' : [ 0xf0, ['pointer64', ['void']]],
    'RelativeTimerBias' : [ 0xf8, ['unsigned long long']],
    'Timer' : [ 0x100, ['_KTIMER']],
    'WaitBlock' : [ 0x140, ['array', 4, ['_KWAIT_BLOCK']]],
    'WaitBlockFill4' : [ 0x140, ['array', 20, ['unsigned char']]],
    'ContextSwitches' : [ 0x154, ['unsigned long']],
    'WaitBlockFill5' : [ 0x140, ['array', 68, ['unsigned char']]],
    'State' : [ 0x184, ['unsigned char']],
    'NpxState' : [ 0x185, ['unsigned char']],
    'WaitIrql' : [ 0x186, ['unsigned char']],
    'WaitMode' : [ 0x187, ['unsigned char']],
    'WaitBlockFill6' : [ 0x140, ['array', 116, ['unsigned char']]],
    'WaitTime' : [ 0x1b4, ['unsigned long']],
    'WaitBlockFill7' : [ 0x140, ['array', 164, ['unsigned char']]],
    'KernelApcDisable' : [ 0x1e4, ['short']],
    'SpecialApcDisable' : [ 0x1e6, ['short']],
    'CombinedApcDisable' : [ 0x1e4, ['unsigned long']],
    'WaitBlockFill8' : [ 0x140, ['array', 40, ['unsigned char']]],
    'ThreadCounters' : [ 0x168, ['pointer64', ['_KTHREAD_COUNTERS']]],
    'WaitBlockFill9' : [ 0x140, ['array', 88, ['unsigned char']]],
    'XStateSave' : [ 0x198, ['pointer64', ['_XSTATE_SAVE']]],
    'WaitBlockFill10' : [ 0x140, ['array', 136, ['unsigned char']]],
    'Win32Thread' : [ 0x1c8, ['pointer64', ['void']]],
    'WaitBlockFill11' : [ 0x140, ['array', 176, ['unsigned char']]],
    'Ucb' : [ 0x1f0, ['pointer64', ['_UMS_CONTROL_BLOCK']]],
    'Uch' : [ 0x1f8, ['pointer64', ['_KUMS_CONTEXT_HEADER']]],
    'TebMappedLowVa' : [ 0x200, ['pointer64', ['void']]],
    'QueueListEntry' : [ 0x208, ['_LIST_ENTRY']],
    'NextProcessor' : [ 0x218, ['unsigned long']],
    'NextProcessorNumber' : [ 0x218, ['BitField', dict(start_bit = 0, end_bit = 31, native_type='unsigned long')]],
    'SharedReadyQueue' : [ 0x218, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'QueuePriority' : [ 0x21c, ['long']],
    'Process' : [ 0x220, ['pointer64', ['_KPROCESS']]],
    'UserAffinity' : [ 0x228, ['_GROUP_AFFINITY']],
    'UserAffinityFill' : [ 0x228, ['array', 10, ['unsigned char']]],
    'PreviousMode' : [ 0x232, ['unsigned char']],
    'BasePriority' : [ 0x233, ['unsigned char']],
    'PriorityDecrement' : [ 0x234, ['unsigned char']],
    'ForegroundBoost' : [ 0x234, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'UnusualBoost' : [ 0x234, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Preempted' : [ 0x235, ['unsigned char']],
    'AdjustReason' : [ 0x236, ['unsigned char']],
    'AdjustIncrement' : [ 0x237, ['unsigned char']],
    'Affinity' : [ 0x238, ['_GROUP_AFFINITY']],
    'AffinityFill' : [ 0x238, ['array', 10, ['unsigned char']]],
    'ApcStateIndex' : [ 0x242, ['unsigned char']],
    'WaitBlockCount' : [ 0x243, ['unsigned char']],
    'IdealProcessor' : [ 0x244, ['unsigned long']],
    'ApcStatePointer' : [ 0x248, ['array', 2, ['pointer64', ['_KAPC_STATE']]]],
    'SavedApcState' : [ 0x258, ['_KAPC_STATE']],
    'SavedApcStateFill' : [ 0x258, ['array', 43, ['unsigned char']]],
    'WaitReason' : [ 0x283, ['unsigned char']],
    'SuspendCount' : [ 0x284, ['unsigned char']],
    'Saturation' : [ 0x285, ['unsigned char']],
    'SListFaultCount' : [ 0x286, ['unsigned short']],
    'SchedulerApc' : [ 0x288, ['_KAPC']],
    'SchedulerApcFill0' : [ 0x288, ['array', 1, ['unsigned char']]],
    'ResourceIndex' : [ 0x289, ['unsigned char']],
    'SchedulerApcFill1' : [ 0x288, ['array', 3, ['unsigned char']]],
    'QuantumReset' : [ 0x28b, ['unsigned char']],
    'SchedulerApcFill2' : [ 0x288, ['array', 4, ['unsigned char']]],
    'KernelTime' : [ 0x28c, ['unsigned long']],
    'SchedulerApcFill3' : [ 0x288, ['array', 64, ['unsigned char']]],
    'WaitPrcb' : [ 0x2c8, ['pointer64', ['_KPRCB']]],
    'SchedulerApcFill4' : [ 0x288, ['array', 72, ['unsigned char']]],
    'LegoData' : [ 0x2d0, ['pointer64', ['void']]],
    'SchedulerApcFill5' : [ 0x288, ['array', 83, ['unsigned char']]],
    'CallbackNestingLevel' : [ 0x2db, ['unsigned char']],
    'UserTime' : [ 0x2dc, ['unsigned long']],
    'SuspendEvent' : [ 0x2e0, ['_KEVENT']],
    'ThreadListEntry' : [ 0x2f8, ['_LIST_ENTRY']],
    'MutantListHead' : [ 0x308, ['_LIST_ENTRY']],
    'LockEntriesFreeList' : [ 0x318, ['_SINGLE_LIST_ENTRY']],
    'LockEntries' : [ 0x320, ['array', 6, ['_KLOCK_ENTRY']]],
    'PropagateBoostsEntry' : [ 0x560, ['_SINGLE_LIST_ENTRY']],
    'IoSelfBoostsEntry' : [ 0x568, ['_SINGLE_LIST_ENTRY']],
    'PriorityFloorCounts' : [ 0x570, ['array', 16, ['unsigned char']]],
    'PriorityFloorSummary' : [ 0x580, ['unsigned long']],
    'AbCompletedIoBoostCount' : [ 0x584, ['long']],
    'AbReferenceCount' : [ 0x588, ['short']],
    'AbFreeEntryCount' : [ 0x58a, ['unsigned char']],
    'AbWaitEntryCount' : [ 0x58b, ['unsigned char']],
    'ForegroundLossTime' : [ 0x58c, ['unsigned long']],
    'GlobalForegroundListEntry' : [ 0x590, ['_LIST_ENTRY']],
    'ForegroundDpcStackListEntry' : [ 0x590, ['_SINGLE_LIST_ENTRY']],
    'InGlobalForegroundList' : [ 0x598, ['unsigned long long']],
    'ReadOperationCount' : [ 0x5a0, ['long long']],
    'WriteOperationCount' : [ 0x5a8, ['long long']],
    'OtherOperationCount' : [ 0x5b0, ['long long']],
    'ReadTransferCount' : [ 0x5b8, ['long long']],
    'WriteTransferCount' : [ 0x5c0, ['long long']],
    'OtherTransferCount' : [ 0x5c8, ['long long']],
} ],
  '_KSTACK_CONTROL' : [ 0x30, {
    'StackBase' : [ 0x0, ['unsigned long long']],
    'ActualLimit' : [ 0x8, ['unsigned long long']],
    'StackExpansion' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Previous' : [ 0x10, ['_KERNEL_STACK_SEGMENT']],
} ],
  '_KSPIN_LOCK_QUEUE' : [ 0x10, {
    'Next' : [ 0x0, ['pointer64', ['_KSPIN_LOCK_QUEUE']]],
    'Lock' : [ 0x8, ['pointer64', ['unsigned long long']]],
} ],
  '_FAST_MUTEX' : [ 0x38, {
    'Count' : [ 0x0, ['long']],
    'Owner' : [ 0x8, ['pointer64', ['void']]],
    'Contention' : [ 0x10, ['unsigned long']],
    'Event' : [ 0x18, ['_KEVENT']],
    'OldIrql' : [ 0x30, ['unsigned long']],
} ],
  '_KEVENT' : [ 0x18, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
} ],
  '__unnamed_1232' : [ 0x10, {
    'Depth' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long long')]],
    'Sequence' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 64, native_type='unsigned long long')]],
    'Reserved' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long long')]],
    'NextEntry' : [ 0x8, ['BitField', dict(start_bit = 4, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_SLIST_HEADER' : [ 0x10, {
    'Alignment' : [ 0x0, ['unsigned long long']],
    'Region' : [ 0x8, ['unsigned long long']],
    'HeaderX64' : [ 0x0, ['__unnamed_1232']],
} ],
  '_LOOKASIDE_LIST_EX' : [ 0x60, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE_POOL']],
} ],
  '_SLIST_ENTRY' : [ 0x10, {
    'Next' : [ 0x0, ['pointer64', ['_SLIST_ENTRY']]],
} ],
  '_NPAGED_LOOKASIDE_LIST' : [ 0x80, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
} ],
  '_PAGED_LOOKASIDE_LIST' : [ 0x80, {
    'L' : [ 0x0, ['_GENERAL_LOOKASIDE']],
} ],
  '_IO_STATUS_BLOCK' : [ 0x10, {
    'Status' : [ 0x0, ['long']],
    'Pointer' : [ 0x0, ['pointer64', ['void']]],
    'Information' : [ 0x8, ['unsigned long long']],
} ],
  '_QUAD' : [ 0x8, {
    'UseThisFieldToCopy' : [ 0x0, ['long long']],
    'DoNotUseThisField' : [ 0x0, ['double']],
} ],
  '_WORK_QUEUE_ITEM' : [ 0x20, {
    'List' : [ 0x0, ['_LIST_ENTRY']],
    'WorkerRoutine' : [ 0x10, ['pointer64', ['void']]],
    'Parameter' : [ 0x18, ['pointer64', ['void']]],
} ],
  '_EXT_DELETE_PARAMETERS' : [ 0x18, {
    'Version' : [ 0x0, ['unsigned long']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'DeleteCallback' : [ 0x8, ['pointer64', ['void']]],
    'DeleteContext' : [ 0x10, ['pointer64', ['void']]],
} ],
  '_EX_PUSH_LOCK' : [ 0x8, {
    'Locked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Waiting' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Waking' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'MultipleShared' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'Shared' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 64, native_type='unsigned long long')]],
    'Value' : [ 0x0, ['unsigned long long']],
    'Ptr' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_PP_LOOKASIDE_LIST' : [ 0x10, {
    'P' : [ 0x0, ['pointer64', ['_GENERAL_LOOKASIDE']]],
    'L' : [ 0x8, ['pointer64', ['_GENERAL_LOOKASIDE']]],
} ],
  '_GENERAL_LOOKASIDE' : [ 0x80, {
    'ListHead' : [ 0x0, ['_SLIST_HEADER']],
    'SingleListHead' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Depth' : [ 0x10, ['unsigned short']],
    'MaximumDepth' : [ 0x12, ['unsigned short']],
    'TotalAllocates' : [ 0x14, ['unsigned long']],
    'AllocateMisses' : [ 0x18, ['unsigned long']],
    'AllocateHits' : [ 0x18, ['unsigned long']],
    'TotalFrees' : [ 0x1c, ['unsigned long']],
    'FreeMisses' : [ 0x20, ['unsigned long']],
    'FreeHits' : [ 0x20, ['unsigned long']],
    'Type' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: 'NonPagedPoolBase', 1: 'PagedPool', 2: 'NonPagedPoolBaseMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolBaseCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolBaseCacheAlignedMustS', 7: 'MaxPoolType', 34: 'NonPagedPoolMustSucceedSession', 516: 'NonPagedPoolNxCacheAligned', 35: 'DontUseThisTypeSession', 32: 'NonPagedPoolSession', 512: 'NonPagedPoolNx', 544: 'NonPagedPoolSessionNx', 36: 'NonPagedPoolCacheAlignedSession', 33: 'PagedPoolSession', 38: 'NonPagedPoolCacheAlignedMustSSession', 37: 'PagedPoolCacheAlignedSession'})]],
    'Tag' : [ 0x28, ['unsigned long']],
    'Size' : [ 0x2c, ['unsigned long']],
    'AllocateEx' : [ 0x30, ['pointer64', ['void']]],
    'Allocate' : [ 0x30, ['pointer64', ['void']]],
    'FreeEx' : [ 0x38, ['pointer64', ['void']]],
    'Free' : [ 0x38, ['pointer64', ['void']]],
    'ListEntry' : [ 0x40, ['_LIST_ENTRY']],
    'LastTotalAllocates' : [ 0x50, ['unsigned long']],
    'LastAllocateMisses' : [ 0x54, ['unsigned long']],
    'LastAllocateHits' : [ 0x54, ['unsigned long']],
    'Future' : [ 0x58, ['array', 2, ['unsigned long']]],
} ],
  '_KNODE' : [ 0xc0, {
    'DeepIdleSet' : [ 0x0, ['unsigned long long']],
    'SharedReadyQueueLeaders' : [ 0x8, ['unsigned long long']],
    'ProximityId' : [ 0x40, ['unsigned long']],
    'NodeNumber' : [ 0x44, ['unsigned short']],
    'PrimaryNodeNumber' : [ 0x46, ['unsigned short']],
    'MaximumProcessors' : [ 0x48, ['unsigned char']],
    'Flags' : [ 0x49, ['_flags']],
    'Stride' : [ 0x4a, ['unsigned char']],
    'LowIndex' : [ 0x4b, ['unsigned char']],
    'Affinity' : [ 0x50, ['_GROUP_AFFINITY']],
    'IdleCpuSet' : [ 0x60, ['unsigned long long']],
    'IdleSmtSet' : [ 0x68, ['unsigned long long']],
    'NonParkedSet' : [ 0x80, ['unsigned long long']],
    'Seed' : [ 0x88, ['unsigned long']],
    'Lowest' : [ 0x8c, ['unsigned long']],
    'Highest' : [ 0x90, ['unsigned long']],
    'ParkLock' : [ 0x94, ['long']],
} ],
  '_ENODE' : [ 0x500, {
    'Ncb' : [ 0x0, ['_KNODE']],
    'ExWorkQueues' : [ 0xc0, ['array', 8, ['pointer64', ['_EX_WORK_QUEUE']]]],
    'ExWorkQueue' : [ 0x100, ['_EX_WORK_QUEUE']],
    'ExpThreadSetManagerEvent' : [ 0x3d0, ['_KEVENT']],
    'ExpDeadlockTimer' : [ 0x3e8, ['_KTIMER']],
    'ExpThreadReaperEvent' : [ 0x428, ['_KEVENT']],
    'WaitBlocks' : [ 0x440, ['array', 3, ['_KWAIT_BLOCK']]],
    'ExpWorkerThreadBalanceManagerPtr' : [ 0x4d0, ['pointer64', ['_ETHREAD']]],
    'ExpWorkerSeed' : [ 0x4d8, ['unsigned long']],
    'ExWorkerFullInit' : [ 0x4dc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ExWorkerStructInit' : [ 0x4dc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ExWorkerFlags' : [ 0x4dc, ['unsigned long']],
} ],
  '_HANDLE_TABLE' : [ 0x80, {
    'NextHandleNeedingPool' : [ 0x0, ['unsigned long']],
    'ExtraInfoPages' : [ 0x4, ['long']],
    'TableCode' : [ 0x8, ['unsigned long long']],
    'QuotaProcess' : [ 0x10, ['pointer64', ['_EPROCESS']]],
    'HandleTableList' : [ 0x18, ['_LIST_ENTRY']],
    'UniqueProcessId' : [ 0x28, ['unsigned long']],
    'Flags' : [ 0x2c, ['unsigned long']],
    'StrictFIFO' : [ 0x2c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'EnableHandleExceptions' : [ 0x2c, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Rundown' : [ 0x2c, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Duplicated' : [ 0x2c, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'HandleContentionEvent' : [ 0x30, ['_EX_PUSH_LOCK']],
    'HandleTableLock' : [ 0x38, ['_EX_PUSH_LOCK']],
    'FreeLists' : [ 0x40, ['array', 1, ['_HANDLE_TABLE_FREE_LIST']]],
    'ActualEntry' : [ 0x40, ['array', 32, ['unsigned char']]],
    'DebugInfo' : [ 0x60, ['pointer64', ['_HANDLE_TRACE_DEBUG_INFO']]],
} ],
  '_HANDLE_TABLE_ENTRY_INFO' : [ 0x4, {
    'AuditMask' : [ 0x0, ['unsigned long']],
} ],
  '_HANDLE_TABLE_ENTRY' : [ 0x10, {
    'VolatileLowValue' : [ 0x0, ['long long']],
    'LowValue' : [ 0x0, ['long long']],
    'InfoTable' : [ 0x0, ['pointer64', ['_HANDLE_TABLE_ENTRY_INFO']]],
    'Unlocked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'RefCnt' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 17, native_type='unsigned long long')]],
    'Attributes' : [ 0x0, ['BitField', dict(start_bit = 17, end_bit = 20, native_type='unsigned long long')]],
    'ObjectPointerBits' : [ 0x0, ['BitField', dict(start_bit = 20, end_bit = 64, native_type='unsigned long long')]],
    'HighValue' : [ 0x8, ['long long']],
    'NextFreeHandleEntry' : [ 0x8, ['pointer64', ['_HANDLE_TABLE_ENTRY']]],
    'LeafHandleValue' : [ 0x8, ['_EXHANDLE']],
    'GrantedAccessBits' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 25, native_type='unsigned long')]],
    'NoRightsUpgrade' : [ 0x8, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'Spare' : [ 0x8, ['BitField', dict(start_bit = 26, end_bit = 32, native_type='unsigned long')]],
    'TypeInfo' : [ 0xc, ['unsigned long']],
} ],
  '_EX_FAST_REF' : [ 0x8, {
    'Object' : [ 0x0, ['pointer64', ['void']]],
    'RefCnt' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long long')]],
    'Value' : [ 0x0, ['unsigned long long']],
} ],
  '__unnamed_1329' : [ 0x2c, {
    'InitialPrivilegeSet' : [ 0x0, ['_INITIAL_PRIVILEGE_SET']],
    'PrivilegeSet' : [ 0x0, ['_PRIVILEGE_SET']],
} ],
  '_ACCESS_STATE' : [ 0xa0, {
    'OperationID' : [ 0x0, ['_LUID']],
    'SecurityEvaluated' : [ 0x8, ['unsigned char']],
    'GenerateAudit' : [ 0x9, ['unsigned char']],
    'GenerateOnClose' : [ 0xa, ['unsigned char']],
    'PrivilegesAllocated' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['unsigned long']],
    'RemainingDesiredAccess' : [ 0x10, ['unsigned long']],
    'PreviouslyGrantedAccess' : [ 0x14, ['unsigned long']],
    'OriginalDesiredAccess' : [ 0x18, ['unsigned long']],
    'SubjectSecurityContext' : [ 0x20, ['_SECURITY_SUBJECT_CONTEXT']],
    'SecurityDescriptor' : [ 0x40, ['pointer64', ['void']]],
    'AuxData' : [ 0x48, ['pointer64', ['void']]],
    'Privileges' : [ 0x50, ['__unnamed_1329']],
    'AuditPrivileges' : [ 0x7c, ['unsigned char']],
    'ObjectName' : [ 0x80, ['_UNICODE_STRING']],
    'ObjectTypeName' : [ 0x90, ['_UNICODE_STRING']],
} ],
  '_AUX_ACCESS_DATA' : [ 0xe0, {
    'PrivilegesUsed' : [ 0x0, ['pointer64', ['_PRIVILEGE_SET']]],
    'GenericMapping' : [ 0x8, ['_GENERIC_MAPPING']],
    'AccessesToAudit' : [ 0x18, ['unsigned long']],
    'MaximumAuditMask' : [ 0x1c, ['unsigned long']],
    'TransactionId' : [ 0x20, ['_GUID']],
    'NewSecurityDescriptor' : [ 0x30, ['pointer64', ['void']]],
    'ExistingSecurityDescriptor' : [ 0x38, ['pointer64', ['void']]],
    'ParentSecurityDescriptor' : [ 0x40, ['pointer64', ['void']]],
    'DeRefSecurityDescriptor' : [ 0x48, ['pointer64', ['void']]],
    'SDLock' : [ 0x50, ['pointer64', ['void']]],
    'AccessReasons' : [ 0x58, ['_ACCESS_REASONS']],
    'GenerateStagingEvents' : [ 0xd8, ['unsigned char']],
} ],
  '_ETHREAD' : [ 0x778, {
    'Tcb' : [ 0x0, ['_KTHREAD']],
    'CreateTime' : [ 0x5d0, ['_LARGE_INTEGER']],
    'ExitTime' : [ 0x5d8, ['_LARGE_INTEGER']],
    'KeyedWaitChain' : [ 0x5d8, ['_LIST_ENTRY']],
    'ChargeOnlySession' : [ 0x5e8, ['pointer64', ['void']]],
    'PostBlockList' : [ 0x5f0, ['_LIST_ENTRY']],
    'ForwardLinkShadow' : [ 0x5f0, ['pointer64', ['void']]],
    'StartAddress' : [ 0x5f8, ['pointer64', ['void']]],
    'TerminationPort' : [ 0x600, ['pointer64', ['_TERMINATION_PORT']]],
    'ReaperLink' : [ 0x600, ['pointer64', ['_ETHREAD']]],
    'KeyedWaitValue' : [ 0x600, ['pointer64', ['void']]],
    'ActiveTimerListLock' : [ 0x608, ['unsigned long long']],
    'ActiveTimerListHead' : [ 0x610, ['_LIST_ENTRY']],
    'Cid' : [ 0x620, ['_CLIENT_ID']],
    'KeyedWaitSemaphore' : [ 0x630, ['_KSEMAPHORE']],
    'AlpcWaitSemaphore' : [ 0x630, ['_KSEMAPHORE']],
    'ClientSecurity' : [ 0x650, ['_PS_CLIENT_SECURITY_CONTEXT']],
    'IrpList' : [ 0x658, ['_LIST_ENTRY']],
    'TopLevelIrp' : [ 0x668, ['unsigned long long']],
    'DeviceToVerify' : [ 0x670, ['pointer64', ['_DEVICE_OBJECT']]],
    'Win32StartAddress' : [ 0x678, ['pointer64', ['void']]],
    'LegacyPowerObject' : [ 0x680, ['pointer64', ['void']]],
    'ThreadListEntry' : [ 0x688, ['_LIST_ENTRY']],
    'RundownProtect' : [ 0x698, ['_EX_RUNDOWN_REF']],
    'ThreadLock' : [ 0x6a0, ['_EX_PUSH_LOCK']],
    'ReadClusterSize' : [ 0x6a8, ['unsigned long']],
    'MmLockOrdering' : [ 0x6ac, ['long']],
    'CmLockOrdering' : [ 0x6b0, ['long']],
    'CrossThreadFlags' : [ 0x6b4, ['unsigned long']],
    'Terminated' : [ 0x6b4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ThreadInserted' : [ 0x6b4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'HideFromDebugger' : [ 0x6b4, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ActiveImpersonationInfo' : [ 0x6b4, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'HardErrorsAreDisabled' : [ 0x6b4, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0x6b4, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'SkipCreationMsg' : [ 0x6b4, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'SkipTerminationMsg' : [ 0x6b4, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'CopyTokenOnOpen' : [ 0x6b4, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'ThreadIoPriority' : [ 0x6b4, ['BitField', dict(start_bit = 9, end_bit = 12, native_type='unsigned long')]],
    'ThreadPagePriority' : [ 0x6b4, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
    'RundownFail' : [ 0x6b4, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'UmsForceQueueTermination' : [ 0x6b4, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'ReservedCrossThreadFlags' : [ 0x6b4, ['BitField', dict(start_bit = 17, end_bit = 32, native_type='unsigned long')]],
    'SameThreadPassiveFlags' : [ 0x6b8, ['unsigned long']],
    'ActiveExWorker' : [ 0x6b8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MemoryMaker' : [ 0x6b8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ClonedThread' : [ 0x6b8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'KeyedEventInUse' : [ 0x6b8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'SelfTerminate' : [ 0x6b8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'SameThreadApcFlags' : [ 0x6bc, ['unsigned long']],
    'HardFaultBehavior' : [ 0x6bc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'StartAddressInvalid' : [ 0x6bc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'EtwCalloutActive' : [ 0x6bc, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'OwnsProcessWorkingSetExclusive' : [ 0x6bc, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'OwnsProcessWorkingSetShared' : [ 0x6bc, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'OwnsSystemCacheWorkingSetExclusive' : [ 0x6bc, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'OwnsSystemCacheWorkingSetShared' : [ 0x6bc, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'OwnsSessionWorkingSetExclusive' : [ 0x6bc, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'OwnsSessionWorkingSetShared' : [ 0x6bd, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'OwnsProcessAddressSpaceExclusive' : [ 0x6bd, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'OwnsProcessAddressSpaceShared' : [ 0x6bd, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'SuppressSymbolLoad' : [ 0x6bd, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Prefetching' : [ 0x6bd, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'OwnsVadExclusive' : [ 0x6bd, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'OwnsChangeControlAreaExclusive' : [ 0x6bd, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'OwnsChangeControlAreaShared' : [ 0x6bd, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'OwnsPagedPoolWorkingSetExclusive' : [ 0x6be, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'OwnsPagedPoolWorkingSetShared' : [ 0x6be, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'OwnsSystemPtesWorkingSetExclusive' : [ 0x6be, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'OwnsSystemPtesWorkingSetShared' : [ 0x6be, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'TrimTrigger' : [ 0x6be, ['BitField', dict(start_bit = 4, end_bit = 6, native_type='unsigned char')]],
    'Spare2' : [ 0x6be, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'SystemPagePriorityActive' : [ 0x6bf, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'SystemPagePriority' : [ 0x6bf, ['BitField', dict(start_bit = 1, end_bit = 4, native_type='unsigned char')]],
    'Spare3' : [ 0x6bf, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'CacheManagerActive' : [ 0x6c0, ['unsigned char']],
    'DisablePageFaultClustering' : [ 0x6c1, ['unsigned char']],
    'ActiveFaultCount' : [ 0x6c2, ['unsigned char']],
    'LockOrderState' : [ 0x6c3, ['unsigned char']],
    'AlpcMessageId' : [ 0x6c8, ['unsigned long long']],
    'AlpcMessage' : [ 0x6d0, ['pointer64', ['void']]],
    'AlpcReceiveAttributeSet' : [ 0x6d0, ['unsigned long']],
    'ExitStatus' : [ 0x6d8, ['long']],
    'AlpcWaitListEntry' : [ 0x6e0, ['_LIST_ENTRY']],
    'CacheManagerCount' : [ 0x6f0, ['unsigned long']],
    'IoBoostCount' : [ 0x6f4, ['unsigned long']],
    'BoostList' : [ 0x6f8, ['_LIST_ENTRY']],
    'DeboostList' : [ 0x708, ['_LIST_ENTRY']],
    'BoostListLock' : [ 0x718, ['unsigned long long']],
    'IrpListLock' : [ 0x720, ['unsigned long long']],
    'ReservedForSynchTracking' : [ 0x728, ['pointer64', ['void']]],
    'CmCallbackListHead' : [ 0x730, ['_SINGLE_LIST_ENTRY']],
    'ActivityId' : [ 0x738, ['pointer64', ['_GUID']]],
    'SeLearningModeListHead' : [ 0x740, ['_SINGLE_LIST_ENTRY']],
    'VerifierContext' : [ 0x748, ['pointer64', ['void']]],
    'KernelStackReference' : [ 0x750, ['unsigned long']],
    'AdjustedClientToken' : [ 0x758, ['pointer64', ['void']]],
    'UserFsBase' : [ 0x760, ['unsigned long']],
    'UserGsBase' : [ 0x768, ['unsigned long long']],
    'PicoContext' : [ 0x770, ['pointer64', ['void']]],
} ],
  '_EPROCESS' : [ 0x6f0, {
    'Pcb' : [ 0x0, ['_KPROCESS']],
    'ProcessLock' : [ 0x2c8, ['_EX_PUSH_LOCK']],
    'CreateTime' : [ 0x2d0, ['_LARGE_INTEGER']],
    'RundownProtect' : [ 0x2d8, ['_EX_RUNDOWN_REF']],
    'UniqueProcessId' : [ 0x2e0, ['pointer64', ['void']]],
    'ActiveProcessLinks' : [ 0x2e8, ['_LIST_ENTRY']],
    'Flags2' : [ 0x2f8, ['unsigned long']],
    'JobNotReallyActive' : [ 0x2f8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AccountingFolded' : [ 0x2f8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'NewProcessReported' : [ 0x2f8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ExitProcessReported' : [ 0x2f8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ReportCommitChanges' : [ 0x2f8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'LastReportMemory' : [ 0x2f8, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'ForceWakeCharge' : [ 0x2f8, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'CrossSessionCreate' : [ 0x2f8, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'NeedsHandleRundown' : [ 0x2f8, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'RefTraceEnabled' : [ 0x2f8, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DisableDynamicCode' : [ 0x2f8, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'EmptyJobEvaluated' : [ 0x2f8, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DefaultPagePriority' : [ 0x2f8, ['BitField', dict(start_bit = 12, end_bit = 15, native_type='unsigned long')]],
    'PrimaryTokenFrozen' : [ 0x2f8, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessVerifierTarget' : [ 0x2f8, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'StackRandomizationDisabled' : [ 0x2f8, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'AffinityPermanent' : [ 0x2f8, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'AffinityUpdateEnable' : [ 0x2f8, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'PropagateNode' : [ 0x2f8, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'ExplicitAffinity' : [ 0x2f8, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ProcessExecutionState' : [ 0x2f8, ['BitField', dict(start_bit = 22, end_bit = 24, native_type='unsigned long')]],
    'DisallowStrippedImages' : [ 0x2f8, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'HighEntropyASLREnabled' : [ 0x2f8, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'ExtensionPointDisable' : [ 0x2f8, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'ForceRelocateImages' : [ 0x2f8, ['BitField', dict(start_bit = 27, end_bit = 28, native_type='unsigned long')]],
    'ProcessStateChangeRequest' : [ 0x2f8, ['BitField', dict(start_bit = 28, end_bit = 30, native_type='unsigned long')]],
    'ProcessStateChangeInProgress' : [ 0x2f8, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'DisallowWin32kSystemCalls' : [ 0x2f8, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'Flags' : [ 0x2fc, ['unsigned long']],
    'CreateReported' : [ 0x2fc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'NoDebugInherit' : [ 0x2fc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessExiting' : [ 0x2fc, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ProcessDelete' : [ 0x2fc, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ControlFlowGuardEnabled' : [ 0x2fc, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'VmDeleted' : [ 0x2fc, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'OutswapEnabled' : [ 0x2fc, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Outswapped' : [ 0x2fc, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ForkFailed' : [ 0x2fc, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Wow64VaSpace4Gb' : [ 0x2fc, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'AddressSpaceInitialized' : [ 0x2fc, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
    'SetTimerResolution' : [ 0x2fc, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'BreakOnTermination' : [ 0x2fc, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'DeprioritizeViews' : [ 0x2fc, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'WriteWatch' : [ 0x2fc, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'ProcessInSession' : [ 0x2fc, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'OverrideAddressSpace' : [ 0x2fc, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'HasAddressSpace' : [ 0x2fc, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'LaunchPrefetched' : [ 0x2fc, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'Background' : [ 0x2fc, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'VmTopDown' : [ 0x2fc, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'ImageNotifyDone' : [ 0x2fc, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'PdeUpdateNeeded' : [ 0x2fc, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'VdmAllowed' : [ 0x2fc, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'ProcessRundown' : [ 0x2fc, ['BitField', dict(start_bit = 25, end_bit = 26, native_type='unsigned long')]],
    'ProcessInserted' : [ 0x2fc, ['BitField', dict(start_bit = 26, end_bit = 27, native_type='unsigned long')]],
    'DefaultIoPriority' : [ 0x2fc, ['BitField', dict(start_bit = 27, end_bit = 30, native_type='unsigned long')]],
    'ProcessSelfDelete' : [ 0x2fc, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'SetTimerResolutionLink' : [ 0x2fc, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'ProcessQuotaUsage' : [ 0x300, ['array', 2, ['unsigned long long']]],
    'ProcessQuotaPeak' : [ 0x310, ['array', 2, ['unsigned long long']]],
    'PeakVirtualSize' : [ 0x320, ['unsigned long long']],
    'VirtualSize' : [ 0x328, ['unsigned long long']],
    'SessionProcessLinks' : [ 0x330, ['_LIST_ENTRY']],
    'ExceptionPortData' : [ 0x340, ['pointer64', ['void']]],
    'ExceptionPortValue' : [ 0x340, ['unsigned long long']],
    'ExceptionPortState' : [ 0x340, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long long')]],
    'Token' : [ 0x348, ['_EX_FAST_REF']],
    'WorkingSetPage' : [ 0x350, ['unsigned long long']],
    'AddressCreationLock' : [ 0x358, ['_EX_PUSH_LOCK']],
    'PageTableCommitmentLock' : [ 0x360, ['_EX_PUSH_LOCK']],
    'RotateInProgress' : [ 0x368, ['pointer64', ['_ETHREAD']]],
    'ForkInProgress' : [ 0x370, ['pointer64', ['_ETHREAD']]],
    'CommitChargeJob' : [ 0x378, ['pointer64', ['_EJOB']]],
    'CloneRoot' : [ 0x380, ['_RTL_AVL_TREE']],
    'NumberOfPrivatePages' : [ 0x388, ['unsigned long long']],
    'NumberOfLockedPages' : [ 0x390, ['unsigned long long']],
    'Win32Process' : [ 0x398, ['pointer64', ['void']]],
    'Job' : [ 0x3a0, ['pointer64', ['_EJOB']]],
    'SectionObject' : [ 0x3a8, ['pointer64', ['void']]],
    'SectionBaseAddress' : [ 0x3b0, ['pointer64', ['void']]],
    'Cookie' : [ 0x3b8, ['unsigned long']],
    'WorkingSetWatch' : [ 0x3c0, ['pointer64', ['_PAGEFAULT_HISTORY']]],
    'Win32WindowStation' : [ 0x3c8, ['pointer64', ['void']]],
    'InheritedFromUniqueProcessId' : [ 0x3d0, ['pointer64', ['void']]],
    'LdtInformation' : [ 0x3d8, ['pointer64', ['void']]],
    'OwnerProcessId' : [ 0x3e0, ['unsigned long long']],
    'Peb' : [ 0x3e8, ['pointer64', ['_PEB']]],
    'Session' : [ 0x3f0, ['pointer64', ['void']]],
    'AweInfo' : [ 0x3f8, ['pointer64', ['void']]],
    'QuotaBlock' : [ 0x400, ['pointer64', ['_EPROCESS_QUOTA_BLOCK']]],
    'ObjectTable' : [ 0x408, ['pointer64', ['_HANDLE_TABLE']]],
    'DebugPort' : [ 0x410, ['pointer64', ['void']]],
    'Wow64Process' : [ 0x418, ['pointer64', ['void']]],
    'DeviceMap' : [ 0x420, ['pointer64', ['void']]],
    'EtwDataSource' : [ 0x428, ['pointer64', ['void']]],
    'PageDirectoryPte' : [ 0x430, ['unsigned long long']],
    'ImageFileName' : [ 0x438, ['array', 15, ['unsigned char']]],
    'PriorityClass' : [ 0x447, ['unsigned char']],
    'SecurityPort' : [ 0x448, ['pointer64', ['void']]],
    'SeAuditProcessCreationInfo' : [ 0x450, ['_SE_AUDIT_PROCESS_CREATION_INFO']],
    'JobLinks' : [ 0x458, ['_LIST_ENTRY']],
    'HighestUserAddress' : [ 0x468, ['pointer64', ['void']]],
    'ThreadListHead' : [ 0x470, ['_LIST_ENTRY']],
    'ActiveThreads' : [ 0x480, ['unsigned long']],
    'ImagePathHash' : [ 0x484, ['unsigned long']],
    'DefaultHardErrorProcessing' : [ 0x488, ['unsigned long']],
    'LastThreadExitStatus' : [ 0x48c, ['long']],
    'PrefetchTrace' : [ 0x490, ['_EX_FAST_REF']],
    'LockedPagesList' : [ 0x498, ['pointer64', ['void']]],
    'ReadOperationCount' : [ 0x4a0, ['_LARGE_INTEGER']],
    'WriteOperationCount' : [ 0x4a8, ['_LARGE_INTEGER']],
    'OtherOperationCount' : [ 0x4b0, ['_LARGE_INTEGER']],
    'ReadTransferCount' : [ 0x4b8, ['_LARGE_INTEGER']],
    'WriteTransferCount' : [ 0x4c0, ['_LARGE_INTEGER']],
    'OtherTransferCount' : [ 0x4c8, ['_LARGE_INTEGER']],
    'CommitCharge' : [ 0x4d0, ['unsigned long long']],
    'Vm' : [ 0x4d8, ['_MMSUPPORT']],
    'MmProcessLinks' : [ 0x5c0, ['_LIST_ENTRY']],
    'ModifiedPageCount' : [ 0x5d0, ['unsigned long']],
    'ExitStatus' : [ 0x5d4, ['long']],
    'VadRoot' : [ 0x5d8, ['_RTL_AVL_TREE']],
    'VadHint' : [ 0x5e0, ['pointer64', ['void']]],
    'VadCount' : [ 0x5e8, ['unsigned long long']],
    'VadPhysicalPages' : [ 0x5f0, ['unsigned long long']],
    'VadPhysicalPagesLimit' : [ 0x5f8, ['unsigned long long']],
    'AlpcContext' : [ 0x600, ['_ALPC_PROCESS_CONTEXT']],
    'TimerResolutionLink' : [ 0x620, ['_LIST_ENTRY']],
    'TimerResolutionStackRecord' : [ 0x630, ['pointer64', ['_PO_DIAG_STACK_RECORD']]],
    'RequestedTimerResolution' : [ 0x638, ['unsigned long']],
    'SmallestTimerResolution' : [ 0x63c, ['unsigned long']],
    'ExitTime' : [ 0x640, ['_LARGE_INTEGER']],
    'InvertedFunctionTable' : [ 0x648, ['pointer64', ['_INVERTED_FUNCTION_TABLE']]],
    'InvertedFunctionTableLock' : [ 0x650, ['_EX_PUSH_LOCK']],
    'ActiveThreadsHighWatermark' : [ 0x658, ['unsigned long']],
    'LargePrivateVadCount' : [ 0x65c, ['unsigned long']],
    'ThreadListLock' : [ 0x660, ['_EX_PUSH_LOCK']],
    'WnfContext' : [ 0x668, ['pointer64', ['void']]],
    'Spare0' : [ 0x670, ['unsigned long long']],
    'SignatureLevel' : [ 0x678, ['unsigned char']],
    'SectionSignatureLevel' : [ 0x679, ['unsigned char']],
    'Protection' : [ 0x67a, ['_PS_PROTECTION']],
    'SpareByte20' : [ 0x67b, ['array', 1, ['unsigned char']]],
    'Flags3' : [ 0x67c, ['unsigned long']],
    'Minimal' : [ 0x67c, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'SvmReserved' : [ 0x680, ['long']],
    'SvmReserved1' : [ 0x688, ['pointer64', ['void']]],
    'SvmReserved2' : [ 0x690, ['unsigned long long']],
    'LastFreezeInterruptTime' : [ 0x698, ['unsigned long long']],
    'DiskCounters' : [ 0x6a0, ['pointer64', ['_PROCESS_DISK_COUNTERS']]],
    'PicoContext' : [ 0x6a8, ['pointer64', ['void']]],
    'KeepAliveCounter' : [ 0x6b0, ['unsigned long']],
    'NoWakeKeepAliveCounter' : [ 0x6b4, ['unsigned long']],
    'DeepFreezeStartTime' : [ 0x6b8, ['unsigned long long']],
    'CommitChargeLimit' : [ 0x6c0, ['unsigned long long']],
    'CommitChargePeak' : [ 0x6c8, ['unsigned long long']],
    'HighPriorityFaultsAllowed' : [ 0x6d0, ['unsigned long']],
    'SequenceNumber' : [ 0x6d8, ['unsigned long long']],
    'CreateInterruptTime' : [ 0x6e0, ['unsigned long long']],
    'CreateUnbiasedInterruptTime' : [ 0x6e8, ['unsigned long long']],
} ],
  '_KPROCESS' : [ 0x2c8, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'ProfileListHead' : [ 0x18, ['_LIST_ENTRY']],
    'DirectoryTableBase' : [ 0x28, ['unsigned long long']],
    'ThreadListHead' : [ 0x30, ['_LIST_ENTRY']],
    'ProcessLock' : [ 0x40, ['unsigned long']],
    'Spare0' : [ 0x44, ['unsigned long']],
    'Affinity' : [ 0x48, ['_KAFFINITY_EX']],
    'ReadyListHead' : [ 0xf0, ['_LIST_ENTRY']],
    'SwapListEntry' : [ 0x100, ['_SINGLE_LIST_ENTRY']],
    'ActiveProcessors' : [ 0x108, ['_KAFFINITY_EX']],
    'AutoAlignment' : [ 0x1b0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='long')]],
    'DisableBoost' : [ 0x1b0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='long')]],
    'DisableQuantum' : [ 0x1b0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='long')]],
    'AffinitySet' : [ 0x1b0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='long')]],
    'DeepFreeze' : [ 0x1b0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'TimerVirtualization' : [ 0x1b0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'CheckStackExtents' : [ 0x1b0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'ActiveGroupsMask' : [ 0x1b0, ['BitField', dict(start_bit = 7, end_bit = 27, native_type='unsigned long')]],
    'ReservedFlags' : [ 0x1b0, ['BitField', dict(start_bit = 27, end_bit = 32, native_type='long')]],
    'ProcessFlags' : [ 0x1b0, ['long']],
    'BasePriority' : [ 0x1b4, ['unsigned char']],
    'QuantumReset' : [ 0x1b5, ['unsigned char']],
    'Visited' : [ 0x1b6, ['unsigned char']],
    'Flags' : [ 0x1b7, ['_KEXECUTE_OPTIONS']],
    'ThreadSeed' : [ 0x1b8, ['array', 20, ['unsigned long']]],
    'IdealNode' : [ 0x208, ['array', 20, ['unsigned short']]],
    'IdealGlobalNode' : [ 0x230, ['unsigned short']],
    'Spare1' : [ 0x232, ['unsigned short']],
    'StackCount' : [ 0x234, ['_KSTACK_COUNT']],
    'ProcessListEntry' : [ 0x238, ['_LIST_ENTRY']],
    'CycleTime' : [ 0x248, ['unsigned long long']],
    'ContextSwitches' : [ 0x250, ['unsigned long long']],
    'SchedulingGroup' : [ 0x258, ['pointer64', ['_KSCHEDULING_GROUP']]],
    'FreezeCount' : [ 0x260, ['unsigned long']],
    'KernelTime' : [ 0x264, ['unsigned long']],
    'UserTime' : [ 0x268, ['unsigned long']],
    'LdtFreeSelectorHint' : [ 0x26c, ['unsigned short']],
    'LdtTableLength' : [ 0x26e, ['unsigned short']],
    'LdtSystemDescriptor' : [ 0x270, ['_KGDTENTRY64']],
    'LdtBaseAddress' : [ 0x280, ['pointer64', ['void']]],
    'LdtProcessLock' : [ 0x288, ['_FAST_MUTEX']],
    'InstrumentationCallback' : [ 0x2c0, ['pointer64', ['void']]],
} ],
  '__unnamed_1381' : [ 0x8, {
    'MasterIrp' : [ 0x0, ['pointer64', ['_IRP']]],
    'IrpCount' : [ 0x0, ['long']],
    'SystemBuffer' : [ 0x0, ['pointer64', ['void']]],
} ],
  '__unnamed_1387' : [ 0x10, {
    'UserApcRoutine' : [ 0x0, ['pointer64', ['void']]],
    'IssuingProcess' : [ 0x0, ['pointer64', ['void']]],
    'UserApcContext' : [ 0x8, ['pointer64', ['void']]],
} ],
  '__unnamed_1389' : [ 0x10, {
    'AsynchronousParameters' : [ 0x0, ['__unnamed_1387']],
    'AllocationSize' : [ 0x0, ['_LARGE_INTEGER']],
} ],
  '__unnamed_1394' : [ 0x58, {
    'DeviceQueueEntry' : [ 0x0, ['_KDEVICE_QUEUE_ENTRY']],
    'DriverContext' : [ 0x0, ['array', 4, ['pointer64', ['void']]]],
    'Thread' : [ 0x20, ['pointer64', ['_ETHREAD']]],
    'AuxiliaryBuffer' : [ 0x28, ['pointer64', ['unsigned char']]],
    'ListEntry' : [ 0x30, ['_LIST_ENTRY']],
    'CurrentStackLocation' : [ 0x40, ['pointer64', ['_IO_STACK_LOCATION']]],
    'PacketType' : [ 0x40, ['unsigned long']],
    'OriginalFileObject' : [ 0x48, ['pointer64', ['_FILE_OBJECT']]],
    'IrpExtension' : [ 0x50, ['pointer64', ['void']]],
} ],
  '__unnamed_1396' : [ 0x58, {
    'Overlay' : [ 0x0, ['__unnamed_1394']],
    'Apc' : [ 0x0, ['_KAPC']],
    'CompletionKey' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_IRP' : [ 0xd0, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'AllocationProcessorNumber' : [ 0x4, ['unsigned short']],
    'Reserved' : [ 0x6, ['unsigned short']],
    'MdlAddress' : [ 0x8, ['pointer64', ['_MDL']]],
    'Flags' : [ 0x10, ['unsigned long']],
    'AssociatedIrp' : [ 0x18, ['__unnamed_1381']],
    'ThreadListEntry' : [ 0x20, ['_LIST_ENTRY']],
    'IoStatus' : [ 0x30, ['_IO_STATUS_BLOCK']],
    'RequestorMode' : [ 0x40, ['unsigned char']],
    'PendingReturned' : [ 0x41, ['unsigned char']],
    'StackCount' : [ 0x42, ['unsigned char']],
    'CurrentLocation' : [ 0x43, ['unsigned char']],
    'Cancel' : [ 0x44, ['unsigned char']],
    'CancelIrql' : [ 0x45, ['unsigned char']],
    'ApcEnvironment' : [ 0x46, ['unsigned char']],
    'AllocationFlags' : [ 0x47, ['unsigned char']],
    'UserIosb' : [ 0x48, ['pointer64', ['_IO_STATUS_BLOCK']]],
    'UserEvent' : [ 0x50, ['pointer64', ['_KEVENT']]],
    'Overlay' : [ 0x58, ['__unnamed_1389']],
    'CancelRoutine' : [ 0x68, ['pointer64', ['void']]],
    'UserBuffer' : [ 0x70, ['pointer64', ['void']]],
    'Tail' : [ 0x78, ['__unnamed_1396']],
} ],
  '__unnamed_139d' : [ 0x20, {
    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x8, ['unsigned long']],
    'FileAttributes' : [ 0x10, ['unsigned short']],
    'ShareAccess' : [ 0x12, ['unsigned short']],
    'EaLength' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_13a1' : [ 0x20, {
    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0x10, ['unsigned short']],
    'ShareAccess' : [ 0x12, ['unsigned short']],
    'Parameters' : [ 0x18, ['pointer64', ['_NAMED_PIPE_CREATE_PARAMETERS']]],
} ],
  '__unnamed_13a5' : [ 0x20, {
    'SecurityContext' : [ 0x0, ['pointer64', ['_IO_SECURITY_CONTEXT']]],
    'Options' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0x10, ['unsigned short']],
    'ShareAccess' : [ 0x12, ['unsigned short']],
    'Parameters' : [ 0x18, ['pointer64', ['_MAILSLOT_CREATE_PARAMETERS']]],
} ],
  '__unnamed_13a7' : [ 0x18, {
    'Length' : [ 0x0, ['unsigned long']],
    'Key' : [ 0x8, ['unsigned long']],
    'ByteOffset' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_13ab' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileName' : [ 0x8, ['pointer64', ['_UNICODE_STRING']]],
    'FileInformationClass' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileIsRemoteDeviceInformation', 52: 'FileUnusedInformation', 53: 'FileNumaNodeInformation', 54: 'FileStandardLinkInformation', 55: 'FileRemoteProtocolInformation', 56: 'FileRenameInformationBypassAccessCheck', 57: 'FileLinkInformationBypassAccessCheck', 58: 'FileVolumeNameInformation', 59: 'FileIdInformation', 60: 'FileIdExtdDirectoryInformation', 61: 'FileReplaceCompletionInformation', 62: 'FileHardLinkFullIdInformation', 63: 'FileIdExtdBothDirectoryInformation', 64: 'FileMaximumInformation'})]],
    'FileIndex' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_13ad' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'CompletionFilter' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_13af' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileIsRemoteDeviceInformation', 52: 'FileUnusedInformation', 53: 'FileNumaNodeInformation', 54: 'FileStandardLinkInformation', 55: 'FileRemoteProtocolInformation', 56: 'FileRenameInformationBypassAccessCheck', 57: 'FileLinkInformationBypassAccessCheck', 58: 'FileVolumeNameInformation', 59: 'FileIdInformation', 60: 'FileIdExtdDirectoryInformation', 61: 'FileReplaceCompletionInformation', 62: 'FileHardLinkFullIdInformation', 63: 'FileIdExtdBothDirectoryInformation', 64: 'FileMaximumInformation'})]],
} ],
  '__unnamed_13b1' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'FileInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: 'FileDirectoryInformation', 2: 'FileFullDirectoryInformation', 3: 'FileBothDirectoryInformation', 4: 'FileBasicInformation', 5: 'FileStandardInformation', 6: 'FileInternalInformation', 7: 'FileEaInformation', 8: 'FileAccessInformation', 9: 'FileNameInformation', 10: 'FileRenameInformation', 11: 'FileLinkInformation', 12: 'FileNamesInformation', 13: 'FileDispositionInformation', 14: 'FilePositionInformation', 15: 'FileFullEaInformation', 16: 'FileModeInformation', 17: 'FileAlignmentInformation', 18: 'FileAllInformation', 19: 'FileAllocationInformation', 20: 'FileEndOfFileInformation', 21: 'FileAlternateNameInformation', 22: 'FileStreamInformation', 23: 'FilePipeInformation', 24: 'FilePipeLocalInformation', 25: 'FilePipeRemoteInformation', 26: 'FileMailslotQueryInformation', 27: 'FileMailslotSetInformation', 28: 'FileCompressionInformation', 29: 'FileObjectIdInformation', 30: 'FileCompletionInformation', 31: 'FileMoveClusterInformation', 32: 'FileQuotaInformation', 33: 'FileReparsePointInformation', 34: 'FileNetworkOpenInformation', 35: 'FileAttributeTagInformation', 36: 'FileTrackingInformation', 37: 'FileIdBothDirectoryInformation', 38: 'FileIdFullDirectoryInformation', 39: 'FileValidDataLengthInformation', 40: 'FileShortNameInformation', 41: 'FileIoCompletionNotificationInformation', 42: 'FileIoStatusBlockRangeInformation', 43: 'FileIoPriorityHintInformation', 44: 'FileSfioReserveInformation', 45: 'FileSfioVolumeInformation', 46: 'FileHardLinkInformation', 47: 'FileProcessIdsUsingFileInformation', 48: 'FileNormalizedNameInformation', 49: 'FileNetworkPhysicalNameInformation', 50: 'FileIdGlobalTxDirectoryInformation', 51: 'FileIsRemoteDeviceInformation', 52: 'FileUnusedInformation', 53: 'FileNumaNodeInformation', 54: 'FileStandardLinkInformation', 55: 'FileRemoteProtocolInformation', 56: 'FileRenameInformationBypassAccessCheck', 57: 'FileLinkInformationBypassAccessCheck', 58: 'FileVolumeNameInformation', 59: 'FileIdInformation', 60: 'FileIdExtdDirectoryInformation', 61: 'FileReplaceCompletionInformation', 62: 'FileHardLinkFullIdInformation', 63: 'FileIdExtdBothDirectoryInformation', 64: 'FileMaximumInformation'})]],
    'FileObject' : [ 0x10, ['pointer64', ['_FILE_OBJECT']]],
    'ReplaceIfExists' : [ 0x18, ['unsigned char']],
    'AdvanceOnly' : [ 0x19, ['unsigned char']],
    'ClusterCount' : [ 0x18, ['unsigned long']],
    'DeleteHandle' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_13b3' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'EaList' : [ 0x8, ['pointer64', ['void']]],
    'EaListLength' : [ 0x10, ['unsigned long']],
    'EaIndex' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_13b5' : [ 0x4, {
    'Length' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_13b9' : [ 0x10, {
    'Length' : [ 0x0, ['unsigned long']],
    'FsInformationClass' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {1: 'FileFsVolumeInformation', 2: 'FileFsLabelInformation', 3: 'FileFsSizeInformation', 4: 'FileFsDeviceInformation', 5: 'FileFsAttributeInformation', 6: 'FileFsControlInformation', 7: 'FileFsFullSizeInformation', 8: 'FileFsObjectIdInformation', 9: 'FileFsDriverPathInformation', 10: 'FileFsVolumeFlagsInformation', 11: 'FileFsSectorSizeInformation', 12: 'FileFsDataCopyInformation', 13: 'FileFsMaximumInformation'})]],
} ],
  '__unnamed_13bb' : [ 0x20, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x8, ['unsigned long']],
    'FsControlCode' : [ 0x10, ['unsigned long']],
    'Type3InputBuffer' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_13bd' : [ 0x18, {
    'Length' : [ 0x0, ['pointer64', ['_LARGE_INTEGER']]],
    'Key' : [ 0x8, ['unsigned long']],
    'ByteOffset' : [ 0x10, ['_LARGE_INTEGER']],
} ],
  '__unnamed_13bf' : [ 0x20, {
    'OutputBufferLength' : [ 0x0, ['unsigned long']],
    'InputBufferLength' : [ 0x8, ['unsigned long']],
    'IoControlCode' : [ 0x10, ['unsigned long']],
    'Type3InputBuffer' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_13c1' : [ 0x10, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'Length' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_13c3' : [ 0x10, {
    'SecurityInformation' : [ 0x0, ['unsigned long']],
    'SecurityDescriptor' : [ 0x8, ['pointer64', ['void']]],
} ],
  '__unnamed_13c7' : [ 0x10, {
    'Vpb' : [ 0x0, ['pointer64', ['_VPB']]],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
} ],
  '__unnamed_13cb' : [ 0x8, {
    'Srb' : [ 0x0, ['pointer64', ['_SCSI_REQUEST_BLOCK']]],
} ],
  '__unnamed_13cf' : [ 0x20, {
    'Length' : [ 0x0, ['unsigned long']],
    'StartSid' : [ 0x8, ['pointer64', ['void']]],
    'SidList' : [ 0x10, ['pointer64', ['_FILE_GET_QUOTA_INFORMATION']]],
    'SidListLength' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_13d3' : [ 0x4, {
    'Type' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'BusRelations', 1: 'EjectionRelations', 2: 'PowerRelations', 3: 'RemovalRelations', 4: 'TargetDeviceRelation', 5: 'SingleBusRelations', 6: 'TransportRelations'})]],
} ],
  '__unnamed_13d7' : [ 0x20, {
    'InterfaceType' : [ 0x0, ['pointer64', ['_GUID']]],
    'Size' : [ 0x8, ['unsigned short']],
    'Version' : [ 0xa, ['unsigned short']],
    'Interface' : [ 0x10, ['pointer64', ['_INTERFACE']]],
    'InterfaceSpecificData' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_13db' : [ 0x8, {
    'Capabilities' : [ 0x0, ['pointer64', ['_DEVICE_CAPABILITIES']]],
} ],
  '__unnamed_13df' : [ 0x8, {
    'IoResourceRequirementList' : [ 0x0, ['pointer64', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
} ],
  '__unnamed_13e1' : [ 0x20, {
    'WhichSpace' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x8, ['pointer64', ['void']]],
    'Offset' : [ 0x10, ['unsigned long']],
    'Length' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_13e3' : [ 0x1, {
    'Lock' : [ 0x0, ['unsigned char']],
} ],
  '__unnamed_13e7' : [ 0x4, {
    'IdType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'BusQueryDeviceID', 1: 'BusQueryHardwareIDs', 2: 'BusQueryCompatibleIDs', 3: 'BusQueryInstanceID', 4: 'BusQueryDeviceSerialNumber', 5: 'BusQueryContainerID'})]],
} ],
  '__unnamed_13eb' : [ 0x10, {
    'DeviceTextType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'DeviceTextDescription', 1: 'DeviceTextLocationInformation'})]],
    'LocaleId' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_13ef' : [ 0x10, {
    'InPath' : [ 0x0, ['unsigned char']],
    'Reserved' : [ 0x1, ['array', 3, ['unsigned char']]],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'DeviceUsageTypeUndefined', 1: 'DeviceUsageTypePaging', 2: 'DeviceUsageTypeHibernation', 3: 'DeviceUsageTypeDumpFile', 4: 'DeviceUsageTypeBoot', 5: 'DeviceUsageTypePostDisplay'})]],
} ],
  '__unnamed_13f3' : [ 0x4, {
    'PowerState' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
} ],
  '__unnamed_13f7' : [ 0x8, {
    'PowerSequence' : [ 0x0, ['pointer64', ['_POWER_SEQUENCE']]],
} ],
  '__unnamed_13ff' : [ 0x20, {
    'SystemContext' : [ 0x0, ['unsigned long']],
    'SystemPowerStateContext' : [ 0x0, ['_SYSTEM_POWER_STATE_CONTEXT']],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'SystemPowerState', 1: 'DevicePowerState'})]],
    'State' : [ 0x10, ['_POWER_STATE']],
    'ShutdownType' : [ 0x18, ['Enumeration', dict(target = 'long', choices = {0: 'PowerActionNone', 1: 'PowerActionReserved', 2: 'PowerActionSleep', 3: 'PowerActionHibernate', 4: 'PowerActionShutdown', 5: 'PowerActionShutdownReset', 6: 'PowerActionShutdownOff', 7: 'PowerActionWarmEject'})]],
} ],
  '__unnamed_1403' : [ 0x10, {
    'AllocatedResources' : [ 0x0, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'AllocatedResourcesTranslated' : [ 0x8, ['pointer64', ['_CM_RESOURCE_LIST']]],
} ],
  '__unnamed_1405' : [ 0x20, {
    'ProviderId' : [ 0x0, ['unsigned long long']],
    'DataPath' : [ 0x8, ['pointer64', ['void']]],
    'BufferSize' : [ 0x10, ['unsigned long']],
    'Buffer' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1407' : [ 0x20, {
    'Argument1' : [ 0x0, ['pointer64', ['void']]],
    'Argument2' : [ 0x8, ['pointer64', ['void']]],
    'Argument3' : [ 0x10, ['pointer64', ['void']]],
    'Argument4' : [ 0x18, ['pointer64', ['void']]],
} ],
  '__unnamed_1409' : [ 0x20, {
    'Create' : [ 0x0, ['__unnamed_139d']],
    'CreatePipe' : [ 0x0, ['__unnamed_13a1']],
    'CreateMailslot' : [ 0x0, ['__unnamed_13a5']],
    'Read' : [ 0x0, ['__unnamed_13a7']],
    'Write' : [ 0x0, ['__unnamed_13a7']],
    'QueryDirectory' : [ 0x0, ['__unnamed_13ab']],
    'NotifyDirectory' : [ 0x0, ['__unnamed_13ad']],
    'QueryFile' : [ 0x0, ['__unnamed_13af']],
    'SetFile' : [ 0x0, ['__unnamed_13b1']],
    'QueryEa' : [ 0x0, ['__unnamed_13b3']],
    'SetEa' : [ 0x0, ['__unnamed_13b5']],
    'QueryVolume' : [ 0x0, ['__unnamed_13b9']],
    'SetVolume' : [ 0x0, ['__unnamed_13b9']],
    'FileSystemControl' : [ 0x0, ['__unnamed_13bb']],
    'LockControl' : [ 0x0, ['__unnamed_13bd']],
    'DeviceIoControl' : [ 0x0, ['__unnamed_13bf']],
    'QuerySecurity' : [ 0x0, ['__unnamed_13c1']],
    'SetSecurity' : [ 0x0, ['__unnamed_13c3']],
    'MountVolume' : [ 0x0, ['__unnamed_13c7']],
    'VerifyVolume' : [ 0x0, ['__unnamed_13c7']],
    'Scsi' : [ 0x0, ['__unnamed_13cb']],
    'QueryQuota' : [ 0x0, ['__unnamed_13cf']],
    'SetQuota' : [ 0x0, ['__unnamed_13b5']],
    'QueryDeviceRelations' : [ 0x0, ['__unnamed_13d3']],
    'QueryInterface' : [ 0x0, ['__unnamed_13d7']],
    'DeviceCapabilities' : [ 0x0, ['__unnamed_13db']],
    'FilterResourceRequirements' : [ 0x0, ['__unnamed_13df']],
    'ReadWriteConfig' : [ 0x0, ['__unnamed_13e1']],
    'SetLock' : [ 0x0, ['__unnamed_13e3']],
    'QueryId' : [ 0x0, ['__unnamed_13e7']],
    'QueryDeviceText' : [ 0x0, ['__unnamed_13eb']],
    'UsageNotification' : [ 0x0, ['__unnamed_13ef']],
    'WaitWake' : [ 0x0, ['__unnamed_13f3']],
    'PowerSequence' : [ 0x0, ['__unnamed_13f7']],
    'Power' : [ 0x0, ['__unnamed_13ff']],
    'StartDevice' : [ 0x0, ['__unnamed_1403']],
    'WMI' : [ 0x0, ['__unnamed_1405']],
    'Others' : [ 0x0, ['__unnamed_1407']],
} ],
  '_IO_STACK_LOCATION' : [ 0x48, {
    'MajorFunction' : [ 0x0, ['unsigned char']],
    'MinorFunction' : [ 0x1, ['unsigned char']],
    'Flags' : [ 0x2, ['unsigned char']],
    'Control' : [ 0x3, ['unsigned char']],
    'Parameters' : [ 0x8, ['__unnamed_1409']],
    'DeviceObject' : [ 0x28, ['pointer64', ['_DEVICE_OBJECT']]],
    'FileObject' : [ 0x30, ['pointer64', ['_FILE_OBJECT']]],
    'CompletionRoutine' : [ 0x38, ['pointer64', ['void']]],
    'Context' : [ 0x40, ['pointer64', ['void']]],
} ],
  '__unnamed_141f' : [ 0x48, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Wcb' : [ 0x0, ['_WAIT_CONTEXT_BLOCK']],
} ],
  '_DEVICE_OBJECT' : [ 0x150, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'ReferenceCount' : [ 0x4, ['long']],
    'DriverObject' : [ 0x8, ['pointer64', ['_DRIVER_OBJECT']]],
    'NextDevice' : [ 0x10, ['pointer64', ['_DEVICE_OBJECT']]],
    'AttachedDevice' : [ 0x18, ['pointer64', ['_DEVICE_OBJECT']]],
    'CurrentIrp' : [ 0x20, ['pointer64', ['_IRP']]],
    'Timer' : [ 0x28, ['pointer64', ['_IO_TIMER']]],
    'Flags' : [ 0x30, ['unsigned long']],
    'Characteristics' : [ 0x34, ['unsigned long']],
    'Vpb' : [ 0x38, ['pointer64', ['_VPB']]],
    'DeviceExtension' : [ 0x40, ['pointer64', ['void']]],
    'DeviceType' : [ 0x48, ['unsigned long']],
    'StackSize' : [ 0x4c, ['unsigned char']],
    'Queue' : [ 0x50, ['__unnamed_141f']],
    'AlignmentRequirement' : [ 0x98, ['unsigned long']],
    'DeviceQueue' : [ 0xa0, ['_KDEVICE_QUEUE']],
    'Dpc' : [ 0xc8, ['_KDPC']],
    'ActiveThreadCount' : [ 0x108, ['unsigned long']],
    'SecurityDescriptor' : [ 0x110, ['pointer64', ['void']]],
    'DeviceLock' : [ 0x118, ['_KEVENT']],
    'SectorSize' : [ 0x130, ['unsigned short']],
    'Spare1' : [ 0x132, ['unsigned short']],
    'DeviceObjectExtension' : [ 0x138, ['pointer64', ['_DEVOBJ_EXTENSION']]],
    'Reserved' : [ 0x140, ['pointer64', ['void']]],
} ],
  '_KDPC' : [ 0x40, {
    'TargetInfoAsUlong' : [ 0x0, ['unsigned long']],
    'Type' : [ 0x0, ['unsigned char']],
    'Importance' : [ 0x1, ['unsigned char']],
    'Number' : [ 0x2, ['unsigned short']],
    'DpcListEntry' : [ 0x8, ['_SINGLE_LIST_ENTRY']],
    'ProcessorHistory' : [ 0x10, ['unsigned long long']],
    'DeferredRoutine' : [ 0x18, ['pointer64', ['void']]],
    'DeferredContext' : [ 0x20, ['pointer64', ['void']]],
    'SystemArgument1' : [ 0x28, ['pointer64', ['void']]],
    'SystemArgument2' : [ 0x30, ['pointer64', ['void']]],
    'DpcData' : [ 0x38, ['pointer64', ['void']]],
} ],
  '_IO_DRIVER_CREATE_CONTEXT' : [ 0x20, {
    'Size' : [ 0x0, ['short']],
    'ExtraCreateParameter' : [ 0x8, ['pointer64', ['_ECP_LIST']]],
    'DeviceObjectHint' : [ 0x10, ['pointer64', ['void']]],
    'TxnParameters' : [ 0x18, ['pointer64', ['_TXN_PARAMETER_BLOCK']]],
} ],
  '_IO_PRIORITY_INFO' : [ 0x10, {
    'Size' : [ 0x0, ['unsigned long']],
    'ThreadPriority' : [ 0x4, ['unsigned long']],
    'PagePriority' : [ 0x8, ['unsigned long']],
    'IoPriority' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: 'IoPriorityVeryLow', 1: 'IoPriorityLow', 2: 'IoPriorityNormal', 3: 'IoPriorityHigh', 4: 'IoPriorityCritical', 5: 'MaxIoPriorityTypes'})]],
} ],
  '_OBJECT_HANDLE_INFORMATION' : [ 0x8, {
    'HandleAttributes' : [ 0x0, ['unsigned long']],
    'GrantedAccess' : [ 0x4, ['unsigned long']],
} ],
  '_MDL' : [ 0x30, {
    'Next' : [ 0x0, ['pointer64', ['_MDL']]],
    'Size' : [ 0x8, ['short']],
    'MdlFlags' : [ 0xa, ['short']],
    'AllocationProcessorNumber' : [ 0xc, ['unsigned short']],
    'Reserved' : [ 0xe, ['unsigned short']],
    'Process' : [ 0x10, ['pointer64', ['_EPROCESS']]],
    'MappedSystemVa' : [ 0x18, ['pointer64', ['void']]],
    'StartVa' : [ 0x20, ['pointer64', ['void']]],
    'ByteCount' : [ 0x28, ['unsigned long']],
    'ByteOffset' : [ 0x2c, ['unsigned long']],
} ],
  '_EVENT_DATA_DESCRIPTOR' : [ 0x10, {
    'Ptr' : [ 0x0, ['unsigned long long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned char']],
    'Reserved1' : [ 0xd, ['unsigned char']],
    'Reserved2' : [ 0xe, ['unsigned short']],
} ],
  '_EVENT_DESCRIPTOR' : [ 0x10, {
    'Id' : [ 0x0, ['unsigned short']],
    'Version' : [ 0x2, ['unsigned char']],
    'Channel' : [ 0x3, ['unsigned char']],
    'Level' : [ 0x4, ['unsigned char']],
    'Opcode' : [ 0x5, ['unsigned char']],
    'Task' : [ 0x6, ['unsigned short']],
    'Keyword' : [ 0x8, ['unsigned long long']],
} ],
  '_EVENT_RECORD' : [ 0x70, {
    'EventHeader' : [ 0x0, ['_EVENT_HEADER']],
    'BufferContext' : [ 0x50, ['_ETW_BUFFER_CONTEXT']],
    'ExtendedDataCount' : [ 0x54, ['unsigned short']],
    'UserDataLength' : [ 0x56, ['unsigned short']],
    'ExtendedData' : [ 0x58, ['pointer64', ['_EVENT_HEADER_EXTENDED_DATA_ITEM']]],
    'UserData' : [ 0x60, ['pointer64', ['void']]],
    'UserContext' : [ 0x68, ['pointer64', ['void']]],
} ],
  '_PERFINFO_GROUPMASK' : [ 0x20, {
    'Masks' : [ 0x0, ['array', 8, ['unsigned long']]],
} ],
  '_FILE_OBJECT' : [ 0xd8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'Vpb' : [ 0x10, ['pointer64', ['_VPB']]],
    'FsContext' : [ 0x18, ['pointer64', ['void']]],
    'FsContext2' : [ 0x20, ['pointer64', ['void']]],
    'SectionObjectPointer' : [ 0x28, ['pointer64', ['_SECTION_OBJECT_POINTERS']]],
    'PrivateCacheMap' : [ 0x30, ['pointer64', ['void']]],
    'FinalStatus' : [ 0x38, ['long']],
    'RelatedFileObject' : [ 0x40, ['pointer64', ['_FILE_OBJECT']]],
    'LockOperation' : [ 0x48, ['unsigned char']],
    'DeletePending' : [ 0x49, ['unsigned char']],
    'ReadAccess' : [ 0x4a, ['unsigned char']],
    'WriteAccess' : [ 0x4b, ['unsigned char']],
    'DeleteAccess' : [ 0x4c, ['unsigned char']],
    'SharedRead' : [ 0x4d, ['unsigned char']],
    'SharedWrite' : [ 0x4e, ['unsigned char']],
    'SharedDelete' : [ 0x4f, ['unsigned char']],
    'Flags' : [ 0x50, ['unsigned long']],
    'FileName' : [ 0x58, ['_UNICODE_STRING']],
    'CurrentByteOffset' : [ 0x68, ['_LARGE_INTEGER']],
    'Waiters' : [ 0x70, ['unsigned long']],
    'Busy' : [ 0x74, ['unsigned long']],
    'LastLock' : [ 0x78, ['pointer64', ['void']]],
    'Lock' : [ 0x80, ['_KEVENT']],
    'Event' : [ 0x98, ['_KEVENT']],
    'CompletionContext' : [ 0xb0, ['pointer64', ['_IO_COMPLETION_CONTEXT']]],
    'IrpListLock' : [ 0xb8, ['unsigned long long']],
    'IrpList' : [ 0xc0, ['_LIST_ENTRY']],
    'FileObjectExtension' : [ 0xd0, ['pointer64', ['void']]],
} ],
  '_EX_RUNDOWN_REF' : [ 0x8, {
    'Count' : [ 0x0, ['unsigned long long']],
    'Ptr' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_MM_PAGE_ACCESS_INFO_HEADER' : [ 0x48, {
    'Link' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Type' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'MmPteAccessType', 1: 'MmCcReadAheadType', 2: 'MmPfnRepurposeType', 3: 'MmMaximumPageAccessType'})]],
    'EmptySequenceNumber' : [ 0xc, ['unsigned long']],
    'CurrentFileIndex' : [ 0xc, ['unsigned long']],
    'CreateTime' : [ 0x10, ['unsigned long long']],
    'EmptyTime' : [ 0x18, ['unsigned long long']],
    'TempEntry' : [ 0x18, ['pointer64', ['_MM_PAGE_ACCESS_INFO']]],
    'PageEntry' : [ 0x20, ['pointer64', ['_MM_PAGE_ACCESS_INFO']]],
    'FileEntry' : [ 0x28, ['pointer64', ['unsigned long long']]],
    'FirstFileEntry' : [ 0x30, ['pointer64', ['unsigned long long']]],
    'Process' : [ 0x38, ['pointer64', ['_EPROCESS']]],
    'SessionId' : [ 0x40, ['unsigned long']],
    'PageFrameEntry' : [ 0x20, ['pointer64', ['unsigned long long']]],
    'LastPageFrameEntry' : [ 0x28, ['pointer64', ['unsigned long long']]],
} ],
  '_WHEA_ERROR_PACKET_V2' : [ 0x50, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'Length' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_PACKET_FLAGS']],
    'ErrorType' : [ 0x10, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrTypeProcessor', 1: 'WheaErrTypeMemory', 2: 'WheaErrTypePCIExpress', 3: 'WheaErrTypeNMI', 4: 'WheaErrTypePCIXBus', 5: 'WheaErrTypePCIXDevice', 6: 'WheaErrTypeGeneric'})]],
    'ErrorSeverity' : [ 0x14, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSevRecoverable', 1: 'WheaErrSevFatal', 2: 'WheaErrSevCorrected', 3: 'WheaErrSevInformational'})]],
    'ErrorSourceId' : [ 0x18, ['unsigned long']],
    'ErrorSourceType' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSrcTypeMCE', 1: 'WheaErrSrcTypeCMC', 2: 'WheaErrSrcTypeCPE', 3: 'WheaErrSrcTypeNMI', 4: 'WheaErrSrcTypePCIe', 5: 'WheaErrSrcTypeGeneric', 6: 'WheaErrSrcTypeINIT', 7: 'WheaErrSrcTypeBOOT', 8: 'WheaErrSrcTypeSCIGeneric', 9: 'WheaErrSrcTypeIPFMCA', 10: 'WheaErrSrcTypeIPFCMC', 11: 'WheaErrSrcTypeIPFCPE', 12: 'WheaErrSrcTypeMax'})]],
    'NotifyType' : [ 0x20, ['_GUID']],
    'Context' : [ 0x30, ['unsigned long long']],
    'DataFormat' : [ 0x38, ['Enumeration', dict(target = 'long', choices = {0: 'WheaDataFormatIPFSalRecord', 1: 'WheaDataFormatXPFMCA', 2: 'WheaDataFormatMemory', 3: 'WheaDataFormatPCIExpress', 4: 'WheaDataFormatNMIPort', 5: 'WheaDataFormatPCIXBus', 6: 'WheaDataFormatPCIXDevice', 7: 'WheaDataFormatGeneric', 8: 'WheaDataFormatMax'})]],
    'Reserved1' : [ 0x3c, ['unsigned long']],
    'DataOffset' : [ 0x40, ['unsigned long']],
    'DataLength' : [ 0x44, ['unsigned long']],
    'PshedDataOffset' : [ 0x48, ['unsigned long']],
    'PshedDataLength' : [ 0x4c, ['unsigned long']],
} ],
  '_WHEA_ERROR_RECORD' : [ 0xc8, {
    'Header' : [ 0x0, ['_WHEA_ERROR_RECORD_HEADER']],
    'SectionDescriptor' : [ 0x80, ['array', 1, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR']]],
} ],
  '_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR' : [ 0x48, {
    'SectionOffset' : [ 0x0, ['unsigned long']],
    'SectionLength' : [ 0x4, ['unsigned long']],
    'Revision' : [ 0x8, ['_WHEA_REVISION']],
    'ValidBits' : [ 0xa, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS']],
    'Reserved' : [ 0xb, ['unsigned char']],
    'Flags' : [ 0xc, ['_WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS']],
    'SectionType' : [ 0x10, ['_GUID']],
    'FRUId' : [ 0x20, ['_GUID']],
    'SectionSeverity' : [ 0x30, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSevRecoverable', 1: 'WheaErrSevFatal', 2: 'WheaErrSevCorrected', 3: 'WheaErrSevInformational'})]],
    'FRUText' : [ 0x34, ['array', 20, ['unsigned char']]],
} ],
  '_FSRTL_ADVANCED_FCB_HEADER' : [ 0x68, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'Flags' : [ 0x4, ['unsigned char']],
    'IsFastIoPossible' : [ 0x5, ['unsigned char']],
    'Flags2' : [ 0x6, ['unsigned char']],
    'Reserved' : [ 0x7, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'Version' : [ 0x7, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'Resource' : [ 0x8, ['pointer64', ['_ERESOURCE']]],
    'PagingIoResource' : [ 0x10, ['pointer64', ['_ERESOURCE']]],
    'AllocationSize' : [ 0x18, ['_LARGE_INTEGER']],
    'FileSize' : [ 0x20, ['_LARGE_INTEGER']],
    'ValidDataLength' : [ 0x28, ['_LARGE_INTEGER']],
    'FastMutex' : [ 0x30, ['pointer64', ['_FAST_MUTEX']]],
    'FilterContexts' : [ 0x38, ['_LIST_ENTRY']],
    'PushLock' : [ 0x48, ['_EX_PUSH_LOCK']],
    'FileContextSupportPointer' : [ 0x50, ['pointer64', ['pointer64', ['void']]]],
    'Oplock' : [ 0x58, ['pointer64', ['void']]],
    'ReservedForRemote' : [ 0x58, ['pointer64', ['void']]],
    'ReservedContext' : [ 0x60, ['pointer64', ['void']]],
} ],
  '_iobuf' : [ 0x30, {
    '_ptr' : [ 0x0, ['pointer64', ['unsigned char']]],
    '_cnt' : [ 0x8, ['long']],
    '_base' : [ 0x10, ['pointer64', ['unsigned char']]],
    '_flag' : [ 0x18, ['long']],
    '_file' : [ 0x1c, ['long']],
    '_charbuf' : [ 0x20, ['long']],
    '_bufsiz' : [ 0x24, ['long']],
    '_tmpfname' : [ 0x28, ['pointer64', ['unsigned char']]],
} ],
  '__unnamed_15a5' : [ 0x8, {
    'Long' : [ 0x0, ['unsigned long long']],
    'VolatileLong' : [ 0x0, ['unsigned long long']],
    'Hard' : [ 0x0, ['_MMPTE_HARDWARE']],
    'Flush' : [ 0x0, ['_HARDWARE_PTE']],
    'Proto' : [ 0x0, ['_MMPTE_PROTOTYPE']],
    'Soft' : [ 0x0, ['_MMPTE_SOFTWARE']],
    'TimeStamp' : [ 0x0, ['_MMPTE_TIMESTAMP']],
    'Trans' : [ 0x0, ['_MMPTE_TRANSITION']],
    'Subsect' : [ 0x0, ['_MMPTE_SUBSECTION']],
    'List' : [ 0x0, ['_MMPTE_LIST']],
} ],
  '_MMPTE' : [ 0x8, {
    'u' : [ 0x0, ['__unnamed_15a5']],
} ],
  '_EX_PUSH_LOCK_CACHE_AWARE' : [ 0x100, {
    'Locks' : [ 0x0, ['array', 32, ['pointer64', ['_EX_PUSH_LOCK']]]],
} ],
  '_ERESOURCE' : [ 0x68, {
    'SystemResourcesList' : [ 0x0, ['_LIST_ENTRY']],
    'OwnerTable' : [ 0x10, ['pointer64', ['_OWNER_ENTRY']]],
    'ActiveCount' : [ 0x18, ['short']],
    'Flag' : [ 0x1a, ['unsigned short']],
    'ReservedLowFlags' : [ 0x1a, ['unsigned char']],
    'WaiterPriority' : [ 0x1b, ['unsigned char']],
    'SharedWaiters' : [ 0x20, ['pointer64', ['_KSEMAPHORE']]],
    'ExclusiveWaiters' : [ 0x28, ['pointer64', ['_KEVENT']]],
    'OwnerEntry' : [ 0x30, ['_OWNER_ENTRY']],
    'ActiveEntries' : [ 0x40, ['unsigned long']],
    'ContentionCount' : [ 0x44, ['unsigned long']],
    'NumberOfSharedWaiters' : [ 0x48, ['unsigned long']],
    'NumberOfExclusiveWaiters' : [ 0x4c, ['unsigned long']],
    'Reserved2' : [ 0x50, ['pointer64', ['void']]],
    'Address' : [ 0x58, ['pointer64', ['void']]],
    'CreatorBackTraceIndex' : [ 0x58, ['unsigned long long']],
    'SpinLock' : [ 0x60, ['unsigned long long']],
} ],
  '_MI_CACHED_PTE' : [ 0x8, {
    'GlobalTimeStamp' : [ 0x0, ['unsigned long']],
    'PteIndex' : [ 0x4, ['unsigned long']],
    'Long' : [ 0x0, ['long long']],
} ],
  '_KLOCK_QUEUE_HANDLE' : [ 0x18, {
    'LockQueue' : [ 0x0, ['_KSPIN_LOCK_QUEUE']],
    'OldIrql' : [ 0x10, ['unsigned char']],
} ],
  '_MMPFNLIST' : [ 0x28, {
    'Total' : [ 0x0, ['unsigned long long']],
    'ListName' : [ 0x8, ['Enumeration', dict(target = 'long', choices = {0: 'ZeroedPageList', 1: 'FreePageList', 2: 'StandbyPageList', 3: 'ModifiedPageList', 4: 'ModifiedNoWritePageList', 5: 'BadPageList', 6: 'ActiveAndValid', 7: 'TransitionPage'})]],
    'Flink' : [ 0x10, ['unsigned long long']],
    'Blink' : [ 0x18, ['unsigned long long']],
    'Lock' : [ 0x20, ['unsigned long long']],
} ],
  '__unnamed_15e9' : [ 0x8, {
    'Flink' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 36, native_type='unsigned long long')]],
    'NodeFlinkHigh' : [ 0x0, ['BitField', dict(start_bit = 36, end_bit = 64, native_type='unsigned long long')]],
    'WsIndex' : [ 0x0, ['unsigned long long']],
    'Event' : [ 0x0, ['pointer64', ['_KEVENT']]],
    'Next' : [ 0x0, ['pointer64', ['void']]],
    'VolatileNext' : [ 0x0, ['pointer64', ['void']]],
    'KernelStackOwner' : [ 0x0, ['pointer64', ['_KTHREAD']]],
    'NextStackPfn' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
} ],
  '__unnamed_15ee' : [ 0x8, {
    'Blink' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 36, native_type='unsigned long long')]],
    'NodeBlinkHigh' : [ 0x0, ['BitField', dict(start_bit = 36, end_bit = 56, native_type='unsigned long long')]],
    'TbFlushStamp' : [ 0x0, ['BitField', dict(start_bit = 56, end_bit = 60, native_type='unsigned long long')]],
    'SpareBlink' : [ 0x0, ['BitField', dict(start_bit = 60, end_bit = 64, native_type='unsigned long long')]],
    'ImageProtoPte' : [ 0x0, ['pointer64', ['_MMPTE']]],
    'ShareCount' : [ 0x0, ['unsigned long long']],
} ],
  '__unnamed_15f1' : [ 0x4, {
    'ReferenceCount' : [ 0x0, ['unsigned short']],
    'VolatileReferenceCount' : [ 0x0, ['short']],
    'ShortFlags' : [ 0x2, ['unsigned short']],
    'VolatileShortFlags' : [ 0x2, ['unsigned short']],
} ],
  '__unnamed_15f3' : [ 0x4, {
    'ReferenceCount' : [ 0x0, ['unsigned short']],
    'e1' : [ 0x2, ['_MMPFNENTRY']],
    'e2' : [ 0x0, ['__unnamed_15f1']],
} ],
  '__unnamed_15fd' : [ 0x8, {
    'PteFrame' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 36, native_type='unsigned long long')]],
    'Channel' : [ 0x0, ['BitField', dict(start_bit = 36, end_bit = 38, native_type='unsigned long long')]],
    'Unused1' : [ 0x0, ['BitField', dict(start_bit = 38, end_bit = 39, native_type='unsigned long long')]],
    'Unused2' : [ 0x0, ['BitField', dict(start_bit = 39, end_bit = 40, native_type='unsigned long long')]],
    'Unused3' : [ 0x0, ['BitField', dict(start_bit = 40, end_bit = 53, native_type='unsigned long long')]],
    'PfnExists' : [ 0x0, ['BitField', dict(start_bit = 53, end_bit = 54, native_type='unsigned long long')]],
    'PageIdentity' : [ 0x0, ['BitField', dict(start_bit = 54, end_bit = 57, native_type='unsigned long long')]],
    'PrototypePte' : [ 0x0, ['BitField', dict(start_bit = 57, end_bit = 58, native_type='unsigned long long')]],
    'PageColor' : [ 0x0, ['BitField', dict(start_bit = 58, end_bit = 64, native_type='unsigned long long')]],
    'EntireField' : [ 0x0, ['unsigned long long']],
} ],
  '_MMPFN' : [ 0x30, {
    'u1' : [ 0x0, ['__unnamed_15e9']],
    'u2' : [ 0x8, ['__unnamed_15ee']],
    'PteAddress' : [ 0x10, ['pointer64', ['_MMPTE']]],
    'VolatilePteAddress' : [ 0x10, ['pointer64', ['void']]],
    'Lock' : [ 0x10, ['long']],
    'PteLong' : [ 0x10, ['unsigned long long']],
    'u3' : [ 0x18, ['__unnamed_15f3']],
    'NodeBlinkLow' : [ 0x1c, ['unsigned short']],
    'Unused' : [ 0x1e, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned char')]],
    'VaType' : [ 0x1e, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'ViewCount' : [ 0x1f, ['unsigned char']],
    'NodeFlinkLow' : [ 0x1f, ['unsigned char']],
    'OriginalPte' : [ 0x20, ['_MMPTE']],
    'u4' : [ 0x28, ['__unnamed_15fd']],
} ],
  '_MI_SYSTEM_PTE_TYPE' : [ 0x68, {
    'Bitmap' : [ 0x0, ['_RTL_BITMAP_EX']],
    'BasePte' : [ 0x10, ['pointer64', ['_MMPTE']]],
    'Flags' : [ 0x18, ['unsigned long']],
    'VaType' : [ 0x1c, ['Enumeration', dict(target = 'long', choices = {0: 'MiVaUnused', 1: 'MiVaSessionSpace', 2: 'MiVaProcessSpace', 3: 'MiVaBootLoaded', 4: 'MiVaPfnDatabase', 5: 'MiVaNonPagedPool', 6: 'MiVaPagedPool', 7: 'MiVaSpecialPoolPaged', 8: 'MiVaSystemCache', 9: 'MiVaSystemPtes', 10: 'MiVaHal', 11: 'MiVaSessionGlobalSpace', 12: 'MiVaDriverImages', 13: 'MiVaSpecialPoolNonPaged', 14: 'MiVaMaximumType', 15: 'MiVaSystemPtesLarge'})]],
    'FailureCount' : [ 0x20, ['pointer64', ['unsigned long']]],
    'PteFailures' : [ 0x28, ['unsigned long']],
    'SpinLock' : [ 0x30, ['unsigned long long']],
    'GlobalMutex' : [ 0x30, ['pointer64', ['_FAST_MUTEX']]],
    'Vm' : [ 0x38, ['pointer64', ['_MMSUPPORT']]],
    'TotalSystemPtes' : [ 0x40, ['unsigned long long']],
    'Hint' : [ 0x48, ['unsigned long long']],
    'CachedPtes' : [ 0x50, ['pointer64', ['_MI_CACHED_PTE']]],
    'TotalFreeSystemPtes' : [ 0x58, ['unsigned long long']],
    'CachedPteCount' : [ 0x60, ['long']],
} ],
  '__unnamed_161f' : [ 0x8, {
    'VirtualAddress' : [ 0x0, ['pointer64', ['void']]],
    'Long' : [ 0x0, ['unsigned long long']],
    'e1' : [ 0x0, ['_MMWSLENTRY']],
    'e2' : [ 0x0, ['_MMWSLE_FREE_ENTRY']],
} ],
  '_MMWSLE' : [ 0x8, {
    'u1' : [ 0x0, ['__unnamed_161f']],
} ],
  '_MMWSL' : [ 0x320, {
    'FirstFree' : [ 0x0, ['unsigned long long']],
    'FirstDynamic' : [ 0x8, ['unsigned long long']],
    'LastEntry' : [ 0x10, ['unsigned long long']],
    'NextSlot' : [ 0x18, ['unsigned long long']],
    'LastInitializedWsle' : [ 0x20, ['unsigned long long']],
    'NextAgingSlot' : [ 0x28, ['unsigned long long']],
    'NextAccessClearingSlot' : [ 0x30, ['unsigned long long']],
    'LastAccessClearingRemainder' : [ 0x38, ['unsigned long']],
    'LastAgingRemainder' : [ 0x3c, ['unsigned long']],
    'WsleSize' : [ 0x40, ['unsigned long']],
    'NonDirectCount' : [ 0x48, ['unsigned long long']],
    'LowestPagableAddress' : [ 0x50, ['pointer64', ['void']]],
    'NonDirectHash' : [ 0x58, ['pointer64', ['_MMWSLE_NONDIRECT_HASH']]],
    'HashTableStart' : [ 0x60, ['pointer64', ['_MMWSLE_HASH']]],
    'HighestPermittedHashAddress' : [ 0x68, ['pointer64', ['_MMWSLE_HASH']]],
    'ActiveWsleCounts' : [ 0x70, ['array', 16, ['unsigned long long']]],
    'ActiveWsles' : [ 0xf0, ['array', 16, ['_MI_ACTIVE_WSLE_LISTHEAD']]],
    'Wsle' : [ 0x1f0, ['pointer64', ['_MMWSLE']]],
    'UserVaInfo' : [ 0x1f8, ['_MI_USER_VA_INFO']],
} ],
  '_MMSUPPORT' : [ 0xe8, {
    'ExitGate' : [ 0x0, ['pointer64', ['_KGATE']]],
    'AccessLog' : [ 0x8, ['pointer64', ['void']]],
    'WorkingSetMutex' : [ 0x10, ['_EX_PUSH_LOCK']],
    'WorkingSetExpansionLinks' : [ 0x18, ['_LIST_ENTRY']],
    'AgeDistribution' : [ 0x28, ['array', 7, ['unsigned long long']]],
    'MinimumWorkingSetSize' : [ 0x60, ['unsigned long long']],
    'WorkingSetLeafSize' : [ 0x68, ['unsigned long long']],
    'WorkingSetLeafPrivateSize' : [ 0x70, ['unsigned long long']],
    'WorkingSetSize' : [ 0x78, ['unsigned long long']],
    'WorkingSetPrivateSize' : [ 0x80, ['unsigned long long']],
    'MaximumWorkingSetSize' : [ 0x88, ['unsigned long long']],
    'ChargedWslePages' : [ 0x90, ['unsigned long long']],
    'ActualWslePages' : [ 0x98, ['unsigned long long']],
    'WorkingSetSizeOverhead' : [ 0xa0, ['unsigned long long']],
    'PeakWorkingSetSize' : [ 0xa8, ['unsigned long long']],
    'HardFaultCount' : [ 0xb0, ['unsigned long']],
    'VmWorkingSetList' : [ 0xb8, ['pointer64', ['_MMWSL']]],
    'NextPageColor' : [ 0xc0, ['unsigned short']],
    'LastTrimStamp' : [ 0xc2, ['unsigned short']],
    'PageFaultCount' : [ 0xc4, ['unsigned long']],
    'TrimmedPageCount' : [ 0xc8, ['unsigned long long']],
    'ForceTrimPages' : [ 0xd0, ['unsigned long long']],
    'Flags' : [ 0xd8, ['_MMSUPPORT_FLAGS']],
    'WsSwapSupport' : [ 0xe0, ['pointer64', ['void']]],
} ],
  '__unnamed_1639' : [ 0x4, {
    'LongFlags' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x0, ['_MMSECTION_FLAGS']],
} ],
  '__unnamed_1643' : [ 0x10, {
    'NumberOfSystemCacheViews' : [ 0x0, ['unsigned long']],
    'ImageRelocationStartBit' : [ 0x0, ['unsigned long']],
    'WritableUserReferences' : [ 0x4, ['long']],
    'ImageRelocationSizeIn64k' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'Unused' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 28, native_type='unsigned long')]],
    'CantMove' : [ 0x4, ['BitField', dict(start_bit = 28, end_bit = 29, native_type='unsigned long')]],
    'BitMap' : [ 0x4, ['BitField', dict(start_bit = 29, end_bit = 31, native_type='unsigned long')]],
    'ImageActive' : [ 0x4, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'FlushInProgressCount' : [ 0x8, ['unsigned long']],
    'NumberOfSubsections' : [ 0x8, ['unsigned long']],
    'SeImageStub' : [ 0x8, ['pointer64', ['_MI_IMAGE_SECURITY_REFERENCE']]],
} ],
  '__unnamed_1645' : [ 0x10, {
    'e2' : [ 0x0, ['__unnamed_1643']],
} ],
  '_CONTROL_AREA' : [ 0x78, {
    'Segment' : [ 0x0, ['pointer64', ['_SEGMENT']]],
    'ListHead' : [ 0x8, ['_LIST_ENTRY']],
    'NumberOfSectionReferences' : [ 0x18, ['unsigned long long']],
    'NumberOfPfnReferences' : [ 0x20, ['unsigned long long']],
    'NumberOfMappedViews' : [ 0x28, ['unsigned long long']],
    'NumberOfUserReferences' : [ 0x30, ['unsigned long long']],
    'u' : [ 0x38, ['__unnamed_1639']],
    'FilePointer' : [ 0x40, ['_EX_FAST_REF']],
    'ControlAreaLock' : [ 0x48, ['long']],
    'ModifiedWriteCount' : [ 0x4c, ['unsigned long']],
    'WaitList' : [ 0x50, ['pointer64', ['_MI_CONTROL_AREA_WAIT_BLOCK']]],
    'u2' : [ 0x58, ['__unnamed_1645']],
    'LockedPages' : [ 0x68, ['unsigned long long']],
    'FileObjectLock' : [ 0x70, ['_EX_PUSH_LOCK']],
} ],
  '_MM_STORE_KEY' : [ 0x8, {
    'KeyLow' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 60, native_type='unsigned long long')]],
    'KeyHigh' : [ 0x0, ['BitField', dict(start_bit = 60, end_bit = 64, native_type='unsigned long long')]],
    'EntireKey' : [ 0x0, ['unsigned long long']],
} ],
  '_MMPAGING_FILE' : [ 0xe0, {
    'Size' : [ 0x0, ['unsigned long long']],
    'MaximumSize' : [ 0x8, ['unsigned long long']],
    'MinimumSize' : [ 0x10, ['unsigned long long']],
    'FreeSpace' : [ 0x18, ['unsigned long long']],
    'PeakUsage' : [ 0x20, ['unsigned long long']],
    'HighestPage' : [ 0x28, ['unsigned long long']],
    'FreeReservationSpace' : [ 0x30, ['unsigned long long']],
    'LargestReserveCluster' : [ 0x38, ['unsigned long long']],
    'File' : [ 0x40, ['pointer64', ['_FILE_OBJECT']]],
    'Entry' : [ 0x48, ['array', 2, ['pointer64', ['_MMMOD_WRITER_MDL_ENTRY']]]],
    'PfnsToFree' : [ 0x60, ['_SLIST_HEADER']],
    'PageFileName' : [ 0x70, ['_UNICODE_STRING']],
    'Bitmaps' : [ 0x80, ['pointer64', ['_MI_PAGING_FILE_SPACE_BITMAPS']]],
    'AllocationBitmapHint' : [ 0x88, ['unsigned long']],
    'ReservationBitmapHint' : [ 0x8c, ['unsigned long']],
    'LargestNonReservedClusterSize' : [ 0x90, ['unsigned long']],
    'RefreshClusterSize' : [ 0x94, ['unsigned long']],
    'LastRefreshClusterSize' : [ 0x98, ['unsigned long']],
    'ReservedClusterSizeAggregate' : [ 0x9c, ['unsigned long']],
    'ToBeEvictedCount' : [ 0xa0, ['unsigned long']],
    'HybridPriority' : [ 0xa4, ['unsigned long']],
    'PageFileNumber' : [ 0xa8, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned short')]],
    'BootPartition' : [ 0xa8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned short')]],
    'WsSwapPagefile' : [ 0xa8, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned short')]],
    'NoReservations' : [ 0xa8, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned short')]],
    'Spare0' : [ 0xa8, ['BitField', dict(start_bit = 7, end_bit = 16, native_type='unsigned short')]],
    'AdriftMdls' : [ 0xaa, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Spare1' : [ 0xaa, ['BitField', dict(start_bit = 1, end_bit = 8, native_type='unsigned char')]],
    'Spare2' : [ 0xab, ['BitField', dict(start_bit = 0, end_bit = 8, native_type='unsigned char')]],
    'PageHashPages' : [ 0xac, ['unsigned long']],
    'PageHashPagesPeak' : [ 0xb0, ['unsigned long']],
    'PageHash' : [ 0xb8, ['pointer64', ['unsigned long']]],
    'FileHandle' : [ 0xc0, ['pointer64', ['void']]],
    'Lock' : [ 0xc8, ['unsigned long long']],
    'LockOwner' : [ 0xd0, ['pointer64', ['_ETHREAD']]],
} ],
  '_MI_PAGING_FILE_SPACE_BITMAPS' : [ 0x30, {
    'RefCount' : [ 0x0, ['unsigned long']],
    'Anchor' : [ 0x0, ['pointer64', ['_MI_PAGING_FILE_SPACE_BITMAPS']]],
    'AllocationBitmap' : [ 0x8, ['_RTL_BITMAP']],
    'ReservationBitmap' : [ 0x18, ['_RTL_BITMAP']],
    'EvictStoreBitmap' : [ 0x28, ['pointer64', ['_RTL_BITMAP']]],
} ],
  'tagSWITCH_CONTEXT' : [ 0x60, {
    'Attribute' : [ 0x0, ['tagSWITCH_CONTEXT_ATTRIBUTE']],
    'Data' : [ 0x18, ['tagSWITCH_CONTEXT_DATA']],
} ],
  '__unnamed_1686' : [ 0xc, {
    'Failure' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: '_None', 1: '_CmInitializeHive', 2: '_HvInitializeHive', 3: '_HvpBuildMap', 4: '_HvpBuildMapForLoaderHive', 5: '_HvpInitMap', 6: '_HvLoadHive', 7: '_HvpMapHiveImage', 8: '_HvpRecoverData', 9: '_CmpValidateHiveSecurityDescriptors', 10: '_HvpEnlistBinInMap', 11: '_CmCheckRegistry', 12: '_CmRegistryIO', 13: '_CmCheckRegistry2', 14: '_CmpCheckKey', 15: '_CmpCheckValueList', 16: '_HvCheckHive', 17: '_HvCheckBin', 18: '_HvpGetLogEntryDirtyVector', 19: '_HvpReadLogEntryHeader', 20: '_HvpReadLogEntry'})]],
    'Status' : [ 0x4, ['long']],
    'Point' : [ 0x8, ['unsigned long']],
} ],
  '__unnamed_1689' : [ 0x18, {
    'Action' : [ 0x0, ['unsigned long']],
    'Handle' : [ 0x8, ['pointer64', ['void']]],
    'Status' : [ 0x10, ['long']],
} ],
  '__unnamed_168b' : [ 0x8, {
    'CheckStack' : [ 0x0, ['pointer64', ['void']]],
} ],
  '__unnamed_168f' : [ 0x20, {
    'Cell' : [ 0x0, ['unsigned long']],
    'CellPoint' : [ 0x8, ['pointer64', ['_CELL_DATA']]],
    'RootPoint' : [ 0x10, ['pointer64', ['void']]],
    'Index' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_1691' : [ 0x18, {
    'List' : [ 0x0, ['pointer64', ['_CELL_DATA']]],
    'Index' : [ 0x8, ['unsigned long']],
    'Cell' : [ 0xc, ['unsigned long']],
    'CellPoint' : [ 0x10, ['pointer64', ['_CELL_DATA']]],
} ],
  '__unnamed_1695' : [ 0x10, {
    'Space' : [ 0x0, ['unsigned long']],
    'MapPoint' : [ 0x4, ['unsigned long']],
    'BinPoint' : [ 0x8, ['pointer64', ['_HBIN']]],
} ],
  '__unnamed_1699' : [ 0x10, {
    'Bin' : [ 0x0, ['pointer64', ['_HBIN']]],
    'CellPoint' : [ 0x8, ['pointer64', ['_HCELL']]],
} ],
  '__unnamed_169b' : [ 0x4, {
    'FileOffset' : [ 0x0, ['unsigned long']],
} ],
  '_HIVE_LOAD_FAILURE' : [ 0x160, {
    'Hive' : [ 0x0, ['pointer64', ['_HHIVE']]],
    'Index' : [ 0x8, ['unsigned long']],
    'RecoverableIndex' : [ 0xc, ['unsigned long']],
    'Locations' : [ 0x10, ['array', 8, ['__unnamed_1686']]],
    'RecoverableLocations' : [ 0x70, ['array', 8, ['__unnamed_1686']]],
    'RegistryIO' : [ 0xd0, ['__unnamed_1689']],
    'CheckRegistry2' : [ 0xe8, ['__unnamed_168b']],
    'CheckKey' : [ 0xf0, ['__unnamed_168f']],
    'CheckValueList' : [ 0x110, ['__unnamed_1691']],
    'CheckHive' : [ 0x128, ['__unnamed_1695']],
    'CheckHive1' : [ 0x138, ['__unnamed_1695']],
    'CheckBin' : [ 0x148, ['__unnamed_1699']],
    'RecoverData' : [ 0x158, ['__unnamed_169b']],
} ],
  '_PCW_COUNTER_DESCRIPTOR' : [ 0x8, {
    'Id' : [ 0x0, ['unsigned short']],
    'StructIndex' : [ 0x2, ['unsigned short']],
    'Offset' : [ 0x4, ['unsigned short']],
    'Size' : [ 0x6, ['unsigned short']],
} ],
  '_PCW_REGISTRATION_INFORMATION' : [ 0x30, {
    'Version' : [ 0x0, ['unsigned long']],
    'Name' : [ 0x8, ['pointer64', ['_UNICODE_STRING']]],
    'CounterCount' : [ 0x10, ['unsigned long']],
    'Counters' : [ 0x18, ['pointer64', ['_PCW_COUNTER_DESCRIPTOR']]],
    'Callback' : [ 0x20, ['pointer64', ['void']]],
    'CallbackContext' : [ 0x28, ['pointer64', ['void']]],
} ],
  '_PCW_PROCESSOR_INFO' : [ 0xb8, {
    'IdleTime' : [ 0x0, ['unsigned long long']],
    'AvailableTime' : [ 0x8, ['unsigned long long']],
    'UserTime' : [ 0x10, ['unsigned long long']],
    'KernelTime' : [ 0x18, ['unsigned long long']],
    'Interrupts' : [ 0x20, ['unsigned long']],
    'DpcTime' : [ 0x28, ['unsigned long long']],
    'InterruptTime' : [ 0x30, ['unsigned long long']],
    'ClockInterrupts' : [ 0x38, ['unsigned long']],
    'DpcCount' : [ 0x3c, ['unsigned long']],
    'DpcRate' : [ 0x40, ['unsigned long']],
    'C1Time' : [ 0x48, ['unsigned long long']],
    'C2Time' : [ 0x50, ['unsigned long long']],
    'C3Time' : [ 0x58, ['unsigned long long']],
    'C1Transitions' : [ 0x60, ['unsigned long long']],
    'C2Transitions' : [ 0x68, ['unsigned long long']],
    'C3Transitions' : [ 0x70, ['unsigned long long']],
    'ParkingStatus' : [ 0x78, ['unsigned long']],
    'CurrentFrequency' : [ 0x7c, ['unsigned long']],
    'PercentMaxFrequency' : [ 0x80, ['unsigned long']],
    'StateFlags' : [ 0x84, ['unsigned long']],
    'NominalThroughput' : [ 0x88, ['unsigned long']],
    'ActiveThroughput' : [ 0x8c, ['unsigned long']],
    'ScaledThroughput' : [ 0x90, ['unsigned long long']],
    'ScaledKernelThroughput' : [ 0x98, ['unsigned long long']],
    'AverageIdleTime' : [ 0xa0, ['unsigned long long']],
    'IdleBreakEvents' : [ 0xa8, ['unsigned long long']],
    'PerformanceLimit' : [ 0xb0, ['unsigned long']],
    'PerformanceLimitFlags' : [ 0xb4, ['unsigned long']],
} ],
  '_PCW_DATA' : [ 0x10, {
    'Data' : [ 0x0, ['pointer64', ['void']]],
    'Size' : [ 0x8, ['unsigned long']],
} ],
  '_SYNCH_COUNTERS' : [ 0xb8, {
    'SpinLockAcquireCount' : [ 0x0, ['unsigned long']],
    'SpinLockContentionCount' : [ 0x4, ['unsigned long']],
    'SpinLockSpinCount' : [ 0x8, ['unsigned long']],
    'IpiSendRequestBroadcastCount' : [ 0xc, ['unsigned long']],
    'IpiSendRequestRoutineCount' : [ 0x10, ['unsigned long']],
    'IpiSendSoftwareInterruptCount' : [ 0x14, ['unsigned long']],
    'ExInitializeResourceCount' : [ 0x18, ['unsigned long']],
    'ExReInitializeResourceCount' : [ 0x1c, ['unsigned long']],
    'ExDeleteResourceCount' : [ 0x20, ['unsigned long']],
    'ExecutiveResourceAcquiresCount' : [ 0x24, ['unsigned long']],
    'ExecutiveResourceContentionsCount' : [ 0x28, ['unsigned long']],
    'ExecutiveResourceReleaseExclusiveCount' : [ 0x2c, ['unsigned long']],
    'ExecutiveResourceReleaseSharedCount' : [ 0x30, ['unsigned long']],
    'ExecutiveResourceConvertsCount' : [ 0x34, ['unsigned long']],
    'ExAcqResExclusiveAttempts' : [ 0x38, ['unsigned long']],
    'ExAcqResExclusiveAcquiresExclusive' : [ 0x3c, ['unsigned long']],
    'ExAcqResExclusiveAcquiresExclusiveRecursive' : [ 0x40, ['unsigned long']],
    'ExAcqResExclusiveWaits' : [ 0x44, ['unsigned long']],
    'ExAcqResExclusiveNotAcquires' : [ 0x48, ['unsigned long']],
    'ExAcqResSharedAttempts' : [ 0x4c, ['unsigned long']],
    'ExAcqResSharedAcquiresExclusive' : [ 0x50, ['unsigned long']],
    'ExAcqResSharedAcquiresShared' : [ 0x54, ['unsigned long']],
    'ExAcqResSharedAcquiresSharedRecursive' : [ 0x58, ['unsigned long']],
    'ExAcqResSharedWaits' : [ 0x5c, ['unsigned long']],
    'ExAcqResSharedNotAcquires' : [ 0x60, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAttempts' : [ 0x64, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresExclusive' : [ 0x68, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresShared' : [ 0x6c, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveAcquiresSharedRecursive' : [ 0x70, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveWaits' : [ 0x74, ['unsigned long']],
    'ExAcqResSharedStarveExclusiveNotAcquires' : [ 0x78, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAttempts' : [ 0x7c, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresExclusive' : [ 0x80, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresShared' : [ 0x84, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveAcquiresSharedRecursive' : [ 0x88, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveWaits' : [ 0x8c, ['unsigned long']],
    'ExAcqResSharedWaitForExclusiveNotAcquires' : [ 0x90, ['unsigned long']],
    'ExSetResOwnerPointerExclusive' : [ 0x94, ['unsigned long']],
    'ExSetResOwnerPointerSharedNew' : [ 0x98, ['unsigned long']],
    'ExSetResOwnerPointerSharedOld' : [ 0x9c, ['unsigned long']],
    'ExTryToAcqExclusiveAttempts' : [ 0xa0, ['unsigned long']],
    'ExTryToAcqExclusiveAcquires' : [ 0xa4, ['unsigned long']],
    'ExBoostExclusiveOwner' : [ 0xa8, ['unsigned long']],
    'ExBoostSharedOwners' : [ 0xac, ['unsigned long']],
    'ExEtwSynchTrackingNotificationsCount' : [ 0xb0, ['unsigned long']],
    'ExEtwSynchTrackingNotificationsAccountedCount' : [ 0xb4, ['unsigned long']],
} ],
  '_ETW_PERF_COUNTERS' : [ 0x18, {
    'TotalActiveSessions' : [ 0x0, ['long']],
    'TotalBufferMemoryNonPagedPool' : [ 0x4, ['long']],
    'TotalBufferMemoryPagedPool' : [ 0x8, ['long']],
    'TotalGuidsEnabled' : [ 0xc, ['long']],
    'TotalGuidsNotEnabled' : [ 0x10, ['long']],
    'TotalGuidsPreEnabled' : [ 0x14, ['long']],
} ],
  '_ETW_SESSION_PERF_COUNTERS' : [ 0x18, {
    'BufferMemoryPagedPool' : [ 0x0, ['long']],
    'BufferMemoryNonPagedPool' : [ 0x4, ['long']],
    'EventsLoggedCount' : [ 0x8, ['unsigned long long']],
    'EventsLost' : [ 0x10, ['long']],
    'NumConsumers' : [ 0x14, ['long']],
} ],
  '_FILESYSTEM_DISK_COUNTERS' : [ 0x10, {
    'FsBytesRead' : [ 0x0, ['unsigned long long']],
    'FsBytesWritten' : [ 0x8, ['unsigned long long']],
} ],
  '_THERMAL_ZONE_COUNTERS' : [ 0xc, {
    'Temperature' : [ 0x0, ['unsigned long']],
    'ThrottleLimit' : [ 0x4, ['unsigned long']],
    'ThrottleReasons' : [ 0x8, ['unsigned long']],
} ],
  '_CONTEXT32_UPDATE' : [ 0x4, {
    'NumberEntries' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_1705' : [ 0x10, {
    'ReservedEax' : [ 0x0, ['unsigned long']],
    'ReservedEbx' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 24, native_type='unsigned long')]],
    'InitialApicId' : [ 0x4, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
    'ReservedEcx' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 31, native_type='unsigned long')]],
    'HypervisorPresent' : [ 0x8, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'ReservedEdx' : [ 0xc, ['unsigned long']],
} ],
  '_HV_CPUID_RESULT' : [ 0x10, {
    'Eax' : [ 0x0, ['unsigned long']],
    'Ebx' : [ 0x4, ['unsigned long']],
    'Ecx' : [ 0x8, ['unsigned long']],
    'Edx' : [ 0xc, ['unsigned long']],
    'AsUINT32' : [ 0x0, ['array', 4, ['unsigned long']]],
    'VersionAndFeatures' : [ 0x0, ['__unnamed_1705']],
    'HvVendorAndMaxFunction' : [ 0x0, ['_HV_VENDOR_AND_MAX_FUNCTION']],
    'HvInterface' : [ 0x0, ['_HV_HYPERVISOR_INTERFACE_INFO']],
    'MsHvVersion' : [ 0x0, ['_HV_HYPERVISOR_VERSION_INFO']],
    'MsHvFeatures' : [ 0x0, ['_HV_HYPERVISOR_FEATURES']],
    'MsHvEnlightenmentInformation' : [ 0x0, ['_HV_ENLIGHTENMENT_INFORMATION']],
    'MsHvImplementationLimits' : [ 0x0, ['_HV_IMPLEMENTATION_LIMITS']],
    'MsHvHardwareFeatures' : [ 0x0, ['_HV_HYPERVISOR_HARDWARE_FEATURES']],
} ],
  '_HV_VENDOR_AND_MAX_FUNCTION' : [ 0x10, {
    'MaxFunction' : [ 0x0, ['unsigned long']],
    'VendorName' : [ 0x4, ['array', 12, ['unsigned char']]],
} ],
  '_HV_HYPERVISOR_INTERFACE_INFO' : [ 0x10, {
    'Interface' : [ 0x0, ['unsigned long']],
    'ReservedEbx' : [ 0x4, ['unsigned long']],
    'ReservedEcx' : [ 0x8, ['unsigned long']],
    'ReservedEdx' : [ 0xc, ['unsigned long']],
} ],
  '_HV_HYPERVISOR_VERSION_INFO' : [ 0x10, {
    'BuildNumber' : [ 0x0, ['unsigned long']],
    'MinorVersion' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'MajorVersion' : [ 0x4, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
    'ServicePack' : [ 0x8, ['unsigned long']],
    'ServiceNumber' : [ 0xc, ['BitField', dict(start_bit = 0, end_bit = 24, native_type='unsigned long')]],
    'ServiceBranch' : [ 0xc, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
} ],
  '_HV_HYPERVISOR_FEATURES' : [ 0x10, {
    'PartitionPrivileges' : [ 0x0, ['_HV_PARTITION_PRIVILEGE_MASK']],
    'MaxSupportedCState' : [ 0x8, ['BitField', dict(start_bit = 0, end_bit = 4, native_type='unsigned long')]],
    'HpetNeededForC3PowerState' : [ 0x8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Reserved' : [ 0x8, ['BitField', dict(start_bit = 5, end_bit = 32, native_type='unsigned long')]],
    'MwaitAvailable' : [ 0xc, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'GuestDebuggingAvailable' : [ 0xc, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'PerformanceMonitorsAvailable' : [ 0xc, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'CpuDynamicPartitioningAvailable' : [ 0xc, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'XmmRegistersForFastHypercallAvailable' : [ 0xc, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'GuestIdleAvailable' : [ 0xc, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'HypervisorSleepStateSupportAvailable' : [ 0xc, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'NumaDistanceQueryAvailable' : [ 0xc, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'FrequencyMsrsAvailable' : [ 0xc, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'SyntheticMachineCheckAvailable' : [ 0xc, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'GuestCrashMsrsAvailable' : [ 0xc, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'DebugMsrsAvailable' : [ 0xc, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'Npiep1Available' : [ 0xc, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'DisableHypervisorAvailable' : [ 0xc, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'Reserved1' : [ 0xc, ['BitField', dict(start_bit = 14, end_bit = 32, native_type='unsigned long')]],
} ],
  '_HV_HYPERVISOR_HARDWARE_FEATURES' : [ 0x10, {
    'ApicOverlayAssistInUse' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MsrBitmapsInUse' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ArchitecturalPerformanceCountersInUse' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'SecondLevelAddressTranslationInUse' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DmaRemappingInUse' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'InterruptRemappingInUse' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'MemoryPatrolScrubberPresent' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 32, native_type='unsigned long')]],
    'ReservedEbx' : [ 0x4, ['unsigned long']],
    'ReservedEcx' : [ 0x8, ['unsigned long']],
    'ReservedEdx' : [ 0xc, ['unsigned long']],
} ],
  '_HV_ENLIGHTENMENT_INFORMATION' : [ 0x10, {
    'UseHypercallForAddressSpaceSwitch' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'UseHypercallForLocalFlush' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'UseHypercallForRemoteFlush' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'UseApicMsrs' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'UseMsrForReset' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'UseRelaxedTiming' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'UseDmaRemapping' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'UseInterruptRemapping' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'UseX2ApicMsrs' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'DeprecateAutoEoi' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 32, native_type='unsigned long')]],
    'LongSpinWaitCount' : [ 0x4, ['unsigned long']],
    'ReservedEcx' : [ 0x8, ['unsigned long']],
    'ReservedEdx' : [ 0xc, ['unsigned long']],
} ],
  '_HV_IMPLEMENTATION_LIMITS' : [ 0x10, {
    'MaxVirtualProcessorCount' : [ 0x0, ['unsigned long']],
    'MaxLogicalProcessorCount' : [ 0x4, ['unsigned long']],
    'MaxInterruptMappingCount' : [ 0x8, ['unsigned long']],
    'ReservedEdx' : [ 0xc, ['unsigned long']],
} ],
  '_HV_PARTITION_PRIVILEGE_MASK' : [ 0x8, {
    'AsUINT64' : [ 0x0, ['unsigned long long']],
    'AccessVpRunTimeMsr' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'AccessPartitionReferenceCounter' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'AccessSynicMsrs' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'AccessSyntheticTimerMsrs' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'AccessApicMsrs' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'AccessHypercallMsrs' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
    'AccessVpIndex' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long long')]],
    'AccessResetMsr' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long long')]],
    'AccessStatsMsr' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'AccessPartitionReferenceTsc' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'AccessGuestIdleMsr' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'AccessFrequencyMsrs' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'AccessDebugMsrs' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long long')]],
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 32, native_type='unsigned long long')]],
    'CreatePartitions' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 33, native_type='unsigned long long')]],
    'AccessPartitionId' : [ 0x0, ['BitField', dict(start_bit = 33, end_bit = 34, native_type='unsigned long long')]],
    'AccessMemoryPool' : [ 0x0, ['BitField', dict(start_bit = 34, end_bit = 35, native_type='unsigned long long')]],
    'AdjustMessageBuffers' : [ 0x0, ['BitField', dict(start_bit = 35, end_bit = 36, native_type='unsigned long long')]],
    'PostMessages' : [ 0x0, ['BitField', dict(start_bit = 36, end_bit = 37, native_type='unsigned long long')]],
    'SignalEvents' : [ 0x0, ['BitField', dict(start_bit = 37, end_bit = 38, native_type='unsigned long long')]],
    'CreatePort' : [ 0x0, ['BitField', dict(start_bit = 38, end_bit = 39, native_type='unsigned long long')]],
    'ConnectPort' : [ 0x0, ['BitField', dict(start_bit = 39, end_bit = 40, native_type='unsigned long long')]],
    'AccessStats' : [ 0x0, ['BitField', dict(start_bit = 40, end_bit = 41, native_type='unsigned long long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 41, end_bit = 43, native_type='unsigned long long')]],
    'Debugging' : [ 0x0, ['BitField', dict(start_bit = 43, end_bit = 44, native_type='unsigned long long')]],
    'CpuManagement' : [ 0x0, ['BitField', dict(start_bit = 44, end_bit = 45, native_type='unsigned long long')]],
    'ConfigureProfiler' : [ 0x0, ['BitField', dict(start_bit = 45, end_bit = 46, native_type='unsigned long long')]],
    'EnableExpandedStackwalking' : [ 0x0, ['BitField', dict(start_bit = 46, end_bit = 47, native_type='unsigned long long')]],
    'Reserved3' : [ 0x0, ['BitField', dict(start_bit = 47, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_KTIMER_TABLE' : [ 0x2200, {
    'TimerExpiry' : [ 0x0, ['array', 64, ['pointer64', ['_KTIMER']]]],
    'TimerEntries' : [ 0x200, ['array', 256, ['_KTIMER_TABLE_ENTRY']]],
} ],
  '_KTIMER_TABLE_ENTRY' : [ 0x20, {
    'Lock' : [ 0x0, ['unsigned long long']],
    'Entry' : [ 0x8, ['_LIST_ENTRY']],
    'Time' : [ 0x18, ['_ULARGE_INTEGER']],
} ],
  '_XSTATE_SAVE' : [ 0x38, {
    'Prev' : [ 0x0, ['pointer64', ['_XSTATE_SAVE']]],
    'Thread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
    'Level' : [ 0x10, ['unsigned char']],
    'XStateContext' : [ 0x18, ['_XSTATE_CONTEXT']],
} ],
  '_XSAVE_AREA' : [ 0x240, {
    'LegacyState' : [ 0x0, ['_XSAVE_FORMAT']],
    'Header' : [ 0x200, ['_XSAVE_AREA_HEADER']],
} ],
  '_KSHARED_READY_QUEUE' : [ 0x268, {
    'Lock' : [ 0x0, ['unsigned long long']],
    'ReadySummary' : [ 0x8, ['unsigned long']],
    'ReadyListHead' : [ 0x10, ['array', 32, ['_LIST_ENTRY']]],
    'RunningSummary' : [ 0x210, ['array', 64, ['unsigned char']]],
    'Span' : [ 0x250, ['unsigned long']],
    'LowProcIndex' : [ 0x254, ['unsigned long']],
    'QueueIndex' : [ 0x258, ['unsigned long']],
    'ProcCount' : [ 0x25c, ['unsigned long']],
    'Affinity' : [ 0x260, ['unsigned long long']],
} ],
  '_KEXCEPTION_FRAME' : [ 0x140, {
    'P1Home' : [ 0x0, ['unsigned long long']],
    'P2Home' : [ 0x8, ['unsigned long long']],
    'P3Home' : [ 0x10, ['unsigned long long']],
    'P4Home' : [ 0x18, ['unsigned long long']],
    'P5' : [ 0x20, ['unsigned long long']],
    'Spare1' : [ 0x28, ['unsigned long long']],
    'Xmm6' : [ 0x30, ['_M128A']],
    'Xmm7' : [ 0x40, ['_M128A']],
    'Xmm8' : [ 0x50, ['_M128A']],
    'Xmm9' : [ 0x60, ['_M128A']],
    'Xmm10' : [ 0x70, ['_M128A']],
    'Xmm11' : [ 0x80, ['_M128A']],
    'Xmm12' : [ 0x90, ['_M128A']],
    'Xmm13' : [ 0xa0, ['_M128A']],
    'Xmm14' : [ 0xb0, ['_M128A']],
    'Xmm15' : [ 0xc0, ['_M128A']],
    'TrapFrame' : [ 0xd0, ['unsigned long long']],
    'OutputBuffer' : [ 0xd8, ['unsigned long long']],
    'OutputLength' : [ 0xe0, ['unsigned long long']],
    'Spare2' : [ 0xe8, ['unsigned long long']],
    'MxCsr' : [ 0xf0, ['unsigned long long']],
    'Rbp' : [ 0xf8, ['unsigned long long']],
    'Rbx' : [ 0x100, ['unsigned long long']],
    'Rdi' : [ 0x108, ['unsigned long long']],
    'Rsi' : [ 0x110, ['unsigned long long']],
    'R12' : [ 0x118, ['unsigned long long']],
    'R13' : [ 0x120, ['unsigned long long']],
    'R14' : [ 0x128, ['unsigned long long']],
    'R15' : [ 0x130, ['unsigned long long']],
    'Return' : [ 0x138, ['unsigned long long']],
} ],
  '_KTRAP_FRAME' : [ 0x190, {
    'P1Home' : [ 0x0, ['unsigned long long']],
    'P2Home' : [ 0x8, ['unsigned long long']],
    'P3Home' : [ 0x10, ['unsigned long long']],
    'P4Home' : [ 0x18, ['unsigned long long']],
    'P5' : [ 0x20, ['unsigned long long']],
    'PreviousMode' : [ 0x28, ['unsigned char']],
    'PreviousIrql' : [ 0x29, ['unsigned char']],
    'FaultIndicator' : [ 0x2a, ['unsigned char']],
    'ExceptionActive' : [ 0x2b, ['unsigned char']],
    'MxCsr' : [ 0x2c, ['unsigned long']],
    'Rax' : [ 0x30, ['unsigned long long']],
    'Rcx' : [ 0x38, ['unsigned long long']],
    'Rdx' : [ 0x40, ['unsigned long long']],
    'R8' : [ 0x48, ['unsigned long long']],
    'R9' : [ 0x50, ['unsigned long long']],
    'R10' : [ 0x58, ['unsigned long long']],
    'R11' : [ 0x60, ['unsigned long long']],
    'GsBase' : [ 0x68, ['unsigned long long']],
    'GsSwap' : [ 0x68, ['unsigned long long']],
    'Xmm0' : [ 0x70, ['_M128A']],
    'Xmm1' : [ 0x80, ['_M128A']],
    'Xmm2' : [ 0x90, ['_M128A']],
    'Xmm3' : [ 0xa0, ['_M128A']],
    'Xmm4' : [ 0xb0, ['_M128A']],
    'Xmm5' : [ 0xc0, ['_M128A']],
    'FaultAddress' : [ 0xd0, ['unsigned long long']],
    'ContextRecord' : [ 0xd0, ['unsigned long long']],
    'TimeStampCKCL' : [ 0xd0, ['unsigned long long']],
    'Dr0' : [ 0xd8, ['unsigned long long']],
    'Dr1' : [ 0xe0, ['unsigned long long']],
    'Dr2' : [ 0xe8, ['unsigned long long']],
    'Dr3' : [ 0xf0, ['unsigned long long']],
    'Dr6' : [ 0xf8, ['unsigned long long']],
    'Dr7' : [ 0x100, ['unsigned long long']],
    'DebugControl' : [ 0x108, ['unsigned long long']],
    'LastBranchToRip' : [ 0x110, ['unsigned long long']],
    'LastBranchFromRip' : [ 0x118, ['unsigned long long']],
    'LastExceptionToRip' : [ 0x120, ['unsigned long long']],
    'LastExceptionFromRip' : [ 0x128, ['unsigned long long']],
    'LastBranchControl' : [ 0x108, ['unsigned long long']],
    'LastBranchMSR' : [ 0x110, ['unsigned long']],
    'SegDs' : [ 0x130, ['unsigned short']],
    'SegEs' : [ 0x132, ['unsigned short']],
    'SegFs' : [ 0x134, ['unsigned short']],
    'SegGs' : [ 0x136, ['unsigned short']],
    'TrapFrame' : [ 0x138, ['unsigned long long']],
    'Rbx' : [ 0x140, ['unsigned long long']],
    'Rdi' : [ 0x148, ['unsigned long long']],
    'Rsi' : [ 0x150, ['unsigned long long']],
    'Rbp' : [ 0x158, ['unsigned long long']],
    'ErrorCode' : [ 0x160, ['unsigned long long']],
    'ExceptionFrame' : [ 0x160, ['unsigned long long']],
    'TimeStampKlog' : [ 0x160, ['unsigned long long']],
    'Rip' : [ 0x168, ['unsigned long long']],
    'SegCs' : [ 0x170, ['unsigned short']],
    'Fill0' : [ 0x172, ['unsigned char']],
    'Logging' : [ 0x173, ['unsigned char']],
    'Fill1' : [ 0x174, ['array', 2, ['unsigned short']]],
    'EFlags' : [ 0x178, ['unsigned long']],
    'Fill2' : [ 0x17c, ['unsigned long']],
    'Rsp' : [ 0x180, ['unsigned long long']],
    'SegSs' : [ 0x188, ['unsigned short']],
    'Fill3' : [ 0x18a, ['unsigned short']],
    'Fill4' : [ 0x18c, ['unsigned long']],
} ],
  '_MCGEN_TRACE_CONTEXT' : [ 0x48, {
    'RegistrationHandle' : [ 0x0, ['unsigned long long']],
    'Logger' : [ 0x8, ['unsigned long long']],
    'MatchAnyKeyword' : [ 0x10, ['unsigned long long']],
    'MatchAllKeyword' : [ 0x18, ['unsigned long long']],
    'Flags' : [ 0x20, ['unsigned long']],
    'IsEnabled' : [ 0x24, ['unsigned long']],
    'Level' : [ 0x28, ['unsigned char']],
    'Reserve' : [ 0x29, ['unsigned char']],
    'EnableBitsCount' : [ 0x2a, ['unsigned short']],
    'EnableBitMask' : [ 0x30, ['pointer64', ['unsigned long']]],
    'EnableKeyWords' : [ 0x38, ['pointer64', ['unsigned long long']]],
    'EnableLevel' : [ 0x40, ['pointer64', ['unsigned char']]],
} ],
  '_EVENT_FILTER_DESCRIPTOR' : [ 0x10, {
    'Ptr' : [ 0x0, ['unsigned long long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Type' : [ 0xc, ['unsigned long']],
} ],
  '_SID' : [ 0xc, {
    'Revision' : [ 0x0, ['unsigned char']],
    'SubAuthorityCount' : [ 0x1, ['unsigned char']],
    'IdentifierAuthority' : [ 0x2, ['_SID_IDENTIFIER_AUTHORITY']],
    'SubAuthority' : [ 0x8, ['array', 1, ['unsigned long']]],
} ],
  '_PNP_DEVICE_COMPLETION_QUEUE' : [ 0x50, {
    'DispatchedList' : [ 0x0, ['_LIST_ENTRY']],
    'DispatchedCount' : [ 0x10, ['unsigned long']],
    'CompletedList' : [ 0x18, ['_LIST_ENTRY']],
    'CompletedSemaphore' : [ 0x28, ['_KSEMAPHORE']],
    'SpinLock' : [ 0x48, ['unsigned long long']],
} ],
  '_KSEMAPHORE' : [ 0x20, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'Limit' : [ 0x18, ['long']],
} ],
  '_DEVOBJ_EXTENSION' : [ 0x60, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['unsigned short']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'PowerFlags' : [ 0x10, ['unsigned long']],
    'Dope' : [ 0x18, ['pointer64', ['_DEVICE_OBJECT_POWER_EXTENSION']]],
    'ExtensionFlags' : [ 0x20, ['unsigned long']],
    'DeviceNode' : [ 0x28, ['pointer64', ['void']]],
    'AttachedTo' : [ 0x30, ['pointer64', ['_DEVICE_OBJECT']]],
    'StartIoCount' : [ 0x38, ['long']],
    'StartIoKey' : [ 0x3c, ['long']],
    'StartIoFlags' : [ 0x40, ['unsigned long']],
    'Vpb' : [ 0x48, ['pointer64', ['_VPB']]],
    'DependencyNode' : [ 0x50, ['pointer64', ['void']]],
    'VerifierContext' : [ 0x58, ['pointer64', ['void']]],
} ],
  '__unnamed_1805' : [ 0x8, {
    'LegacyDeviceNode' : [ 0x0, ['pointer64', ['_DEVICE_NODE']]],
    'PendingDeviceRelations' : [ 0x0, ['pointer64', ['_DEVICE_RELATIONS']]],
    'Information' : [ 0x0, ['pointer64', ['void']]],
} ],
  '__unnamed_1807' : [ 0x8, {
    'NextResourceDeviceNode' : [ 0x0, ['pointer64', ['_DEVICE_NODE']]],
} ],
  '__unnamed_180b' : [ 0x20, {
    'DockStatus' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'DOCK_NOTDOCKDEVICE', 1: 'DOCK_QUIESCENT', 2: 'DOCK_ARRIVING', 3: 'DOCK_DEPARTING', 4: 'DOCK_EJECTIRP_COMPLETED'})]],
    'ListEntry' : [ 0x8, ['_LIST_ENTRY']],
    'SerialNumber' : [ 0x18, ['pointer64', ['unsigned short']]],
} ],
  '_DEVICE_NODE' : [ 0x2c8, {
    'Sibling' : [ 0x0, ['pointer64', ['_DEVICE_NODE']]],
    'Child' : [ 0x8, ['pointer64', ['_DEVICE_NODE']]],
    'Parent' : [ 0x10, ['pointer64', ['_DEVICE_NODE']]],
    'LastChild' : [ 0x18, ['pointer64', ['_DEVICE_NODE']]],
    'PhysicalDeviceObject' : [ 0x20, ['pointer64', ['_DEVICE_OBJECT']]],
    'InstancePath' : [ 0x28, ['_UNICODE_STRING']],
    'ServiceName' : [ 0x38, ['_UNICODE_STRING']],
    'PendingIrp' : [ 0x48, ['pointer64', ['_IRP']]],
    'FxDevice' : [ 0x50, ['pointer64', ['_POP_FX_DEVICE']]],
    'FxDeviceLock' : [ 0x58, ['long']],
    'FxRemoveEvent' : [ 0x60, ['_KEVENT']],
    'FxActivationCount' : [ 0x78, ['long']],
    'FxSleepCount' : [ 0x7c, ['long']],
    'Plugin' : [ 0x80, ['pointer64', ['_POP_FX_PLUGIN']]],
    'Level' : [ 0x88, ['unsigned long']],
    'CurrentPowerState' : [ 0x8c, ['_POWER_STATE']],
    'Notify' : [ 0x90, ['_PO_DEVICE_NOTIFY']],
    'PoIrpManager' : [ 0xf8, ['_PO_IRP_MANAGER']],
    'UniqueId' : [ 0x118, ['_UNICODE_STRING']],
    'PowerFlags' : [ 0x128, ['unsigned long']],
    'State' : [ 0x12c, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]],
    'PreviousState' : [ 0x130, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]],
    'StateHistory' : [ 0x134, ['array', -80, ['Enumeration', dict(target = 'long', choices = {768: 'DeviceNodeUnspecified', 769: 'DeviceNodeUninitialized', 770: 'DeviceNodeInitialized', 771: 'DeviceNodeDriversAdded', 772: 'DeviceNodeResourcesAssigned', 773: 'DeviceNodeStartPending', 774: 'DeviceNodeStartCompletion', 775: 'DeviceNodeStartPostWork', 776: 'DeviceNodeStarted', 777: 'DeviceNodeQueryStopped', 778: 'DeviceNodeStopped', 779: 'DeviceNodeRestartCompletion', 780: 'DeviceNodeEnumeratePending', 781: 'DeviceNodeEnumerateCompletion', 782: 'DeviceNodeAwaitingQueuedDeletion', 783: 'DeviceNodeAwaitingQueuedRemoval', 784: 'DeviceNodeQueryRemoved', 785: 'DeviceNodeRemovePendingCloses', 786: 'DeviceNodeRemoved', 787: 'DeviceNodeDeletePendingCloses', 788: 'DeviceNodeDeleted', 789: 'MaxDeviceNodeState'})]]],
    'StateHistoryEntry' : [ 0x184, ['unsigned long']],
    'CompletionStatus' : [ 0x188, ['long']],
    'Flags' : [ 0x18c, ['unsigned long']],
    'UserFlags' : [ 0x190, ['unsigned long']],
    'Problem' : [ 0x194, ['unsigned long']],
    'ProblemStatus' : [ 0x198, ['long']],
    'ResourceList' : [ 0x1a0, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'ResourceListTranslated' : [ 0x1a8, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'DuplicatePDO' : [ 0x1b0, ['pointer64', ['_DEVICE_OBJECT']]],
    'ResourceRequirements' : [ 0x1b8, ['pointer64', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'InterfaceType' : [ 0x1c0, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'ACPIBus', 18: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x1c4, ['unsigned long']],
    'ChildInterfaceType' : [ 0x1c8, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'ACPIBus', 18: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'ChildBusNumber' : [ 0x1cc, ['unsigned long']],
    'ChildBusTypeIndex' : [ 0x1d0, ['unsigned short']],
    'RemovalPolicy' : [ 0x1d2, ['unsigned char']],
    'HardwareRemovalPolicy' : [ 0x1d3, ['unsigned char']],
    'TargetDeviceNotify' : [ 0x1d8, ['_LIST_ENTRY']],
    'DeviceArbiterList' : [ 0x1e8, ['_LIST_ENTRY']],
    'DeviceTranslatorList' : [ 0x1f8, ['_LIST_ENTRY']],
    'NoTranslatorMask' : [ 0x208, ['unsigned short']],
    'QueryTranslatorMask' : [ 0x20a, ['unsigned short']],
    'NoArbiterMask' : [ 0x20c, ['unsigned short']],
    'QueryArbiterMask' : [ 0x20e, ['unsigned short']],
    'OverUsed1' : [ 0x210, ['__unnamed_1805']],
    'OverUsed2' : [ 0x218, ['__unnamed_1807']],
    'BootResources' : [ 0x220, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'BootResourcesTranslated' : [ 0x228, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'CapabilityFlags' : [ 0x230, ['unsigned long']],
    'DockInfo' : [ 0x238, ['__unnamed_180b']],
    'DisableableDepends' : [ 0x258, ['unsigned long']],
    'PendedSetInterfaceState' : [ 0x260, ['_LIST_ENTRY']],
    'LegacyBusListEntry' : [ 0x270, ['_LIST_ENTRY']],
    'DriverUnloadRetryCount' : [ 0x280, ['unsigned long']],
    'PreviousParent' : [ 0x288, ['pointer64', ['_DEVICE_NODE']]],
    'DeletedChildren' : [ 0x290, ['unsigned long']],
    'NumaNodeIndex' : [ 0x294, ['unsigned long']],
    'ContainerID' : [ 0x298, ['_GUID']],
    'OverrideFlags' : [ 0x2a8, ['unsigned char']],
    'DeviceIdsHash' : [ 0x2ac, ['unsigned long']],
    'RequiresUnloadedDriver' : [ 0x2b0, ['unsigned char']],
    'PendingEjectRelations' : [ 0x2b8, ['pointer64', ['_PENDING_RELATIONS_LIST_ENTRY']]],
    'StateFlags' : [ 0x2c0, ['unsigned long']],
} ],
  '_GROUP_AFFINITY' : [ 0x10, {
    'Mask' : [ 0x0, ['unsigned long long']],
    'Group' : [ 0x8, ['unsigned short']],
    'Reserved' : [ 0xa, ['array', 3, ['unsigned short']]],
} ],
  '_KAFFINITY_EX' : [ 0xa8, {
    'Count' : [ 0x0, ['unsigned short']],
    'Size' : [ 0x2, ['unsigned short']],
    'Reserved' : [ 0x4, ['unsigned long']],
    'Bitmap' : [ 0x8, ['array', 20, ['unsigned long long']]],
} ],
  '_PNP_ASSIGN_RESOURCES_CONTEXT' : [ 0x10, {
    'IncludeFailedDevices' : [ 0x0, ['unsigned long']],
    'DeviceCount' : [ 0x4, ['unsigned long']],
    'DeviceList' : [ 0x8, ['array', 1, ['pointer64', ['_DEVICE_OBJECT']]]],
} ],
  '_PNP_RESOURCE_REQUEST' : [ 0x40, {
    'PhysicalDevice' : [ 0x0, ['pointer64', ['_DEVICE_OBJECT']]],
    'Flags' : [ 0x8, ['unsigned long']],
    'AllocationType' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: 'ArbiterRequestLegacyReported', 1: 'ArbiterRequestHalReported', 2: 'ArbiterRequestLegacyAssigned', 3: 'ArbiterRequestPnpDetected', 4: 'ArbiterRequestPnpEnumerated', -1: 'ArbiterRequestUndefined'})]],
    'Priority' : [ 0x10, ['unsigned long']],
    'Position' : [ 0x14, ['unsigned long']],
    'ResourceRequirements' : [ 0x18, ['pointer64', ['_IO_RESOURCE_REQUIREMENTS_LIST']]],
    'ReqList' : [ 0x20, ['pointer64', ['void']]],
    'ResourceAssignment' : [ 0x28, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'TranslatedResourceAssignment' : [ 0x30, ['pointer64', ['_CM_RESOURCE_LIST']]],
    'Status' : [ 0x38, ['long']],
} ],
  '_IO_RESOURCE_REQUIREMENTS_LIST' : [ 0x48, {
    'ListSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'Internal', 1: 'Isa', 2: 'Eisa', 3: 'MicroChannel', 4: 'TurboChannel', 5: 'PCIBus', 6: 'VMEBus', 7: 'NuBus', 8: 'PCMCIABus', 9: 'CBus', 10: 'MPIBus', 11: 'MPSABus', 12: 'ProcessorInternal', 13: 'InternalPowerBus', 14: 'PNPISABus', 15: 'PNPBus', 16: 'Vmcs', 17: 'ACPIBus', 18: 'MaximumInterfaceType', -1: 'InterfaceTypeUndefined'})]],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'SlotNumber' : [ 0xc, ['unsigned long']],
    'Reserved' : [ 0x10, ['array', 3, ['unsigned long']]],
    'AlternativeLists' : [ 0x1c, ['unsigned long']],
    'List' : [ 0x20, ['array', 1, ['_IO_RESOURCE_LIST']]],
} ],
  '_EXCEPTION_RECORD64' : [ 0x98, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['unsigned long long']],
    'ExceptionAddress' : [ 0x10, ['unsigned long long']],
    'NumberParameters' : [ 0x18, ['unsigned long']],
    '__unusedAlignment' : [ 0x1c, ['unsigned long']],
    'ExceptionInformation' : [ 0x20, ['array', 15, ['unsigned long long']]],
} ],
  '_EXCEPTION_RECORD32' : [ 0x50, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['unsigned long']],
    'ExceptionAddress' : [ 0xc, ['unsigned long']],
    'NumberParameters' : [ 0x10, ['unsigned long']],
    'ExceptionInformation' : [ 0x14, ['array', 15, ['unsigned long']]],
} ],
  '_DBGKM_EXCEPTION64' : [ 0xa0, {
    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD64']],
    'FirstChance' : [ 0x98, ['unsigned long']],
} ],
  '_DBGKM_EXCEPTION32' : [ 0x54, {
    'ExceptionRecord' : [ 0x0, ['_EXCEPTION_RECORD32']],
    'FirstChance' : [ 0x50, ['unsigned long']],
} ],
  '_X86_KTRAP_FRAME' : [ 0x8c, {
    'DbgEbp' : [ 0x0, ['unsigned long']],
    'DbgEip' : [ 0x4, ['unsigned long']],
    'DbgArgMark' : [ 0x8, ['unsigned long']],
    'DbgArgPointer' : [ 0xc, ['unsigned long']],
    'TempSegCs' : [ 0x10, ['unsigned long']],
    'TempEsp' : [ 0x14, ['unsigned long']],
    'Dr0' : [ 0x18, ['unsigned long']],
    'Dr1' : [ 0x1c, ['unsigned long']],
    'Dr2' : [ 0x20, ['unsigned long']],
    'Dr3' : [ 0x24, ['unsigned long']],
    'Dr6' : [ 0x28, ['unsigned long']],
    'Dr7' : [ 0x2c, ['unsigned long']],
    'SegGs' : [ 0x30, ['unsigned long']],
    'SegEs' : [ 0x34, ['unsigned long']],
    'SegDs' : [ 0x38, ['unsigned long']],
    'Edx' : [ 0x3c, ['unsigned long']],
    'Ecx' : [ 0x40, ['unsigned long']],
    'Eax' : [ 0x44, ['unsigned long']],
    'PreviousPreviousMode' : [ 0x48, ['unsigned char']],
    'EntropyQueueDpc' : [ 0x49, ['unsigned char']],
    'Reserved' : [ 0x4a, ['array', 2, ['unsigned char']]],
    'ExceptionList' : [ 0x4c, ['unsigned long']],
    'SegFs' : [ 0x50, ['unsigned long']],
    'Edi' : [ 0x54, ['unsigned long']],
    'Esi' : [ 0x58, ['unsigned long']],
    'Ebx' : [ 0x5c, ['unsigned long']],
    'Ebp' : [ 0x60, ['unsigned long']],
    'ErrCode' : [ 0x64, ['unsigned long']],
    'Eip' : [ 0x68, ['unsigned long']],
    'SegCs' : [ 0x6c, ['unsigned long']],
    'EFlags' : [ 0x70, ['unsigned long']],
    'HardwareEsp' : [ 0x74, ['unsigned long']],
    'HardwareSegSs' : [ 0x78, ['unsigned long']],
    'V86Es' : [ 0x7c, ['unsigned long']],
    'V86Ds' : [ 0x80, ['unsigned long']],
    'V86Fs' : [ 0x84, ['unsigned long']],
    'V86Gs' : [ 0x88, ['unsigned long']],
} ],
  '_X86_KTRAP_FRAME_BLUE' : [ 0x8c, {
    'DbgEbp' : [ 0x0, ['unsigned long']],
    'DbgEip' : [ 0x4, ['unsigned long']],
    'DbgArgMark' : [ 0x8, ['unsigned long']],
    'TempSegCs' : [ 0xc, ['unsigned short']],
    'Logging' : [ 0xe, ['unsigned char']],
    'FrameType' : [ 0xf, ['unsigned char']],
    'TempEsp' : [ 0x10, ['unsigned long']],
    'Dr0' : [ 0x14, ['unsigned long']],
    'Dr1' : [ 0x18, ['unsigned long']],
    'Dr2' : [ 0x1c, ['unsigned long']],
    'Dr3' : [ 0x20, ['unsigned long']],
    'Dr6' : [ 0x24, ['unsigned long']],
    'Dr7' : [ 0x28, ['unsigned long']],
    'SegGs' : [ 0x2c, ['unsigned long']],
    'SegEs' : [ 0x30, ['unsigned long']],
    'SegDs' : [ 0x34, ['unsigned long']],
    'Edx' : [ 0x38, ['unsigned long']],
    'Ecx' : [ 0x3c, ['unsigned long']],
    'Eax' : [ 0x40, ['unsigned long']],
    'PreviousPreviousMode' : [ 0x44, ['unsigned char']],
    'EntropyQueueDpc' : [ 0x45, ['unsigned char']],
    'Reserved' : [ 0x46, ['array', 2, ['unsigned char']]],
    'MxCsr' : [ 0x48, ['unsigned long']],
    'ExceptionList' : [ 0x4c, ['unsigned long']],
    'SegFs' : [ 0x50, ['unsigned long']],
    'Edi' : [ 0x54, ['unsigned long']],
    'Esi' : [ 0x58, ['unsigned long']],
    'Ebx' : [ 0x5c, ['unsigned long']],
    'Ebp' : [ 0x60, ['unsigned long']],
    'ErrCode' : [ 0x64, ['unsigned long']],
    'Eip' : [ 0x68, ['unsigned long']],
    'SegCs' : [ 0x6c, ['unsigned long']],
    'EFlags' : [ 0x70, ['unsigned long']],
    'HardwareEsp' : [ 0x74, ['unsigned long']],
    'HardwareSegSs' : [ 0x78, ['unsigned long']],
    'V86Es' : [ 0x7c, ['unsigned long']],
    'V86Ds' : [ 0x80, ['unsigned long']],
    'V86Fs' : [ 0x84, ['unsigned long']],
    'V86Gs' : [ 0x88, ['unsigned long']],
} ],
  '_DBGKD_LOAD_SYMBOLS64' : [ 0x28, {
    'PathNameLength' : [ 0x0, ['unsigned long']],
    'BaseOfDll' : [ 0x8, ['unsigned long long']],
    'ProcessId' : [ 0x10, ['unsigned long long']],
    'CheckSum' : [ 0x18, ['unsigned long']],
    'SizeOfImage' : [ 0x1c, ['unsigned long']],
    'UnloadSymbols' : [ 0x20, ['unsigned char']],
} ],
  '_DBGKD_LOAD_SYMBOLS32' : [ 0x18, {
    'PathNameLength' : [ 0x0, ['unsigned long']],
    'BaseOfDll' : [ 0x4, ['unsigned long']],
    'ProcessId' : [ 0x8, ['unsigned long']],
    'CheckSum' : [ 0xc, ['unsigned long']],
    'SizeOfImage' : [ 0x10, ['unsigned long']],
    'UnloadSymbols' : [ 0x14, ['unsigned char']],
} ],
  '_DBGKD_READ_MEMORY64' : [ 0x10, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
    'TransferCount' : [ 0x8, ['unsigned long']],
    'ActualBytesRead' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_READ_MEMORY32' : [ 0xc, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
    'TransferCount' : [ 0x4, ['unsigned long']],
    'ActualBytesRead' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_MEMORY64' : [ 0x10, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long long']],
    'TransferCount' : [ 0x8, ['unsigned long']],
    'ActualBytesWritten' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_WRITE_MEMORY32' : [ 0xc, {
    'TargetBaseAddress' : [ 0x0, ['unsigned long']],
    'TransferCount' : [ 0x4, ['unsigned long']],
    'ActualBytesWritten' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_BREAKPOINT64' : [ 0x10, {
    'BreakPointAddress' : [ 0x0, ['unsigned long long']],
    'BreakPointHandle' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_WRITE_BREAKPOINT32' : [ 0x8, {
    'BreakPointAddress' : [ 0x0, ['unsigned long']],
    'BreakPointHandle' : [ 0x4, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO64' : [ 0x10, {
    'IoAddress' : [ 0x0, ['unsigned long long']],
    'DataSize' : [ 0x8, ['unsigned long']],
    'DataValue' : [ 0xc, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO32' : [ 0xc, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'IoAddress' : [ 0x4, ['unsigned long']],
    'DataValue' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO_EXTENDED64' : [ 0x20, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['unsigned long']],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'AddressSpace' : [ 0xc, ['unsigned long']],
    'IoAddress' : [ 0x10, ['unsigned long long']],
    'DataValue' : [ 0x18, ['unsigned long']],
} ],
  '_DBGKD_READ_WRITE_IO_EXTENDED32' : [ 0x18, {
    'DataSize' : [ 0x0, ['unsigned long']],
    'InterfaceType' : [ 0x4, ['unsigned long']],
    'BusNumber' : [ 0x8, ['unsigned long']],
    'AddressSpace' : [ 0xc, ['unsigned long']],
    'IoAddress' : [ 0x10, ['unsigned long']],
    'DataValue' : [ 0x14, ['unsigned long']],
} ],
  '_DBGKD_SET_SPECIAL_CALL32' : [ 0x4, {
    'SpecialCall' : [ 0x0, ['unsigned long']],
} ],
  '_DBGKD_SET_SPECIAL_CALL64' : [ 0x8, {
    'SpecialCall' : [ 0x0, ['unsigned long long']],
} ],
  '_DBGKD_SET_INTERNAL_BREAKPOINT32' : [ 0x8, {
    'BreakpointAddress' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
} ],
  '_DBGKD_SET_INTERNAL_BREAKPOINT64' : [ 0x10, {
    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_GET_INTERNAL_BREAKPOINT64' : [ 0x20, {
    'BreakpointAddress' : [ 0x0, ['unsigned long long']],
    'Flags' : [ 0x8, ['unsigned long']],
    'Calls' : [ 0xc, ['unsigned long']],
    'MaxCallsPerPeriod' : [ 0x10, ['unsigned long']],
    'MinInstructions' : [ 0x14, ['unsigned long']],
    'MaxInstructions' : [ 0x18, ['unsigned long']],
    'TotalInstructions' : [ 0x1c, ['unsigned long']],
} ],
  '_DBGKD_GET_INTERNAL_BREAKPOINT32' : [ 0x1c, {
    'BreakpointAddress' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'Calls' : [ 0x8, ['unsigned long']],
    'MaxCallsPerPeriod' : [ 0xc, ['unsigned long']],
    'MinInstructions' : [ 0x10, ['unsigned long']],
    'MaxInstructions' : [ 0x14, ['unsigned long']],
    'TotalInstructions' : [ 0x18, ['unsigned long']],
} ],
  '__unnamed_18c2' : [ 0x28, {
    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT64']],
    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
    'ReadWriteIo' : [ 0x0, ['_DBGKD_READ_WRITE_IO64']],
    'ReadWriteIoExtended' : [ 0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED64']],
    'QuerySpecialCalls' : [ 0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
    'SetSpecialCall' : [ 0x0, ['_DBGKD_SET_SPECIAL_CALL64']],
    'SetInternalBreakpoint' : [ 0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT64']],
    'GetInternalBreakpoint' : [ 0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT64']],
    'GetVersion64' : [ 0x0, ['_DBGKD_GET_VERSION64']],
    'BreakPointEx' : [ 0x0, ['_DBGKD_BREAKPOINTEX']],
    'ReadWriteMsr' : [ 0x0, ['_DBGKD_READ_WRITE_MSR']],
    'SearchMemory' : [ 0x0, ['_DBGKD_SEARCH_MEMORY']],
    'GetSetBusData' : [ 0x0, ['_DBGKD_GET_SET_BUS_DATA']],
    'FillMemory' : [ 0x0, ['_DBGKD_FILL_MEMORY']],
    'QueryMemory' : [ 0x0, ['_DBGKD_QUERY_MEMORY']],
    'SwitchPartition' : [ 0x0, ['_DBGKD_SWITCH_PARTITION']],
    'GetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
    'SetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
} ],
  '_DBGKD_MANIPULATE_STATE64' : [ 0x38, {
    'ApiNumber' : [ 0x0, ['unsigned long']],
    'ProcessorLevel' : [ 0x4, ['unsigned short']],
    'Processor' : [ 0x6, ['unsigned short']],
    'ReturnStatus' : [ 0x8, ['long']],
    'u' : [ 0x10, ['__unnamed_18c2']],
} ],
  '__unnamed_18c9' : [ 0x28, {
    'ReadMemory' : [ 0x0, ['_DBGKD_READ_MEMORY32']],
    'WriteMemory' : [ 0x0, ['_DBGKD_WRITE_MEMORY32']],
    'ReadMemory64' : [ 0x0, ['_DBGKD_READ_MEMORY64']],
    'WriteMemory64' : [ 0x0, ['_DBGKD_WRITE_MEMORY64']],
    'GetContext' : [ 0x0, ['_DBGKD_GET_CONTEXT']],
    'SetContext' : [ 0x0, ['_DBGKD_SET_CONTEXT']],
    'WriteBreakPoint' : [ 0x0, ['_DBGKD_WRITE_BREAKPOINT32']],
    'RestoreBreakPoint' : [ 0x0, ['_DBGKD_RESTORE_BREAKPOINT']],
    'Continue' : [ 0x0, ['_DBGKD_CONTINUE']],
    'Continue2' : [ 0x0, ['_DBGKD_CONTINUE2']],
    'ReadWriteIo' : [ 0x0, ['_DBGKD_READ_WRITE_IO32']],
    'ReadWriteIoExtended' : [ 0x0, ['_DBGKD_READ_WRITE_IO_EXTENDED32']],
    'QuerySpecialCalls' : [ 0x0, ['_DBGKD_QUERY_SPECIAL_CALLS']],
    'SetSpecialCall' : [ 0x0, ['_DBGKD_SET_SPECIAL_CALL32']],
    'SetInternalBreakpoint' : [ 0x0, ['_DBGKD_SET_INTERNAL_BREAKPOINT32']],
    'GetInternalBreakpoint' : [ 0x0, ['_DBGKD_GET_INTERNAL_BREAKPOINT32']],
    'GetVersion32' : [ 0x0, ['_DBGKD_GET_VERSION32']],
    'BreakPointEx' : [ 0x0, ['_DBGKD_BREAKPOINTEX']],
    'ReadWriteMsr' : [ 0x0, ['_DBGKD_READ_WRITE_MSR']],
    'SearchMemory' : [ 0x0, ['_DBGKD_SEARCH_MEMORY']],
    'GetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
    'SetContextEx' : [ 0x0, ['_DBGKD_CONTEXT_EX']],
} ],
  '_DBGKD_MANIPULATE_STATE32' : [ 0x34, {
    'ApiNumber' : [ 0x0, ['unsigned long']],
    'ProcessorLevel' : [ 0x4, ['unsigned short']],
    'Processor' : [ 0x6, ['unsigned short']],
    'ReturnStatus' : [ 0x8, ['long']],
    'u' : [ 0xc, ['__unnamed_18c9']],
} ],
  '_DBGKD_READ_WRITE_MSR' : [ 0xc, {
    'Msr' : [ 0x0, ['unsigned long']],
    'DataValueLow' : [ 0x4, ['unsigned long']],
    'DataValueHigh' : [ 0x8, ['unsigned long']],
} ],
  '_DBGKD_BREAKPOINTEX' : [ 0x8, {
    'BreakPointCount' : [ 0x0, ['unsigned long']],
    'ContinueStatus' : [ 0x4, ['long']],
} ],
  '_DBGKD_SEARCH_MEMORY' : [ 0x18, {
    'SearchAddress' : [ 0x0, ['unsigned long long']],
    'FoundAddress' : [ 0x0, ['unsigned long long']],
    'SearchLength' : [ 0x8, ['unsigned long long']],
    'PatternLength' : [ 0x10, ['unsigned long']],
} ],
  '_DBGKD_RESTORE_BREAKPOINT' : [ 0x4, {
    'BreakPointHandle' : [ 0x0, ['unsigned long']],
} ],
  '_DBGKD_CONTINUE' : [ 0x4, {
    'ContinueStatus' : [ 0x0, ['long']],
} ],
  '_DBGKD_CONTINUE2' : [ 0x20, {
    'ContinueStatus' : [ 0x0, ['long']],
    'ControlSet' : [ 0x4, ['_AMD64_DBGKD_CONTROL_SET']],
    'AnyControlSet' : [ 0x4, ['_DBGKD_ANY_CONTROL_SET']],
} ],
  '_PROCESSOR_POWER_STATE' : [ 0x1e0, {
    'IdleStates' : [ 0x0, ['pointer64', ['_PPM_IDLE_STATES']]],
    'IdleAccounting' : [ 0x8, ['pointer64', ['_PROC_IDLE_ACCOUNTING']]],
    'IdleTimeLast' : [ 0x10, ['unsigned long long']],
    'IdleTimeTotal' : [ 0x18, ['unsigned long long']],
    'IdleTimeEntry' : [ 0x20, ['unsigned long long']],
    'Reserved' : [ 0x28, ['unsigned long long']],
    'IdlePolicy' : [ 0x30, ['_PROC_IDLE_POLICY']],
    'Synchronization' : [ 0x38, ['_PPM_IDLE_SYNCHRONIZATION_STATE']],
    'PerfFeedback' : [ 0x40, ['_PROC_FEEDBACK']],
    'Hypervisor' : [ 0xb0, ['Enumeration', dict(target = 'long', choices = {0: 'ProcHypervisorNone', 1: 'ProcHypervisorPresent', 2: 'ProcHypervisorPower'})]],
    'LastSysTime' : [ 0xb4, ['unsigned long']],
    'WmiDispatchPtr' : [ 0xb8, ['unsigned long long']],
    'WmiInterfaceEnabled' : [ 0xc0, ['long']],
    'FFHThrottleStateInfo' : [ 0xc8, ['_PPM_FFH_THROTTLE_STATE_INFO']],
    'PerfActionDpc' : [ 0xe8, ['_KDPC']],
    'PerfActionMask' : [ 0x128, ['long']],
    'HvIdleCheck' : [ 0x130, ['_PROC_IDLE_SNAP']],
    'PerfCheck' : [ 0x140, ['_PROC_PERF_SNAP']],
    'Domain' : [ 0x180, ['pointer64', ['_PROC_PERF_DOMAIN']]],
    'PerfConstraint' : [ 0x188, ['pointer64', ['_PROC_PERF_CONSTRAINT']]],
    'Concurrency' : [ 0x190, ['pointer64', ['_PPM_CONCURRENCY_ACCOUNTING']]],
    'Load' : [ 0x198, ['pointer64', ['_PROC_PERF_LOAD']]],
    'PerfHistory' : [ 0x1a0, ['pointer64', ['_PROC_PERF_HISTORY']]],
    'GuaranteedPerformancePercent' : [ 0x1a8, ['unsigned char']],
    'HvTargetState' : [ 0x1a9, ['unsigned char']],
    'Parked' : [ 0x1aa, ['unsigned char']],
    'OverUtilized' : [ 0x1ab, ['unsigned char']],
    'LatestPerformancePercent' : [ 0x1ac, ['unsigned long']],
    'LatestAffinitizedPercent' : [ 0x1b0, ['unsigned long']],
    'ExpectedUtility' : [ 0x1b4, ['unsigned long']],
    'Utility' : [ 0x1b8, ['array', 3, ['_PROC_PERF_UTILITY']]],
} ],
  '_PROC_PERF_UTILITY' : [ 0xc, {
    'Affinitized' : [ 0x0, ['unsigned long']],
    'Performance' : [ 0x4, ['unsigned long']],
    'Total' : [ 0x8, ['unsigned long']],
} ],
  '_CPU_INFO' : [ 0x10, {
    'AsUINT32' : [ 0x0, ['array', 4, ['unsigned long']]],
    'Eax' : [ 0x0, ['unsigned long']],
    'Ebx' : [ 0x4, ['unsigned long']],
    'Ecx' : [ 0x8, ['unsigned long']],
    'Edx' : [ 0xc, ['unsigned long']],
} ],
  '_POP_FX_COMPONENT_FLAGS' : [ 0x8, {
    'Value' : [ 0x0, ['long']],
    'Value2' : [ 0x4, ['long']],
    'RefCount' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 30, native_type='unsigned long')]],
    'Idling' : [ 0x0, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'Active' : [ 0x0, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'CriticalIdleOverride' : [ 0x4, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ResidentOverride' : [ 0x4, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'CompleteIdleStatePending' : [ 0x4, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Reserved' : [ 0x4, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
} ],
  '_POP_FX_DEVICE_STATUS' : [ 0x4, {
    'Value' : [ 0x0, ['long']],
    'SystemTransition' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'PepD0Notify' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'IdleTimerOn' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'IgnoreIdleTimeout' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'IrpInUse' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'IrpPending' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DPNRDeviceNotified' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DPNRReceivedFromPep' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 32, native_type='unsigned long')]],
} ],
  '_POP_RW_LOCK' : [ 0x10, {
    'Lock' : [ 0x0, ['_EX_PUSH_LOCK']],
    'Thread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
} ],
  '_VOLUME_CACHE_MAP' : [ 0xd0, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteCode' : [ 0x2, ['short']],
    'UseCount' : [ 0x4, ['unsigned long']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'VolumeCacheMapLinks' : [ 0x10, ['_LIST_ENTRY']],
    'DirtyPages' : [ 0x20, ['unsigned long long']],
    'LogHandleContext' : [ 0x28, ['_LOG_HANDLE_CONTEXT']],
    'Flags' : [ 0xc0, ['unsigned long']],
    'PagesQueuedToDisk' : [ 0xc4, ['unsigned long']],
    'LoggedPagesQueuedToDisk' : [ 0xc8, ['unsigned long']],
} ],
  '_SHARED_CACHE_MAP' : [ 0x208, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeByteSize' : [ 0x2, ['short']],
    'OpenCount' : [ 0x4, ['unsigned long']],
    'FileSize' : [ 0x8, ['_LARGE_INTEGER']],
    'BcbList' : [ 0x10, ['_LIST_ENTRY']],
    'SectionSize' : [ 0x20, ['_LARGE_INTEGER']],
    'ValidDataLength' : [ 0x28, ['_LARGE_INTEGER']],
    'ValidDataGoal' : [ 0x30, ['_LARGE_INTEGER']],
    'InitialVacbs' : [ 0x38, ['array', 4, ['pointer64', ['_VACB']]]],
    'Vacbs' : [ 0x58, ['pointer64', ['pointer64', ['_VACB']]]],
    'FileObjectFastRef' : [ 0x60, ['_EX_FAST_REF']],
    'VacbLock' : [ 0x68, ['_EX_PUSH_LOCK']],
    'DirtyPages' : [ 0x70, ['unsigned long']],
    'LoggedStreamLinks' : [ 0x78, ['_LIST_ENTRY']],
    'SharedCacheMapLinks' : [ 0x88, ['_LIST_ENTRY']],
    'Flags' : [ 0x98, ['unsigned long']],
    'Status' : [ 0x9c, ['long']],
    'Mbcb' : [ 0xa0, ['pointer64', ['_MBCB']]],
    'Section' : [ 0xa8, ['pointer64', ['void']]],
    'CreateEvent' : [ 0xb0, ['pointer64', ['_KEVENT']]],
    'WaitOnActiveCount' : [ 0xb8, ['pointer64', ['_KEVENT']]],
    'PagesToWrite' : [ 0xc0, ['unsigned long']],
    'BeyondLastFlush' : [ 0xc8, ['long long']],
    'Callbacks' : [ 0xd0, ['pointer64', ['_CACHE_MANAGER_CALLBACKS']]],
    'LazyWriteContext' : [ 0xd8, ['pointer64', ['void']]],
    'PrivateList' : [ 0xe0, ['_LIST_ENTRY']],
    'V1' : [ 0xf0, ['_LOGGED_STREAM_CALLBACK_V1']],
    'V2' : [ 0xf0, ['_LOGGED_STREAM_CALLBACK_V2']],
    'LargestLSN' : [ 0x100, ['_LARGE_INTEGER']],
    'DirtyPageThreshold' : [ 0x108, ['unsigned long']],
    'LazyWritePassCount' : [ 0x10c, ['unsigned long']],
    'UninitializeEvent' : [ 0x110, ['pointer64', ['_CACHE_UNINITIALIZE_EVENT']]],
    'BcbLock' : [ 0x118, ['_FAST_MUTEX']],
    'LastUnmapBehindOffset' : [ 0x150, ['_LARGE_INTEGER']],
    'Event' : [ 0x158, ['_KEVENT']],
    'HighWaterMappingOffset' : [ 0x170, ['_LARGE_INTEGER']],
    'PrivateCacheMap' : [ 0x178, ['_PRIVATE_CACHE_MAP']],
    'WriteBehindWorkQueueEntry' : [ 0x1f0, ['pointer64', ['void']]],
    'VolumeCacheMap' : [ 0x1f8, ['pointer64', ['_VOLUME_CACHE_MAP']]],
    'ProcImagePathHash' : [ 0x200, ['unsigned long']],
    'WritesInProgress' : [ 0x204, ['unsigned long']],
} ],
  '__unnamed_1971' : [ 0x10, {
    'FileOffset' : [ 0x0, ['_LARGE_INTEGER']],
    'ActiveCount' : [ 0x0, ['unsigned short']],
    'Links' : [ 0x0, ['_LIST_ENTRY']],
} ],
  '_VACB' : [ 0x28, {
    'BaseAddress' : [ 0x0, ['pointer64', ['void']]],
    'SharedCacheMap' : [ 0x8, ['pointer64', ['_SHARED_CACHE_MAP']]],
    'Overlay' : [ 0x10, ['__unnamed_1971']],
    'ArrayHead' : [ 0x20, ['pointer64', ['_VACB_ARRAY_HEADER']]],
} ],
  '__unnamed_1992' : [ 0x8, {
    'FileObject' : [ 0x0, ['pointer64', ['_FILE_OBJECT']]],
} ],
  '__unnamed_1994' : [ 0x8, {
    'SharedCacheMap' : [ 0x0, ['pointer64', ['_SHARED_CACHE_MAP']]],
} ],
  '__unnamed_1996' : [ 0x8, {
    'Event' : [ 0x0, ['pointer64', ['_KEVENT']]],
} ],
  '__unnamed_1998' : [ 0x4, {
    'Reason' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_199a' : [ 0x30, {
    'SharedCacheMap' : [ 0x0, ['pointer64', ['_SHARED_CACHE_MAP']]],
    'IoStatus' : [ 0x8, ['pointer64', ['_IO_STATUS_BLOCK']]],
    'CallerWaitEvent' : [ 0x10, ['_KEVENT']],
    'IsLowPriWriteBehind' : [ 0x28, ['unsigned char']],
} ],
  '__unnamed_199c' : [ 0x30, {
    'Read' : [ 0x0, ['__unnamed_1992']],
    'Write' : [ 0x0, ['__unnamed_1994']],
    'Event' : [ 0x0, ['__unnamed_1996']],
    'Notification' : [ 0x0, ['__unnamed_1998']],
    'LowPriWrite' : [ 0x0, ['__unnamed_199a']],
} ],
  '_WORK_QUEUE_ENTRY' : [ 0x48, {
    'WorkQueueLinks' : [ 0x0, ['_LIST_ENTRY']],
    'Parameters' : [ 0x10, ['__unnamed_199c']],
    'Function' : [ 0x40, ['unsigned char']],
} ],
  '_CC_EXTERNAL_CACHE_INFO' : [ 0x30, {
    'Callback' : [ 0x0, ['pointer64', ['void']]],
    'DirtyPageStatistics' : [ 0x8, ['_DIRTY_PAGE_STATISTICS']],
    'Links' : [ 0x20, ['_LIST_ENTRY']],
} ],
  '_LOG_HANDLE_CONTEXT' : [ 0x98, {
    'LogHandle' : [ 0x0, ['pointer64', ['void']]],
    'FlushToLsnRoutine' : [ 0x8, ['pointer64', ['void']]],
    'QueryLogHandleInfoRoutine' : [ 0x10, ['pointer64', ['void']]],
    'DirtyPageStatistics' : [ 0x18, ['_DIRTY_PAGE_STATISTICS']],
    'DirtyPageThresholds' : [ 0x30, ['_DIRTY_PAGE_THRESHOLDS']],
    'AdditionalPagesToWrite' : [ 0x68, ['unsigned long']],
    'CcLWScanDPThreshold' : [ 0x6c, ['unsigned long']],
    'LargestLsnForCurrentLWScan' : [ 0x70, ['_LARGE_INTEGER']],
    'RelatedFileObject' : [ 0x78, ['pointer64', ['_FILE_OBJECT']]],
    'LargestLsnFileObjectKey' : [ 0x80, ['unsigned long long']],
    'LastLWTimeStamp' : [ 0x88, ['_LARGE_INTEGER']],
    'Flags' : [ 0x90, ['unsigned long']],
} ],
  '_MBCB' : [ 0xc0, {
    'NodeTypeCode' : [ 0x0, ['short']],
    'NodeIsInZone' : [ 0x2, ['short']],
    'PagesToWrite' : [ 0x4, ['unsigned long']],
    'DirtyPages' : [ 0x8, ['unsigned long']],
    'Reserved' : [ 0xc, ['unsigned long']],
    'BitmapRanges' : [ 0x10, ['_LIST_ENTRY']],
    'ResumeWritePage' : [ 0x20, ['long long']],
    'MostRecentlyDirtiedPage' : [ 0x28, ['long long']],
    'BitmapRange1' : [ 0x30, ['_BITMAP_RANGE']],
    'BitmapRange2' : [ 0x60, ['_BITMAP_RANGE']],
    'BitmapRange3' : [ 0x90, ['_BITMAP_RANGE']],
} ],
  '_BITMAP_RANGE' : [ 0x30, {
    'Links' : [ 0x0, ['_LIST_ENTRY']],
    'BasePage' : [ 0x10, ['long long']],
    'FirstDirtyPage' : [ 0x18, ['unsigned long']],
    'LastDirtyPage' : [ 0x1c, ['unsigned long']],
    'DirtyPages' : [ 0x20, ['unsigned long']],
    'Bitmap' : [ 0x28, ['pointer64', ['unsigned long']]],
} ],
  'VACB_LEVEL_ALLOCATION_LIST' : [ 0x20, {
    'VacbLevelList' : [ 0x0, ['_LIST_ENTRY']],
    'VacbLevelWithBcbListHeads' : [ 0x10, ['pointer64', ['void']]],
    'VacbLevelsAllocated' : [ 0x18, ['unsigned long']],
} ],
  '_VACB_LEVEL_REFERENCE' : [ 0x8, {
    'Reference' : [ 0x0, ['long']],
    'SpecialReference' : [ 0x4, ['long']],
} ],
  '_CACHE_UNINITIALIZE_EVENT' : [ 0x20, {
    'Next' : [ 0x0, ['pointer64', ['_CACHE_UNINITIALIZE_EVENT']]],
    'Event' : [ 0x8, ['_KEVENT']],
} ],
  '_HEAP_LIST_LOOKUP' : [ 0x38, {
    'ExtendedLookup' : [ 0x0, ['pointer64', ['_HEAP_LIST_LOOKUP']]],
    'ArraySize' : [ 0x8, ['unsigned long']],
    'ExtraItem' : [ 0xc, ['unsigned long']],
    'ItemCount' : [ 0x10, ['unsigned long']],
    'OutOfRangeItems' : [ 0x14, ['unsigned long']],
    'BaseIndex' : [ 0x18, ['unsigned long']],
    'ListHead' : [ 0x20, ['pointer64', ['_LIST_ENTRY']]],
    'ListsInUseUlong' : [ 0x28, ['pointer64', ['unsigned long']]],
    'ListHints' : [ 0x30, ['pointer64', ['pointer64', ['_LIST_ENTRY']]]],
} ],
  '_HEAP' : [ 0x298, {
    'Entry' : [ 0x0, ['_HEAP_ENTRY']],
    'SegmentSignature' : [ 0x10, ['unsigned long']],
    'SegmentFlags' : [ 0x14, ['unsigned long']],
    'SegmentListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'Heap' : [ 0x28, ['pointer64', ['_HEAP']]],
    'BaseAddress' : [ 0x30, ['pointer64', ['void']]],
    'NumberOfPages' : [ 0x38, ['unsigned long']],
    'FirstEntry' : [ 0x40, ['pointer64', ['_HEAP_ENTRY']]],
    'LastValidEntry' : [ 0x48, ['pointer64', ['_HEAP_ENTRY']]],
    'NumberOfUnCommittedPages' : [ 0x50, ['unsigned long']],
    'NumberOfUnCommittedRanges' : [ 0x54, ['unsigned long']],
    'SegmentAllocatorBackTraceIndex' : [ 0x58, ['unsigned short']],
    'Reserved' : [ 0x5a, ['unsigned short']],
    'UCRSegmentList' : [ 0x60, ['_LIST_ENTRY']],
    'Flags' : [ 0x70, ['unsigned long']],
    'ForceFlags' : [ 0x74, ['unsigned long']],
    'CompatibilityFlags' : [ 0x78, ['unsigned long']],
    'EncodeFlagMask' : [ 0x7c, ['unsigned long']],
    'Encoding' : [ 0x80, ['_HEAP_ENTRY']],
    'Interceptor' : [ 0x90, ['unsigned long']],
    'VirtualMemoryThreshold' : [ 0x94, ['unsigned long']],
    'Signature' : [ 0x98, ['unsigned long']],
    'SegmentReserve' : [ 0xa0, ['unsigned long long']],
    'SegmentCommit' : [ 0xa8, ['unsigned long long']],
    'DeCommitFreeBlockThreshold' : [ 0xb0, ['unsigned long long']],
    'DeCommitTotalFreeThreshold' : [ 0xb8, ['unsigned long long']],
    'TotalFreeSize' : [ 0xc0, ['unsigned long long']],
    'MaximumAllocationSize' : [ 0xc8, ['unsigned long long']],
    'ProcessHeapsListIndex' : [ 0xd0, ['unsigned short']],
    'HeaderValidateLength' : [ 0xd2, ['unsigned short']],
    'HeaderValidateCopy' : [ 0xd8, ['pointer64', ['void']]],
    'NextAvailableTagIndex' : [ 0xe0, ['unsigned short']],
    'MaximumTagIndex' : [ 0xe2, ['unsigned short']],
    'TagEntries' : [ 0xe8, ['pointer64', ['_HEAP_TAG_ENTRY']]],
    'UCRList' : [ 0xf0, ['_LIST_ENTRY']],
    'AlignRound' : [ 0x100, ['unsigned long long']],
    'AlignMask' : [ 0x108, ['unsigned long long']],
    'VirtualAllocdBlocks' : [ 0x110, ['_LIST_ENTRY']],
    'SegmentList' : [ 0x120, ['_LIST_ENTRY']],
    'AllocatorBackTraceIndex' : [ 0x130, ['unsigned short']],
    'NonDedicatedListLength' : [ 0x134, ['unsigned long']],
    'BlocksIndex' : [ 0x138, ['pointer64', ['void']]],
    'UCRIndex' : [ 0x140, ['pointer64', ['void']]],
    'PseudoTagEntries' : [ 0x148, ['pointer64', ['_HEAP_PSEUDO_TAG_ENTRY']]],
    'FreeLists' : [ 0x150, ['_LIST_ENTRY']],
    'LockVariable' : [ 0x160, ['pointer64', ['_HEAP_LOCK']]],
    'CommitRoutine' : [ 0x168, ['pointer64', ['void']]],
    'FrontEndHeap' : [ 0x170, ['pointer64', ['void']]],
    'FrontHeapLockCount' : [ 0x178, ['unsigned short']],
    'FrontEndHeapType' : [ 0x17a, ['unsigned char']],
    'RequestedFrontEndHeapType' : [ 0x17b, ['unsigned char']],
    'FrontEndHeapUsageData' : [ 0x180, ['pointer64', ['unsigned short']]],
    'FrontEndHeapMaximumIndex' : [ 0x188, ['unsigned short']],
    'FrontEndHeapStatusBitmap' : [ 0x18a, ['array', 129, ['unsigned char']]],
    'Counters' : [ 0x210, ['_HEAP_COUNTERS']],
    'TuningParameters' : [ 0x288, ['_HEAP_TUNING_PARAMETERS']],
} ],
  '__unnamed_1a07' : [ 0x68, {
    'CriticalSection' : [ 0x0, ['_RTL_CRITICAL_SECTION']],
    'Resource' : [ 0x0, ['_ERESOURCE']],
} ],
  '_HEAP_LOCK' : [ 0x68, {
    'Lock' : [ 0x0, ['__unnamed_1a07']],
} ],
  '_HEAP_ENTRY' : [ 0x10, {
    'PreviousBlockPrivateData' : [ 0x0, ['pointer64', ['void']]],
    'Size' : [ 0x8, ['unsigned short']],
    'Flags' : [ 0xa, ['unsigned char']],
    'SmallTagIndex' : [ 0xb, ['unsigned char']],
    'SubSegmentCode' : [ 0x8, ['unsigned long']],
    'PreviousSize' : [ 0xc, ['unsigned short']],
    'SegmentOffset' : [ 0xe, ['unsigned char']],
    'LFHFlags' : [ 0xe, ['unsigned char']],
    'UnusedBytes' : [ 0xf, ['unsigned char']],
    'CompactHeader' : [ 0x8, ['unsigned long long']],
    'Reserved' : [ 0x0, ['pointer64', ['void']]],
    'FunctionIndex' : [ 0x8, ['unsigned short']],
    'ContextValue' : [ 0xa, ['unsigned short']],
    'InterceptorValue' : [ 0x8, ['unsigned long']],
    'UnusedBytesLength' : [ 0xc, ['unsigned short']],
    'EntryOffset' : [ 0xe, ['unsigned char']],
    'ExtendedBlockSignature' : [ 0xf, ['unsigned char']],
    'ReservedForAlignment' : [ 0x0, ['pointer64', ['void']]],
    'Code1' : [ 0x8, ['unsigned long']],
    'Code2' : [ 0xc, ['unsigned short']],
    'Code3' : [ 0xe, ['unsigned char']],
    'Code4' : [ 0xf, ['unsigned char']],
    'Code234' : [ 0xc, ['unsigned long']],
    'AgregateCode' : [ 0x8, ['unsigned long long']],
} ],
  '_HEAP_SEGMENT' : [ 0x70, {
    'Entry' : [ 0x0, ['_HEAP_ENTRY']],
    'SegmentSignature' : [ 0x10, ['unsigned long']],
    'SegmentFlags' : [ 0x14, ['unsigned long']],
    'SegmentListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'Heap' : [ 0x28, ['pointer64', ['_HEAP']]],
    'BaseAddress' : [ 0x30, ['pointer64', ['void']]],
    'NumberOfPages' : [ 0x38, ['unsigned long']],
    'FirstEntry' : [ 0x40, ['pointer64', ['_HEAP_ENTRY']]],
    'LastValidEntry' : [ 0x48, ['pointer64', ['_HEAP_ENTRY']]],
    'NumberOfUnCommittedPages' : [ 0x50, ['unsigned long']],
    'NumberOfUnCommittedRanges' : [ 0x54, ['unsigned long']],
    'SegmentAllocatorBackTraceIndex' : [ 0x58, ['unsigned short']],
    'Reserved' : [ 0x5a, ['unsigned short']],
    'UCRSegmentList' : [ 0x60, ['_LIST_ENTRY']],
} ],
  '_HEAP_VIRTUAL_ALLOC_ENTRY' : [ 0x40, {
    'Entry' : [ 0x0, ['_LIST_ENTRY']],
    'ExtraStuff' : [ 0x10, ['_HEAP_ENTRY_EXTRA']],
    'CommitSize' : [ 0x20, ['unsigned long long']],
    'ReserveSize' : [ 0x28, ['unsigned long long']],
    'BusyBlock' : [ 0x30, ['_HEAP_ENTRY']],
} ],
  '_HEAP_FREE_ENTRY' : [ 0x20, {
    'PreviousBlockPrivateData' : [ 0x0, ['pointer64', ['void']]],
    'Size' : [ 0x8, ['unsigned short']],
    'Flags' : [ 0xa, ['unsigned char']],
    'SmallTagIndex' : [ 0xb, ['unsigned char']],
    'SubSegmentCode' : [ 0x8, ['unsigned long']],
    'PreviousSize' : [ 0xc, ['unsigned short']],
    'SegmentOffset' : [ 0xe, ['unsigned char']],
    'LFHFlags' : [ 0xe, ['unsigned char']],
    'UnusedBytes' : [ 0xf, ['unsigned char']],
    'CompactHeader' : [ 0x8, ['unsigned long long']],
    'Reserved' : [ 0x0, ['pointer64', ['void']]],
    'FunctionIndex' : [ 0x8, ['unsigned short']],
    'ContextValue' : [ 0xa, ['unsigned short']],
    'InterceptorValue' : [ 0x8, ['unsigned long']],
    'UnusedBytesLength' : [ 0xc, ['unsigned short']],
    'EntryOffset' : [ 0xe, ['unsigned char']],
    'ExtendedBlockSignature' : [ 0xf, ['unsigned char']],
    'ReservedForAlignment' : [ 0x0, ['pointer64', ['void']]],
    'Code1' : [ 0x8, ['unsigned long']],
    'Code2' : [ 0xc, ['unsigned short']],
    'Code3' : [ 0xe, ['unsigned char']],
    'Code4' : [ 0xf, ['unsigned char']],
    'Code234' : [ 0xc, ['unsigned long']],
    'AgregateCode' : [ 0x8, ['unsigned long long']],
    'FreeList' : [ 0x10, ['_LIST_ENTRY']],
} ],
  '__unnamed_1a59' : [ 0x4, {
    'DataLength' : [ 0x0, ['short']],
    'TotalLength' : [ 0x2, ['short']],
} ],
  '__unnamed_1a5b' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1a59']],
    'Length' : [ 0x0, ['unsigned long']],
} ],
  '__unnamed_1a5d' : [ 0x4, {
    'Type' : [ 0x0, ['short']],
    'DataInfoOffset' : [ 0x2, ['short']],
} ],
  '__unnamed_1a5f' : [ 0x4, {
    's2' : [ 0x0, ['__unnamed_1a5d']],
    'ZeroInit' : [ 0x0, ['unsigned long']],
} ],
  '_PORT_MESSAGE' : [ 0x28, {
    'u1' : [ 0x0, ['__unnamed_1a5b']],
    'u2' : [ 0x4, ['__unnamed_1a5f']],
    'ClientId' : [ 0x8, ['_CLIENT_ID']],
    'DoNotUseThisField' : [ 0x8, ['double']],
    'MessageId' : [ 0x18, ['unsigned long']],
    'ClientViewSize' : [ 0x20, ['unsigned long long']],
    'CallbackId' : [ 0x20, ['unsigned long']],
} ],
  '_ALPC_MESSAGE_ATTRIBUTES' : [ 0x8, {
    'AllocatedAttributes' : [ 0x0, ['unsigned long']],
    'ValidAttributes' : [ 0x4, ['unsigned long']],
} ],
  '_ALPC_HANDLE_ENTRY' : [ 0x8, {
    'Object' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_BLOB_TYPE' : [ 0x30, {
    'ResourceId' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'BLOB_TYPE_UNKNOWN', 1: 'BLOB_TYPE_CONNECTION_INFO', 2: 'BLOB_TYPE_MESSAGE', 3: 'BLOB_TYPE_SECURITY_CONTEXT', 4: 'BLOB_TYPE_SECTION', 5: 'BLOB_TYPE_REGION', 6: 'BLOB_TYPE_VIEW', 7: 'BLOB_TYPE_RESERVE', 8: 'BLOB_TYPE_DIRECT_TRANSFER', 9: 'BLOB_TYPE_HANDLE_DATA', 10: 'BLOB_TYPE_MAX_ID'})]],
    'PoolTag' : [ 0x4, ['unsigned long']],
    'LookasideIndex' : [ 0x8, ['unsigned long']],
    'Flags' : [ 0xc, ['unsigned long']],
    'Counters' : [ 0x10, ['pointer64', ['_BLOB_COUNTERS']]],
    'DeleteProcedure' : [ 0x18, ['pointer64', ['void']]],
    'DestroyProcedure' : [ 0x20, ['pointer64', ['void']]],
    'UsualSize' : [ 0x28, ['unsigned long long']],
} ],
  '__unnamed_1a7a' : [ 0x1, {
    'ReferenceCache' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Lookaside' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Initializing' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Deleted' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
} ],
  '__unnamed_1a7c' : [ 0x1, {
    's1' : [ 0x0, ['__unnamed_1a7a']],
    'Flags' : [ 0x0, ['unsigned char']],
} ],
  '_BLOB' : [ 0x30, {
    'ResourceList' : [ 0x0, ['_LIST_ENTRY']],
    'FreeListEntry' : [ 0x0, ['_SLIST_ENTRY']],
    'u1' : [ 0x10, ['__unnamed_1a7c']],
    'ResourceId' : [ 0x11, ['unsigned char']],
    'CachedReferences' : [ 0x12, ['short']],
    'ReferenceCount' : [ 0x18, ['long long']],
    'Lock' : [ 0x20, ['_EX_PUSH_LOCK']],
} ],
  '__unnamed_1a8e' : [ 0x4, {
    'Internal' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Secure' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
} ],
  '__unnamed_1a90' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1a8e']],
} ],
  '_KALPC_SECTION' : [ 0x48, {
    'SectionObject' : [ 0x0, ['pointer64', ['void']]],
    'Size' : [ 0x8, ['unsigned long long']],
    'HandleTable' : [ 0x10, ['pointer64', ['_ALPC_HANDLE_TABLE']]],
    'SectionHandle' : [ 0x18, ['pointer64', ['void']]],
    'OwnerProcess' : [ 0x20, ['pointer64', ['_EPROCESS']]],
    'OwnerPort' : [ 0x28, ['pointer64', ['_ALPC_PORT']]],
    'u1' : [ 0x30, ['__unnamed_1a90']],
    'NumberOfRegions' : [ 0x34, ['unsigned long']],
    'RegionListHead' : [ 0x38, ['_LIST_ENTRY']],
} ],
  '__unnamed_1a99' : [ 0x4, {
    'Secure' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
} ],
  '__unnamed_1a9b' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1a99']],
} ],
  '_KALPC_REGION' : [ 0x58, {
    'RegionListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Section' : [ 0x10, ['pointer64', ['_KALPC_SECTION']]],
    'Offset' : [ 0x18, ['unsigned long long']],
    'Size' : [ 0x20, ['unsigned long long']],
    'ViewSize' : [ 0x28, ['unsigned long long']],
    'u1' : [ 0x30, ['__unnamed_1a9b']],
    'NumberOfViews' : [ 0x34, ['unsigned long']],
    'ViewListHead' : [ 0x38, ['_LIST_ENTRY']],
    'ReadOnlyView' : [ 0x48, ['pointer64', ['_KALPC_VIEW']]],
    'ReadWriteView' : [ 0x50, ['pointer64', ['_KALPC_VIEW']]],
} ],
  '__unnamed_1aa1' : [ 0x4, {
    'WriteAccess' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AutoRelease' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ForceUnlink' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
} ],
  '__unnamed_1aa3' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1aa1']],
} ],
  '_KALPC_VIEW' : [ 0x60, {
    'ViewListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Region' : [ 0x10, ['pointer64', ['_KALPC_REGION']]],
    'OwnerPort' : [ 0x18, ['pointer64', ['_ALPC_PORT']]],
    'OwnerProcess' : [ 0x20, ['pointer64', ['_EPROCESS']]],
    'Address' : [ 0x28, ['pointer64', ['void']]],
    'Size' : [ 0x30, ['unsigned long long']],
    'SecureViewHandle' : [ 0x38, ['pointer64', ['void']]],
    'WriteAccessHandle' : [ 0x40, ['pointer64', ['void']]],
    'u1' : [ 0x48, ['__unnamed_1aa3']],
    'NumberOfOwnerMessages' : [ 0x4c, ['unsigned long']],
    'ProcessViewListEntry' : [ 0x50, ['_LIST_ENTRY']],
} ],
  '_ALPC_COMMUNICATION_INFO' : [ 0x48, {
    'ConnectionPort' : [ 0x0, ['pointer64', ['_ALPC_PORT']]],
    'ServerCommunicationPort' : [ 0x8, ['pointer64', ['_ALPC_PORT']]],
    'ClientCommunicationPort' : [ 0x10, ['pointer64', ['_ALPC_PORT']]],
    'CommunicationList' : [ 0x18, ['_LIST_ENTRY']],
    'HandleTable' : [ 0x28, ['_ALPC_HANDLE_TABLE']],
    'CloseMessage' : [ 0x40, ['pointer64', ['_KALPC_MESSAGE']]],
} ],
  '__unnamed_1ac1' : [ 0x4, {
    'Initialized' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Type' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 3, native_type='unsigned long')]],
    'ConnectionPending' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ConnectionRefused' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'Disconnected' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Closed' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'NoFlushOnClose' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ReturnExtendedInfo' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'Waitable' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DynamicSecurity' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'Wow64CompletionList' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'Lpc' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'LpcToLpc' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'HasCompletionList' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'HadCompletionList' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'EnableCompletionList' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
} ],
  '__unnamed_1ac3' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1ac1']],
    'State' : [ 0x0, ['unsigned long']],
} ],
  '_ALPC_PORT' : [ 0x1c0, {
    'PortListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'CommunicationInfo' : [ 0x10, ['pointer64', ['_ALPC_COMMUNICATION_INFO']]],
    'OwnerProcess' : [ 0x18, ['pointer64', ['_EPROCESS']]],
    'CompletionPort' : [ 0x20, ['pointer64', ['void']]],
    'CompletionKey' : [ 0x28, ['pointer64', ['void']]],
    'CompletionPacketLookaside' : [ 0x30, ['pointer64', ['_ALPC_COMPLETION_PACKET_LOOKASIDE']]],
    'PortContext' : [ 0x38, ['pointer64', ['void']]],
    'StaticSecurity' : [ 0x40, ['_SECURITY_CLIENT_CONTEXT']],
    'IncomingQueueLock' : [ 0x88, ['_EX_PUSH_LOCK']],
    'MainQueue' : [ 0x90, ['_LIST_ENTRY']],
    'LargeMessageQueue' : [ 0xa0, ['_LIST_ENTRY']],
    'PendingQueueLock' : [ 0xb0, ['_EX_PUSH_LOCK']],
    'PendingQueue' : [ 0xb8, ['_LIST_ENTRY']],
    'WaitQueueLock' : [ 0xc8, ['_EX_PUSH_LOCK']],
    'WaitQueue' : [ 0xd0, ['_LIST_ENTRY']],
    'Semaphore' : [ 0xe0, ['pointer64', ['_KSEMAPHORE']]],
    'DummyEvent' : [ 0xe0, ['pointer64', ['_KEVENT']]],
    'PortAttributes' : [ 0xe8, ['_ALPC_PORT_ATTRIBUTES']],
    'ResourceListLock' : [ 0x130, ['_EX_PUSH_LOCK']],
    'ResourceListHead' : [ 0x138, ['_LIST_ENTRY']],
    'PortObjectLock' : [ 0x148, ['_EX_PUSH_LOCK']],
    'CompletionList' : [ 0x150, ['pointer64', ['_ALPC_COMPLETION_LIST']]],
    'CallbackObject' : [ 0x158, ['pointer64', ['_CALLBACK_OBJECT']]],
    'CallbackContext' : [ 0x160, ['pointer64', ['void']]],
    'CanceledQueue' : [ 0x168, ['_LIST_ENTRY']],
    'SequenceNo' : [ 0x178, ['long']],
    'ReferenceNo' : [ 0x17c, ['long']],
    'ReferenceNoWait' : [ 0x180, ['pointer64', ['_PALPC_PORT_REFERENCE_WAIT_BLOCK']]],
    'u1' : [ 0x188, ['__unnamed_1ac3']],
    'TargetQueuePort' : [ 0x190, ['pointer64', ['_ALPC_PORT']]],
    'TargetSequencePort' : [ 0x198, ['pointer64', ['_ALPC_PORT']]],
    'CachedMessage' : [ 0x1a0, ['pointer64', ['_KALPC_MESSAGE']]],
    'MainQueueLength' : [ 0x1a8, ['unsigned long']],
    'LargeMessageQueueLength' : [ 0x1ac, ['unsigned long']],
    'PendingQueueLength' : [ 0x1b0, ['unsigned long']],
    'CanceledQueueLength' : [ 0x1b4, ['unsigned long']],
    'WaitQueueLength' : [ 0x1b8, ['unsigned long']],
} ],
  '_ALPC_COMPLETION_LIST' : [ 0xa0, {
    'Entry' : [ 0x0, ['_LIST_ENTRY']],
    'OwnerProcess' : [ 0x10, ['pointer64', ['_EPROCESS']]],
    'CompletionListLock' : [ 0x18, ['_EX_PUSH_LOCK']],
    'Mdl' : [ 0x20, ['pointer64', ['_MDL']]],
    'UserVa' : [ 0x28, ['pointer64', ['void']]],
    'UserLimit' : [ 0x30, ['pointer64', ['void']]],
    'DataUserVa' : [ 0x38, ['pointer64', ['void']]],
    'SystemVa' : [ 0x40, ['pointer64', ['void']]],
    'TotalSize' : [ 0x48, ['unsigned long long']],
    'Header' : [ 0x50, ['pointer64', ['_ALPC_COMPLETION_LIST_HEADER']]],
    'List' : [ 0x58, ['pointer64', ['void']]],
    'ListSize' : [ 0x60, ['unsigned long long']],
    'Bitmap' : [ 0x68, ['pointer64', ['void']]],
    'BitmapSize' : [ 0x70, ['unsigned long long']],
    'Data' : [ 0x78, ['pointer64', ['void']]],
    'DataSize' : [ 0x80, ['unsigned long long']],
    'BitmapLimit' : [ 0x88, ['unsigned long']],
    'BitmapNextHint' : [ 0x8c, ['unsigned long']],
    'ConcurrencyCount' : [ 0x90, ['unsigned long']],
    'AttributeFlags' : [ 0x94, ['unsigned long']],
    'AttributeSize' : [ 0x98, ['unsigned long']],
} ],
  '_OBJECT_ATTRIBUTES' : [ 0x30, {
    'Length' : [ 0x0, ['unsigned long']],
    'RootDirectory' : [ 0x8, ['pointer64', ['void']]],
    'ObjectName' : [ 0x10, ['pointer64', ['_UNICODE_STRING']]],
    'Attributes' : [ 0x18, ['unsigned long']],
    'SecurityDescriptor' : [ 0x20, ['pointer64', ['void']]],
    'SecurityQualityOfService' : [ 0x28, ['pointer64', ['void']]],
} ],
  '_OBJECT_TYPE' : [ 0xd8, {
    'TypeList' : [ 0x0, ['_LIST_ENTRY']],
    'Name' : [ 0x10, ['_UNICODE_STRING']],
    'DefaultObject' : [ 0x20, ['pointer64', ['void']]],
    'Index' : [ 0x28, ['unsigned char']],
    'TotalNumberOfObjects' : [ 0x2c, ['unsigned long']],
    'TotalNumberOfHandles' : [ 0x30, ['unsigned long']],
    'HighWaterNumberOfObjects' : [ 0x34, ['unsigned long']],
    'HighWaterNumberOfHandles' : [ 0x38, ['unsigned long']],
    'TypeInfo' : [ 0x40, ['_OBJECT_TYPE_INITIALIZER']],
    'TypeLock' : [ 0xb8, ['_EX_PUSH_LOCK']],
    'Key' : [ 0xc0, ['unsigned long']],
    'CallbackList' : [ 0xc8, ['_LIST_ENTRY']],
} ],
  '_PALPC_PORT_REFERENCE_WAIT_BLOCK' : [ 0x20, {
    'DesiredReferenceNoEvent' : [ 0x0, ['_KEVENT']],
    'DesiredReferenceNo' : [ 0x18, ['long']],
} ],
  '_PORT_MESSAGE32' : [ 0x18, {
    'u1' : [ 0x0, ['__unnamed_1a5b']],
    'u2' : [ 0x4, ['__unnamed_1a5f']],
    'ClientId' : [ 0x8, ['_CLIENT_ID32']],
    'DoNotUseThisField' : [ 0x8, ['double']],
    'MessageId' : [ 0x10, ['unsigned long']],
    'ClientViewSize' : [ 0x14, ['unsigned long']],
    'CallbackId' : [ 0x14, ['unsigned long']],
} ],
  '__unnamed_1aeb' : [ 0x4, {
    'QueueType' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned long')]],
    'QueuePortType' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 6, native_type='unsigned long')]],
    'Canceled' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Ready' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ReleaseMessage' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'SharedQuota' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'ReplyWaitReply' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'OwnerPortReference' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'ReserveReference' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'ReceiverReference' : [ 0x0, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'ViewAttributeRetrieved' : [ 0x0, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'InDispatch' : [ 0x0, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
} ],
  '__unnamed_1aed' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1aeb']],
    'State' : [ 0x0, ['unsigned long']],
} ],
  '_KALPC_MESSAGE' : [ 0x100, {
    'Entry' : [ 0x0, ['_LIST_ENTRY']],
    'PortQueue' : [ 0x10, ['pointer64', ['_ALPC_PORT']]],
    'OwnerPort' : [ 0x18, ['pointer64', ['_ALPC_PORT']]],
    'WaitingThread' : [ 0x20, ['pointer64', ['_ETHREAD']]],
    'u1' : [ 0x28, ['__unnamed_1aed']],
    'SequenceNo' : [ 0x2c, ['long']],
    'QuotaProcess' : [ 0x30, ['pointer64', ['_EPROCESS']]],
    'QuotaBlock' : [ 0x30, ['pointer64', ['void']]],
    'CancelSequencePort' : [ 0x38, ['pointer64', ['_ALPC_PORT']]],
    'CancelQueuePort' : [ 0x40, ['pointer64', ['_ALPC_PORT']]],
    'CancelSequenceNo' : [ 0x48, ['long']],
    'CancelListEntry' : [ 0x50, ['_LIST_ENTRY']],
    'Reserve' : [ 0x60, ['pointer64', ['_KALPC_RESERVE']]],
    'MessageAttributes' : [ 0x68, ['_KALPC_MESSAGE_ATTRIBUTES']],
    'DataUserVa' : [ 0xa0, ['pointer64', ['void']]],
    'CommunicationInfo' : [ 0xa8, ['pointer64', ['_ALPC_COMMUNICATION_INFO']]],
    'ConnectionPort' : [ 0xb0, ['pointer64', ['_ALPC_PORT']]],
    'ServerThread' : [ 0xb8, ['pointer64', ['_ETHREAD']]],
    'WakeReference' : [ 0xc0, ['pointer64', ['void']]],
    'ExtensionBuffer' : [ 0xc8, ['pointer64', ['void']]],
    'ExtensionBufferSize' : [ 0xd0, ['unsigned long long']],
    'PortMessage' : [ 0xd8, ['_PORT_MESSAGE']],
} ],
  '_ALPC_DISPATCH_CONTEXT' : [ 0x38, {
    'PortObject' : [ 0x0, ['pointer64', ['_ALPC_PORT']]],
    'Message' : [ 0x8, ['pointer64', ['_KALPC_MESSAGE']]],
    'CommunicationInfo' : [ 0x10, ['pointer64', ['_ALPC_COMMUNICATION_INFO']]],
    'TargetThread' : [ 0x18, ['pointer64', ['_ETHREAD']]],
    'TargetPort' : [ 0x20, ['pointer64', ['_ALPC_PORT']]],
    'Flags' : [ 0x28, ['unsigned long']],
    'TotalLength' : [ 0x2c, ['unsigned short']],
    'Type' : [ 0x2e, ['unsigned short']],
    'DataInfoOffset' : [ 0x30, ['unsigned short']],
    'SignalCompletion' : [ 0x32, ['unsigned char']],
    'PostedToCompletionList' : [ 0x33, ['unsigned char']],
} ],
  '_REMOTE_PORT_VIEW' : [ 0x18, {
    'Length' : [ 0x0, ['unsigned long']],
    'ViewSize' : [ 0x8, ['unsigned long long']],
    'ViewBase' : [ 0x10, ['pointer64', ['void']]],
} ],
  '_KALPC_RESERVE' : [ 0x28, {
    'OwnerPort' : [ 0x0, ['pointer64', ['_ALPC_PORT']]],
    'HandleTable' : [ 0x8, ['pointer64', ['_ALPC_HANDLE_TABLE']]],
    'Handle' : [ 0x10, ['pointer64', ['void']]],
    'Message' : [ 0x18, ['pointer64', ['_KALPC_MESSAGE']]],
    'Active' : [ 0x20, ['long']],
} ],
  '_KALPC_HANDLE_DATA' : [ 0x30, {
    'Flags' : [ 0x0, ['unsigned long']],
    'ObjectType' : [ 0x4, ['unsigned long']],
    'DuplicateContext' : [ 0x8, ['_OB_DUPLICATE_OBJECT_STATE']],
} ],
  '_KALPC_MESSAGE_ATTRIBUTES' : [ 0x38, {
    'ClientContext' : [ 0x0, ['pointer64', ['void']]],
    'ServerContext' : [ 0x8, ['pointer64', ['void']]],
    'PortContext' : [ 0x10, ['pointer64', ['void']]],
    'CancelPortContext' : [ 0x18, ['pointer64', ['void']]],
    'SecurityData' : [ 0x20, ['pointer64', ['_KALPC_SECURITY_DATA']]],
    'View' : [ 0x28, ['pointer64', ['_KALPC_VIEW']]],
    'HandleData' : [ 0x30, ['pointer64', ['_KALPC_HANDLE_DATA']]],
} ],
  '__unnamed_1b2f' : [ 0x4, {
    'Revoked' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Impersonated' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
} ],
  '__unnamed_1b31' : [ 0x4, {
    's1' : [ 0x0, ['__unnamed_1b2f']],
} ],
  '_KALPC_SECURITY_DATA' : [ 0x70, {
    'HandleTable' : [ 0x0, ['pointer64', ['_ALPC_HANDLE_TABLE']]],
    'ContextHandle' : [ 0x8, ['pointer64', ['void']]],
    'OwningProcess' : [ 0x10, ['pointer64', ['_EPROCESS']]],
    'OwnerPort' : [ 0x18, ['pointer64', ['_ALPC_PORT']]],
    'DynamicSecurity' : [ 0x20, ['_SECURITY_CLIENT_CONTEXT']],
    'u1' : [ 0x68, ['__unnamed_1b31']],
} ],
  '_IO_MINI_COMPLETION_PACKET_USER' : [ 0x50, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'PacketType' : [ 0x10, ['unsigned long']],
    'KeyContext' : [ 0x18, ['pointer64', ['void']]],
    'ApcContext' : [ 0x20, ['pointer64', ['void']]],
    'IoStatus' : [ 0x28, ['long']],
    'IoStatusInformation' : [ 0x30, ['unsigned long long']],
    'MiniPacketCallback' : [ 0x38, ['pointer64', ['void']]],
    'Context' : [ 0x40, ['pointer64', ['void']]],
    'Allocated' : [ 0x48, ['unsigned char']],
} ],
  '_IOP_IRP_EXTENSION' : [ 0x28, {
    'ExtensionFlags' : [ 0x0, ['unsigned short']],
    'Allocated' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'PropagateId' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'TimeStamped' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'SpareBits' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 16, native_type='unsigned short')]],
    'TypesAllocated' : [ 0x2, ['unsigned short']],
    'GenericExtension' : [ 0x4, ['array', 4, ['unsigned char']]],
    'VerifierContext' : [ 0x8, ['pointer64', ['void']]],
    'ActivityId' : [ 0x10, ['_GUID']],
    'Timestamp' : [ 0x20, ['_LARGE_INTEGER']],
} ],
  '_DRIVER_OBJECT' : [ 0x150, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'DeviceObject' : [ 0x8, ['pointer64', ['_DEVICE_OBJECT']]],
    'Flags' : [ 0x10, ['unsigned long']],
    'DriverStart' : [ 0x18, ['pointer64', ['void']]],
    'DriverSize' : [ 0x20, ['unsigned long']],
    'DriverSection' : [ 0x28, ['pointer64', ['void']]],
    'DriverExtension' : [ 0x30, ['pointer64', ['_DRIVER_EXTENSION']]],
    'DriverName' : [ 0x38, ['_UNICODE_STRING']],
    'HardwareDatabase' : [ 0x48, ['pointer64', ['_UNICODE_STRING']]],
    'FastIoDispatch' : [ 0x50, ['pointer64', ['_FAST_IO_DISPATCH']]],
    'DriverInit' : [ 0x58, ['pointer64', ['void']]],
    'DriverStartIo' : [ 0x60, ['pointer64', ['void']]],
    'DriverUnload' : [ 0x68, ['pointer64', ['void']]],
    'MajorFunction' : [ 0x70, ['array', 28, ['pointer64', ['void']]]],
} ],
  '_FILE_SEGMENT_ELEMENT' : [ 0x8, {
    'Buffer' : [ 0x0, ['pointer64', ['void']]],
    'Alignment' : [ 0x0, ['unsigned long long']],
} ],
  '_RELATIVE_SYMLINK_INFO' : [ 0x20, {
    'ExposedNamespaceLength' : [ 0x0, ['unsigned short']],
    'Flags' : [ 0x2, ['unsigned short']],
    'DeviceNameLength' : [ 0x4, ['unsigned short']],
    'Reserved' : [ 0x6, ['unsigned short']],
    'InteriorMountPoint' : [ 0x8, ['pointer64', ['_RELATIVE_SYMLINK_INFO']]],
    'OpenedName' : [ 0x10, ['_UNICODE_STRING']],
} ],
  '_ECP_LIST' : [ 0x18, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Flags' : [ 0x4, ['unsigned long']],
    'EcpList' : [ 0x8, ['_LIST_ENTRY']],
} ],
  '_IOP_FILE_OBJECT_EXTENSION' : [ 0x48, {
    'FoExtFlags' : [ 0x0, ['unsigned long']],
    'FoExtPerTypeExtension' : [ 0x8, ['array', 7, ['pointer64', ['void']]]],
    'FoIoPriorityHint' : [ 0x40, ['Enumeration', dict(target = 'long', choices = {0: 'IopIoPriorityNotSet', 1: 'IopIoPriorityVeryLow', 2: 'IopIoPriorityLow', 3: 'IopIoPriorityNormal', 4: 'IopIoPriorityHigh', 5: 'IopIoPriorityCritical', 6: 'MaxIopIoPriorityTypes'})]],
} ],
  '_OPEN_PACKET' : [ 0xb8, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'FileObject' : [ 0x8, ['pointer64', ['_FILE_OBJECT']]],
    'FinalStatus' : [ 0x10, ['long']],
    'Information' : [ 0x18, ['unsigned long long']],
    'ParseCheck' : [ 0x20, ['unsigned long']],
    'RelatedFileObject' : [ 0x28, ['pointer64', ['_FILE_OBJECT']]],
    'ReferencedDeviceObject' : [ 0x28, ['pointer64', ['_DEVICE_OBJECT']]],
    'OriginalAttributes' : [ 0x30, ['pointer64', ['_OBJECT_ATTRIBUTES']]],
    'AllocationSize' : [ 0x38, ['_LARGE_INTEGER']],
    'CreateOptions' : [ 0x40, ['unsigned long']],
    'FileAttributes' : [ 0x44, ['unsigned short']],
    'ShareAccess' : [ 0x46, ['unsigned short']],
    'EaBuffer' : [ 0x48, ['pointer64', ['void']]],
    'EaLength' : [ 0x50, ['unsigned long']],
    'Options' : [ 0x54, ['unsigned long']],
    'Disposition' : [ 0x58, ['unsigned long']],
    'BasicInformation' : [ 0x60, ['pointer64', ['_FILE_BASIC_INFORMATION']]],
    'NetworkInformation' : [ 0x68, ['pointer64', ['_FILE_NETWORK_OPEN_INFORMATION']]],
    'CreateFileType' : [ 0x70, ['Enumeration', dict(target = 'long', choices = {0: 'CreateFileTypeNone', 1: 'CreateFileTypeNamedPipe', 2: 'CreateFileTypeMailslot'})]],
    'MailslotOrPipeParameters' : [ 0x78, ['pointer64', ['void']]],
    'Override' : [ 0x80, ['unsigned char']],
    'QueryOnly' : [ 0x81, ['unsigned char']],
    'DeleteOnly' : [ 0x82, ['unsigned char']],
    'FullAttributes' : [ 0x83, ['unsigned char']],
    'LocalFileObject' : [ 0x88, ['pointer64', ['_DUMMY_FILE_OBJECT']]],
    'InternalFlags' : [ 0x90, ['unsigned long']],
    'AccessMode' : [ 0x94, ['unsigned char']],
    'DriverCreateContext' : [ 0x98, ['_IO_DRIVER_CREATE_CONTEXT']],
} ],
  '_ETW_SYSTEMTIME' : [ 0x10, {
    'Year' : [ 0x0, ['unsigned short']],
    'Month' : [ 0x2, ['unsigned short']],
    'DayOfWeek' : [ 0x4, ['unsigned short']],
    'Day' : [ 0x6, ['unsigned short']],
    'Hour' : [ 0x8, ['unsigned short']],
    'Minute' : [ 0xa, ['unsigned short']],
    'Second' : [ 0xc, ['unsigned short']],
    'Milliseconds' : [ 0xe, ['unsigned short']],
} ],
  '_TIME_FIELDS' : [ 0x10, {
    'Year' : [ 0x0, ['short']],
    'Month' : [ 0x2, ['short']],
    'Day' : [ 0x4, ['short']],
    'Hour' : [ 0x6, ['short']],
    'Minute' : [ 0x8, ['short']],
    'Second' : [ 0xa, ['short']],
    'Milliseconds' : [ 0xc, ['short']],
    'Weekday' : [ 0xe, ['short']],
} ],
  '__unnamed_1bf6' : [ 0x4, {
    'MajorVersion' : [ 0x0, ['unsigned char']],
    'MinorVersion' : [ 0x1, ['unsigned char']],
    'SubVersion' : [ 0x2, ['unsigned char']],
    'SubMinorVersion' : [ 0x3, ['unsigned char']],
} ],
  '_TRACE_LOGFILE_HEADER' : [ 0x118, {
    'BufferSize' : [ 0x0, ['unsigned long']],
    'Version' : [ 0x4, ['unsigned long']],
    'VersionDetail' : [ 0x4, ['__unnamed_1bf6']],
    'ProviderVersion' : [ 0x8, ['unsigned long']],
    'NumberOfProcessors' : [ 0xc, ['unsigned long']],
    'EndTime' : [ 0x10, ['_LARGE_INTEGER']],
    'TimerResolution' : [ 0x18, ['unsigned long']],
    'MaximumFileSize' : [ 0x1c, ['unsigned long']],
    'LogFileMode' : [ 0x20, ['unsigned long']],
    'BuffersWritten' : [ 0x24, ['unsigned long']],
    'LogInstanceGuid' : [ 0x28, ['_GUID']],
    'StartBuffers' : [ 0x28, ['unsigned long']],
    'PointerSize' : [ 0x2c, ['unsigned long']],
    'EventsLost' : [ 0x30, ['unsigned long']],
    'CpuSpeedInMHz' : [ 0x34, ['unsigned long']],
    'LoggerName' : [ 0x38, ['pointer64', ['unsigned short']]],
    'LogFileName' : [ 0x40, ['pointer64', ['unsigned short']]],
    'TimeZone' : [ 0x48, ['_RTL_TIME_ZONE_INFORMATION']],
    'BootTime' : [ 0xf8, ['_LARGE_INTEGER']],
    'PerfFreq' : [ 0x100, ['_LARGE_INTEGER']],
    'StartTime' : [ 0x108, ['_LARGE_INTEGER']],
    'ReservedFlags' : [ 0x110, ['unsigned long']],
    'BuffersLost' : [ 0x114, ['unsigned long']],
} ],
  '_TlgProvider_t' : [ 0x40, {
    'LevelPlus1' : [ 0x0, ['unsigned long']],
    'ProviderMetadataPtr' : [ 0x8, ['pointer64', ['unsigned short']]],
    'KeywordAny' : [ 0x10, ['unsigned long long']],
    'KeywordAll' : [ 0x18, ['unsigned long long']],
    'RegHandle' : [ 0x20, ['unsigned long long']],
    'EnableCallback' : [ 0x28, ['pointer64', ['void']]],
    'CallbackContext' : [ 0x30, ['pointer64', ['void']]],
    'AnnotationFunc' : [ 0x38, ['pointer64', ['void']]],
} ],
  '_TlgProviderMetadata_t' : [ 0x13, {
    'Type' : [ 0x0, ['unsigned char']],
    'ProviderId' : [ 0x1, ['_GUID']],
    'RemainingSize' : [ 0x11, ['unsigned short']],
} ],
  '_WMI_LOGGER_CONTEXT' : [ 0x390, {
    'LoggerId' : [ 0x0, ['unsigned long']],
    'BufferSize' : [ 0x4, ['unsigned long']],
    'MaximumEventSize' : [ 0x8, ['unsigned long']],
    'LoggerMode' : [ 0xc, ['unsigned long']],
    'AcceptNewEvents' : [ 0x10, ['long']],
    'EventMarker' : [ 0x14, ['array', 2, ['unsigned long']]],
    'ErrorMarker' : [ 0x1c, ['unsigned long']],
    'SizeMask' : [ 0x20, ['unsigned long']],
    'GetCpuClock' : [ 0x28, ['pointer64', ['void']]],
    'LoggerThread' : [ 0x30, ['pointer64', ['_ETHREAD']]],
    'LoggerStatus' : [ 0x38, ['long']],
    'FailureReason' : [ 0x3c, ['unsigned long']],
    'BufferQueue' : [ 0x40, ['_ETW_BUFFER_QUEUE']],
    'OverflowQueue' : [ 0x58, ['_ETW_BUFFER_QUEUE']],
    'GlobalList' : [ 0x70, ['_LIST_ENTRY']],
    'ProviderBinaryList' : [ 0x80, ['_LIST_ENTRY']],
    'BatchedBufferList' : [ 0x90, ['pointer64', ['_WMI_BUFFER_HEADER']]],
    'CurrentBuffer' : [ 0x90, ['_EX_FAST_REF']],
    'LoggerName' : [ 0x98, ['_UNICODE_STRING']],
    'LogFileName' : [ 0xa8, ['_UNICODE_STRING']],
    'LogFilePattern' : [ 0xb8, ['_UNICODE_STRING']],
    'NewLogFileName' : [ 0xc8, ['_UNICODE_STRING']],
    'ClockType' : [ 0xd8, ['unsigned long']],
    'LastFlushedBuffer' : [ 0xdc, ['unsigned long']],
    'FlushTimer' : [ 0xe0, ['unsigned long']],
    'FlushThreshold' : [ 0xe4, ['unsigned long']],
    'ByteOffset' : [ 0xe8, ['_LARGE_INTEGER']],
    'MinimumBuffers' : [ 0xf0, ['unsigned long']],
    'BuffersAvailable' : [ 0xf4, ['long']],
    'NumberOfBuffers' : [ 0xf8, ['long']],
    'MaximumBuffers' : [ 0xfc, ['unsigned long']],
    'EventsLost' : [ 0x100, ['unsigned long']],
    'PeakBuffersCount' : [ 0x104, ['long']],
    'BuffersWritten' : [ 0x108, ['unsigned long']],
    'LogBuffersLost' : [ 0x10c, ['unsigned long']],
    'RealTimeBuffersDelivered' : [ 0x110, ['unsigned long']],
    'RealTimeBuffersLost' : [ 0x114, ['unsigned long']],
    'SequencePtr' : [ 0x118, ['pointer64', ['long']]],
    'LocalSequence' : [ 0x120, ['unsigned long']],
    'InstanceGuid' : [ 0x124, ['_GUID']],
    'MaximumFileSize' : [ 0x134, ['unsigned long']],
    'FileCounter' : [ 0x138, ['long']],
    'PoolType' : [ 0x13c, ['Enumeration', dict(target = 'long', choices = {0: 'NonPagedPoolBase', 1: 'PagedPool', 2: 'NonPagedPoolBaseMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolBaseCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolBaseCacheAlignedMustS', 7: 'MaxPoolType', 34: 'NonPagedPoolMustSucceedSession', 516: 'NonPagedPoolNxCacheAligned', 35: 'DontUseThisTypeSession', 32: 'NonPagedPoolSession', 512: 'NonPagedPoolNx', 544: 'NonPagedPoolSessionNx', 36: 'NonPagedPoolCacheAlignedSession', 33: 'PagedPoolSession', 38: 'NonPagedPoolCacheAlignedMustSSession', 37: 'PagedPoolCacheAlignedSession'})]],
    'ReferenceTime' : [ 0x140, ['_ETW_REF_CLOCK']],
    'CollectionOn' : [ 0x150, ['long']],
    'ProviderInfoSize' : [ 0x154, ['unsigned long']],
    'Consumers' : [ 0x158, ['_LIST_ENTRY']],
    'NumConsumers' : [ 0x168, ['unsigned long']],
    'TransitionConsumer' : [ 0x170, ['pointer64', ['_ETW_REALTIME_CONSUMER']]],
    'RealtimeLogfileHandle' : [ 0x178, ['pointer64', ['void']]],
    'RealtimeLogfileName' : [ 0x180, ['_UNICODE_STRING']],
    'RealtimeWriteOffset' : [ 0x190, ['_LARGE_INTEGER']],
    'RealtimeReadOffset' : [ 0x198, ['_LARGE_INTEGER']],
    'RealtimeLogfileSize' : [ 0x1a0, ['_LARGE_INTEGER']],
    'RealtimeLogfileUsage' : [ 0x1a8, ['unsigned long long']],
    'RealtimeMaximumFileSize' : [ 0x1b0, ['unsigned long long']],
    'RealtimeBuffersSaved' : [ 0x1b8, ['unsigned long']],
    'RealtimeReferenceTime' : [ 0x1c0, ['_ETW_REF_CLOCK']],
    'NewRTEventsLost' : [ 0x1d0, ['Enumeration', dict(target = 'long', choices = {0: 'EtwRtEventNoLoss', 1: 'EtwRtEventLost', 2: 'EtwRtBufferLost', 3: 'EtwRtBackupLost', 4: 'EtwRtEventLossMax'})]],
    'LoggerEvent' : [ 0x1d8, ['_KEVENT']],
    'FlushEvent' : [ 0x1f0, ['_KEVENT']],
    'FlushTimeOutTimer' : [ 0x208, ['_KTIMER']],
    'LoggerDpc' : [ 0x248, ['_KDPC']],
    'LoggerMutex' : [ 0x288, ['_KMUTANT']],
    'LoggerLock' : [ 0x2c0, ['_EX_PUSH_LOCK']],
    'BufferListSpinLock' : [ 0x2c8, ['unsigned long long']],
    'BufferListPushLock' : [ 0x2c8, ['_EX_PUSH_LOCK']],
    'ClientSecurityContext' : [ 0x2d0, ['_SECURITY_CLIENT_CONTEXT']],
    'TokenAccessInformation' : [ 0x318, ['pointer64', ['_TOKEN_ACCESS_INFORMATION']]],
    'SecurityDescriptor' : [ 0x320, ['_EX_FAST_REF']],
    'StartTime' : [ 0x328, ['_LARGE_INTEGER']],
    'LogFileHandle' : [ 0x330, ['pointer64', ['void']]],
    'BufferSequenceNumber' : [ 0x338, ['long long']],
    'Flags' : [ 0x340, ['unsigned long']],
    'Persistent' : [ 0x340, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'AutoLogger' : [ 0x340, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'FsReady' : [ 0x340, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'RealTime' : [ 0x340, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'Wow' : [ 0x340, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'KernelTrace' : [ 0x340, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'NoMoreEnable' : [ 0x340, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'StackTracing' : [ 0x340, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'ErrorLogged' : [ 0x340, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'RealtimeLoggerContextFreed' : [ 0x340, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'PebsTracing' : [ 0x340, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'PmcCounters' : [ 0x340, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'PageAlignBuffers' : [ 0x340, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'SpareFlags1' : [ 0x340, ['BitField', dict(start_bit = 13, end_bit = 16, native_type='unsigned long')]],
    'SystemLoggerIndex' : [ 0x340, ['BitField', dict(start_bit = 16, end_bit = 24, native_type='unsigned long')]],
    'StackCaching' : [ 0x340, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'SpareFlags2' : [ 0x340, ['BitField', dict(start_bit = 25, end_bit = 32, native_type='unsigned long')]],
    'RequestFlag' : [ 0x344, ['unsigned long']],
    'DbgRequestNewFie' : [ 0x344, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'DbgRequestUpdateFile' : [ 0x344, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'DbgRequestFlush' : [ 0x344, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'DbgRequestDisableRealtime' : [ 0x344, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'DbgRequestDisconnectConsumer' : [ 0x344, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'DbgRequestConnectConsumer' : [ 0x344, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'DbgRequestNotifyConsumer' : [ 0x344, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'DbgRequestUpdateHeader' : [ 0x344, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'DbgRequestDefferdFlush' : [ 0x344, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'DbgRequestDefferdFlushTimer' : [ 0x344, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'DbgRequestFlushTimer' : [ 0x344, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'DbgRequestUpdateDebugger' : [ 0x344, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'DbgSpareRequestFlags' : [ 0x344, ['BitField', dict(start_bit = 12, end_bit = 32, native_type='unsigned long')]],
    'HookIdMap' : [ 0x348, ['_RTL_BITMAP']],
    'StackCache' : [ 0x358, ['pointer64', ['_ETW_STACK_CACHE']]],
    'PmcData' : [ 0x360, ['pointer64', ['_ETW_PMC_SUPPORT']]],
    'WinRtProviderBinaryList' : [ 0x368, ['_LIST_ENTRY']],
    'ScratchArray' : [ 0x378, ['pointer64', ['pointer64', ['_WMI_BUFFER_HEADER']]]],
    'DisallowedGuids' : [ 0x380, ['_DISALLOWED_GUIDS']],
} ],
  '_ETW_PMC_SUPPORT' : [ 0x28, {
    'Source' : [ 0x0, ['array', -16, ['Enumeration', dict(target = 'long', choices = {0: 'ProfileTime', 1: 'ProfileAlignmentFixup', 2: 'ProfileTotalIssues', 3: 'ProfilePipelineDry', 4: 'ProfileLoadInstructions', 5: 'ProfilePipelineFrozen', 6: 'ProfileBranchInstructions', 7: 'ProfileTotalNonissues', 8: 'ProfileDcacheMisses', 9: 'ProfileIcacheMisses', 10: 'ProfileCacheMisses', 11: 'ProfileBranchMispredictions', 12: 'ProfileStoreInstructions', 13: 'ProfileFpInstructions', 14: 'ProfileIntegerInstructions', 15: 'Profile2Issue', 16: 'Profile3Issue', 17: 'Profile4Issue', 18: 'ProfileSpecialInstructions', 19: 'ProfileTotalCycles', 20: 'ProfileIcacheIssues', 21: 'ProfileDcacheAccesses', 22: 'ProfileMemoryBarrierCycles', 23: 'ProfileLoadLinkedIssues', 24: 'ProfileMaximum'})]]],
    'HookIdCount' : [ 0x10, ['unsigned long']],
    'HookId' : [ 0x14, ['array', 4, ['unsigned short']]],
    'CountersCount' : [ 0x1c, ['unsigned long']],
    'ProcessorCtrs' : [ 0x20, ['array', 1, ['pointer64', ['_HAL_PMC_COUNTERS']]]],
} ],
  '_ETW_LOGGER_HANDLE' : [ 0x1, {
    'DereferenceAndLeave' : [ 0x0, ['unsigned char']],
} ],
  '_LUID_AND_ATTRIBUTES' : [ 0xc, {
    'Luid' : [ 0x0, ['_LUID']],
    'Attributes' : [ 0x8, ['unsigned long']],
} ],
  '_TOKEN' : [ 0x478, {
    'TokenSource' : [ 0x0, ['_TOKEN_SOURCE']],
    'TokenId' : [ 0x10, ['_LUID']],
    'AuthenticationId' : [ 0x18, ['_LUID']],
    'ParentTokenId' : [ 0x20, ['_LUID']],
    'ExpirationTime' : [ 0x28, ['_LARGE_INTEGER']],
    'TokenLock' : [ 0x30, ['pointer64', ['_ERESOURCE']]],
    'ModifiedId' : [ 0x38, ['_LUID']],
    'Privileges' : [ 0x40, ['_SEP_TOKEN_PRIVILEGES']],
    'AuditPolicy' : [ 0x58, ['_SEP_AUDIT_POLICY']],
    'SessionId' : [ 0x78, ['unsigned long']],
    'UserAndGroupCount' : [ 0x7c, ['unsigned long']],
    'RestrictedSidCount' : [ 0x80, ['unsigned long']],
    'VariableLength' : [ 0x84, ['unsigned long']],
    'DynamicCharged' : [ 0x88, ['unsigned long']],
    'DynamicAvailable' : [ 0x8c, ['unsigned long']],
    'DefaultOwnerIndex' : [ 0x90, ['unsigned long']],
    'UserAndGroups' : [ 0x98, ['pointer64', ['_SID_AND_ATTRIBUTES']]],
    'RestrictedSids' : [ 0xa0, ['pointer64', ['_SID_AND_ATTRIBUTES']]],
    'PrimaryGroup' : [ 0xa8, ['pointer64', ['void']]],
    'DynamicPart' : [ 0xb0, ['pointer64', ['unsigned long']]],
    'DefaultDacl' : [ 0xb8, ['pointer64', ['_ACL']]],
    'TokenType' : [ 0xc0, ['Enumeration', dict(target = 'long', choices = {1: 'TokenPrimary', 2: 'TokenImpersonation'})]],
    'ImpersonationLevel' : [ 0xc4, ['Enumeration', dict(target = 'long', choices = {0: 'SecurityAnonymous', 1: 'SecurityIdentification', 2: 'SecurityImpersonation', 3: 'SecurityDelegation'})]],
    'TokenFlags' : [ 0xc8, ['unsigned long']],
    'TokenInUse' : [ 0xcc, ['unsigned char']],
    'IntegrityLevelIndex' : [ 0xd0, ['unsigned long']],
    'MandatoryPolicy' : [ 0xd4, ['unsigned long']],
    'LogonSession' : [ 0xd8, ['pointer64', ['_SEP_LOGON_SESSION_REFERENCES']]],
    'OriginatingLogonSession' : [ 0xe0, ['_LUID']],
    'SidHash' : [ 0xe8, ['_SID_AND_ATTRIBUTES_HASH']],
    'RestrictedSidHash' : [ 0x1f8, ['_SID_AND_ATTRIBUTES_HASH']],
    'pSecurityAttributes' : [ 0x308, ['pointer64', ['_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION']]],
    'Package' : [ 0x310, ['pointer64', ['void']]],
    'Capabilities' : [ 0x318, ['pointer64', ['_SID_AND_ATTRIBUTES']]],
    'CapabilityCount' : [ 0x320, ['unsigned long']],
    'CapabilitiesHash' : [ 0x328, ['_SID_AND_ATTRIBUTES_HASH']],
    'LowboxNumberEntry' : [ 0x438, ['pointer64', ['_SEP_LOWBOX_NUMBER_ENTRY']]],
    'LowboxHandlesEntry' : [ 0x440, ['pointer64', ['_SEP_LOWBOX_HANDLES_ENTRY']]],
    'pClaimAttributes' : [ 0x448, ['pointer64', ['_AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION']]],
    'TrustLevelSid' : [ 0x450, ['pointer64', ['void']]],
    'TrustLinkedToken' : [ 0x458, ['pointer64', ['_TOKEN']]],
    'IntegrityLevelSidValue' : [ 0x460, ['pointer64', ['void']]],
    'TokenSidValues' : [ 0x468, ['pointer64', ['_SEP_SID_VALUES_BLOCK']]],
    'VariablePart' : [ 0x470, ['unsigned long long']],
} ],
  '_SEP_LOGON_SESSION_REFERENCES' : [ 0x80, {
    'Next' : [ 0x0, ['pointer64', ['_SEP_LOGON_SESSION_REFERENCES']]],
    'LogonId' : [ 0x8, ['_LUID']],
    'BuddyLogonId' : [ 0x10, ['_LUID']],
    'ReferenceCount' : [ 0x18, ['long long']],
    'Flags' : [ 0x20, ['unsigned long']],
    'pDeviceMap' : [ 0x28, ['pointer64', ['_DEVICE_MAP']]],
    'Token' : [ 0x30, ['pointer64', ['void']]],
    'AccountName' : [ 0x38, ['_UNICODE_STRING']],
    'AuthorityName' : [ 0x48, ['_UNICODE_STRING']],
    'LowBoxHandlesTable' : [ 0x58, ['_SEP_LOWBOX_HANDLES_TABLE']],
    'SharedDataLock' : [ 0x68, ['_EX_PUSH_LOCK']],
    'SharedClaimAttributes' : [ 0x70, ['pointer64', ['_AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION']]],
    'SharedSidValues' : [ 0x78, ['pointer64', ['_SEP_SID_VALUES_BLOCK']]],
} ],
  '_PS_PROTECTION' : [ 0x1, {
    'Level' : [ 0x0, ['unsigned char']],
    'Type' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned char')]],
    'Audit' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Signer' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
} ],
  '_OBJECT_HEADER' : [ 0x38, {
    'PointerCount' : [ 0x0, ['long long']],
    'HandleCount' : [ 0x8, ['long long']],
    'NextToFree' : [ 0x8, ['pointer64', ['void']]],
    'Lock' : [ 0x10, ['_EX_PUSH_LOCK']],
    'TypeIndex' : [ 0x18, ['unsigned char']],
    'TraceFlags' : [ 0x19, ['unsigned char']],
    'DbgRefTrace' : [ 0x19, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'DbgTracePermanent' : [ 0x19, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'InfoMask' : [ 0x1a, ['unsigned char']],
    'Flags' : [ 0x1b, ['unsigned char']],
    'NewObject' : [ 0x1b, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'KernelObject' : [ 0x1b, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'KernelOnlyAccess' : [ 0x1b, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'ExclusiveObject' : [ 0x1b, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'PermanentObject' : [ 0x1b, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'DefaultSecurityQuota' : [ 0x1b, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'SingleHandleEntry' : [ 0x1b, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'DeletedInline' : [ 0x1b, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'Spare' : [ 0x1c, ['unsigned long']],
    'ObjectCreateInfo' : [ 0x20, ['pointer64', ['_OBJECT_CREATE_INFORMATION']]],
    'QuotaBlockCharged' : [ 0x20, ['pointer64', ['void']]],
    'SecurityDescriptor' : [ 0x28, ['pointer64', ['void']]],
    'Body' : [ 0x30, ['_QUAD']],
} ],
  '_OBJECT_HEADER_QUOTA_INFO' : [ 0x20, {
    'PagedPoolCharge' : [ 0x0, ['unsigned long']],
    'NonPagedPoolCharge' : [ 0x4, ['unsigned long']],
    'SecurityDescriptorCharge' : [ 0x8, ['unsigned long']],
    'SecurityDescriptorQuotaBlock' : [ 0x10, ['pointer64', ['void']]],
    'Reserved' : [ 0x18, ['unsigned long long']],
} ],
  '_OBJECT_HEADER_PROCESS_INFO' : [ 0x10, {
    'ExclusiveProcess' : [ 0x0, ['pointer64', ['_EPROCESS']]],
    'Reserved' : [ 0x8, ['unsigned long long']],
} ],
  '_OBJECT_HEADER_HANDLE_INFO' : [ 0x10, {
    'HandleCountDataBase' : [ 0x0, ['pointer64', ['_OBJECT_HANDLE_COUNT_DATABASE']]],
    'SingleEntry' : [ 0x0, ['_OBJECT_HANDLE_COUNT_ENTRY']],
} ],
  '_OBJECT_HEADER_NAME_INFO' : [ 0x20, {
    'Directory' : [ 0x0, ['pointer64', ['_OBJECT_DIRECTORY']]],
    'Name' : [ 0x8, ['_UNICODE_STRING']],
    'ReferenceCount' : [ 0x18, ['long']],
} ],
  '_OBJECT_HEADER_CREATOR_INFO' : [ 0x20, {
    'TypeList' : [ 0x0, ['_LIST_ENTRY']],
    'CreatorUniqueProcess' : [ 0x10, ['pointer64', ['void']]],
    'CreatorBackTraceIndex' : [ 0x18, ['unsigned short']],
    'Reserved' : [ 0x1a, ['unsigned short']],
} ],
  '_OBJECT_HEADER_AUDIT_INFO' : [ 0x10, {
    'SecurityDescriptor' : [ 0x0, ['pointer64', ['void']]],
    'Reserved' : [ 0x8, ['unsigned long long']],
} ],
  '_OBP_LOOKUP_CONTEXT' : [ 0x28, {
    'Directory' : [ 0x0, ['pointer64', ['_OBJECT_DIRECTORY']]],
    'Object' : [ 0x8, ['pointer64', ['void']]],
    'EntryLink' : [ 0x10, ['pointer64', ['pointer64', ['_OBJECT_DIRECTORY_ENTRY']]]],
    'HashValue' : [ 0x18, ['unsigned long']],
    'HashIndex' : [ 0x1c, ['unsigned short']],
    'DirectoryLocked' : [ 0x1e, ['unsigned char']],
    'LockedExclusive' : [ 0x1f, ['unsigned char']],
    'LockStateSignature' : [ 0x20, ['unsigned long']],
} ],
  '_OBJECT_DIRECTORY' : [ 0x150, {
    'HashBuckets' : [ 0x0, ['array', 37, ['pointer64', ['_OBJECT_DIRECTORY_ENTRY']]]],
    'Lock' : [ 0x128, ['_EX_PUSH_LOCK']],
    'DeviceMap' : [ 0x130, ['pointer64', ['_DEVICE_MAP']]],
    'ShadowDirectory' : [ 0x130, ['pointer64', ['_OBJECT_DIRECTORY']]],
    'SessionId' : [ 0x138, ['unsigned long']],
    'NamespaceEntry' : [ 0x140, ['pointer64', ['void']]],
    'Flags' : [ 0x148, ['unsigned long']],
} ],
  '_WHEAP_INFO_BLOCK' : [ 0x18, {
    'ErrorSourceCount' : [ 0x0, ['unsigned long']],
    'ErrorSourceTable' : [ 0x8, ['pointer64', ['_WHEAP_ERROR_SOURCE_TABLE']]],
    'WorkQueue' : [ 0x10, ['pointer64', ['_WHEAP_WORK_QUEUE']]],
} ],
  '_WHEAP_ERROR_SOURCE' : [ 0x428, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'FailedAllocations' : [ 0x10, ['unsigned long']],
    'PlatformErrorSourceId' : [ 0x14, ['unsigned long']],
    'ErrorCount' : [ 0x18, ['long']],
    'RecordCount' : [ 0x1c, ['unsigned long']],
    'RecordLength' : [ 0x20, ['unsigned long']],
    'PoolTag' : [ 0x24, ['unsigned long']],
    'Type' : [ 0x28, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSrcTypeMCE', 1: 'WheaErrSrcTypeCMC', 2: 'WheaErrSrcTypeCPE', 3: 'WheaErrSrcTypeNMI', 4: 'WheaErrSrcTypePCIe', 5: 'WheaErrSrcTypeGeneric', 6: 'WheaErrSrcTypeINIT', 7: 'WheaErrSrcTypeBOOT', 8: 'WheaErrSrcTypeSCIGeneric', 9: 'WheaErrSrcTypeIPFMCA', 10: 'WheaErrSrcTypeIPFCMC', 11: 'WheaErrSrcTypeIPFCPE', 12: 'WheaErrSrcTypeMax'})]],
    'Records' : [ 0x30, ['pointer64', ['_WHEAP_ERROR_RECORD_WRAPPER']]],
    'Context' : [ 0x38, ['pointer64', ['void']]],
    'SectionCount' : [ 0x40, ['unsigned long']],
    'SectionLength' : [ 0x44, ['unsigned long']],
    'TickCountAtLastError' : [ 0x48, ['_LARGE_INTEGER']],
    'AccumulatedErrors' : [ 0x50, ['unsigned long']],
    'TotalErrors' : [ 0x54, ['unsigned long']],
    'Deferred' : [ 0x58, ['unsigned char']],
    'Descriptor' : [ 0x59, ['_WHEA_ERROR_SOURCE_DESCRIPTOR']],
} ],
  '_WHEAP_ERROR_RECORD_WRAPPER' : [ 0xf0, {
    'WorkEntry' : [ 0x0, ['_LIST_ENTRY']],
    'Length' : [ 0x10, ['unsigned long']],
    'ProcessorNumber' : [ 0x14, ['unsigned long']],
    'Flags' : [ 0x18, ['_WHEAP_ERROR_RECORD_WRAPPER_FLAGS']],
    'InUse' : [ 0x1c, ['long']],
    'ErrorSource' : [ 0x20, ['pointer64', ['_WHEAP_ERROR_SOURCE']]],
    'ErrorRecord' : [ 0x28, ['_WHEA_ERROR_RECORD']],
} ],
  '_KSECONDARY_IDT_ENTRY' : [ 0x30, {
    'SpinLock' : [ 0x0, ['unsigned long long']],
    'ConnectLock' : [ 0x8, ['_KEVENT']],
    'LineMasked' : [ 0x20, ['unsigned char']],
    'InterruptList' : [ 0x28, ['pointer64', ['_KINTERRUPT']]],
} ],
  '_WNF_STATE_NAME' : [ 0x8, {
    'Data' : [ 0x0, ['array', 2, ['unsigned long']]],
} ],
  '_PS_CLIENT_SECURITY_CONTEXT' : [ 0x8, {
    'ImpersonationData' : [ 0x0, ['unsigned long long']],
    'ImpersonationToken' : [ 0x0, ['pointer64', ['void']]],
    'ImpersonationLevel' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 2, native_type='unsigned long long')]],
    'EffectiveOnly' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
} ],
  '_DBGKD_ANY_CONTROL_SET' : [ 0x1c, {
    'X86ControlSet' : [ 0x0, ['_X86_DBGKD_CONTROL_SET']],
    'AlphaControlSet' : [ 0x0, ['unsigned long']],
    'IA64ControlSet' : [ 0x0, ['_IA64_DBGKD_CONTROL_SET']],
    'Amd64ControlSet' : [ 0x0, ['_AMD64_DBGKD_CONTROL_SET']],
    'ArmControlSet' : [ 0x0, ['_ARM_DBGKD_CONTROL_SET']],
    'ArmCeControlSet' : [ 0x0, ['_ARMCE_DBGKD_CONTROL_SET']],
    'PpcControlSet' : [ 0x0, ['_PPC_DBGKD_CONTROL_SET']],
} ],
  '_MI_VERIFIER_POOL_HEADER' : [ 0x8, {
    'VerifierPoolEntry' : [ 0x0, ['pointer64', ['_VI_POOL_ENTRY']]],
} ],
  '_POP_FX_PLUGIN' : [ 0xb0, {
    'Link' : [ 0x0, ['_LIST_ENTRY']],
    'Version' : [ 0x10, ['unsigned long']],
    'Flags' : [ 0x18, ['unsigned long long']],
    'WorkQueue' : [ 0x20, ['_KQUEUE']],
    'AcceptDeviceNotification' : [ 0x60, ['pointer64', ['void']]],
    'AcceptProcessorNotification' : [ 0x68, ['pointer64', ['void']]],
    'WorkOrderCount' : [ 0x70, ['unsigned long']],
    'WorkOrders' : [ 0x78, ['array', 1, ['_POP_FX_WORK_ORDER']]],
} ],
  '_ARM_DBGKD_CONTROL_SET' : [ 0xc, {
    'Continue' : [ 0x0, ['unsigned long']],
    'CurrentSymbolStart' : [ 0x4, ['unsigned long']],
    'CurrentSymbolEnd' : [ 0x8, ['unsigned long']],
} ],
  '_LPCP_MESSAGE' : [ 0x50, {
    'Entry' : [ 0x0, ['_LIST_ENTRY']],
    'FreeEntry' : [ 0x0, ['_SINGLE_LIST_ENTRY']],
    'Reserved0' : [ 0x8, ['unsigned long']],
    'SenderPort' : [ 0x10, ['pointer64', ['void']]],
    'RepliedToThread' : [ 0x18, ['pointer64', ['_ETHREAD']]],
    'PortContext' : [ 0x20, ['pointer64', ['void']]],
    'Request' : [ 0x28, ['_PORT_MESSAGE']],
} ],
  '_HARDWARE_PTE' : [ 0x8, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'Write' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'Owner' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'WriteThrough' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long long')]],
    'CacheDisable' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long long')]],
    'Accessed' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long long')]],
    'Dirty' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long long')]],
    'LargePage' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long long')]],
    'Global' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'CopyOnWrite' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'Prototype' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'reserved0' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long long')]],
    'PageFrameNumber' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 48, native_type='unsigned long long')]],
    'reserved1' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 52, native_type='unsigned long long')]],
    'SoftwareWsIndex' : [ 0x0, ['BitField', dict(start_bit = 52, end_bit = 63, native_type='unsigned long long')]],
    'NoExecute' : [ 0x0, ['BitField', dict(start_bit = 63, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_ALPC_PORT_ATTRIBUTES' : [ 0x48, {
    'Flags' : [ 0x0, ['unsigned long']],
    'SecurityQos' : [ 0x4, ['_SECURITY_QUALITY_OF_SERVICE']],
    'MaxMessageLength' : [ 0x10, ['unsigned long long']],
    'MemoryBandwidth' : [ 0x18, ['unsigned long long']],
    'MaxPoolUsage' : [ 0x20, ['unsigned long long']],
    'MaxSectionSize' : [ 0x28, ['unsigned long long']],
    'MaxViewSize' : [ 0x30, ['unsigned long long']],
    'MaxTotalSectionSize' : [ 0x38, ['unsigned long long']],
    'DupObjectTypes' : [ 0x40, ['unsigned long']],
    'Reserved' : [ 0x44, ['unsigned long']],
} ],
  '_KSTACK_COUNT' : [ 0x4, {
    'Value' : [ 0x0, ['long']],
    'State' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 3, native_type='unsigned long')]],
    'StackCount' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
} ],
  '_KENTROPY_TIMING_STATE' : [ 0x150, {
    'EntropyCount' : [ 0x0, ['unsigned long']],
    'Buffer' : [ 0x4, ['array', 64, ['unsigned long']]],
    'Dpc' : [ 0x108, ['_KDPC']],
    'LastDeliveredBuffer' : [ 0x148, ['unsigned long']],
} ],
  '_DISPATCHER_HEADER' : [ 0x18, {
    'Lock' : [ 0x0, ['long']],
    'LockNV' : [ 0x0, ['long']],
    'Type' : [ 0x0, ['unsigned char']],
    'Signalling' : [ 0x1, ['unsigned char']],
    'Size' : [ 0x2, ['unsigned char']],
    'Reserved1' : [ 0x3, ['unsigned char']],
    'TimerType' : [ 0x0, ['unsigned char']],
    'TimerControlFlags' : [ 0x1, ['unsigned char']],
    'Absolute' : [ 0x1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Wake' : [ 0x1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'EncodedTolerableDelay' : [ 0x1, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'Hand' : [ 0x2, ['unsigned char']],
    'TimerMiscFlags' : [ 0x3, ['unsigned char']],
    'Index' : [ 0x3, ['BitField', dict(start_bit = 0, end_bit = 6, native_type='unsigned char')]],
    'Inserted' : [ 0x3, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'Expired' : [ 0x3, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'Timer2Type' : [ 0x0, ['unsigned char']],
    'Timer2Flags' : [ 0x1, ['unsigned char']],
    'Timer2Inserted' : [ 0x1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Timer2Expiring' : [ 0x1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Timer2CancelPending' : [ 0x1, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Timer2SetPending' : [ 0x1, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Timer2Running' : [ 0x1, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'Timer2Disabled' : [ 0x1, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'Timer2ReservedFlags' : [ 0x1, ['BitField', dict(start_bit = 6, end_bit = 8, native_type='unsigned char')]],
    'Timer2Reserved1' : [ 0x2, ['unsigned char']],
    'Timer2Reserved2' : [ 0x3, ['unsigned char']],
    'QueueType' : [ 0x0, ['unsigned char']],
    'QueueControlFlags' : [ 0x1, ['unsigned char']],
    'Abandoned' : [ 0x1, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'DisableIncrement' : [ 0x1, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'QueueReservedControlFlags' : [ 0x1, ['BitField', dict(start_bit = 2, end_bit = 8, native_type='unsigned char')]],
    'QueueSize' : [ 0x2, ['unsigned char']],
    'QueueReserved' : [ 0x3, ['unsigned char']],
    'ThreadType' : [ 0x0, ['unsigned char']],
    'ThreadReserved' : [ 0x1, ['unsigned char']],
    'ThreadControlFlags' : [ 0x2, ['unsigned char']],
    'CycleProfiling' : [ 0x2, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'CounterProfiling' : [ 0x2, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'GroupScheduling' : [ 0x2, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'AffinitySet' : [ 0x2, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'ThreadReservedControlFlags' : [ 0x2, ['BitField', dict(start_bit = 4, end_bit = 8, native_type='unsigned char')]],
    'DebugActive' : [ 0x3, ['unsigned char']],
    'ActiveDR7' : [ 0x3, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'Instrumented' : [ 0x3, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Minimal' : [ 0x3, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Reserved4' : [ 0x3, ['BitField', dict(start_bit = 3, end_bit = 6, native_type='unsigned char')]],
    'UmsScheduled' : [ 0x3, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'UmsPrimary' : [ 0x3, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'MutantType' : [ 0x0, ['unsigned char']],
    'MutantSize' : [ 0x1, ['unsigned char']],
    'DpcActive' : [ 0x2, ['unsigned char']],
    'MutantReserved' : [ 0x3, ['unsigned char']],
    'SignalState' : [ 0x4, ['long']],
    'WaitListHead' : [ 0x8, ['_LIST_ENTRY']],
} ],
  '_VI_POOL_ENTRY' : [ 0x20, {
    'PageHeader' : [ 0x0, ['_VI_POOL_PAGE_HEADER']],
    'InUse' : [ 0x0, ['_VI_POOL_ENTRY_INUSE']],
    'NextFree' : [ 0x0, ['pointer64', ['_SLIST_ENTRY']]],
} ],
  '_MM_PAGE_ACCESS_INFO' : [ 0x8, {
    'Flags' : [ 0x0, ['_MM_PAGE_ACCESS_INFO_FLAGS']],
    'FileOffset' : [ 0x0, ['unsigned long long']],
    'VirtualAddress' : [ 0x0, ['pointer64', ['void']]],
    'PointerProtoPte' : [ 0x0, ['pointer64', ['void']]],
} ],
  '_MI_CONTROL_AREA_WAIT_BLOCK' : [ 0x28, {
    'Next' : [ 0x0, ['pointer64', ['_MI_CONTROL_AREA_WAIT_BLOCK']]],
    'WaitReason' : [ 0x8, ['unsigned long']],
    'WaitResponse' : [ 0xc, ['unsigned long']],
    'Gate' : [ 0x10, ['_KGATE']],
} ],
  '_TraceLoggingMetadata_t' : [ 0x10, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Size' : [ 0x4, ['unsigned short']],
    'Version' : [ 0x6, ['unsigned char']],
    'Flags' : [ 0x7, ['unsigned char']],
    'Magic' : [ 0x8, ['unsigned long long']],
} ],
  '_HEAP_COUNTERS' : [ 0x78, {
    'TotalMemoryReserved' : [ 0x0, ['unsigned long long']],
    'TotalMemoryCommitted' : [ 0x8, ['unsigned long long']],
    'TotalMemoryLargeUCR' : [ 0x10, ['unsigned long long']],
    'TotalSizeInVirtualBlocks' : [ 0x18, ['unsigned long long']],
    'TotalSegments' : [ 0x20, ['unsigned long']],
    'TotalUCRs' : [ 0x24, ['unsigned long']],
    'CommittOps' : [ 0x28, ['unsigned long']],
    'DeCommitOps' : [ 0x2c, ['unsigned long']],
    'LockAcquires' : [ 0x30, ['unsigned long']],
    'LockCollisions' : [ 0x34, ['unsigned long']],
    'CommitRate' : [ 0x38, ['unsigned long']],
    'DecommittRate' : [ 0x3c, ['unsigned long']],
    'CommitFailures' : [ 0x40, ['unsigned long']],
    'InBlockCommitFailures' : [ 0x44, ['unsigned long']],
    'PollIntervalCounter' : [ 0x48, ['unsigned long']],
    'DecommitsSinceLastCheck' : [ 0x4c, ['unsigned long']],
    'HeapPollInterval' : [ 0x50, ['unsigned long']],
    'AllocAndFreeOps' : [ 0x54, ['unsigned long']],
    'AllocationIndicesActive' : [ 0x58, ['unsigned long']],
    'InBlockDeccommits' : [ 0x5c, ['unsigned long']],
    'InBlockDeccomitSize' : [ 0x60, ['unsigned long long']],
    'HighWatermarkSize' : [ 0x68, ['unsigned long long']],
    'LastPolledSize' : [ 0x70, ['unsigned long long']],
} ],
  '_PPM_FFH_THROTTLE_STATE_INFO' : [ 0x20, {
    'EnableLogging' : [ 0x0, ['unsigned char']],
    'MismatchCount' : [ 0x4, ['unsigned long']],
    'Initialized' : [ 0x8, ['unsigned char']],
    'LastValue' : [ 0x10, ['unsigned long long']],
    'LastLogTickCount' : [ 0x18, ['_LARGE_INTEGER']],
} ],
  '_SYSPTES_HEADER' : [ 0x28, {
    'ListHead' : [ 0x0, ['_LIST_ENTRY']],
    'Count' : [ 0x10, ['unsigned long long']],
    'NumberOfEntries' : [ 0x18, ['unsigned long long']],
    'NumberOfEntriesPeak' : [ 0x20, ['unsigned long long']],
} ],
  '_EXCEPTION_RECORD' : [ 0x98, {
    'ExceptionCode' : [ 0x0, ['long']],
    'ExceptionFlags' : [ 0x4, ['unsigned long']],
    'ExceptionRecord' : [ 0x8, ['pointer64', ['_EXCEPTION_RECORD']]],
    'ExceptionAddress' : [ 0x10, ['pointer64', ['void']]],
    'NumberParameters' : [ 0x18, ['unsigned long']],
    'ExceptionInformation' : [ 0x20, ['array', 15, ['unsigned long long']]],
} ],
  '_MI_ACTIVE_WSLE_LISTHEAD' : [ 0x10, {
    'Flink' : [ 0x0, ['unsigned long long']],
    'Blink' : [ 0x8, ['unsigned long long']],
} ],
  '_PPM_IDLE_SYNCHRONIZATION_STATE' : [ 0x4, {
    'AsLong' : [ 0x0, ['long']],
    'RefCount' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 24, native_type='long')]],
    'State' : [ 0x0, ['BitField', dict(start_bit = 24, end_bit = 32, native_type='unsigned long')]],
} ],
  '_PENDING_RELATIONS_LIST_ENTRY' : [ 0x70, {
    'Link' : [ 0x0, ['_LIST_ENTRY']],
    'WorkItem' : [ 0x10, ['_WORK_QUEUE_ITEM']],
    'DeviceEvent' : [ 0x30, ['pointer64', ['_PNP_DEVICE_EVENT_ENTRY']]],
    'DeviceObject' : [ 0x38, ['pointer64', ['_DEVICE_OBJECT']]],
    'RelationsList' : [ 0x40, ['pointer64', ['_RELATION_LIST']]],
    'EjectIrp' : [ 0x48, ['pointer64', ['_IRP']]],
    'Lock' : [ 0x50, ['Enumeration', dict(target = 'long', choices = {0: 'IRPLOCK_CANCELABLE', 1: 'IRPLOCK_CANCEL_STARTED', 2: 'IRPLOCK_CANCEL_COMPLETE', 3: 'IRPLOCK_COMPLETED'})]],
    'Problem' : [ 0x54, ['unsigned long']],
    'ProfileChangingEject' : [ 0x58, ['unsigned char']],
    'DisplaySafeRemovalDialog' : [ 0x59, ['unsigned char']],
    'LightestSleepState' : [ 0x5c, ['Enumeration', dict(target = 'long', choices = {0: 'PowerSystemUnspecified', 1: 'PowerSystemWorking', 2: 'PowerSystemSleeping1', 3: 'PowerSystemSleeping2', 4: 'PowerSystemSleeping3', 5: 'PowerSystemHibernate', 6: 'PowerSystemShutdown', 7: 'PowerSystemMaximum'})]],
    'DockInterface' : [ 0x60, ['pointer64', ['DOCK_INTERFACE']]],
    'DequeuePending' : [ 0x68, ['unsigned char']],
    'DeleteType' : [ 0x6c, ['Enumeration', dict(target = 'long', choices = {0: 'QueryRemoveDevice', 1: 'CancelRemoveDevice', 2: 'RemoveDevice', 3: 'SurpriseRemoveDevice', 4: 'EjectDevice', 5: 'RemoveFailedDevice', 6: 'RemoveUnstartedFailedDevice', 7: 'MaxDeviceDeleteType'})]],
} ],
  '_TOKEN_ACCESS_INFORMATION' : [ 0x50, {
    'SidHash' : [ 0x0, ['pointer64', ['_SID_AND_ATTRIBUTES_HASH']]],
    'RestrictedSidHash' : [ 0x8, ['pointer64', ['_SID_AND_ATTRIBUTES_HASH']]],
    'Privileges' : [ 0x10, ['pointer64', ['_TOKEN_PRIVILEGES']]],
    'AuthenticationId' : [ 0x18, ['_LUID']],
    'TokenType' : [ 0x20, ['Enumeration', dict(target = 'long', choices = {1: 'TokenPrimary', 2: 'TokenImpersonation'})]],
    'ImpersonationLevel' : [ 0x24, ['Enumeration', dict(target = 'long', choices = {0: 'SecurityAnonymous', 1: 'SecurityIdentification', 2: 'SecurityImpersonation', 3: 'SecurityDelegation'})]],
    'MandatoryPolicy' : [ 0x28, ['_TOKEN_MANDATORY_POLICY']],
    'Flags' : [ 0x2c, ['unsigned long']],
    'AppContainerNumber' : [ 0x30, ['unsigned long']],
    'PackageSid' : [ 0x38, ['pointer64', ['void']]],
    'CapabilitiesHash' : [ 0x40, ['pointer64', ['_SID_AND_ATTRIBUTES_HASH']]],
    'TrustLevelSid' : [ 0x48, ['pointer64', ['void']]],
} ],
  '_CELL_DATA' : [ 0x50, {
    'u' : [ 0x0, ['_u']],
} ],
  '_INITIAL_PRIVILEGE_SET' : [ 0x2c, {
    'PrivilegeCount' : [ 0x0, ['unsigned long']],
    'Control' : [ 0x4, ['unsigned long']],
    'Privilege' : [ 0x8, ['array', 3, ['_LUID_AND_ATTRIBUTES']]],
} ],
  '_HEAP_TUNING_PARAMETERS' : [ 0x10, {
    'CommittThresholdShift' : [ 0x0, ['unsigned long']],
    'MaxPreCommittThreshold' : [ 0x8, ['unsigned long long']],
} ],
  '_MMWSLE_NONDIRECT_HASH' : [ 0x10, {
    'Key' : [ 0x0, ['pointer64', ['void']]],
    'Index' : [ 0x8, ['unsigned long long']],
} ],
  '_POP_FX_WORK_ORDER' : [ 0x38, {
    'WorkItem' : [ 0x0, ['_WORK_QUEUE_ITEM']],
    'WorkCount' : [ 0x20, ['long']],
    'Context' : [ 0x28, ['pointer64', ['void']]],
    'WatchdogTimerInfo' : [ 0x30, ['pointer64', ['_POP_FX_WORK_ORDER_WATCHDOG_INFO']]],
} ],
  '_KAPC' : [ 0x58, {
    'Type' : [ 0x0, ['unsigned char']],
    'SpareByte0' : [ 0x1, ['unsigned char']],
    'Size' : [ 0x2, ['unsigned char']],
    'SpareByte1' : [ 0x3, ['unsigned char']],
    'SpareLong0' : [ 0x4, ['unsigned long']],
    'Thread' : [ 0x8, ['pointer64', ['_KTHREAD']]],
    'ApcListEntry' : [ 0x10, ['_LIST_ENTRY']],
    'KernelRoutine' : [ 0x20, ['pointer64', ['void']]],
    'RundownRoutine' : [ 0x28, ['pointer64', ['void']]],
    'NormalRoutine' : [ 0x30, ['pointer64', ['void']]],
    'Reserved' : [ 0x20, ['array', 3, ['pointer64', ['void']]]],
    'NormalContext' : [ 0x38, ['pointer64', ['void']]],
    'SystemArgument1' : [ 0x40, ['pointer64', ['void']]],
    'SystemArgument2' : [ 0x48, ['pointer64', ['void']]],
    'ApcStateIndex' : [ 0x50, ['unsigned char']],
    'ApcMode' : [ 0x51, ['unsigned char']],
    'Inserted' : [ 0x52, ['unsigned char']],
} ],
  '_KTIMER_EXPIRATION_TRACE' : [ 0x10, {
    'InterruptTime' : [ 0x0, ['unsigned long long']],
    'PerformanceCounter' : [ 0x8, ['_LARGE_INTEGER']],
} ],
  '_POOL_TRACKER_BIG_PAGES' : [ 0x18, {
    'Va' : [ 0x0, ['unsigned long long']],
    'Key' : [ 0x8, ['unsigned long']],
    'PoolType' : [ 0xc, ['unsigned long']],
    'NumberOfBytes' : [ 0x10, ['unsigned long long']],
} ],
  'tagSWITCH_CONTEXT_DATA' : [ 0x48, {
    'ullOsMaxVersionTested' : [ 0x0, ['unsigned long long']],
    'ullContextMinimum' : [ 0x8, ['unsigned long long']],
    'guPlatform' : [ 0x10, ['_GUID']],
    'guMinPlatform' : [ 0x20, ['_GUID']],
    'ulContextSource' : [ 0x30, ['unsigned long']],
    'ulElementCount' : [ 0x34, ['unsigned long']],
    'guElements' : [ 0x38, ['array', 1, ['_GUID']]],
} ],
  '_WHEAP_ERROR_SOURCE_TABLE' : [ 0x30, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Count' : [ 0x4, ['long']],
    'Items' : [ 0x8, ['_LIST_ENTRY']],
    'InsertLock' : [ 0x18, ['_KEVENT']],
} ],
  '_TEB_ACTIVE_FRAME' : [ 0x18, {
    'Flags' : [ 0x0, ['unsigned long']],
    'Previous' : [ 0x8, ['pointer64', ['_TEB_ACTIVE_FRAME']]],
    'Context' : [ 0x10, ['pointer64', ['_TEB_ACTIVE_FRAME_CONTEXT']]],
} ],
  '_FILE_GET_QUOTA_INFORMATION' : [ 0x14, {
    'NextEntryOffset' : [ 0x0, ['unsigned long']],
    'SidLength' : [ 0x4, ['unsigned long']],
    'Sid' : [ 0x8, ['_SID']],
} ],
  '_ACCESS_REASONS' : [ 0x80, {
    'Data' : [ 0x0, ['array', 32, ['unsigned long']]],
} ],
  '_CM_KEY_BODY' : [ 0x58, {
    'Type' : [ 0x0, ['unsigned long']],
    'KeyControlBlock' : [ 0x8, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
    'NotifyBlock' : [ 0x10, ['pointer64', ['_CM_NOTIFY_BLOCK']]],
    'ProcessID' : [ 0x18, ['pointer64', ['void']]],
    'KeyBodyList' : [ 0x20, ['_LIST_ENTRY']],
    'Flags' : [ 0x30, ['BitField', dict(start_bit = 0, end_bit = 16, native_type='unsigned long')]],
    'HandleTags' : [ 0x30, ['BitField', dict(start_bit = 16, end_bit = 32, native_type='unsigned long')]],
    'KtmTrans' : [ 0x38, ['pointer64', ['void']]],
    'KtmUow' : [ 0x40, ['pointer64', ['_GUID']]],
    'ContextListHead' : [ 0x48, ['_LIST_ENTRY']],
} ],
  '_KWAIT_BLOCK' : [ 0x30, {
    'WaitListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'WaitType' : [ 0x10, ['unsigned char']],
    'BlockState' : [ 0x11, ['unsigned char']],
    'WaitKey' : [ 0x12, ['unsigned short']],
    'SpareLong' : [ 0x14, ['long']],
    'Thread' : [ 0x18, ['pointer64', ['_KTHREAD']]],
    'NotificationQueue' : [ 0x18, ['pointer64', ['_KQUEUE']]],
    'Object' : [ 0x20, ['pointer64', ['void']]],
    'SparePtr' : [ 0x28, ['pointer64', ['void']]],
} ],
  '_MMPTE_PROTOTYPE' : [ 0x8, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'DemandFillProto' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long long')]],
    'HiberVerifyConverted' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long long')]],
    'Unused1' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 8, native_type='unsigned long long')]],
    'ReadOnly' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long long')]],
    'Combined' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long long')]],
    'Prototype' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long long')]],
    'Protection' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 16, native_type='unsigned long long')]],
    'ProtoAddress' : [ 0x0, ['BitField', dict(start_bit = 16, end_bit = 64, native_type='long long')]],
} ],
  '_WHEA_ERROR_PACKET_FLAGS' : [ 0x4, {
    'PreviousError' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'Reserved1' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'HypervisorError' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'Simulated' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'PlatformPfaControl' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'PlatformDirectedOffline' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'Reserved2' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 32, native_type='unsigned long')]],
    'AsULONG' : [ 0x0, ['unsigned long']],
} ],
  '_THERMAL_INFORMATION_EX' : [ 0x50, {
    'ThermalStamp' : [ 0x0, ['unsigned long']],
    'ThermalConstant1' : [ 0x4, ['unsigned long']],
    'ThermalConstant2' : [ 0x8, ['unsigned long']],
    'SamplingPeriod' : [ 0xc, ['unsigned long']],
    'CurrentTemperature' : [ 0x10, ['unsigned long']],
    'PassiveTripPoint' : [ 0x14, ['unsigned long']],
    'CriticalTripPoint' : [ 0x18, ['unsigned long']],
    'ActiveTripPointCount' : [ 0x1c, ['unsigned char']],
    'ActiveTripPoint' : [ 0x20, ['array', 10, ['unsigned long']]],
    'S4TransitionTripPoint' : [ 0x48, ['unsigned long']],
    'MinimumThrottle' : [ 0x4c, ['unsigned long']],
} ],
  '__unnamed_1dce' : [ 0x4, {
    'FilePointerIndex' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 9, native_type='unsigned long')]],
    'HardFault' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'Image' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'Spare0' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
} ],
  '__unnamed_1dd0' : [ 0x4, {
    'FilePointerIndex' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 9, native_type='unsigned long')]],
    'HardFault' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'Spare1' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 12, native_type='unsigned long')]],
} ],
  '_MM_PAGE_ACCESS_INFO_FLAGS' : [ 0x4, {
    'File' : [ 0x0, ['__unnamed_1dce']],
    'Private' : [ 0x0, ['__unnamed_1dd0']],
} ],
  '_PPM_CONCURRENCY_ACCOUNTING' : [ 0x28, {
    'Lock' : [ 0x0, ['unsigned long long']],
    'Processors' : [ 0x8, ['unsigned long']],
    'ActiveProcessors' : [ 0xc, ['unsigned long']],
    'LastUpdateTime' : [ 0x10, ['unsigned long long']],
    'TotalTime' : [ 0x18, ['unsigned long long']],
    'AccumulatedTime' : [ 0x20, ['array', 1, ['unsigned long long']]],
} ],
  '_VI_VERIFIER_ISSUE' : [ 0x20, {
    'IssueType' : [ 0x0, ['unsigned long long']],
    'Address' : [ 0x8, ['pointer64', ['void']]],
    'Parameters' : [ 0x10, ['array', 2, ['unsigned long long']]],
} ],
  '_MMSUBSECTION_FLAGS' : [ 0x4, {
    'SubsectionAccessed' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'Protection' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 6, native_type='unsigned short')]],
    'StartingSector4132' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 16, native_type='unsigned short')]],
    'SubsectionStatic' : [ 0x2, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned short')]],
    'GlobalMemory' : [ 0x2, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned short')]],
    'DirtyPages' : [ 0x2, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned short')]],
    'OnDereferenceList' : [ 0x2, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned short')]],
    'SectorEndOffset' : [ 0x2, ['BitField', dict(start_bit = 4, end_bit = 16, native_type='unsigned short')]],
} ],
  '_EXCEPTION_POINTERS' : [ 0x10, {
    'ExceptionRecord' : [ 0x0, ['pointer64', ['_EXCEPTION_RECORD']]],
    'ContextRecord' : [ 0x8, ['pointer64', ['_CONTEXT']]],
} ],
  '_KMUTANT' : [ 0x38, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
    'MutantListEntry' : [ 0x18, ['_LIST_ENTRY']],
    'OwnerThread' : [ 0x28, ['pointer64', ['_KTHREAD']]],
    'Abandoned' : [ 0x30, ['unsigned char']],
    'ApcDisable' : [ 0x31, ['unsigned char']],
} ],
  '_OBJECT_REF_INFO' : [ 0x28, {
    'ObjectHeader' : [ 0x0, ['pointer64', ['_OBJECT_HEADER']]],
    'NextRef' : [ 0x8, ['pointer64', ['void']]],
    'ImageFileName' : [ 0x10, ['array', 16, ['unsigned char']]],
    'NextPos' : [ 0x20, ['unsigned short']],
    'MaxStacks' : [ 0x22, ['unsigned short']],
    'StackInfo' : [ 0x24, ['array', 0, ['_OBJECT_REF_STACK_INFO']]],
} ],
  '_HBIN' : [ 0x20, {
    'Signature' : [ 0x0, ['unsigned long']],
    'FileOffset' : [ 0x4, ['unsigned long']],
    'Size' : [ 0x8, ['unsigned long']],
    'Reserved1' : [ 0xc, ['array', 2, ['unsigned long']]],
    'TimeStamp' : [ 0x14, ['_LARGE_INTEGER']],
    'Spare' : [ 0x1c, ['unsigned long']],
} ],
  '_MI_IMAGE_SECURITY_REFERENCE' : [ 0x10, {
    'SecurityContext' : [ 0x0, ['_IMAGE_SECURITY_CONTEXT']],
    'DynamicRelocations' : [ 0x8, ['pointer64', ['void']]],
} ],
  '_AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION' : [ 0x260, {
    'DeviceGroupsCount' : [ 0x0, ['unsigned long']],
    'pDeviceGroups' : [ 0x8, ['pointer64', ['_SID_AND_ATTRIBUTES']]],
    'RestrictedDeviceGroupsCount' : [ 0x10, ['unsigned long']],
    'pRestrictedDeviceGroups' : [ 0x18, ['pointer64', ['_SID_AND_ATTRIBUTES']]],
    'DeviceGroupsHash' : [ 0x20, ['_SID_AND_ATTRIBUTES_HASH']],
    'RestrictedDeviceGroupsHash' : [ 0x130, ['_SID_AND_ATTRIBUTES_HASH']],
    'pUserSecurityAttributes' : [ 0x240, ['pointer64', ['_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION']]],
    'pDeviceSecurityAttributes' : [ 0x248, ['pointer64', ['_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION']]],
    'pRestrictedUserSecurityAttributes' : [ 0x250, ['pointer64', ['_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION']]],
    'pRestrictedDeviceSecurityAttributes' : [ 0x258, ['pointer64', ['_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION']]],
} ],
  '_HEAP_TAG_ENTRY' : [ 0x48, {
    'Allocs' : [ 0x0, ['unsigned long']],
    'Frees' : [ 0x4, ['unsigned long']],
    'Size' : [ 0x8, ['unsigned long long']],
    'TagIndex' : [ 0x10, ['unsigned short']],
    'CreatorBackTraceIndex' : [ 0x12, ['unsigned short']],
    'TagName' : [ 0x14, ['array', 24, ['wchar']]],
} ],
  '_SECURITY_QUALITY_OF_SERVICE' : [ 0xc, {
    'Length' : [ 0x0, ['unsigned long']],
    'ImpersonationLevel' : [ 0x4, ['Enumeration', dict(target = 'long', choices = {0: 'SecurityAnonymous', 1: 'SecurityIdentification', 2: 'SecurityImpersonation', 3: 'SecurityDelegation'})]],
    'ContextTrackingMode' : [ 0x8, ['unsigned char']],
    'EffectiveOnly' : [ 0x9, ['unsigned char']],
} ],
  '_MMWSLE_FREE_ENTRY' : [ 0x8, {
    'MustBeZero' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long long')]],
    'PreviousFree' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 28, native_type='unsigned long long')]],
    'NextFree' : [ 0x0, ['BitField', dict(start_bit = 28, end_bit = 64, native_type='unsigned long long')]],
} ],
  '_NT_TIB' : [ 0x38, {
    'ExceptionList' : [ 0x0, ['pointer64', ['_EXCEPTION_REGISTRATION_RECORD']]],
    'StackBase' : [ 0x8, ['pointer64', ['void']]],
    'StackLimit' : [ 0x10, ['pointer64', ['void']]],
    'SubSystemTib' : [ 0x18, ['pointer64', ['void']]],
    'FiberData' : [ 0x20, ['pointer64', ['void']]],
    'Version' : [ 0x20, ['unsigned long']],
    'ArbitraryUserPointer' : [ 0x28, ['pointer64', ['void']]],
    'Self' : [ 0x30, ['pointer64', ['_NT_TIB']]],
} ],
  '_LEARNING_MODE_DATA' : [ 0x8, {
    'Settings' : [ 0x0, ['unsigned long']],
    'Enabled' : [ 0x4, ['unsigned char']],
    'PermissiveModeEnabled' : [ 0x5, ['unsigned char']],
} ],
  '_WHEA_REVISION' : [ 0x2, {
    'MinorRevision' : [ 0x0, ['unsigned char']],
    'MajorRevision' : [ 0x1, ['unsigned char']],
    'AsUSHORT' : [ 0x0, ['unsigned short']],
} ],
  '_EJOB' : [ 0x4b0, {
    'Event' : [ 0x0, ['_KEVENT']],
    'JobLinks' : [ 0x18, ['_LIST_ENTRY']],
    'ProcessListHead' : [ 0x28, ['_LIST_ENTRY']],
    'JobLock' : [ 0x38, ['_ERESOURCE']],
    'TotalUserTime' : [ 0xa0, ['_LARGE_INTEGER']],
    'TotalKernelTime' : [ 0xa8, ['_LARGE_INTEGER']],
    'TotalCycleTime' : [ 0xb0, ['_LARGE_INTEGER']],
    'ThisPeriodTotalUserTime' : [ 0xb8, ['_LARGE_INTEGER']],
    'ThisPeriodTotalKernelTime' : [ 0xc0, ['_LARGE_INTEGER']],
    'TotalContextSwitches' : [ 0xc8, ['unsigned long long']],
    'TotalPageFaultCount' : [ 0xd0, ['unsigned long']],
    'TotalProcesses' : [ 0xd4, ['unsigned long']],
    'ActiveProcesses' : [ 0xd8, ['unsigned long']],
    'TotalTerminatedProcesses' : [ 0xdc, ['unsigned long']],
    'PerProcessUserTimeLimit' : [ 0xe0, ['_LARGE_INTEGER']],
    'PerJobUserTimeLimit' : [ 0xe8, ['_LARGE_INTEGER']],
    'MinimumWorkingSetSize' : [ 0xf0, ['unsigned long long']],
    'MaximumWorkingSetSize' : [ 0xf8, ['unsigned long long']],
    'LimitFlags' : [ 0x100, ['unsigned long']],
    'ActiveProcessLimit' : [ 0x104, ['unsigned long']],
    'Affinity' : [ 0x108, ['_KAFFINITY_EX']],
    'AccessState' : [ 0x1b0, ['pointer64', ['_JOB_ACCESS_STATE']]],
    'AccessStateQuotaReference' : [ 0x1b8, ['pointer64', ['void']]],
    'UIRestrictionsClass' : [ 0x1c0, ['unsigned long']],
    'EndOfJobTimeAction' : [ 0x1c4, ['unsigned long']],
    'CompletionPort' : [ 0x1c8, ['pointer64', ['void']]],
    'CompletionKey' : [ 0x1d0, ['pointer64', ['void']]],
    'CompletionCount' : [ 0x1d8, ['unsigned long long']],
    'SessionId' : [ 0x1e0, ['unsigned long']],
    'SchedulingClass' : [ 0x1e4, ['unsigned long']],
    'ReadOperationCount' : [ 0x1e8, ['unsigned long long']],
    'WriteOperationCount' : [ 0x1f0, ['unsigned long long']],
    'OtherOperationCount' : [ 0x1f8, ['unsigned long long']],
    'ReadTransferCount' : [ 0x200, ['unsigned long long']],
    'WriteTransferCount' : [ 0x208, ['unsigned long long']],
    'OtherTransferCount' : [ 0x210, ['unsigned long long']],
    'DiskIoInfo' : [ 0x218, ['_PROCESS_DISK_COUNTERS']],
    'ProcessMemoryLimit' : [ 0x240, ['unsigned long long']],
    'JobMemoryLimit' : [ 0x248, ['unsigned long long']],
    'PeakProcessMemoryUsed' : [ 0x250, ['unsigned long long']],
    'PeakJobMemoryUsed' : [ 0x258, ['unsigned long long']],
    'EffectiveAffinity' : [ 0x260, ['_KAFFINITY_EX']],
    'EffectivePerProcessUserTimeLimit' : [ 0x308, ['_LARGE_INTEGER']],
    'EffectiveMinimumWorkingSetSize' : [ 0x310, ['unsigned long long']],
    'EffectiveMaximumWorkingSetSize' : [ 0x318, ['unsigned long long']],
    'EffectiveProcessMemoryLimit' : [ 0x320, ['unsigned long long']],
    'EffectiveProcessMemoryLimitJob' : [ 0x328, ['pointer64', ['_EJOB']]],
    'EffectivePerProcessUserTimeLimitJob' : [ 0x330, ['pointer64', ['_EJOB']]],
    'EffectiveLimitFlags' : [ 0x338, ['unsigned long']],
    'EffectiveSchedulingClass' : [ 0x33c, ['unsigned long']],
    'EffectiveFreezeCount' : [ 0x340, ['unsigned long']],
    'EffectiveBackgroundCount' : [ 0x344, ['unsigned long']],
    'EffectiveSwapCount' : [ 0x348, ['unsigned long']],
    'EffectiveNotificationLimitCount' : [ 0x34c, ['unsigned long']],
    'EffectivePriorityClass' : [ 0x350, ['unsigned char']],
    'PriorityClass' : [ 0x351, ['unsigned char']],
    'Reserved1' : [ 0x352, ['array', 2, ['unsigned char']]],
    'CompletionFilter' : [ 0x354, ['unsigned long']],
    'WakeChannel' : [ 0x358, ['_WNF_STATE_NAME']],
    'WakeInfo' : [ 0x358, ['_PS_WAKE_INFORMATION']],
    'WakeFilter' : [ 0x390, ['_JOBOBJECT_WAKE_FILTER']],
    'LowEdgeLatchFilter' : [ 0x398, ['unsigned long']],
    'OwnedHighEdgeFilters' : [ 0x39c, ['unsigned long']],
    'NotificationLink' : [ 0x3a0, ['pointer64', ['_EJOB']]],
    'CurrentJobMemoryUsed' : [ 0x3a8, ['unsigned long long']],
    'NotificationInfo' : [ 0x3b0, ['pointer64', ['_JOB_NOTIFICATION_INFORMATION']]],
    'NotificationInfoQuotaReference' : [ 0x3b8, ['pointer64', ['void']]],
    'NotificationPacket' : [ 0x3c0, ['pointer64', ['_IO_MINI_COMPLETION_PACKET_USER']]],
    'CpuRateControl' : [ 0x3c8, ['pointer64', ['_JOB_CPU_RATE_CONTROL']]],
    'EffectiveSchedulingGroup' : [ 0x3d0, ['pointer64', ['void']]],
    'ReadyTime' : [ 0x3d8, ['unsigned long long']],
    'MemoryLimitsLock' : [ 0x3e0, ['_EX_PUSH_LOCK']],
    'SiblingJobLinks' : [ 0x3e8, ['_LIST_ENTRY']],
    'ChildJobListHead' : [ 0x3f8, ['_LIST_ENTRY']],
    'ParentJob' : [ 0x408, ['pointer64', ['_EJOB']]],
    'RootJob' : [ 0x410, ['pointer64', ['_EJOB']]],
    'IteratorListHead' : [ 0x418, ['_LIST_ENTRY']],
    'AncestorCount' : [ 0x428, ['unsigned long long']],
    'Ancestors' : [ 0x430, ['pointer64', ['pointer64', ['_EJOB']]]],
    'Accounting' : [ 0x438, ['_EPROCESS_VALUES']],
    'ShadowActiveProcessCount' : [ 0x488, ['unsigned long']],
    'SequenceNumber' : [ 0x48c, ['unsigned long']],
    'TimerListLock' : [ 0x490, ['unsigned long long']],
    'TimerListHead' : [ 0x498, ['_LIST_ENTRY']],
    'JobFlags' : [ 0x4a8, ['unsigned long']],
    'CloseDone' : [ 0x4a8, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'MultiGroup' : [ 0x4a8, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'OutstandingNotification' : [ 0x4a8, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'NotificationInProgress' : [ 0x4a8, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'UILimits' : [ 0x4a8, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'CpuRateControlActive' : [ 0x4a8, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned long')]],
    'OwnCpuRateControl' : [ 0x4a8, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned long')]],
    'Terminating' : [ 0x4a8, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned long')]],
    'WorkingSetLock' : [ 0x4a8, ['BitField', dict(start_bit = 8, end_bit = 9, native_type='unsigned long')]],
    'JobFrozen' : [ 0x4a8, ['BitField', dict(start_bit = 9, end_bit = 10, native_type='unsigned long')]],
    'Background' : [ 0x4a8, ['BitField', dict(start_bit = 10, end_bit = 11, native_type='unsigned long')]],
    'WakeNotificationAllocated' : [ 0x4a8, ['BitField', dict(start_bit = 11, end_bit = 12, native_type='unsigned long')]],
    'WakeNotificationEnabled' : [ 0x4a8, ['BitField', dict(start_bit = 12, end_bit = 13, native_type='unsigned long')]],
    'WakeNotificationPending' : [ 0x4a8, ['BitField', dict(start_bit = 13, end_bit = 14, native_type='unsigned long')]],
    'LimitNotificationRequired' : [ 0x4a8, ['BitField', dict(start_bit = 14, end_bit = 15, native_type='unsigned long')]],
    'ZeroCountNotificationRequired' : [ 0x4a8, ['BitField', dict(start_bit = 15, end_bit = 16, native_type='unsigned long')]],
    'CycleTimeNotificationRequired' : [ 0x4a8, ['BitField', dict(start_bit = 16, end_bit = 17, native_type='unsigned long')]],
    'CycleTimeNotificationPending' : [ 0x4a8, ['BitField', dict(start_bit = 17, end_bit = 18, native_type='unsigned long')]],
    'TimersVirtualized' : [ 0x4a8, ['BitField', dict(start_bit = 18, end_bit = 19, native_type='unsigned long')]],
    'JobSwapped' : [ 0x4a8, ['BitField', dict(start_bit = 19, end_bit = 20, native_type='unsigned long')]],
    'ViolationDetected' : [ 0x4a8, ['BitField', dict(start_bit = 20, end_bit = 21, native_type='unsigned long')]],
    'EmptyJobNotified' : [ 0x4a8, ['BitField', dict(start_bit = 21, end_bit = 22, native_type='unsigned long')]],
    'NoSystemCharge' : [ 0x4a8, ['BitField', dict(start_bit = 22, end_bit = 23, native_type='unsigned long')]],
    'DropNoWakeCharges' : [ 0x4a8, ['BitField', dict(start_bit = 23, end_bit = 24, native_type='unsigned long')]],
    'NoWakeChargePolicyDecided' : [ 0x4a8, ['BitField', dict(start_bit = 24, end_bit = 25, native_type='unsigned long')]],
    'SpareJobFlags' : [ 0x4a8, ['BitField', dict(start_bit = 25, end_bit = 32, native_type='unsigned long')]],
    'EffectiveHighEdgeFilters' : [ 0x4ac, ['unsigned long']],
} ],
  '_PPM_IDLE_STATES' : [ 0x318, {
    'InterfaceVersion' : [ 0x0, ['unsigned char']],
    'ForceIdle' : [ 0x1, ['unsigned char']],
    'EstimateIdleDuration' : [ 0x2, ['unsigned char']],
    'ExitLatencyTraceEnabled' : [ 0x3, ['unsigned char']],
    'NonInterruptibleTransition' : [ 0x4, ['unsigned char']],
    'ExitLatencyCountdown' : [ 0x8, ['unsigned long']],
    'TargetState' : [ 0xc, ['unsigned long']],
    'ActualState' : [ 0x10, ['unsigned long']],
    'OldState' : [ 0x14, ['unsigned long']],
    'OverrideIndex' : [ 0x18, ['unsigned long']],
    'ProcessorIdleCount' : [ 0x1c, ['unsigned long']],
    'Type' : [ 0x20, ['unsigned long']],
    'ReasonFlags' : [ 0x24, ['unsigned short']],
    'InitiateWakeStamp' : [ 0x28, ['unsigned long long']],
    'PreviousStatus' : [ 0x30, ['long']],
    'PreviousCancelReason' : [ 0x34, ['unsigned long']],
    'PrimaryProcessorMask' : [ 0x38, ['_KAFFINITY_EX']],
    'SecondaryProcessorMask' : [ 0xe0, ['_KAFFINITY_EX']],
    'IdlePrepare' : [ 0x188, ['pointer64', ['void']]],
    'IdleExecute' : [ 0x190, ['pointer64', ['void']]],
    'IdlePreselect' : [ 0x198, ['pointer64', ['void']]],
    'IdleTest' : [ 0x1a0, ['pointer64', ['void']]],
    'IdleComplete' : [ 0x1a8, ['pointer64', ['void']]],
    'IdleCancel' : [ 0x1b0, ['pointer64', ['void']]],
    'IdleIsHalted' : [ 0x1b8, ['pointer64', ['void']]],
    'IdleInitiateWake' : [ 0x1c0, ['pointer64', ['void']]],
    'QueryPlatformStateResidency' : [ 0x1c8, ['pointer64', ['void']]],
    'PrepareInfo' : [ 0x1d0, ['_PROCESSOR_IDLE_PREPARE_INFO']],
    'Tracing' : [ 0x238, ['pointer64', ['_PERFINFO_PPM_STATE_SELECTION']]],
    'State' : [ 0x240, ['array', 1, ['_PPM_IDLE_STATE']]],
} ],
  '_PEB' : [ 0x388, {
    'InheritedAddressSpace' : [ 0x0, ['unsigned char']],
    'ReadImageFileExecOptions' : [ 0x1, ['unsigned char']],
    'BeingDebugged' : [ 0x2, ['unsigned char']],
    'BitField' : [ 0x3, ['unsigned char']],
    'ImageUsesLargePages' : [ 0x3, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'IsProtectedProcess' : [ 0x3, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'IsImageDynamicallyRelocated' : [ 0x3, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'SkipPatchingUser32Forwarders' : [ 0x3, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'IsPackagedProcess' : [ 0x3, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'IsAppContainer' : [ 0x3, ['BitField', dict(start_bit = 5, end_bit = 6, native_type='unsigned char')]],
    'IsProtectedProcessLight' : [ 0x3, ['BitField', dict(start_bit = 6, end_bit = 7, native_type='unsigned char')]],
    'SpareBits' : [ 0x3, ['BitField', dict(start_bit = 7, end_bit = 8, native_type='unsigned char')]],
    'Padding0' : [ 0x4, ['array', 4, ['unsigned char']]],
    'Mutant' : [ 0x8, ['pointer64', ['void']]],
    'ImageBaseAddress' : [ 0x10, ['pointer64', ['void']]],
    'Ldr' : [ 0x18, ['pointer64', ['_PEB_LDR_DATA']]],
    'ProcessParameters' : [ 0x20, ['pointer64', ['_RTL_USER_PROCESS_PARAMETERS']]],
    'SubSystemData' : [ 0x28, ['pointer64', ['void']]],
    'ProcessHeap' : [ 0x30, ['pointer64', ['void']]],
    'FastPebLock' : [ 0x38, ['pointer64', ['_RTL_CRITICAL_SECTION']]],
    'AtlThunkSListPtr' : [ 0x40, ['pointer64', ['void']]],
    'IFEOKey' : [ 0x48, ['pointer64', ['void']]],
    'CrossProcessFlags' : [ 0x50, ['unsigned long']],
    'ProcessInJob' : [ 0x50, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'ProcessInitializing' : [ 0x50, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'ProcessUsingVEH' : [ 0x50, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'ProcessUsingVCH' : [ 0x50, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned long')]],
    'ProcessUsingFTH' : [ 0x50, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned long')]],
    'ReservedBits0' : [ 0x50, ['BitField', dict(start_bit = 5, end_bit = 32, native_type='unsigned long')]],
    'Padding1' : [ 0x54, ['array', 4, ['unsigned char']]],
    'KernelCallbackTable' : [ 0x58, ['pointer64', ['void']]],
    'UserSharedInfoPtr' : [ 0x58, ['pointer64', ['void']]],
    'SystemReserved' : [ 0x60, ['array', 1, ['unsigned long']]],
    'AtlThunkSListPtr32' : [ 0x64, ['unsigned long']],
    'ApiSetMap' : [ 0x68, ['pointer64', ['void']]],
    'TlsExpansionCounter' : [ 0x70, ['unsigned long']],
    'Padding2' : [ 0x74, ['array', 4, ['unsigned char']]],
    'TlsBitmap' : [ 0x78, ['pointer64', ['void']]],
    'TlsBitmapBits' : [ 0x80, ['array', 2, ['unsigned long']]],
    'ReadOnlySharedMemoryBase' : [ 0x88, ['pointer64', ['void']]],
    'SparePvoid0' : [ 0x90, ['pointer64', ['void']]],
    'ReadOnlyStaticServerData' : [ 0x98, ['pointer64', ['pointer64', ['void']]]],
    'AnsiCodePageData' : [ 0xa0, ['pointer64', ['void']]],
    'OemCodePageData' : [ 0xa8, ['pointer64', ['void']]],
    'UnicodeCaseTableData' : [ 0xb0, ['pointer64', ['void']]],
    'NumberOfProcessors' : [ 0xb8, ['unsigned long']],
    'NtGlobalFlag' : [ 0xbc, ['unsigned long']],
    'CriticalSectionTimeout' : [ 0xc0, ['_LARGE_INTEGER']],
    'HeapSegmentReserve' : [ 0xc8, ['unsigned long long']],
    'HeapSegmentCommit' : [ 0xd0, ['unsigned long long']],
    'HeapDeCommitTotalFreeThreshold' : [ 0xd8, ['unsigned long long']],
    'HeapDeCommitFreeBlockThreshold' : [ 0xe0, ['unsigned long long']],
    'NumberOfHeaps' : [ 0xe8, ['unsigned long']],
    'MaximumNumberOfHeaps' : [ 0xec, ['unsigned long']],
    'ProcessHeaps' : [ 0xf0, ['pointer64', ['pointer64', ['void']]]],
    'GdiSharedHandleTable' : [ 0xf8, ['pointer64', ['void']]],
    'ProcessStarterHelper' : [ 0x100, ['pointer64', ['void']]],
    'GdiDCAttributeList' : [ 0x108, ['unsigned long']],
    'Padding3' : [ 0x10c, ['array', 4, ['unsigned char']]],
    'LoaderLock' : [ 0x110, ['pointer64', ['_RTL_CRITICAL_SECTION']]],
    'OSMajorVersion' : [ 0x118, ['unsigned long']],
    'OSMinorVersion' : [ 0x11c, ['unsigned long']],
    'OSBuildNumber' : [ 0x120, ['unsigned short']],
    'OSCSDVersion' : [ 0x122, ['unsigned short']],
    'OSPlatformId' : [ 0x124, ['unsigned long']],
    'ImageSubsystem' : [ 0x128, ['unsigned long']],
    'ImageSubsystemMajorVersion' : [ 0x12c, ['unsigned long']],
    'ImageSubsystemMinorVersion' : [ 0x130, ['unsigned long']],
    'Padding4' : [ 0x134, ['array', 4, ['unsigned char']]],
    'ActiveProcessAffinityMask' : [ 0x138, ['unsigned long long']],
    'GdiHandleBuffer' : [ 0x140, ['array', 60, ['unsigned long']]],
    'PostProcessInitRoutine' : [ 0x230, ['pointer64', ['void']]],
    'TlsExpansionBitmap' : [ 0x238, ['pointer64', ['void']]],
    'TlsExpansionBitmapBits' : [ 0x240, ['array', 32, ['unsigned long']]],
    'SessionId' : [ 0x2c0, ['unsigned long']],
    'Padding5' : [ 0x2c4, ['array', 4, ['unsigned char']]],
    'AppCompatFlags' : [ 0x2c8, ['_ULARGE_INTEGER']],
    'AppCompatFlagsUser' : [ 0x2d0, ['_ULARGE_INTEGER']],
    'pShimData' : [ 0x2d8, ['pointer64', ['void']]],
    'AppCompatInfo' : [ 0x2e0, ['pointer64', ['void']]],
    'CSDVersion' : [ 0x2e8, ['_UNICODE_STRING']],
    'ActivationContextData' : [ 0x2f8, ['pointer64', ['_ACTIVATION_CONTEXT_DATA']]],
    'ProcessAssemblyStorageMap' : [ 0x300, ['pointer64', ['_ASSEMBLY_STORAGE_MAP']]],
    'SystemDefaultActivationContextData' : [ 0x308, ['pointer64', ['_ACTIVATION_CONTEXT_DATA']]],
    'SystemAssemblyStorageMap' : [ 0x310, ['pointer64', ['_ASSEMBLY_STORAGE_MAP']]],
    'MinimumStackCommit' : [ 0x318, ['unsigned long long']],
    'FlsCallback' : [ 0x320, ['pointer64', ['_FLS_CALLBACK_INFO']]],
    'FlsListHead' : [ 0x328, ['_LIST_ENTRY']],
    'FlsBitmap' : [ 0x338, ['pointer64', ['void']]],
    'FlsBitmapBits' : [ 0x340, ['array', 4, ['unsigned long']]],
    'FlsHighIndex' : [ 0x350, ['unsigned long']],
    'WerRegistrationData' : [ 0x358, ['pointer64', ['void']]],
    'WerShipAssertPtr' : [ 0x360, ['pointer64', ['void']]],
    'pUnused' : [ 0x368, ['pointer64', ['void']]],
    'pImageHeaderHash' : [ 0x370, ['pointer64', ['void']]],
    'TracingFlags' : [ 0x378, ['unsigned long']],
    'HeapTracingEnabled' : [ 0x378, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned long')]],
    'CritSecTracingEnabled' : [ 0x378, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned long')]],
    'LibLoaderTracingEnabled' : [ 0x378, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned long')]],
    'SpareTracingBits' : [ 0x378, ['BitField', dict(start_bit = 3, end_bit = 32, native_type='unsigned long')]],
    'Padding6' : [ 0x37c, ['array', 4, ['unsigned char']]],
    'CsrServerReadOnlySharedMemoryBase' : [ 0x380, ['unsigned long long']],
} ],
  '_HEAP_UCR_DESCRIPTOR' : [ 0x30, {
    'ListEntry' : [ 0x0, ['_LIST_ENTRY']],
    'SegmentEntry' : [ 0x10, ['_LIST_ENTRY']],
    'Address' : [ 0x20, ['pointer64', ['void']]],
    'Size' : [ 0x28, ['unsigned long long']],
} ],
  '_ETW_REALTIME_CONSUMER' : [ 0x98, {
    'Links' : [ 0x0, ['_LIST_ENTRY']],
    'ProcessHandle' : [ 0x10, ['pointer64', ['void']]],
    'ProcessObject' : [ 0x18, ['pointer64', ['_EPROCESS']]],
    'NextNotDelivered' : [ 0x20, ['pointer64', ['void']]],
    'RealtimeConnectContext' : [ 0x28, ['pointer64', ['void']]],
    'DisconnectEvent' : [ 0x30, ['pointer64', ['_KEVENT']]],
    'DataAvailableEvent' : [ 0x38, ['pointer64', ['_KEVENT']]],
    'UserBufferCount' : [ 0x40, ['pointer64', ['unsigned long']]],
    'UserBufferListHead' : [ 0x48, ['pointer64', ['_SINGLE_LIST_ENTRY']]],
    'BuffersLost' : [ 0x50, ['unsigned long']],
    'EmptyBuffersCount' : [ 0x54, ['unsigned long']],
    'LoggerId' : [ 0x58, ['unsigned short']],
    'Flags' : [ 0x5a, ['unsigned char']],
    'ShutDownRequested' : [ 0x5a, ['BitField', dict(start_bit = 0, end_bit = 1, native_type='unsigned char')]],
    'NewBuffersLost' : [ 0x5a, ['BitField', dict(start_bit = 1, end_bit = 2, native_type='unsigned char')]],
    'Disconnected' : [ 0x5a, ['BitField', dict(start_bit = 2, end_bit = 3, native_type='unsigned char')]],
    'Notified' : [ 0x5a, ['BitField', dict(start_bit = 3, end_bit = 4, native_type='unsigned char')]],
    'Wow' : [ 0x5a, ['BitField', dict(start_bit = 4, end_bit = 5, native_type='unsigned char')]],
    'ReservedBufferSpaceBitMap' : [ 0x60, ['_RTL_BITMAP']],
    'ReservedBufferSpace' : [ 0x70, ['pointer64', ['unsigned char']]],
    'ReservedBufferSpaceSize' : [ 0x78, ['unsigned long']],
    'UserPagesAllocated' : [ 0x7c, ['unsigned long']],
    'UserPagesReused' : [ 0x80, ['unsigned long']],
    'EventsLostCount' : [ 0x88, ['pointer64', ['unsigned long']]],
    'BuffersLostCount' : [ 0x90, ['pointer64', ['unsigned long']]],
} ],
  '_POOL_DESCRIPTOR' : [ 0x1140, {
    'PoolType' : [ 0x0, ['Enumeration', dict(target = 'long', choices = {0: 'NonPagedPoolBase', 1: 'PagedPool', 2: 'NonPagedPoolBaseMustSucceed', 3: 'DontUseThisType', 4: 'NonPagedPoolBaseCacheAligned', 5: 'PagedPoolCacheAligned', 6: 'NonPagedPoolBaseCacheAlignedMustS', 7: 'MaxPoolType', 34: 'NonPagedPoolMustSucceedSession', 516: 'NonPagedPoolNxCacheAligned', 35: 'DontUseThisTypeSession', 32: 'NonPagedPoolSession', 512: 'NonPagedPoolNx', 544: 'NonPagedPoolSessionNx', 36: 'NonPagedPoolCacheAlignedSession', 33: 'PagedPoolSession', 38: 'NonPagedPoolCacheAlignedMustSSession', 37: 'PagedPoolCacheAlignedSession'})]],
    'PagedLock' : [ 0x8, ['_FAST_MUTEX']],
    'NonPagedLock' : [ 0x8, ['unsigned long long']],
    'RunningAllocs' : [ 0x40, ['long']],
    'RunningDeAllocs' : [ 0x44, ['long']],
    'TotalBigPages' : [ 0x48, ['long']],
    'ThreadsProcessingDeferrals' : [ 0x4c, ['long']],
    'TotalBytes' : [ 0x50, ['unsigned long long']],
    'PoolIndex' : [ 0x80, ['unsigned long']],
    'TotalPages' : [ 0xc0, ['long']],
    'PendingFrees' : [ 0x100, ['_SINGLE_LIST_ENTRY']],
    'PendingFreeDepth' : [ 0x108, ['long']],
    'ListHeads' : [ 0x140, ['array', 256, ['_LIST_ENTRY']]],
} ],
  '_TOKEN_MANDATORY_POLICY' : [ 0x4, {
    'Policy' : [ 0x0, ['unsigned long']],
} ],
  '_BLOB_COUNTERS' : [ 0x8, {
    'CreatedObjects' : [ 0x0, ['unsigned long']],
    'DeletedObjects' : [ 0x4, ['unsigned long']],
} ],
  '_KGATE' : [ 0x18, {
    'Header' : [ 0x0, ['_DISPATCHER_HEADER']],
} ],
  '_WHEA_ERROR_RECORD_HEADER' : [ 0x80, {
    'Signature' : [ 0x0, ['unsigned long']],
    'Revision' : [ 0x4, ['_WHEA_REVISION']],
    'SignatureEnd' : [ 0x6, ['unsigned long']],
    'SectionCount' : [ 0xa, ['unsigned short']],
    'Severity' : [ 0xc, ['Enumeration', dict(target = 'long', choices = {0: 'WheaErrSevRecoverable', 1: 'WheaErrSevFatal', 2: 'WheaErrSevCorrected', 3: 'WheaErrSevInformational'})]],
    'ValidBits' : [ 0x10, ['_WHEA_ERROR_RECORD_HEADER_VALIDBITS']],
    'Length' : [ 0x14, ['unsigned long']],
    'Timestamp' : [ 0x18, ['_WHEA_TIMESTAMP']],
    'PlatformId' : [ 0x20, ['_GUID']],
    'PartitionId' : [ 0x30, ['_GUID']],
    'CreatorId' : [ 0x40, ['_GUID']],
    'NotifyType' : [ 0x50, ['_GUID']],
    'RecordId' : [ 0x60, ['unsigned long long']],
    'Flags' : [ 0x68, ['_WHEA_ERROR_RECORD_HEADER_FLAGS']],
    'PersistenceInfo' : [ 0x6c, ['_WHEA_PERSISTENCE_INFO']],
    'Reserved' : [ 0x74, ['array', 12, ['unsigned char']]],
} ],
  '_ALPC_PROCESS_CONTEXT' : [ 0x20, {
    'Lock' : [ 0x0, ['_EX_PUSH_LOCK']],
    'ViewListHead' : [ 0x8, ['_LIST_ENTRY']],
    'PagedPoolQuotaCache' : [ 0x18, ['unsigned long long']],
} ],
  '_DRIVER_EXTENSION' : [ 0x50, {
    'DriverObject' : [ 0x0, ['pointer64', ['_DRIVER_OBJECT']]],
    'AddDevice' : [ 0x8, ['pointer64', ['void']]],
    'Count' : [ 0x10, ['unsigned long']],
    'ServiceKeyName' : [ 0x18, ['_UNICODE_STRING']],
    'ClientDriverExtension' : [ 0x28, ['pointer64', ['_IO_CLIENT_EXTENSION']]],
    'FsFilterCallbacks' : [ 0x30, ['pointer64', ['_FS_FILTER_CALLBACKS']]],
    'KseCallbacks' : [ 0x38, ['pointer64', ['void']]],
    'DvCallbacks' : [ 0x40, ['pointer64', ['void']]],
    'VerifierContext' : [ 0x48, ['pointer64', ['void']]],
} ],
  '_PRIVILEGE_SET' : [ 0x14, {
    'PrivilegeCount' : [ 0x0, ['unsigned long']],
    'Control' : [ 0x4, ['unsigned long']],
    'Privilege' : [ 0x8, ['array', 1, ['_LUID_AND_ATTRIBUTES']]],
} ],
  '_WHEAP_WORK_QUEUE' : [ 0x88, {
    'ListHead' : [ 0x0, ['_LIST_ENTRY']],
    'ListLock' : [ 0x10, ['unsigned long long']],
    'ItemCount' : [ 0x18, ['long']],
    'Dpc' : [ 0x20, ['_KDPC']],
    'WorkItem' : [ 0x60, ['_WORK_QUEUE_ITEM']],
    'WorkRoutine' : [ 0x80, ['pointer64', ['void']]],
} ],
  '_CM_NOTIFY_BLOCK' : [ 0x58, {
    'HiveList' : [ 0x0, ['_LIST_ENTRY']],
    'PostList' : [ 0x10, ['_LIST_ENTRY']],
    'KeyControlBlock' : [ 0x20, ['pointer64', ['_CM_KEY_CONTROL_BLOCK']]],
    'KeyBody' : [ 0x28, ['pointer64', ['_CM_KEY_BODY']]],
    'Filter' : [ 0x30, ['BitField', dict(start_bit = 0, end_bit = 30, native_type='unsigned long')]],
    'WatchTree' : [ 0x30, ['BitField', dict(start_bit = 30, end_bit = 31, native_type='unsigned long')]],
    'NotifyPending' : [ 0x30, ['BitField', dict(start_bit = 31, end_bit = 32, native_type='unsigned long')]],
    'SubjectContext' : [ 0x38, ['_SECURITY_SUBJECT_CONTEXT']],
} ],
  '_KINTERRUPT' : [ 0x100, {
    'Type' : [ 0x0, ['short']],
    'Size' : [ 0x2, ['short']],
    'InterruptListEntry' : [ 0x8, ['_LIST_ENTRY']],
    'ServiceRoutine' : [ 0x18, ['pointer64', ['void']]],
    'MessageServiceRoutine' : [ 0x20, ['pointer64', ['void']]],
    'MessageIndex' : [ 0x28, ['unsigned long']],
    'ServiceContext' : [ 0x30, ['pointer64', ['void']]],
    'SpinLock' : [ 0x38, ['unsigned long long']],
    'TickCount' : [ 0x40, ['unsigned long']],
    'ActualLock' : [ 0x48, ['pointer64', ['unsigned long long']]],
    'DispatchAddress' : [ 0x50, ['pointer64', ['void']]],
    'Vector' : [ 0x58, ['unsigned long']],
    'Irql' : [ 0x5c, ['unsigned char']],
    'SynchronizeIrql' : [ 0x5d, ['unsigned char']],
    'FloatingSave' : [ 0x5e, ['unsigned char']],
    'Connected' : [ 0x5f, ['unsigned char']],
    'Number' : [ 0x60, ['unsigned long']],
    'ShareVector' : [ 0x64, ['unsigned char']],
    'EmulateActiveBoth' : [ 0x65, ['unsigned char']],
    'ActiveCount' : [ 0x66, ['unsigned short']],
    'InternalState' : [ 0x68, ['long']],
    'Mode' : [ 0x6c, ['Enumeration', dict(target = 'long', choices = {0: 'LevelSensitive', 1: 'Latched'})]],
    'Polarity' : [ 0x70, ['Enumeration', dict(target = 'long', choices = {0: 'InterruptPolarityUnknown', 1: 'InterruptRisingEdge', 2: 'InterruptFallingEdge', 3: 'InterruptActiveBothTriggerLow', 4: 'InterruptActiveBothTriggerHigh'})]],
    'ServiceCount' : [ 0x74, ['unsigned long']],
    'DispatchCount' : [ 0x78, ['unsigned long']],
    'PassiveEvent' : [ 0x80, ['pointer64', ['_KEVENT']]],
    'TrapFrame' : [ 0x88, ['pointer64', ['_KTRAP_FRAME']]],
    'DispatchCode' : [ 0x90, ['array', 4, ['unsigned long']]],
    'DisconnectData' : [ 0xa0, ['pointer64', ['void']]],
    'ServiceThread' : [ 0xa8, ['pointer64', ['_KTHREAD']]],
    'IsrDpcStats' : [ 0xb0, ['_ISRDPCSTATS']],
    'ConnectionData' : [ 0xf0, ['pointer64', ['_INTERRUPT_CONNECTION_DATA']]],
    'Padding' : [ 0xf8, ['array', 8, ['unsigned char']]],
} ],
  '_AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION' : [ 0x30, {
    'SecurityAttributeCount' : [ 0x0, ['unsigned long']],
    'SecurityAttributesList' : [ 0x8, ['_LIST_ENTRY']],
    'WorkingSecurityAttributeCount' : [ 0x18, ['unsigned long']],
    'WorkingSecurityAttributesList' : [ 0x20, ['_LIST_ENTRY']],
} ],
  '_IMAGE_FILE_HEADER' : [ 0x14, {
    'Machine' : [ 0x0, ['unsigned short']],
    'NumberOfSections' : [ 0x2, ['unsigned short']],
    'TimeDateStamp' : [ 0x4, ['unsigned long']],
    'PointerToSymbolTable' : [ 0x8, ['unsigned long']],
    'NumberOfSymbols' : [ 0xc, ['unsigned long']],
    'SizeOfOptionalHeader' : [ 0x10, ['unsigned short']],
    'Characteristics' : [ 0x12, ['unsigned short']],
} ],
  '_HIVE_LIST_ENTRY' : [ 0x88, {
    'FileName' : [ 0x0, ['pointer64', ['unsigned short']]],
    'BaseName' : [ 0x8, ['pointer64', ['unsigned short']]],
    'RegRootName' : [ 0x10, ['pointer64', ['unsigned short']]],
    'CmHive' : [ 0x18, ['pointer64', ['_CMHIVE']]],
    'HHiveFlags' : [ 0x20, ['unsigned long']],
    'CmHiveFlags' : [ 0x24, ['unsigned long']],
    'CmKcbCacheSize' : [ 0x28, ['unsigned long']],
    'CmHive2' : [ 0x30, ['pointer64', ['_CMHIVE']]],
    'HiveMounted' : [ 0x38, ['unsigned char']],
    'ThreadFinished' : [ 0x39, ['unsigned char']],
    'ThreadStarted' : [ 0x3a, ['unsigned char']],
    'Allocate' : [ 0x3b, ['unsigned char']],
    'WinPERequired' : [ 0x3c, ['unsigned char']],
    'StartEvent' : [ 0x40, ['_KEVENT']],
    'FinishedEvent' : [ 0x58, ['_KEVENT']],
    'MountLock' : [ 0x70, ['_KEVENT']],
} ],
  '_HMAP_DIRECTORY' : [ 0x2000, {
    'Directory' : [ 0x0, ['array', 1024, ['pointer64', ['_HMAP_TABLE']]]],
} ],
  '_CONTEXT' : [ 0x4d0, {
    'P1Home' : [ 0x0, ['unsigned long long']],
    'P2Home' : [ 0x8, ['unsigned long long']],
    'P3Home' : [ 0x10, ['unsigned long long']],
    'P4Home' : [ 0x18, ['unsigned long long']],
    'P5Home' : [ 0x20, ['unsigned long long']],
    'P6Home' : [ 0x28, ['unsigned long long']],
    'ContextFlags' : [ 0x30, ['unsigned long']],
    'MxCsr' : [ 0x34, ['unsigned long']],
    'SegCs' : [ 0x38, ['unsigned short']],
    'SegDs' : [ 0x3a, ['unsigned short']],
    'SegEs' : [ 0x3c, ['unsigned short']],
    'SegFs' : [ 0x3e, ['unsigned short']],
    'SegGs' : [ 0x40, ['unsigned short']],
    'SegSs' : [ 0x42, ['unsigned short']],
    'EFlags' : [ 0x44, ['unsigned long']],
    'Dr0' : [ 0x48, ['unsigned long long']],
    'Dr1' : [ 0x50, ['unsigned long long']],
    'Dr2' : [ 0x58, ['unsigned long long']],
    'Dr3' : [ 0x60, ['unsigned long long']],
    'Dr6' : [ 0x68, ['unsigned long long']],
    'Dr7' : [ 0x70, ['unsigned long long']],
    'Rax' : [ 0x78, ['unsigned long long']],
    'Rcx' : [ 0x80, ['unsigned long long']],
    'Rdx' : [ 0x88, ['unsigned long long']],
    'Rbx' : [ 0x90, ['unsigned long long']],
    'Rsp' : [ 0x98, ['unsigned long long']],
    'Rbp' : [ 0xa0, ['unsigned long long']],
    'Rsi' : [ 0xa8, ['unsigned long long']],
    'Rdi' : [ 0xb0, ['unsigned long long']],
    'R8' : [ 0xb8, ['unsigned long long']],
    'R9' : [ 0xc0, ['unsigned long long']],
    'R10' : [ 0xc8, ['unsigned long long']],
    'R11' : [ 0xd0, ['unsigned long long']],
    'R12' : [ 0xd8, ['unsigned long long']],
    'R13' : [ 0xe0, ['unsigned long long']],
    'R14' : [ 0xe8, ['unsigned long long']],
    'R15' : [ 0xf0, ['unsigned long long']],
    'Rip' : [ 0xf8, ['unsigned long long']],
    'FltSave' : [ 0x100, ['_XSAVE_FORMAT']],
    'Header' : [ 0x100, ['array', 2, ['_M128A']]],
    'Legacy' : [ 0x120, ['array', 8, ['_M128A']]],
    'Xmm0' : [ 0x1a0, ['_M128A']],
    'Xmm1' : [ 0x1b0, ['_M128A']],
    'Xmm2' : [ 0x1c0, ['_M128A']],
    'Xmm3' : [ 0x1d0, ['_M128A']],
    'Xmm4' : [ 0x1e0, ['_M128A']],
    'Xmm5' : [ 0x1f0, ['_M128A']],
    'Xmm6' : [ 0x200, ['_M128A']],
    'Xmm7' : [ 0x210, ['_M128A']],
    'Xmm8' : [ 0x220, ['_M128A']],
    'Xmm9' : [ 0x230, ['_M128A']],
    'Xmm10' : [ 0x240, ['_M128A']],
    'Xmm11' : [ 0x250, ['_M128A']],
    'Xmm12' : [ 0x260, ['_M128A']],
    'Xmm13' : [ 0x270, ['_M128A']],
    'Xmm14' : [ 0x280, ['_M128A']],
    'Xmm15' : [ 0x290, ['_M128A']],
    'VectorRegister' : [ 0x300, ['array', 26, ['_M128A']]],
    'VectorControl' : [ 0x4a0, ['unsigned long long']],
    'DebugControl' : [ 0x4a8, ['unsigned long long']],
    'LastBranchToRip' : [ 0x4b0, ['unsigned long long']],
    'LastBranchFromRip' : [ 0x4b8, ['unsigned long long']],
    'LastExceptionToRip' : [ 0x4c0, ['unsigned long long']],
    'LastExceptionFromRip' : [ 0x4c8, ['unsigned long long']],
} ],
  '_ALPC_HANDLE_TABLE' : [ 0x18, {
