# Volatility
# Copyright (C) 2012-13 Volatility Foundation
#
# This file is part of Volatility.
#
# Volatility is free software; you can redistribute it and/or modify
# it under the terms of the GNU General Public License Version 2 as
# published by the Free Software Foundation.  You may not use, modify or
# distribute this program under any other version of the GNU General
# Public License.
#
# Volatility is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with Volatility.  If not, see <http://www.gnu.org/licenses/>.
#
# Notwithstanding any rights to use the Software granted by the foregoing,
# if entities or individuals have received a Cease & Desist letter from
# the Volatility Project, the Volatility Foundation, or its copyright holders
# for violating the terms of the GPL version 2, those entities (their employees,
# subcontractors, independent contractors, and affiliates) and / or persons
# are granted no such rights and any use by any one or more of them is
# expressly prohibited, in accordance with Section 4 of the GPL version 2.
# Any rights granted to such entities and / or persons by earlier license
# agreements have been previously terminated as to them.

#pylint: disable-msg=C0111

import os
import re
import math

        # to VACBs, that track which views of a given file are mapped in the cache.
        # For example, the first entry in the VACB index array refers to the first
        # 256 KB of the file. The InitialVacbs can describe a file up to 1 MB (4xVACB).
        iterval = 0
        while (iterval < full_blocks) and (full_blocks <= 4):
            Vacbs = self.InitialVacbs[iterval]
            vacbinfo = self.extract_vacb(Vacbs, VACB_BLOCK)
            if vacbinfo: vacbary.append(vacbinfo)
            iterval += 1

        # We also have to account for the spill over data
        # that is not found in the full blocks.  The first case to
        # consider is when the spill over is still in InitialVacbs.
        if (left_over > 0) and (full_blocks < 4):
            Vacbs = self.InitialVacbs[iterval]
            vacbinfo = self.extract_vacb(Vacbs, left_over)
            if vacbinfo: vacbary.append(vacbinfo)

        # If the file is larger than 1 MB, a seperate VACB index array
        # needs to be allocated. This is based on how many 256 KB blocks
        # would be required for the size of the file. This newly allocated
        # VACB index array is found through the Vacbs member of
        # SHARED_CACHE_MAP.

        Vacbs = self.Vacbs

        if not Vacbs or (Vacbs.v() == 0):
            return vacbary

        # There are a number of instances where the initial value in
        # InitialVacb will also be the fist entry in Vacbs. Thus we
        # ignore, since it was already processed. It is possible to just
        # process again as the file offset is specified for each VACB.
        if  self.InitialVacbs[0].obj_offset == Vacbs.v():
            return vacbary

        # If the file is less than 32 MB than it can be found in
        # a single level VACB index array.
        size_of_pointer = self.obj_vm.profile.get_obj_size("address")

        if not SectionSize > VACB_SIZE_OF_FIRST_LEVEL:

            ArrayHead = Vacbs.v()
            _i = 0
            for _i in range(0, full_blocks):
                vacb_addr = ArrayHead + (_i * size_of_pointer)
                vacb_entry = obj.Object("address", offset = vacb_addr, vm = Vacbs.obj_vm)

                # If we find a zero entry, then we proceed to the next one.
                # If the entry is zero, then the view is not mapped and we
                # skip. We do not pad because we use the FileOffset to seek
                # to the correct offset in the file.
                if not vacb_entry or (vacb_entry.v() == 0x0):
                    continue
                Vacb = obj.Object("_VACB", offset = vacb_entry.v(), vm = self.obj_vm)
                vacbinfo = self.extract_vacb(Vacb, VACB_BLOCK)
                if vacbinfo:
                    vacbary.append(vacbinfo)
            if left_over > 0:
                vacb_addr = ArrayHead + ((_i + 1) * size_of_pointer)
                vacb_entry = obj.Object("address", offset = vacb_addr, vm = Vacbs.obj_vm)

                if not vacb_entry or (vacb_entry.v() == 0x0):
                    return vacbary

                Vacb = obj.Object("_VACB", offset = vacb_entry.v(), vm = self.obj_vm)
                vacbinfo = self.extract_vacb(Vacb, left_over)
                if vacbinfo:
                    vacbary.append(vacbinfo)
            # The file is less than 32 MB, so we can
            # stop processing.
            return vacbary

        # If we get to this point, then we know that the SectionSize is greator than
        # VACB_SIZE_OF_FIRST_LEVEL (32 MB). Then we have a "sparse multilevel index
        # array where each VACB index array is made up of 128 entries. We no
        # longer assume the data is sequential. (Log2 (32 MB) - 18)/7

        #tree_depth = math.ceil((math.ceil(math.log(file_size, 2)) - 18)/7)
        level_depth = math.ceil(math.log(SectionSize, 2))
        level_depth = (level_depth - VACB_OFFSET_SHIFT) / VACB_LEVEL_SHIFT
        level_depth = math.ceil(level_depth)
        limit_depth = level_depth

        if SectionSize > VACB_SIZE_OF_FIRST_LEVEL:

            # Create an array of 128 entries for the VACB index array
            VacbArray = obj.Object("Array", offset = Vacbs.v(), \
                vm = self.obj_vm, count = VACB_ARRAY, \
                targetType = "address", parent = self)

            # We use a bit of a brute force method. We walk the
            # array and if any entry points to the shared cache map
            # object then we extract it. Otherwise, if it is non-zero
            # we attempt to traverse to the next level.
            for _i in range(0, VACB_ARRAY):
                if VacbArray[_i] == 0x0:
                    continue
                Vacb = obj.Object("_VACB", offset = int(VacbArray[_i]), vm = self.obj_vm)
                if  Vacb.SharedCacheMap == self.obj_offset:
                    vacbinfo = self.extract_vacb(Vacb, VACB_BLOCK)
                    if vacbinfo:
                        vacbary.append(vacbinfo)
                else:
                    # The Index is a pointer
                    #Process the next level of the multi-level array
                    # We set the limit_depth to be the depth of the tree
                    # as determined from the size and we initialize the
                    # current level to 2.
                    vacbary = self.process_index_array(VacbArray[_i], 2, limit_depth, vacbary)
                    #vacbary = vacbary + _vacbary

        return vacbary

class ControlAreaModification(obj.ProfileModification):
    conditions = {'os': lambda x: x == 'windows'}

    def modification(self, profile):
        profile.object_classes.update({
            '_CONTROL_AREA': _CONTROL_AREA,
            '_SHARED_CACHE_MAP': _SHARED_CACHE_MAP,
            })

#--------------------------------------------------------------------------------
# VTypes
#--------------------------------------------------------------------------------

# Windows x86 symbols for ntkrnlpa
ntkrnlpa_types_x86 = {
    '__ntkrnlpa' : [ 0x8, {
    'Long' : [ 0x0, ['unsigned long long']],
    'VolatileLong' : [ 0x0, ['unsigned long long']],
    'Hard' : [ 0x0, ['_MMPTE_HARDWARE_64']],
    'Flush' : [ 0x0, ['_HARDWARE_PTE']],
    'Proto' : [ 0x0, ['_MMPTE_PROTOTYPE']],
    'Soft' : [ 0x0, ['_MMPTE_SOFTWARE_64']],
    'TimeStamp' : [ 0x0, ['_MMPTE_TIMESTAMP']],
    'Trans' : [ 0x0, ['_MMPTE_TRANSITION_64']],
    'Subsect' : [ 0x0, ['_MMPTE_SUBSECTION_64']],
    'List' : [ 0x0, ['_MMPTE_LIST']],
    } ],
    '_MMPTEPA' : [ 0x8, {
    'u' : [ 0x0, ['__ntkrnlpa']],
    } ],
    '_MMPTE_SUBSECTION_64' : [ 0x8, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type = 'unsigned long long')]],
    'Unused0' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 5, native_type = 'unsigned long long')]],
    'Protection' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 10, native_type = 'unsigned long long')]],
    'Prototype' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type = 'unsigned long long')]],
    'Unused1' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 32, native_type = 'unsigned long long')]],
    'SubsectionAddress' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 64, native_type = 'long long')]],
    } ],
    '_MMPTE_TRANSITION_64' : [ 0x8, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type = 'unsigned long long')]],
    'Write' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type = 'unsigned long long')]],
    'Owner' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type = 'unsigned long long')]],
    'WriteThrough' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type = 'unsigned long long')]],
    'CacheDisable' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type = 'unsigned long long')]],
    'Protection' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 10, native_type = 'unsigned long long')]],
    'Prototype' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type = 'unsigned long long')]],
    'Transition' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type = 'unsigned long long')]],
    'PageFrameNumber' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 48, native_type = 'unsigned long long')]],
    'Unused' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 64, native_type = 'unsigned long long')]],
    }],
   '_MMPTE_HARDWARE_64' : [ 0x8, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type = 'unsigned long long')]],
    'Dirty1' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 2, native_type = 'unsigned long long')]],
    'Owner' : [ 0x0, ['BitField', dict(start_bit = 2, end_bit = 3, native_type = 'unsigned long long')]],
    'WriteThrough' : [ 0x0, ['BitField', dict(start_bit = 3, end_bit = 4, native_type = 'unsigned long long')]],
    'CacheDisable' : [ 0x0, ['BitField', dict(start_bit = 4, end_bit = 5, native_type = 'unsigned long long')]],
    'Accessed' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 6, native_type = 'unsigned long long')]],
    'Dirty' : [ 0x0, ['BitField', dict(start_bit = 6, end_bit = 7, native_type = 'unsigned long long')]],
    'LargePage' : [ 0x0, ['BitField', dict(start_bit = 7, end_bit = 8, native_type = 'unsigned long long')]],
    'Global' : [ 0x0, ['BitField', dict(start_bit = 8, end_bit = 9, native_type = 'unsigned long long')]],
    'CopyOnWrite' : [ 0x0, ['BitField', dict(start_bit = 9, end_bit = 10, native_type = 'unsigned long long')]],
    'Unused' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type = 'unsigned long long')]],
    'Write' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type = 'unsigned long long')]],
    'PageFrameNumber' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 48, native_type = 'unsigned long long')]],
    'reserved1' : [ 0x0, ['BitField', dict(start_bit = 48, end_bit = 52, native_type = 'unsigned long long')]],
    'SoftwareWsIndex' : [ 0x0, ['BitField', dict(start_bit = 52, end_bit = 63, native_type = 'unsigned long long')]],
    'NoExecute' : [ 0x0, ['BitField', dict(start_bit = 63, end_bit = 64, native_type = 'unsigned long long')]],
    } ],
    '_MMPTE_SOFTWARE_64' : [ 0x8, {
    'Valid' : [ 0x0, ['BitField', dict(start_bit = 0, end_bit = 1, native_type = 'unsigned long long')]],
    'PageFileLow' : [ 0x0, ['BitField', dict(start_bit = 1, end_bit = 5, native_type = 'unsigned long long')]],
    'Protection' : [ 0x0, ['BitField', dict(start_bit = 5, end_bit = 10, native_type = 'unsigned long long')]],
    'Prototype' : [ 0x0, ['BitField', dict(start_bit = 10, end_bit = 11, native_type = 'unsigned long long')]],
    'Transition' : [ 0x0, ['BitField', dict(start_bit = 11, end_bit = 12, native_type = 'unsigned long long')]],
    'UsedPageTableEntries' : [ 0x0, ['BitField', dict(start_bit = 12, end_bit = 22, native_type = 'unsigned long long')]],
    'InStore' : [ 0x0, ['BitField', dict(start_bit = 22, end_bit = 23, native_type = 'unsigned long long')]],
    'Reserved' : [ 0x0, ['BitField', dict(start_bit = 23, end_bit = 32, native_type = 'unsigned long long')]],
    'PageFileHigh' : [ 0x0, ['BitField', dict(start_bit = 32, end_bit = 64, native_type = 'unsigned long long')]],
    } ],
}

class DumpFilesVTypesx86(obj.ProfileModification):
    """This modification applies the vtypes for all 
    versions of 32bit Windows."""
    before = ['WindowsObjectClasses']
    conditions = {'os': lambda x: x == 'windows',
                  'memory_model': lambda x : x == '32bit'}
    def modification(self, profile):
        profile.vtypes.update(ntkrnlpa_types_x86)

class DumpFiles(common.AbstractWindowsCommand):
    """Extract memory mapped and cached files"""

    def __init__(self, config, *args, **kwargs):
        common.AbstractWindowsCommand.__init__(self, config, *args, **kwargs)

        self.kaddr_space = None
        self.filters = []

        config.add_option('REGEX', short_option = 'r',
                      help = 'Dump files matching REGEX',
                      action = 'store', type = 'string')
        config.add_option('IGNORE-CASE', short_option = 'i',
                      help = 'Ignore case in pattern match',
                      action = 'store_true', default = False)
        config.add_option('OFFSET', short_option = 'o', default = None,
                      help = 'Dump files for Process with physical address OFFSET',
                      action = 'store', type = 'int')
        config.add_option('PHYSOFFSET', short_option = 'Q', default = None,
                      help = 'Dump File Object at physical address PHYSOFFSET',
                      action = 'store', type = 'int')
        config.add_option('DUMP-DIR', short_option = 'D', default = None,
                      cache_invalidator = False,
                      help = 'Directory in which to dump extracted files')
        config.add_option('SUMMARY-FILE', short_option = 'S', default = None,
                      cache_invalidator = False,
                      help = 'File where to store summary information')
        config.add_option('PID', short_option = 'p', default = None,
                      help = 'Operate on these Process IDs (comma-separated)',
                      action = 'store', type = 'str')
        config.add_option('NAME', short_option = 'n',
                      help = 'Include extracted filename in output file path',
                      action = 'store_true', default = False)
        config.add_option('UNSAFE', short_option = 'u',
                      help = 'Relax safety constraints for more data',
                      action = 'store_true', default = False)

        # Possible filters include:
        # SharedCacheMap,DataSectionObject,ImageSectionObject,HandleTable,VAD
        config.add_option("FILTER", short_option = 'F', default = None,
                            help = 'Filters to apply (comma-separated)')

    def filter_tasks(self, tasks):
        """ Reduce the tasks based on the user selectable PIDS parameter.

        Returns a reduced list or the full list if config.PIDS not specified.
        """

        if self._config.PID is None:
            return tasks

        try:
            pidlist = [int(p) for p in self._config.PID.split(',')]
        except ValueError:
            debug.error("Invalid PID {0}".format(self._config.PID))

        return [t for t in tasks if t.UniqueProcessId in pidlist]

    def audited_read_bytes(self, vm, vaddr, length, pad):
        """ This function provides an audited zread capability

        It performs a similar function to zread, in that it will
        pad "invalid" pages.  The main difference is that it allows
        us to collect auditing information about which pages were actually 
        present and which ones were padded. 

        Args:
            vm: The address space to read the data from. 
            vaddr: The virtual address to start reading the data from.
            length: How many bytes to read
            pad: This argument controls if the unavailable bytes are padded.

        Returns:
